      *****************************************************************
      * FILE NAME:   BARDATAL3
      * DESCRIPTION: Item no./UPC cross reference keyed by UPCMC.
      * WRITTEN BY:  RICK SEKORA
      * DATE:        NOVEMBER 2010
      *
      * --------  ---  -----------------------------------------------
      * XX/XX/XX  XXX  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *****************************************************************
     A                                      UNIQUE
     A          R BARDATAR                  PFILE(BARDATA)
      *
     A          K BDUCC14
      *
     A          S BDUCC14                   COMP(NE ' ')
