      *******************************************************************
      * APPLICATION: Shipping                                           *
      * FILE NAME:   HYLSGTD2                                           *
      * DESCRIPTION: Shipment Group Tote Detail                         *
      * WRITTEN BY:  William Earl (MCA)                                 *
      * DATE:        September 2022                                     *
      *                                                                 *
      *    Date     By   Description                                    *
      * ----------  ---  ---------------------------------------------- *
      * XX/XX/XXXX  XXX  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX *
      *******************************************************************
     A          R HYRSGTD                   PFILE(HYPSGTD)
      *
     A          K TDGRP#
     A          K TDBLTO
     A          K TDSHTO
     A          K TDDSHP
     A          K TDTOTE
     A          K TDITEM
     A          K TDTURN
     A          K TDTSEQ
     A          K TDRSEQ
