      *******************************************************************
      * APPLICATION:                                                    *
      * FILE NAME:   PICKBATDP                                          *
      * DESCRIPTION: Pick Batch Detail                                  *
      * WRITTEN BY:  Glenn Hopwood (Profound Logic Software)            *
      * DATE:        Sept 2021                                          *
      *                                                                 *
      *    Date     By   Description                                    *
      * ----------  ---  ---------------------------------------------- *
      * XX/XX/XXXX  XXX  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX *
      *******************************************************************
     A                                      UNIQUE
     A                                      REF(FLDREF)
     A          R PICKBATDR
      *
     A            PICKBAT   R               REFFLD(ORD#)
     A                                      TEXT('Pick Batch Num')
     A                                      COLHDG('Pick' 'Batch' 'Num')
     A            PICKSEQ   R               REFFLD(SEQ3)
     A                                      TEXT('Sequence Number')
     A                                      COLHDG('Seq#')
     A            PICKOVRORD     4P 0       TEXT('Override Pick Order')
     A                                      COLHDG('Ovrrd' 'Pick' 'Ord')
     A            PICKTURN  R               REFFLD(TURN)
     A                                      TEXT('Turnaround Number')
     A                                      COLHDG('Turnaround' 'Number')
     A            PICKORD   R               REFFLD(ORD#)
     A                                      TEXT('Order Number')
     A                                      COLHDG('Order#')
     A            PICKORDL  R               REFFLD(ORL#)
     A                                      TEXT('Line Number')
     A                                      COLHDG('Line#')
     A            PICKITEM  R               REFFLD(ITEM)
     A                                      TEXT('Item Number')
     A                                      COLHDG('Item' 'Number')
     A            PICKITEMUM     5A         TEXT('Pick Item U/M')
     A                                      COLHDG('Pick' 'Item' 'U/M')
     A            PICKITEMCT    50A         TEXT('Pick Item Comment')
     A                                      COLHDG('Pick' 'Item' 'Comment')
      **
      ** Item/Location info
     A            PICKWHS        3P 0       TEXT('Warehouse')
     A                                      COLHDG('Warehouse')
     A            PICKSTKRM      3A         TEXT('Stockroom')
     A                                      COLHDG('Stockroom')
     A            PICKAISLE      4A         TEXT('Aisle')
     A                                      COLHDG('Aisle')
     A            PICKLOC        8A         TEXT('Stock Location')
     A                                      COLHDG('Stock' 'Location')
      **
      **
     A            PICKITMST      1A         TEXT('Pick item Status')
     A                                      COLHDG('Pick' 'Item' 'Status')
     A            PICKNEED  R               REFFLD(IMQT)
     A                                      TEXT('Quantity Needed')
     A                                      COLHDG('Qty' 'Needed')
     A            PICKQTYP  R               REFFLD(IMQT)
     A                                      TEXT('Quantity Picked')
     A                                      COLHDG('Qty' 'Picked')
      *
     A          K PICKBAT
     A          K PICKSEQ
