STRPGMEXP PGMLVL(*CURRENT)
/********************************************************************/
/*   *MODULE      WPIGENPOOP V3R1PNSRC    06/18/12  13:14:34      */
/********************************************************************/
  EXPORT SYMBOL("POPDATASAVED")
  EXPORT SYMBOL("POPSAVENEED")
  EXPORT SYMBOL("POPONEBTN")
  EXPORT SYMBOL("POPTWOBTN")
  EXPORT SYMBOL("POPTHREEBTN")
ENDPGMEXP
