STRPGMEXP PGMLVL(*CURRENT)
/*========================================================================*/
/*Programmer notes:                                                       */
/*This is the API which is used while Add/Edit Payment Value 1 Code       */
/*Created: 08/04/14 C:295   Project: WC2247                               */
/**********************************************************************   */
/* Revisions:                                                             */
/*                                                                        */
/*  05/01/18 C:274 Project: WC1917                                        */
/*                 Added EditAddBP procedure.                             */
/*========================================================================*/
  EXPORT SYMBOL("EDITADDPV1")
  EXPORT SYMBOL("EDITADDBP")
ENDPGMEXP
