     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*
     A** WORKERS' COMPENSATION AGENT ASSIGNMENT FILE
     A*
     A          R PAA01                     PFILE(WMAAP)
     A          K AACO#
     A          K AAFEIN
     A          K AAMOD
     A          K AAFND
