     A* (C) Copyright Progressive Data Solutions, Inc., 2000 - 2004
     A*
     A* WORKERS' COMP WORK FILE FOR AGT QUOTE SYSTEM
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 09/07/12  C:65  WC2116                                        *
     A*                 ADD PRIOR PREMIUM AND PRIOR CARRIER NAME      *
     A*                 FIELDS.                                       *
     A*                                                               *
     A* 07/06/05  C:58  WC1310                                        *
     A*                 Add automatic update to lost flag.            *
     A*                                                               *
     A*  11/01/00  C:33  PROJECT: WC1008                              *
     A*                  ADD TRANSFER TYPE (QTXFER)                   *
     A*****************************************************************
     A*
     A                                      REF(WREFP)
     A          R PQT01                     TEXT('AGT QUOTE SYSTEM FILE')
     A            QTCO#     R               REFFLD(CO#)
     A            QTFND     R               REFFLD(FND)
     A            QTAGT#    R               REFFLD(AGT#)
     A            QTCHAP    R               REFFLD(RGN#)
     A                                      COLHDG('CHAPTER')
     A            QTNAME    R               REFFLD(CTY)
     A                                      COLHDG('ACCOUNT NAME')
     A            QTTYPE    R               REFFLD(FLAG)
     A                                      COLHDG('ACTIVITY TYPE')
     A            QTWKDT    R               REFFLD(DT)
     A                                      COLHDG('WEEK ENDING DATE')
     A            QTEFDT    R               REFFLD(DT)
     A                                      COLHDG('EST. EFFECTIVE DATE')
     A            QTCARR    R               REFFLD(DS15)
     A                                      COLHDG('CARRIER NAME')
     A            QTPREM    R               REFFLD(ZIP)
     A                                      COLHDG('PREMIUM AMT')
     A            QTCOMM    R               REFFLD(DS40)
     A                                      COLHDG('COMMENT')
     A            QTSTAT    R               REFFLD(STAT)
     A            QTUSER    R               REFFLD(USER)
     A            QTPGM     R               REFFLD(PGM)
     A            QTTIME    R               REFFLD(TIME)
     A            QTDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            QTEMP#    R               REFFLD(EMP#)
     A            QTDIV     R               REFFLD(DIV)
     A********  VERSION 3 MODS  ********
     A            QTIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            QTIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            QTITM     R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            QTIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            QTMOD     R               REFFLD(PC54)
     A                                      COLHDG('EXPERIENCE MODIFIER')
     A            QTARAP    R               REFFLD(PC54)
     A                                      COLHDG('ARAP')
     A            QTHLR     R               REFFLD(A72)
     A                                      COLHDG('HISTORICAL' 'LOSS RATIO')
     A            QTPLR     R               REFFLD(A72)
     A                                      COLHDG('PROJECTED' 'LOSS RATIO')
     A            QTFIN     R               REFFLD(FLAG)
     A                                      COLHDG('FINAL STATUS')
     A            QTNBDT    R               REFFLD(DT)
     A                                      COLHDG('NEW BUSINESS' 'DATE')
     A            QTRVDT    R               REFFLD(DT)
     A                                      COLHDG('REVISED' 'DATE')
     A            QTBFPR    R               REFFLD(A90)
     A                                      COLHDG('PREMIUM B-4 REVISION')
     A            QTORDT    R               REFFLD(DT)
     A                                      COLHDG('ORIGINAL' 'SUBMISSION' +
     A                                      'DATE')
     A            QTFXDT    R               REFFLD(DT)
     A                                      COLHDG('FAX' 'DATE')
     A            QTCOM2    R               REFFLD(DS40)
     A                                      COLHDG('COMMENT 2')
     A***  BEGIN ADD  ***  11/01/00  **********************************
     A            QTXFER    R               REFFLD(FLAG)
     A                                      COLHDG('TRANSFER TYPE')
     A***  END   ADD  ***  11/01/00  **********************************
     A******* BEGIN ADD ***** 07/06/05 ********************************
     A            QTAULS    R               REFFLD(FLAG)
     A                                      COLHDG('AUTO' 'LOST')
     A******* END ADD ******* 07/06/05 ********************************
     A******* BEGIN ADD ***** 09/07/12 ********************************
     A            QTPPRM    R     S         REFFLD(ZIP)
     A                                      COLHDG('PRIOR' 'PREMIUM')
     A            QTPCAR    R               REFFLD(DS15)
     A                                      COLHDG('PRIOR' 'CARRIER NAME')
     A******* END ADD ******* 09/07/12 ********************************
