     A**********************************************************************
     A* WDF2P - Group Auxiliary (REVERSE-ENGINEERED placeholder)
     A* Used by WTAGTCFG for carrier-list grid (project WC2964, 04/21/24).
     A**********************************************************************
     A          R PDF201
     A            DFCO#          3P 0       TEXT('Company Number')
     A            DFFND          3P 0       TEXT('Fund Number')
     A            DFCARR        10A         TEXT('Carrier')
     A            DFTEXT        40A         TEXT('Description')
