     A*  (C) Copyright Progressive Data Systems, Inc., 2001
     A**
     A** AL DENTAL PROCEDURE CODES
     A*****************************************************************
     A*  CREATED 05/03/01 BY C:62 FOR PROJECT AL042                   *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A          R PAL01                     TEXT('AL DENTAL PROCEDURE CODE')
     A            ALCPT4         5A
     A            ALDESC       100A
     A            ALMRA         15S 2
     A            ALFILL         2A
