     A*  (C) Copyright APPLIED COMPUTER TECHNOLOGIES,INC.1991
     A**
     A* * * ACCOUNTS PAYABLE A/P HISTORY FILE.
     A*
     A***************************************************************
     A*  REVISIONS:
     A*
     A*  04/24/97 C:107 PROJECT AP010
     A*                ADDED ROLLED TO G/L FLAG & DATE.
     A*
     A*  05/20/97 C:107 PROJECT AP017
     A*                ADDED INVOICE ENTRY DATE.
     A***************************************************************
     A                                      REF(BKREFP)
     A          R PCH01                     TEXT('INVOICE HISTORY')
     A******
     A            CHCO#     R               REFFLD(CO#)
     A            CHFAC#    R               REFFLD(FAC#)
     A            CHFAC2    R               REFFLD(FAC#)
     A            CHBNK#    R               REFFLD(BNK#)
     A            CHBTCH    R               REFFLD(BUL#1)
     A            CHVDR     R               REFFLD(VDR)
     A            CHINV#    R               REFFLD(INV#)
     A            CHSEQ1    R               REFFLD(SEQ#)
     A            CHCHK#    R               REFFLD(CHK#)
     A            CHINVD    R               REFFLD(DT)
     A                                      COLHDG('INVOICE DATE')
     A            CHDUED    R               REFFLD(DT)
     A                                      COLHDG('DUE DATE')
     A            CHACMO    R               REFFLD(MO)
      *** BEG CHG * V3
     A*****       CHACYR    R               REFFLD(YR)
     A            CHACYR    R               REFFLD(YR4)
      *** END CHG * V3
     A            CHPONO    R               REFFLD(DS10)
     A            CHPODS    R               REFFLD(DS20)
     A            CHAMT     R               REFFLD(A112)
     A                                      COLHDG('INVOICE AMOUNT')
     A            CHDISC    R               REFFLD(A112)
     A                                      COLHDG('DISCOUNT AMOUNT')
     A            CHCODE    R               REFFLD(FLAG)
     A            CHSEQ2    R               REFFLD(SEQ#)
     A            CHBUL1    R               REFFLD(BUL#1)
     A            CHIPGM    R               REFFLD(PGM)
     A            CHCTIM    R               REFFLD(TIME)
     A            CHCDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            CHCUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CHANGED BY')
     A            CHIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A            CHITIM    R               REFFLD(TIME)
     A            CHIDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            CHSTAT    R               REFFLD(FLAG)
     A                                      COLHDG('STATUS')
      *** BEG ADD * AP010 C:107
     A            CHRGL     R               REFFLD(FLAG)
     A                                      COLHDG('ROLLED TO G/L FLAG')
     A            CHRDAT    R               REFFLD(DT)
     A                                      COLHDG('ROLLED TO G/L DATE')
      *** END ADD * AP010 C:107
      *** BEG ADD * AP017 C:107
      *** BEG CHG * V3
     A*****       GLENDT         6  0       COLHDG('DATE INV ENTERED GL')
     A            GLENDT    R               REFFLD(DT)
     A                                      COLHDG('DATE INV ENTERED GL')
      *** END CHG * V3
      *** END ADD * AP017 C:107
