     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A**
     A**
     A* * * ACCOUNTS PAYABLE HISTORY
     A*
     A          R PCH01                     PFILE(APCHP)
     A          K CHCO#
     A          K CHFAC#
     A          K CHVDR
     A          K CHSEQ1
