     A*%%TS  SD  19971212  075700  GJOHNSON    REL-V3R7M0  5716-PW1
     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BKREFP)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      ALTHELP
     A                                      HELP
     A                                      VLDCMDKEY(11)
      * ================================================================
     A          R SCR01A
     A                                      CF10
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A                                  1 23'Accounts Payable Check Request'
     A                                      DSPATR(HI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A            Q1PGM     R        O  2  2REFFLD(DS10)
     A  19                                  ERRMSGID(BKM0136 *LIBL/BKMES)
     A                                  2 70'SCR01A'
     A                                  5  2'Type choices, press Enter.'
     A                                  7  2'Company No.........:'
     A            SCCO#     R     Y  B  7 24REFFLD(CO#)
     A  20                                  ERRMSGID(WCR0502 *LIBL/WMESGG)
     A  22                                  ERRMSGID(APM0104 *LIBL/BKMES)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                  8  2'Facility No........:'
     A            SCFAC#    R     Y  B  8 24REFFLD(FAC#)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  21                                  ERRMSGID(WCR0502 *LIBL/WMESGG)
     A  22                                  ERRMSGID(APM0104 *LIBL/BKMES)
     A                                 22  2'F3=Exit'
     A                                      COLOR(BLU)
     A                                    +3'F10=Search'
     A                                      COLOR(BLU)
      * ================================================================
     A          R SCR01
     A*%%TS  SD  19971211  104259  GJOHNSON    REL-V3R7M0  5716-PW1
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(31)
     A                                      SETOF(32)
     A                                      SETOF(33)
     A                                      SETOF(25)
     A                                      SETOF(39)
     A                                      SETOF(40)
     A                                      SETOF(41)
     A                                      CF02
     A                                      CF10
     A            SCUSER    R        O  1  2REFFLD(USER)
     A                                  1 23'Accounts Payable Check Request'
     A                                      DSPATR(HI)
     A                                  1 23'Accounts Payable Check Request'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A            Q1PGM     R        O  2  2REFFLD(DS10)
     A                                  2 70'SCR01'
     A                                  5  3'Company #..........:'
     A            SCCO#          3  0O  5 25
     A                                      DSPATR(HI)
     A                                  7  3'Facility #.........:'
     A            SCFAC#         3  0O  7 25
     A                                      DSPATR(HI)
     A                                  9  3'Bank Number........:'
     A            SCBNK#    R     Y  B  9 25REFFLD(BNK#)
     A  22                                  DSPATR(PC)
     A                                      DSPATR(CS)
     A  22                                  ERRMSGID(BKM0103 *LIBL/BKMES)
     A  23                                  ERRMSGID(APM0109 *LIBL/BKMES)
     A  24                                  ERRMSGID(APM0110 *LIBL/BKMES)
     A  31                                  ERRMSGID(BKM0103 *LIBL/BKMES)
     A  32                                  ERRMSGID(BKM0106 *LIBL/BKMES)
     A  33                                  ERRMSGID(BKM0107 *LIBL/BKMES)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                 11  3'Check Date.........:'
     A            SCDATE    R     Y  B 11 25REFFLD(DT8)
     A  20                                  ERRMSGID(BKM0102 *LIBL/BKMES)
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(CS)
     A                                 13  3'Starting Check No..:'
     A            SCCHK#    R     Y  B 13 25REFFLD(CHK#)
     A  25                                  ERRMSGID(APM0111 *LIBL/BKMES)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      DSPATR(PC)
     A                                 15  3'Number of Leads....:'
     A            SCLEAD    R     Y  B 15 25REFFLD(A10)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                 23  2'F1=Help   F2=Reprint checks  F3=Ex-
     A                                      it   F10=Search                    -
     A                                          '
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
      * ================================================================
     A          R SCR02
     A*%%TS  SD  19971212  075700  GJOHNSON    REL-V3R7M0  5716-PW1
     A                                      CF10
     A                                      CF12
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A                                      SETOF(31)
     A                                      SETOF(32)
     A                                      SETOF(33)
     A                                      SETOF(39)
     A                                      SETOF(40)
     A                                      SETOF(41)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A                                  1 23'Accounts Payable Check Request'
     A                                      DSPATR(HI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A            Q1PGM     R        O  2  2REFFLD(DS10)
     A                                  2 70'SCR02'
     A                                  3 29' REPRINT CHECKS '
     A                                      DSPATR(RI)
     A                                  5  3'Enter the following information to-
     A                                       reprint checks.  Any additional vo-
     A                                      uchers'
     A                                  6  3'selected since the previous printi-
     A                                      ng will be included.'
     A                                  8  3'Company #..........:'
     A            SCCO#          3S 0O  8 25DSPATR(HI)
     A                                 10  3'Facility #.........:'
     A            SCFAC#         3S 0O 10 25DSPATR(HI)
     A                                 12  3'Bank Number........:'
     A            SCBNK#    R     Y  B 12 25REFFLD(BNK#)
     A  22                                  DSPATR(PC)
     A                                      DSPATR(CS)
     A  22                                  ERRMSGID(BKM0103 *LIBL/BKMES)
     A  23                                  ERRMSGID(APM0109 *LIBL/BKMES)
     A  31                                  ERRMSGID(BKM0103 *LIBL/BKMES)
     A  32                                  ERRMSGID(BKM0106 *LIBL/BKMES)
     A  33                                  ERRMSGID(BKM0107 *LIBL/BKMES)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                 14  3'Check Date.........:'
     A            SCDATE    R     Y  B 14 25REFFLD(DT8)
     A  20                                  ERRMSGID(BKM0102 *LIBL/BKMES)
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(CS)
     A                                 16  3'Reprint from Check#:'
     A            SCCHK1    R        B 16 25REFFLD(PREF01/CHK# *LIBL/BKREFP)
     A                                      DSPATR(HI)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                      DSPATR(CS)
     A                                 18  3'New Starting Check#:'
     A            SCCHK2    R        B 18 25REFFLD(PREF01/CHK# *LIBL/BKREFP)
     A  25                                  ERRMSGID(APM0111 *LIBL/BKMES)
     A                                      DSPATR(HI)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                      DSPATR(CS)
     A                                 19  3'Void Interim Checks:'
     A                                      DSPATR(ND)
     A            SCVOID    R        B 19 25REFFLD(PREF01/FLAG *LIBL/BKREFP)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      DSPATR(ND)
     A                                 20  3'Number of Leads....:'
     A            SCLEAD    R     Y  B 20 25REFFLD(A10)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                 23  2'F1=Help   F3=Exit   F10=Search    -
     A                                         F12=Cancel         '
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
