     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A**
     A**
     A* * * CHECK RECONCILATION * * *
     A*
     A          R PCR01                     PFILE(BKCRP)
     A          K CRAPP
     A          K CRBNK#
     A          K CRCHK#
     A          S CRSTAT                    COMP(NE 'D')
