     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*%%TS  SD  19940112  144318  WHERR       REL-V2R2M0  5738-PW1
     A*  91/06/04  09:10:45    WHERR       REL-R03M00  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BKREFP)
     A                                      CHGINPDFT(CS)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A                                      CF06
     A                                      ALTHELP
     A                                      HELP
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A*  91/06/04  09:10:45    WHERR       REL-R03M00  5728-PW1
     A                                      SETOF(20)
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPDOC('SCRN1' 'BKI513F.F' '-
     A                                      BK.HLP')
     A            SCFILE    R        O  1  3REFFLD(FLE)
     A            SCCONM    R        O  1 22REFFLD(DS30)
     A            SCRECF    R        O  1 71REFFLD(RECF)
     A            SCUSER    R        O  2 70REFFLD(USER)
     A            SCPGNM    R        O  2 27REFFLD(DS30)
     A                                      DSPATR(HI)
     A N09        SCMODE    R        O  3 30REFFLD(NM10)
     A                                      TEXT('ADD/UPDATE MODE')
     A                                      DSPATR(HI)
     A                                  4  3'Deduction Code..:'
     A            SCDED     R        B  4 21REFFLD(CODE)
     A N09                                  DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  20                                  ERRMSGID(BKM0101 *LIBL/BKMES)
     A N09                                  DSPATR(UL)
     A                                 23  3'F1=Help'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 12'F3=Exit'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 21'F5=Search deduction'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A          R SCR02
     A*%%TS  SD  19940112  144318  WHERR       REL-V2R2M0  5738-PW1
     A                                      CF12
     A N09N40                               CF20
     A  64                                  CF23
     A                                      SETOF(20)
     A                                      SETOF(21)
     A          H                           HLPDOC('SCRN2' 'BKI513F.F' 'BK.HLP')
     A                                      HLPARA(01 001 24 080)
     A            SCFILE    R        O  1  3REFFLD(FLE)
     A            SCCONM    R        O  1 22REFFLD(DS30)
     A            SCRECF    R        O  1 71REFFLD(RECF)
     A            SCPGNM    R        O  2 27REFFLD(DS30)
     A                                      DSPATR(HI)
     A            SCUSER    R        O  2 70REFFLD(USER)
     A N09        SCMODE    R        O  3 30REFFLD(NM10)
     A                                      TEXT('ADD/UPDATE MODE')
     A                                      DSPATR(HI)
     A                                  4  3'Deduction Code..:'
     A            SCDED     R        O  4 21REFFLD(CODE)
     A                                  5  3'Description.....:'
     A            SCDESC    R        B  5 21REFFLD(DS30)
     A N09                                  DSPATR(CS)
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                  6  3'Short Desc......:'
     A            SCALPH    R        B  6 21REFFLD(DS10)
     A N09                                  DSPATR(CS)
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                 23  3'F1=Help'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 12'F3=Exit'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 21'F12=Cancel  '
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A            SCCMDD    R        O 23 68REFFLD(DS10)
     A                                      TEXT('F23=DELETE')
     A                                  8  3'Classification..:'
     A            SCTYPE    R        B  8 21REFFLD(FLAG)
     A                                      VALUES(' ' '1' '2' '3')
     A                                      CHKMSGID(PRM0132 BKMES)
     A                                  8 26'1 = Take Deduction before FIT'
     A                                  9 26'2 = Take Deduction before FICA'
     A                                 10 26'3 = Take Deduction before FIT & FI-
     A                                      CA'
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A          R SCR03
