     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*  91/05/12  11:59:34    WHERR       REL-R02M00  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BKREFP)
     A                                      CHGINPDFT(CS)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A                                      ALTHELP
     A                                      HELP
     A                                      VLDCMDKEY(11)
     A          R DUMMY
     A                                      KEEP
     A                                      ASSUME
     A                                  1  2' '
     A          R SCR01
     A                                      WINDOW(6 39 7 37)
     A                                      WDWBORDER((*COLOR WHT))
     A                                      OVERLAY
     A                                      SETOF(20)
     A            SCPGNM    R        O  2  2REFFLD(DS30)
     A                                      DSPATR(HI)
     A                                  4  2'Password.:'
     A            SCPW          10   B  4 13DSPATR(ND)
     A  20                                  ERRMSGID(BSE9901 *LIBL/BKMSG)
     A                                  6  2'F1=Help'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                  6 12'F3=Exit'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
