     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   FORMAT DESCRIPTION:                                      **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A*                                    REL-R02M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A*
     A                                      CF05
     A                                      CF07
     A                                      CF13
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A                                      SETOF(26)
     A                                      SETOF(27)
     A                                      SETOF(28)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0020F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  8 23'New Quote:'
     A            SCNEW     R        B  8 35REFFLD(FLAG)
     A                                      TEXT('FLAG')
     A*                                     DSPATR(CS)
     A  20                                  ERRMSGID(CCR0869 *LIBL/CMESGG)
     A  22                                  ERRMSGID(CCR0541 *LIBL/CMESGG)
     A  24                                  ERRMSGID(CCR0870 *LIBL/CMESGG)
     A  25                                  ERRMSGID(CCR0632 *LIBL/CMESGG)
     A                                  8 42'Renewal Quote:'
     A            SCRNEW    R        B  8 58REFFLD(FLAG)
     A                                      TEXT('FLAG')
     A*                                     DSPATR(CS)
     A  21                                  ERRMSGID(CCR0869 *LIBL/CMESGG)
     A  23                                  ERRMSGID(CCR0541 *LIBL/CMESGG)
     A  24                                  ERRMSGID(CCR0870 *LIBL/CMESGG)
     A  26                                  ERRMSGID(CCR0871 *LIBL/CMESGG)
     A                                 10 30'Quote Number:'
     A            SCQUT#    R        B 10 45REFFLD(QUT#)
     A                                      EDTCDE(4)
     A*                                     DSPATR(CS)
     A                                      CHECK(RB)
     A  25                                  ERRMSGID(CCR0632 *LIBL/CMESGG)
     A  26                                  ERRMSGID(CCR0871 *LIBL/CMESGG)
     A  27                                  ERRMSGID(CCR0633 *LIBL/CMESGG)
     A  28                                  ERRMSGID(CCR0872 *LIBL/CMESGG)
     A                                 13  8'Key the Quote Number and press Ent-
     A                                      er to Maintain an existing Quote.'
     A                                 14  8'For a New Quote key a "Y" into the-
     A                                       New Quote field and Press ENTER.'
     A                                 15  8'For a Renewal Quote key a "Y" into-
     A                                       the Renewal Quote field and'
     A                                 16  8'existing Quote to be renewed into -
     A                                      Quote Number Field and Press ENTER.'
     A                                 17  8'Computer will generate New and Ren-
     A                                      ewal Quote Numbers.  For a search'
     A                                 18  8'of Quotes by Quote Number, Press F-
     A                                      5.     For a search by Named'
     A                                 19  8'Insured, Press F7.   '
     A                                 23  6'   F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 28'   F5=Quote # search'
     A                                      COLOR(BLU)
     A                                 23 53'   F7=Named insured search'
     A                                      COLOR(BLU)
     A                                 24 53'   F13=Change user parms'
     A                                      COLOR(BLU)
     A          R SCR02
     A*
     A                                      CF12
     A N09                                  CF05
     A N09                                  CF07
     A N09                                  CF10
     A                                      SETOF(17)
     A                                      SETOF(18)
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A                                      SETOF(26)
     A                                      SETOF(27)
     A                                      SETOF(28)
     A                                      SETOF(29)
     A                                      SETOF(31)
     A                                      SETOF(32)
     A                                      SETOF(33)
     A                                      SETOF(34)
     A                                      SETOF(35)
     A                                      SETOF(36)
     A                                      SETOF(37)
     A                                      SETOF(38)
     A                                      SETOF(39)
     A                                      SETOF(41)
     A                                      SETOF(54)
     A                                      SETOF(70)
     A                                      SETOF(71)
     A                                      SETOF(72)
     A                                      SETOF(73)
     A                                      SETOF(74)
     A                                      SETOF(80)
     A                                      SETOF(81)
     A                                      SETOF(82)
     A                                      SETOF(83)
     A                                      SETOF(84)
     A                                      SETOF(85)
     A                                      SETOF(86)
     A                                      SETOF(87)
     A                                      SETOF(88)
     A                                      SETOF(89)
     A                                      SETOF(90)
     A                                      SETOF(91)
     A                                      SETOF(92)
     A                                      SETOF(93)
     A                                      SETOF(94)
     A                                      SETOF(95)
     A                                      SETOF(96)
     A                                      SETOF(97)
     A                                      SETOF(98)
     A                                      SETOF(99)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0020F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR02'
     A N09        SCMODE    R        O  3 71REFFLD(NM10)
     A                                      TEXT('ADD/UPDATE MODE')
     A                                      DSPATR(HI)
     A                                  4  2'Quote Number:'
     A            SCQUT#    R     S  O  4 17REFFLD(QUT#)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  6  2'Named Insured:'
     A            SCFIN     R        B  6 22REFFLD(NAME)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('NAME')
     A  20                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                  8  2'DBA Name:'
     A            SCDBA     R        B  8 22REFFLD(NAME)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('NAME')
     A                                  9  2'Mailing Address:'
     A            SCADR1    R        B  9 22REFFLD(ADR1)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('ADDRESS LINE 1')
     A  21                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A            SCADR2    R        B 10 22REFFLD(ADR2)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('ADDRESS LINE 2')
     A                                 11  2'City/Cnty/ST/Zip:'
     A            SCCTY     R        B 11 22REFFLD(CTY)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('CITY')
     A  22                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A            SCCNTY    R        B 11 50REFFLD(CNTY)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  17                                  DSPATR(PC)
     A  41                                  ERRMSGID(CCR0660 *LIBL/CMESGG)
     A  54                                  ERRMSGID(CCR0536 *LIBL/CMESGG)
     A            SCST      R        B 11 55REFFLD(ST)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  18                                  DSPATR(PC)
     A                                      TEXT('STATE')
     A  23                                  ERRMSGID(CCR0505 *LIBL/CMESGG)
     A            SCZIP1    R        B 11 60REFFLD(ZIP1)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      TEXT('ZIP 1')
     A  24                                  ERRMSGID(CCR0504 *LIBL/CMESGG)
     A                                 11 66'-'
     A            SCZIP2    R        B 11 68REFFLD(ZIP2)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      TEXT('ZIP 2')
     A                                 13  2'Effective Date:'
     A            SCEFDT    R        B 13 22REFFLD(DT8)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A  25                                  ERRMSGID(CCR0502 *LIBL/CMESGG)
     A                                      TEXT('DATE')
     A  09                                  DSPATR(PR)
     A                                 14  2'Federal Tax ID#:'
     A            SCFEIN    R        B 14 22REFFLD(FEIN)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  26                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      TEXT('FEDERAL TAX ID')
     A                                 14 41'Agent Code:'
     A            SCAGT#    R     Y  B 14 54REFFLD(AGT#)
     A  09                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      TEXT('AGENT NUMBER')
     A  70                                  DSPATR(PC)
     A  27                                  ERRMSGID(CCR0546 *LIBL/CMESGG)
     A                                 15  2'Organization type:'
     A            SCORT     R        B 15 22REFFLD(FLAG)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('FLAG')
     A  71                                  DSPATR(PC)
     A  28                                  ERRMSGID(CCR0542 *LIBL/CMESGG)
     A                                 15 34'Years in Business:'
     A            SCYIB     R        B 15 54REFFLD(YIB)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      TEXT('YEARS IN BUSINESS')
     A                                 16  2'Nature of Business:'
     A            SCNOB     R        B 16 22REFFLD(DS40)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('DESCRIPTION')
     A                                 17  2'Status of Account:'
     A            SCSTAC    R        B 17 22REFFLD(FLAG)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('FLAG')
     A  32                                  ERRMSGID(CCR0634 *LIBL/CMESGG)
     A                                 17 32'Underwriter:'
     A            SCUNCD    R        B 17 46REFFLD(STAF)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('STAFF CODE')
     A  72                                  DSPATR(PC)
     A  33                                  ERRMSGID(CCR0550 *LIBL/CMESGG)
     A                                 18  2'Premium Quoted:'
     A            SCPRMQ    R     Y  B 18 22REFFLD(A80)
     A                                      EDTCDE(4)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      TEXT('AMOUNT')
     A  73                                  DSPATR(PC)
     A                                 18 32'Policy Fee:'
     A            SCPFEE    R     Y  B 18 46REFFLD(A52)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  35                                  ERRMSGID(CCR0625 *LIBL/CMESGG)
     A                                 18 55'Type of Policy:'
     A            SCPLTY    R        B 18 72REFFLD(PLTY)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('POLICY TYPE')
     A  36                                  ERRMSGID(CCR0908 *LIBL/CMESGG)
     A                                 20  2'Section Code:'
     A            SCCC01    R     A  B 20 22REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      TEXT('CODE')
     A  80 74                               DSPATR(PC)
     A  80 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  80 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  80 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC02    R     A  B 20 27REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  81 74                               DSPATR(PC)
     A  81 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  81 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  81 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC03    R     A  B 20 32REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  82 74                               DSPATR(PC)
     A  82 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  82 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  82 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC04    R     A  B 20 37REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  83 74                               DSPATR(PC)
     A  83 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  83 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  83 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC05    R     A  B 20 42REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  84 74                               DSPATR(PC)
     A  84 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  84 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  84 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC06    R     A  B 20 47REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  85 74                               DSPATR(PC)
     A  85 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  85 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  85 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC07    R     A  B 20 52REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  86 74                               DSPATR(PC)
     A  86 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  86 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  86 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC08    R     A  B 20 57REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  87 74                               DSPATR(PC)
     A  87 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  87 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  87 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC09    R     A  B 20 62REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  88 74                               DSPATR(PC)
     A  88 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  88 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  88 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC10    R     A  B 20 67REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  89 74                               DSPATR(PC)
     A  89 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  89 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  89 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC11    R     A  B 21 22REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  90 74                               DSPATR(PC)
     A  90 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  90 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  90 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC12    R     A  B 21 27REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  91 74                               DSPATR(PC)
     A  91 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  91 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  91 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC13    R     A  B 21 32REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  92 74                               DSPATR(PC)
     A  92 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  92 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  92 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC14    R     A  B 21 37REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  93 74                               DSPATR(PC)
     A  93 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  93 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  93 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC15    R     A  B 21 42REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  94 74                               DSPATR(PC)
     A  94 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  94 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  94 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC16    R     A  B 21 47REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  95 74                               DSPATR(PC)
     A  95 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  95 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  95 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC17    R     A  B 21 52REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  96 74                               DSPATR(PC)
     A  96 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  96 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  96 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC18    R     A  B 21 57REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  97 74                               DSPATR(PC)
     A  97 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  97 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  97 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC19    R     A  B 21 62REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  98 74                               DSPATR(PC)
     A  98 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  98 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  98 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A            SCCC20    R     A  B 21 67REFFLD(CDE)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  99 74                               DSPATR(PC)
     A  99 37                               ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  99 38                               ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  99 39                               ERRMSGID(CCR0591 *LIBL/CMESGG)
     A                                 23  2'   F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 31'   F12=Cancel     '
     A                                      COLOR(BLU)
     A N09                             23 62'   F5=Agent search'
     A                                      COLOR(BLU)
     A N09                             24 13'   F7=Underwriter search'
     A                                      COLOR(BLU)
     A N09                             24 46'   F10=Table search'
     A                                      COLOR(BLU)
     A                                  3 29'NAMED INSURED INFORMATION'
     A                                      DSPATR(HI)
     A          R SCR99
     A*
     A            SCERR     R        I  3  3REFFLD(FLAG *LIBL/SREFP)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
