     A*%%TS  SD  19980128  101808  COLEMANR    REL-V3R7M0  5716-PW1
     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   NON-PREMIUM ENDORSEMENT ENTRY DISPLAY                    **
     A**                                                            **
     A****************************************************************
     A**  REVISIONS                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A**                                                            **
     A****************************************************************
     A**
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A*%%TS  SD  19980128  101808  COLEMANR    REL-V3R7M0  5716-PW1
     A                                      CF05
     A                                      CF07
     A                                      CF09
     A                                      CF10
     A                                      CF13
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A                                      SETOF(26)
     A                                      SETOF(27)
     A                                      SETOF(28)
     A                                      SETOF(30)
     A                                      SETOF(31)
     A                                      SETOF(32)
     A                                      SETOF(33)
     A                                      SETOF(34)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0280F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  9 25'Policy Number:'
     A            SCPOL#    R     A  B  9 44REFFLD(POL#)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A  21                                  ERRMSGID(CCR0535 *LIBL/CMESGG)
     A  27                                  ERRMSGID(CCR0508 *LIBL/CMESGG)
     A                                 11 25'Section Code:'
     A            SCCC      R        B 11 44REFFLD(CDE)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A  21                                  ERRMSGID(CCR0598 *LIBL/CMESGG)
     A  22                                  ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  27                                  ERRMSGID(CCR0508 *LIBL/CMESGG)
     A                                 13 25'Transaction Code:'
     A            SCTRNS    R        B 13 44REFFLD(CDE)
     A                                      OVRDTA
     A  33                                  DSPATR(PC)
     A  23                                  ERRMSGID(CCR0524 *LIBL/CMESGG)
     A  24                                  ERRMSGID(CCR0536 *LIBL/CMESGG)
     A  27                                  ERRMSGID(CCR0508 *LIBL/CMESGG)
     A                                 15 25'Transaction Date:'
     A            SCENDT    R        B 15 44REFFLD(DT8)
     A  34                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A  25                                  ERRMSGID(CCR0502 *LIBL/CMESGG)
     A  26                                  ERRMSGID(CCR0530 *LIBL/CMESGG)
     A  27                                  ERRMSGID(CCR0508 *LIBL/CMESGG)
     A  28                                  ERRMSGID(CCR0697 *LIBL/CMESGG)
     A                                 22  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 22 30'F5=Detail search'
     A                                      COLOR(BLU)
     A                                 22 51'F7=Policy number search   '
     A                                      COLOR(BLU)
     A                                 23  2'F9=Named insured search   '
     A                                      COLOR(BLU)
     A                                 23 30'F10=Table search'
     A                                      COLOR(BLU)
     A                                 23 51'F13=Change user parameters   '
     A                                      COLOR(BLU)
     A          R SCR02
     A*%%TS  SD  19970723  150627  WINNERW     REL-V3R6M0  5716-PW1
     A                                      CF12
     A                                      CF01
     A                                      CF20
     A                                      ROLLUP(18)
     A                                      ROLLDOWN(19)
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0280F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR02'
     A N04        SCMODE    R        O  3 71REFFLD(NM10)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A                                  4 64'Status:'
     A            SCST      R     A  O  4 72REFFLD(FLAG)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  5  2'Policy Number:'
     A            SCPOL#    R     A  O  5 17REFFLD(POL#)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  5 33'Name:'
     A            SCFIN     R     A  O  5 39REFFLD(DS40)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  6  2'Section Code:'
     A            SCCC      R        O  6 16REFFLD(CDE)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  6 21'Trans Code:'
     A            SCTRNS    R        O  6 33REFFLD(CDE)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  6 37'Trans Date:'
     A            SCENDT    R        O  6 49REFFLD(DT8)
     A                                      DSPATR(HI)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A                                  6 61'Endorsement #:'
     A            SCEND#    R     S  O  6 76REFFLD(END#)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCFLAG    R        O  8  2REFFLD(FLAG)
     A                                      DSPATR(ND)
     A  20                                  ERRMSGID(CCR0600 *LIBL/CMESGG)
     A  21                                  ERRMSGID(CCR0840 *LIBL/CMESGG)
     A            SCTX01    R     A  B  8 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX02    R     A  B  9 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX03    R     A  B 10 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX04    R     A  B 11 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX05    R     A  B 12 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX06    R     A  B 13 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX07    R     A  B 14 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX08    R     A  B 15 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX09    R     A  B 16 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX10    R     A  B 17 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX11    R     A  B 18 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX12    R     A  B 19 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX13    R     A  B 20 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A            SCTX14    R     A  B 21 10REFFLD(DESC)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 21'F12=Cancel     '
     A                                      COLOR(BLU)
     A                                 23 43'F1=Restart'
     A                                      COLOR(BLU)
     A            SCUP           9A  O 23 58DSPATR(HI)
     A                                      OVRDTA
     A            SCDOWN         9A  O 23 69DSPATR(HI)
     A                                      OVRDTA
     A  03                              3  2'POLICY CANCELLED'
     A                                      DSPATR(RI)
     A  05                              3  2'CANCELLATION PENDING'
     A                                      DSPATR(RI)
     A  06                              6  2'REINSTATEMENT PENDING'
     A                                      DSPATR(RI)
     A  04                              3 63'POLICY NON-RENEWED'
     A                                      DSPATR(RI)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
