     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   PAYEE MASTER MAINTENANCE DISPLAY                         **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                      CF05
     A                                      CF07
     A                                      CF13
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0430F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  9 24'Payee federal tax ID #:'
     A            SCFEIN    R        B  9 49REFFLD(FEIN)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A  20                                  ERRMSGID(CCR0507 *LIBL/CMESGG)
     A  21                                  ERRMSGID(CCR0508 *LIBL/CMESGG)
     A                                      TEXT('FEDERAL TAX ID')
     A*                                     DSPATR(CS)
     A                                 11 24'Location modifier:'
     A            SCMOD     R        B 11 49REFFLD(MOD)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  21                                  ERRMSGID(CCR0508 *LIBL/CMESGG)
     A  22                                  ERRMSGID(CCR0507 *LIBL/CMESGG)
     A                                      TEXT('MODIFIER')
     A*                                     DSPATR(CS)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 27'F5=Payee # search'
     A                                      COLOR(BLU)
     A                                 23 55'F7=Alpha search'
     A                                      COLOR(BLU)
     A                                 24 55'F13=Change user parms'
     A                                      COLOR(BLU)
     A          R SCR02
     A                                      CF12
     A N09N40                               CF20
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A                                      SETOF(26)
     A                                      SETOF(27)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0430F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A N09                              2 76'SCR02'
     A            SCMODE    R        O  3 71REFFLD(NM10)
     A                                      TEXT('ADD/UPDATE MODE')
     A                                      DSPATR(HI)
     A                                  5  2'Payee:'
     A            SCFEIN    R        O  5  9REFFLD(FEIN)
     A                                      DSPATR(HI)
     A                                  5 23'Modifier:'
     A            SCMOD     R        O  5 33REFFLD(MOD)
     A                                      DSPATR(HI)
     A                                  5 49'Status:'
     A            SCSTAT    R        O  5 57REFFLD(STAT)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  8 10'Name or last name:'
     A            SCNAME    R        B  8 31REFFLD(NAME)
     A                                      TEXT('name or last name')
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A  20                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                  9 10'First name:'
     A            SCFSN     R        B  9 31REFFLD(FSN)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 10 10'Title:'
     A            SCTITL    R        B 10 31REFFLD(TITL)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                 11 10'Address:'
     A            SCADR1    R        B 11 31REFFLD(ADR1)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A  21                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                 12 10'City, State, Zip:'
     A            SCCTY     R        B 12 31REFFLD(CTY)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  22                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                      OVRDTA
     A            SCST      R        B 12 58REFFLD(ST)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A  23                                  ERRMSGID(CCR0505 *LIBL/CMESGG)
     A            SCZIP1    R        B 12 62REFFLD(ZIP1)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A  24                                  ERRMSGID(CCR0507 *LIBL/CMESGG)
     A                                      OVRDTA
     A                                 12 68'-'
     A            SCZIP2    R        B 12 70REFFLD(ZIP2)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                 13 10'Area code, Phone #:'
     A                                 13 31'('
     A            SCAREA    R        B 13 33REFFLD(AREA)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                 13 37')'
     A            SCPHN1    R        B 13 39REFFLD(PHN1)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                 13 43'-'
     A            SCPHN2    R        B 13 45REFFLD(PHN2)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                 15 10'Short name:'
     A            SCSHNM    R        B 15 31REFFLD(NM10)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A  25                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                 16 10'1099 flag (Y/N):'
     A            SC1099    R        B 16 31REFFLD(FLAG)
     A                                      TEXT('1099 FLAG')
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A  26                                  ERRMSGID(CCR0513 *LIBL/CMESGG)
     A                                 17 10'Payee type:'
     A            SCTYPE    R        B 17 31REFFLD(FLAG)
     A                                      TEXT('payee type')
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A  27                                  ERRMSGID(CCR0678 *LIBL/CMESGG)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 27'F12=Cancel     '
     A                                      COLOR(BLU)
     A N09N40                          23 58'F20=Change status'
     A                                      COLOR(BLU)
     A          R SCR99
     A            SCFL01    R        O  1  2REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      TEXT('DUMMY FIELD')
