     A*%%TS  SD  19980516  122305  COLEMANR    REL-V3R7M0  5716-PW1
     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   REQUEST PAYMENT FILE TRANSACTION DISPLAY                 **
     A**                                                            **
     A****************************************************************
     A**  REVISIONS                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A**                                                            **
     A****************************************************************
     A**
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT(UL)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                      CF12
     A N09                                  CF06
     A N09                                  CF09
     A                                      ROLLUP(18)
     A                                      ROLLDOWN(19)
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(23)
     A                                      SETOF(28)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0712F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  4  2'Claim Number:'
     A            SCCLM#    R        B  4 17REFFLD(CLM#)
     A                                      DSPATR(HI)
     A*                                     DSPATR(CS)
     A                                      OVRDTA
     A                                  5  4'Claim #'
     A                                  5 15'Claimant'
     A                                  5 24'Sect'
     A                                  5 29'Loc'
     A                                  5 33'Bldg'
     A                                  5 38'Cov'
     A                                  5 42'Subl'
     A                                  5 47'Veh#'
     A                                  5 52'Line'
     A                                  5 57'Form'
     A                                  5 63'Rate'
     A                                  5 69'Class'
     A                                  5 75'Cov Cd'
     A                                  6 10'Payee'
     A                                      DSPATR(HI)
     A                                  6 17'Mod'
     A                                      DSPATR(HI)
     A                                  6 22'Trans Dt'
     A                                      DSPATR(HI)
     A                                  6 31'Pay Cd'
     A                                      DSPATR(HI)
     A                                  6 43'Amount'
     A                                      DSPATR(HI)
     A                                  6 54'Ded. Used'
     A                                      DSPATR(HI)
     A                                  6 67'Net Amount'
     A                                      DSPATR(HI)
     A                                  6 78'Sts'
     A                                      DSPATR(HI)
     A            SCFL01    R        B  8  1REFFLD(FLAG)
     A  20                                  ERRMSGID(CCR0600 *LIBL/CMESGG)
     A  23                                  ERRMSGID(CCR0924 *LIBL/CMESGG)
     A  28                                  ERRMSGID(CCR0903 *LIBL/CMESGG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCFL02    R        B 10  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCFL03    R        B 12  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCFL04    R        B 14  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCFL05    R        B 16  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCFL06    R        B 18  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCFL07    R        B 20  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCC01    R        O  8 25REFFLD(CDE)
     A                                      OVRDTA
     A            SCCC02    R        O 10 25REFFLD(CDE)
     A                                      OVRDTA
     A            SCCC03    R        O 12 25REFFLD(CDE)
     A                                      OVRDTA
     A            SCCC04    R        O 14 25REFFLD(CDE)
     A                                      OVRDTA
     A            SCCC05    R        O 16 25REFFLD(CDE)
     A                                      OVRDTA
     A            SCCC06    R        O 18 25REFFLD(CDE)
     A                                      OVRDTA
     A            SCCC07    R        O 20 25REFFLD(CDE)
     A                                      OVRDTA
     A            SCCM01    R        O  8  4REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCM02    R        O 10  4REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCM03    R        O 12  4REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCM04    R        O 14  4REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCM05    R        O 16  4REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCM06    R        O 18  4REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCM07    R        O 20  4REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL01    R        O  8 18REFFLD(CLID)
     A                                      OVRDTA
     A            SCCL02    R        O 10 18REFFLD(CLID)
     A                                      OVRDTA
     A            SCCL03    R        O 12 18REFFLD(CLID)
     A                                      OVRDTA
     A            SCCL04    R        O 14 18REFFLD(CLID)
     A                                      OVRDTA
     A            SCCL05    R        O 16 18REFFLD(CLID)
     A                                      OVRDTA
     A            SCCL06    R        O 18 18REFFLD(CLID)
     A                                      OVRDTA
     A            SCCL07    R        O 20 18REFFLD(CLID)
     A                                      OVRDTA
     A            SCLC01    R        O  8 29REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLC02    R        O 10 29REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLC03    R        O 12 29REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLC04    R        O 14 29REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLC05    R        O 16 29REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLC06    R        O 18 29REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLC07    R        O 20 29REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR01    R        O  8 34REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR02    R        O 10 34REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR03    R        O 12 34REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR04    R        O 14 34REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR05    R        O 16 34REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR06    R        O 18 34REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR07    R        O 20 34REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF01    R        O  8 39REFFLD(FLAG)
     A                                      OVRDTA
     A            SCCF02    R        O 10 39REFFLD(FLAG)
     A                                      OVRDTA
     A            SCCF03    R        O 12 39REFFLD(FLAG)
     A                                      OVRDTA
     A            SCCF04    R        O 14 39REFFLD(FLAG)
     A                                      OVRDTA
     A            SCCF05    R        O 16 39REFFLD(FLAG)
     A                                      OVRDTA
     A            SCCF06    R        O 18 39REFFLD(FLAG)
     A                                      OVRDTA
     A            SCCF07    R        O 20 39REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL01    R        O  8 42REFFLD(SUBL)
     A                                      OVRDTA
     A            SCSL02    R        O 10 42REFFLD(SUBL)
     A                                      OVRDTA
     A            SCSL03    R        O 12 42REFFLD(SUBL)
     A                                      OVRDTA
     A            SCSL04    R        O 14 42REFFLD(SUBL)
     A                                      OVRDTA
     A            SCSL05    R        O 16 42REFFLD(SUBL)
     A                                      OVRDTA
     A            SCSL06    R        O 18 42REFFLD(SUBL)
     A                                      OVRDTA
     A            SCSL07    R        O 20 42REFFLD(SUBL)
     A                                      OVRDTA
     A            SCCS01    R        O  8 68REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCS02    R        O 10 68REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCS03    R        O 12 68REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCS04    R        O 14 68REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCS05    R        O 16 68REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCS06    R        O 18 68REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCS07    R        O 20 68REFFLD(CLAS)
     A                                      OVRDTA
     A            SCLN01    R        O  8 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCLN02    R        O 10 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCLN03    R        O 12 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCLN04    R        O 14 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCLN05    R        O 16 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCLN06    R        O 18 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCLN07    R        O 20 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCIT01    R        O  8 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCIT02    R        O 10 47REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCIT03    R        O 12 47REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCIT04    R        O 14 47REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCIT05    R        O 16 47REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCIT06    R        O 18 47REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCIT07    R        O 20 47REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCFR01    R        O  8 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCFR02    R        O 10 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCFR03    R        O 12 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCFR04    R        O 14 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCFR05    R        O 16 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCFR06    R        O 18 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCFR07    R        O 20 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT01    R        O  8 64REFFLD(RTGP)
     A                                      OVRDTA
     A            SCRT02    R        O 10 64REFFLD(RTGP)
     A                                      OVRDTA
     A            SCRT03    R        O 12 64REFFLD(RTGP)
     A                                      OVRDTA
     A            SCRT04    R        O 14 64REFFLD(RTGP)
     A                                      OVRDTA
     A            SCRT05    R        O 16 64REFFLD(RTGP)
     A                                      OVRDTA
     A            SCRT06    R        O 18 64REFFLD(RTGP)
     A                                      OVRDTA
     A            SCRT07    R        O 20 64REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCV01    R        O  8 77REFFLD(CVBO)
     A                                      OVRDTA
     A            SCCV02    R        O 10 77REFFLD(CVBO)
     A                                      OVRDTA
     A            SCCV03    R        O 12 77REFFLD(CVBO)
     A                                      OVRDTA
     A            SCCV04    R        O 14 77REFFLD(CVBO)
     A                                      OVRDTA
     A            SCCV05    R        O 16 77REFFLD(CVBO)
     A                                      OVRDTA
     A            SCCV06    R        O 18 77REFFLD(CVBO)
     A                                      OVRDTA
     A            SCCV07    R        O 20 77REFFLD(CVBO)
     A                                      OVRDTA
     A            SCFN01    R        O  9  6REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCFN02    R        O 11  6REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCFN03    R        O 13  6REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCFN04    R        O 15  6REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCFN05    R        O 17  6REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCFN06    R        O 19  6REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCFN07    R        O 21  6REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD01    R        O  9 17REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD02    R        O 11 17REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD03    R        O 13 17REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD04    R        O 15 17REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD05    R        O 17 17REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD06    R        O 19 17REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD07    R        O 21 17REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT01    R        O  9 22REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCDT02    R        O 11 22REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCDT03    R        O 13 22REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCDT04    R        O 15 22REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCDT05    R        O 17 22REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCDT06    R        O 19 22REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCDT07    R        O 21 22REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC01    R        O  9 33REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCPC02    R        O 11 33REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCPC03    R        O 13 33REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCPC04    R        O 15 33REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCPC05    R        O 17 33REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCPC06    R        O 19 33REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCPC07    R        O 21 33REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCGA01    R        O  9 37REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA02    R        O 11 37REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA03    R        O 13 37REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA04    R        O 15 37REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA05    R        O 17 37REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA06    R        O 19 37REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA07    R        O 21 37REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCDU01    R        O  9 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCDU02    R        O 11 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCDU03    R        O 13 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCDU04    R        O 15 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCDU05    R        O 17 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCDU06    R        O 19 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCDU07    R        O 21 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCNA01    R        O  9 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCNA02    R        O 11 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCNA03    R        O 13 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCNA04    R        O 15 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCNA05    R        O 17 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCNA06    R        O 19 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCNA07    R        O 21 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST01    R        O  9 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCST02    R        O 11 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCST03    R        O 13 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCST04    R        O 15 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCST05    R        O 17 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCST06    R        O 19 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCST07    R        O 21 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 23'F12=Cancel     '
     A                                      COLOR(BLU)
     A            SCUP           9A  O 23 53OVRDTA
     A            SCDOWN         9A  O 23 67OVRDTA
     A N09                             24  2'F6=Release/hold payment'
     A                                      COLOR(BLU)
     A N09                             24 31'F9=Delete transaction'
     A                                      COLOR(BLU)
     A            SCERR     R        O 24 78REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      OVRDTA
     A  21                                  ERRMSGID(CCR0627 *LIBL/CMESGG)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
