     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   PAYMENT FILE RECOVERY SEARCH DISPLAY                     **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                      CF12
     A                                      ROLLUP(18)
     A                                      ROLLDOWN(19)
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C0911F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  4  2'Claim Number:'
     A            SCCLM#    R        B  4 17REFFLD(CLM#)
     A                                      DSPATR(HI)
     A*                                     DSPATR(CS)
     A                                      OVRDTA
     A                                  5  4'Claim #'
     A                                  5 14'Claimant'
     A                                  5 23'Sect'
     A                                  5 28'Loc'
     A                                  5 32'Bldg'
     A                                  5 37'Cov'
     A                                  5 41'Subl'
     A                                  5 46'Veh #'
     A                                  5 52'Line'
     A                                  5 57'Form'
     A                                  5 62'Rate'
     A                                  5 67'Class'
     A                                  5 74'Cov Cd'
     A                                  6  2'Req#'
     A                                      DSPATR(HI)
     A                                  6  9'Check #'
     A                                      DSPATR(HI)
     A                                  6 19'Fed ID'
     A                                      DSPATR(HI)
     A                                  6 29'Mod'
     A                                      DSPATR(HI)
     A                                  6 35'TDATE'
     A                                      DSPATR(HI)
     A                                  6 43'PC'
     A                                      DSPATR(HI)
     A                                  6 47'TY'
     A                                      DSPATR(HI)
     A                                  6 54'Ded. Used'
     A                                      DSPATR(HI)
     A                                  6 65'Amt Received'
     A                                      DSPATR(HI)
     A                                  6 78'Sts'
     A                                      DSPATR(HI)
     A            SCFL01    R        B  8  1REFFLD(FLAG)
     A  20                                  ERRMSGID(CCR0600 *LIBL/CMESGG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCM01    R        O  8  3REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL01    R        O  8 17REFFLD(CLID)
     A                                      OVRDTA
     A            SCCC01    R        O  8 24REFFLD(CDE)
     A                                      OVRDTA
     A            SCLC01    R        O  8 28REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR01    R        O  8 33REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF01    R        O  8 38REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL01    R        O  8 41REFFLD(SUBL)
     A                                      OVRDTA
     A            SCIT01    R        O  8 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLN01    R        O  8 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFR01    R        O  8 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT01    R        O  8 63REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCS01    R        O  8 67REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCV01    R        O  8 76REFFLD(CVBO)
     A                                      OVRDTA
     A            SCRQ01    R        O  9  2REFFLD(SEQ#)
     A                                      TEXT('Request #')
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            SCCK01    R        O  9  9REFFLD(CHK#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCFN01    R        O  9 18REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD01    R        O  9 29REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT01    R        O  9 34REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC01    R        O  9 43REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCTP01    R        O  9 47REFFLD(COVF)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCDU01    R        O  9 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA01    R        O  9 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST01    R        O  9 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCFL02    R        B 10  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCM02    R        O 10  3REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL02    R        O 10 17REFFLD(CLID)
     A                                      OVRDTA
     A            SCCC02    R        O 10 24REFFLD(CDE)
     A                                      OVRDTA
     A            SCLC02    R        O 10 28REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR02    R        O 10 33REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF02    R        O 10 38REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL02    R        O 10 41REFFLD(SUBL)
     A                                      OVRDTA
     A            SCIT02    R        O 10 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLN02    R        O 10 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFR02    R        O 10 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT02    R        O 10 63REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCS02    R        O 10 67REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCV02    R        O 10 76REFFLD(CVBO)
     A                                      OVRDTA
     A            SCRQ02    R        O 11  2REFFLD(SEQ#)
     A                                      TEXT('Request #')
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            SCCK02    R        O 11  9REFFLD(CHK#)
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCFN02    R        O 11 18REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD02    R        O 11 29REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT02    R        O 11 34REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC02    R        O 11 43REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCTP02    R        O 11 47REFFLD(COVF)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCDU02    R        O 11 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA02    R        O 11 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST02    R        O 11 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCFL03    R        B 12  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCM03    R        O 12  3REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL03    R        O 12 17REFFLD(CLID)
     A                                      OVRDTA
     A            SCCC03    R        O 12 24REFFLD(CDE)
     A                                      OVRDTA
     A            SCLC03    R        O 12 28REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR03    R        O 12 33REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF03    R        O 12 38REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL03    R        O 12 41REFFLD(SUBL)
     A                                      OVRDTA
     A            SCIT03    R        O 12 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLN03    R        O 12 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFR03    R        O 12 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT03    R        O 12 63REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCS03    R        O 12 67REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCV03    R        O 12 76REFFLD(CVBO)
     A                                      OVRDTA
     A            SCRQ03    R        O 13  2REFFLD(SEQ#)
     A                                      TEXT('Request #')
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            SCCK03    R        O 13  9REFFLD(CHK#)
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCFN03    R        O 13 18REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD03    R        O 13 29REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT03    R        O 13 34REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC03    R        O 13 43REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCTP03    R        O 13 47REFFLD(COVF)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCDU03    R        O 13 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA03    R        O 13 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST03    R        O 13 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCFL04    R        B 14  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCM04    R        O 14  3REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL04    R        O 14 17REFFLD(CLID)
     A                                      OVRDTA
     A            SCCC04    R        O 14 24REFFLD(CDE)
     A                                      OVRDTA
     A            SCLC04    R        O 14 28REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR04    R        O 14 33REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF04    R        O 14 38REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL04    R        O 14 41REFFLD(SUBL)
     A                                      OVRDTA
     A            SCIT04    R        O 14 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLN04    R        O 14 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFR04    R        O 14 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT04    R        O 14 63REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCS04    R        O 14 67REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCV04    R        O 14 76REFFLD(CVBO)
     A                                      OVRDTA
     A            SCRQ04    R        O 15  2REFFLD(SEQ#)
     A                                      TEXT('Request #')
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            SCCK04    R        O 15  9REFFLD(CHK#)
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCFN04    R        O 15 18REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD04    R        O 15 29REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT04    R        O 15 34REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC04    R        O 15 43REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCTP04    R        O 15 47REFFLD(COVF)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCDU04    R        O 15 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA04    R        O 15 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST04    R        O 15 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCFL05    R        B 16  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCM05    R        O 16  3REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL05    R        O 16 17REFFLD(CLID)
     A                                      OVRDTA
     A            SCCC05    R        O 16 24REFFLD(CDE)
     A                                      OVRDTA
     A            SCLC05    R        O 16 28REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR05    R        O 16 33REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF05    R        O 16 38REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL05    R        O 16 41REFFLD(SUBL)
     A                                      OVRDTA
     A            SCIT05    R        O 16 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLN05    R        O 16 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFR05    R        O 16 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT05    R        O 16 63REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCS05    R        O 16 67REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCV05    R        O 16 76REFFLD(CVBO)
     A                                      OVRDTA
     A            SCRQ05    R        O 17  2REFFLD(SEQ#)
     A                                      TEXT('Request #')
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            SCCK05    R        O 17  9REFFLD(CHK#)
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCFN05    R        O 17 18REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD05    R        O 17 29REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT05    R        O 17 34REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC05    R        O 17 43REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCTP05    R        O 17 47REFFLD(COVF)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCDU05    R        O 17 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA05    R        O 17 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST05    R        O 17 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCFL06    R        B 18  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCM06    R        O 18  3REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL06    R        O 18 17REFFLD(CLID)
     A                                      OVRDTA
     A            SCCC06    R        O 18 24REFFLD(CDE)
     A                                      OVRDTA
     A            SCLC06    R        O 18 28REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR06    R        O 18 33REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF06    R        O 18 38REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL06    R        O 18 41REFFLD(SUBL)
     A                                      OVRDTA
     A            SCIT06    R        O 18 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLN06    R        O 18 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFR06    R        O 18 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT06    R        O 18 63REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCS06    R        O 18 67REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCV06    R        O 18 76REFFLD(CVBO)
     A                                      OVRDTA
     A            SCRQ06    R        O 19  2REFFLD(SEQ#)
     A                                      TEXT('Request #')
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            SCCK06    R        O 19  9REFFLD(CHK#)
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCFN06    R        O 19 18REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD06    R        O 19 29REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT06    R        O 19 34REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC06    R        O 19 43REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCTP06    R        O 19 47REFFLD(COVF)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCDU06    R        O 19 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA06    R        O 19 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST06    R        O 19 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCFL07    R        B 20  1REFFLD(FLAG)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            SCCM07    R        O 20  3REFFLD(CLM#)
     A                                      OVRDTA
     A            SCCL07    R        O 20 17REFFLD(CLID)
     A                                      OVRDTA
     A            SCCC07    R        O 20 24REFFLD(CDE)
     A                                      OVRDTA
     A            SCLC07    R        O 20 28REFFLD(LOC#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCPR07    R        O 20 33REFFLD(PRM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCCF07    R        O 20 38REFFLD(FLAG)
     A                                      OVRDTA
     A            SCSL07    R        O 20 41REFFLD(SUBL)
     A                                      OVRDTA
     A            SCIT07    R        O 20 46REFFLD(ITM#)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            SCLN07    R        O 20 54REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFR07    R        O 20 58REFFLD(FRM)
     A                                      OVRDTA
     A            SCRT07    R        O 20 63REFFLD(RTGP)
     A                                      OVRDTA
     A            SCCS07    R        O 20 67REFFLD(CLAS)
     A                                      OVRDTA
     A            SCCV07    R        O 20 76REFFLD(CVBO)
     A                                      OVRDTA
     A            SCRQ07    R        O 21  2REFFLD(SEQ#)
     A                                      TEXT('Request #')
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            SCCK07    R        O 21  9REFFLD(CHK#)
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCFN07    R        O 21 18REFFLD(FEIN)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCMD07    R        O 21 29REFFLD(MOD)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      DSPATR(HI)
     A            SCDT07    R        O 21 34REFFLD(DT8)
     A                                      OVRDTA
     A                                      EDTWRD('  /  /    ')
     A                                      DSPATR(HI)
     A            SCPC07    R        O 21 43REFFLD(CDE)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            SCTP07    R        O 21 47REFFLD(COVF)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            SCDU07    R        O 21 51REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCGA07    R        O 21 65REFFLD(A92)
     A                                      OVRDTA
     A                                      EDTCDE(2)
     A                                      DSPATR(HI)
     A            SCST07    R        O 21 79REFFLD(STAT)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 23'F12=Cancel     '
     A                                      COLOR(BLU)
     A            SCUP           9A  O 23 53OVRDTA
     A            SCDOWN         9A  O 23 67OVRDTA
     A            SCERR     R        O 24 78REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      OVRDTA
     A  21                                  ERRMSGID(CCR0627 *LIBL/CMESGG)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
