     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   SECTION CODE TABLE MAINTENANCE DISPLAY                   **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A*                                     CHGINPDFT(CS)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                      PUTOVR
     A                                      CF05
     A                                      SETOF(20)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C2000F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  8 32'Section Code:'
     A            SCCOV     R        B  8 47REFFLD(CODE)
     A                                      OVRDTA
     A  20                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 30'F5=Search'
     A                                      COLOR(BLU)
     A          R SCR02
     A                                      PUTOVR
     A                                      CF12
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A N09N40                               CF20
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C2000F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR02'
     A N09        SCMODE    R        O  3 71REFFLD(NM10)
     A                                      TEXT('ADD/UPDATE MODE')
     A                                      DSPATR(HI)
     A                                  5  2'Section code:'
     A            SCCOV     R        O  5 17REFFLD(CODE)
     A                                      DSPATR(HI)
     A                                  5 30'Status:'
     A            SCSTAT    R        O  5 38REFFLD(STAT)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  8  9'Description:'
     A            SCDESC    R        B  8 23REFFLD(DS40)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A  20                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                      OVRDTA
     A                                 10  9'Section value:'
     A            SCVAL     R        B 10 26REFFLD(FLAG)
     A  09                                  DSPATR(HI)
     A*                                     DSPATR(CS)
     A  09                                  DSPATR(PR)
     A                                      OVRDTA
     A  21                                  ERRMSGID(CCR0510 *LIBL/CMESGG)
     A                                      TEXT('FLAG')
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 22'F12=Cancel     '
     A                                      COLOR(BLU)
     A N09N40                          23 60'F20=Change status'
     A                                      COLOR(BLU)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
