     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   BILLING CODE TABLE SEARCH DISPLAY                        **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A                                      HELP(10)
     A                                      ROLLUP(18)
     A                                      ROLLDOWN(19)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                      PUTOVR
     A                                      SETOF(20)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'C2021F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  4  3'Billing Schedule Code:'
     A            SCCODE    R        B  4 27REFFLD(CODE)
     A*                                     DSPATR(CS)
     A                                      OVRDTA
     A                                  6 16'Code'
     A                                  6 24'Description'
     A                                  6 57'Status'
     A            SCFL01    R        B  8 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A  20                                  ERRMSGID(CCR0600 *LIBL/CMESGG)
     A            SCFL02    R        B  9 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SLFL03    R        B 10 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL04    R        B 11 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL05    R        B 12 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL06    R        B 13 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL07    R        B 14 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL08    R        B 15 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL09    R        B 16 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL10    R        B 17 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL11    R        B 18 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL12    R        B 19 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL13    R        B 20 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCFL14    R        B 21 15REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCBC01    R        O  8 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC02    R        O  9 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC03    R        O 10 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC04    R        O 11 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC05    R        O 12 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC06    R        O 13 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC07    R        O 14 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC08    R        O 15 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC09    R        O 16 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC10    R        O 17 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC11    R        O 18 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC12    R        O 19 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC13    R        O 20 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCBC14    R        O 21 17REFFLD(CODE)
     A                                      OVRDTA
     A            SCCD01    R        O  8 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD02    R        O  9 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD03    R        O 10 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD04    R        O 11 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD05    R        O 12 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD06    R        O 13 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD07    R        O 14 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD08    R        O 15 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD09    R        O 16 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD10    R        O 17 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD11    R        O 18 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD12    R        O 19 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD13    R        O 20 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCCD14    R        O 21 24REFFLD(DS30)
     A                                      OVRDTA
     A            SCST01    R        O  8 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST02    R        O  9 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST03    R        O 10 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST04    R        O 11 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST05    R        O 12 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST06    R        O 13 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST07    R        O 14 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST08    R        O 15 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST09    R        O 16 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST10    R        O 17 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST11    R        O 18 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST12    R        O 19 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST13    R        O 20 59REFFLD(FLAG)
     A                                      OVRDTA
     A            SCST14    R        O 21 59REFFLD(FLAG)
     A                                      OVRDTA
     A                                 23 10'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 31'F12=Cancel     '
     A                                      COLOR(BLU)
     A            SCUP           9A  O 23 52OVRDTA
     A            SCDOWN         9A  O 23 67OVRDTA
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND PR)
