     A*%%TS  SD  19980122  170007  COLEMANR    REL-V3R7M0  5716-PW1
     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   CHECK ENCLOSURE TABLE MAINTENANCE DISPLAY                **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A*%%TS  SD  19980122  170007  COLEMANR    REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF05
     A                                      SETOF(20)
     A                                      SETOF(21)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A            DSDAT8    R        O  1 71REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                  2  2'C2175F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                 10 28'Check Enclosure Code:'
     A            SCCODE    R        B 10 52REFFLD(CODE)
     A                                      OVRDTA
     A  20                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A  21                                  ERRMSGID(CCR0508 *LIBL/CMESGG)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 35'F5=Search'
     A                                      COLOR(BLU)
     A          R SCR02
     A*%%TS  SD  19980122  170007  COLEMANR    REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF12
     A N09N40                               CF20
     A                                      SETOF(20)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A            DSDAT8    R        O  1 71REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                  2  2'C2175F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR02'
     A N09        SCMODE    R        O  3 71REFFLD(NM10)
     A                                      TEXT('ADD/UPDATE MODE')
     A                                      DSPATR(HI)
     A                                  6  2'Check Enclosure Code:'
     A            SCCODE    R        O  6 25REFFLD(CODE)
     A                                      DSPATR(HI)
     A                                  6 39'Status:'
     A            SCSTAT    R        O  6 47REFFLD(STAT)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  9 11'Description:'
     A            SCDESC    R        B  9 25REFFLD(DS30)
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A  20                                  ERRMSGID(CCR0501 *LIBL/CMESGG)
     A                                 23  2'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 23'F12=Cancel     '
     A                                      COLOR(BLU)
     A N09N40                          23 60'F20=Change status'
     A                                      COLOR(BLU)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
