     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   CHECK SCHEDULE FILE SEARCH DISPLAY                       **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A                                      HELP(10)
     A                                      ROLLUP(18)
     A                                      ROLLDOWN(19)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                      PUTOVR
     A                                      SETOF(20)
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                      DSPATR(HI)
     A                                  1 73DATE
     A                                      EDTWRD('  /  /  ')
     A                                  2  2'C6011F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  4  2'Process Date'
     A            SCPRDT    R        B  4 15REFFLD(DT8)
     A*                                     DSPATR(CS)
     A                                      EDTWRD('  /  /    ')
     A                                  6 16'Process Date'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 31'Check printing'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 48'Check update'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            SCFL01    R        B  8 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A  20                                  ERRMSGID(CCR0600 *LIBL/CMESGG)
     A            SCPD01    R        O  8 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS001    R        O  8 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS101    R        O  8 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL02    R        B  9 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD02    R        O  9 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS002    R        O  9 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS102    R        O  9 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SLFL03    R        B 10 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD03    R        O 10 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS003    R        O 10 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS103    R        O 10 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL04    R        B 11 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD04    R        O 11 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS004    R        O 11 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS104    R        O 11 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL05    R        B 12 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD05    R        O 12 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS005    R        O 12 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS105    R        O 12 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL06    R        B 13 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD06    R        O 13 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS006    R        O 13 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS106    R        O 13 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL07    R        B 14 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD07    R        O 14 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS007    R        O 14 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS107    R        O 14 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL08    R        B 15 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD08    R        O 15 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS008    R        O 15 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS108    R        O 15 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL09    R        B 16 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD09    R        O 16 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS009    R        O 16 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS109    R        O 16 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL10    R        B 17 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD10    R        O 17 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS010    R        O 17 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS110    R        O 17 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL11    R        B 18 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD11    R        O 18 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS011    R        O 18 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS111    R        O 18 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL12    R        B 19 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD12    R        O 19 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS012    R        O 19 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS112    R        O 19 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL13    R        B 20 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD13    R        O 20 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS013    R        O 20 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS113    R        O 20 53REFFLD(FLAG)
     A                                      OVRDTA
     A            SCFL14    R        B 21 10REFFLD(FLAG)
     A                                      DSPATR(ND)
     A            SCPD14    R        O 21 17REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A                                      OVRDTA
     A            SCS014    R        O 21 37REFFLD(FLAG)
     A                                      OVRDTA
     A            SCS114    R        O 21 53REFFLD(FLAG)
     A                                      OVRDTA
     A                                 23 10'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 23 31'F12=Cancel     '
     A                                      COLOR(BLU)
     A            SCUP           9A  O 23 52OVRDTA
     A            SCDOWN         9A  O 23 67OVRDTA
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
