     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   IL1201 - ENDORSEMENT E PRINT FILE                        **
     A**                                                            **
     A**   PROGRAMMER: C:31                                         **
     A**   <---------------------------------------------------->   **
     A**   <-|        THIS FILE MUST BE COMPILED WITH         |->   **
     A**   <-|              DEVTYPE = *AFPDS                  |->   **
     A**   <---------------------------------------------------->   **
     A****************************************************************
     A**   REVISIONS                                                **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      REF(*LIBL/CREFP)
     A*----------------------------------------------------------------
     A          R PRTE1                     FONT(155)
     A*----------------------------------------------------------------
     A                                 10 37'ENDORSEMENT'
     A            QQTYPE         1     10 51
     A*
     A            PMPOL#        13     15 12
     A            XXEFDT         6  0  15 38
     A                                      EDTCDE(Y)
     A            CONAME        40     15 52
     A            XAGN          30     16 52
     A*
     A            PMFIN         40     19 12
     A            XXUNM2        30     19 55
     A*
     A            XXDBA          4     20 12
     A            PMDBA         40     20 17
     A                                 20 61'AGENT'
     A*
     A                                 26 37'COMMERCIAL AUTO'
     A*----------------------------------------------------------------
     A          R PRTE2                     FONT(155)
     A*----------------------------------------------------------------
     A                                    27'SAND AND GRAVEL HAULERS -'
     A                                      SKIPB(031)
     A                                    54'LIMITATION'
     A                                      SPACEA(002)
     A                                    15'     In consideration of the premi-
     A                                      um charged for this policy, it is a-
     A                                      greed   '
     A                                      SPACEA(001)
     A                                    15'that such coverage as is afforded -
     A                                      by this policy shall not apply to a-
     A                                      ny       '
     A                                      SPACEA(001)
     A                                    15'accident, occurrence, or event occ-
     A                                      urring while any vehicle insured he-
     A                                      re-    '
     A                                      SPACEA(001)
     A                                    15'under is being used for the transp-
     A                                      ortation, including loading and unl-
     A                                      oading   '
     A                                      SPACEA(001)
     A                                    15'of, or distribution of any product-
     A                                       other than sand and gravel'
     A                                      SPACEA(002)
     A                                    15'All other terms and conditions of -
     A                                      this policy remain unchanged.'
     A                                      SPACEA(002)
     A                                    15'ACKNOWLEDGEMENT OF INSURED:'
     A                                      UNDERLINE
     A                                      SPACEA(002)
     A                                    15'I, the undersigned, confirm accept-
     A                                      ance of the terms of the above'
     A                                      SPACEA(001)
     A                                    15'endorsement on behalf of any and a-
     A                                      ll "insured" under this policy.'
     A                                      SPACEA(002)
     A                                    15'SIGNED: __________________________-
     A                                      ______________'
     A                                      SPACEA(001)
     A                                    16'        Named Insured (Individual)'
     A                                      SPACEA(002)
     A                                    15'SIGNED: __________________________-
     A                                      ______________'
     A                                      SPACEA(001)
     A                                    16'        President of Named Insured-
     A                                       (Corporation)'
     A                                      SPACEA(002)
     A                                    17'        __________________________-
     A                                      ______________'
     A                                      SPACEA(001)
     A                                    40'PRINT'
     A                                      SPACEA(002)
     A                                    15'WITNESSED BY: ____________________-
     A                                      ______________'
     A                                      SPACEA(001)
     A                                    18'              Signature of Agent/G-
     A                                      eneral Agent'
     A            UPSTAF         3        11
     A                                      SKIPB(061)
     A            DSDATE         6  0     15EDTCDE(Y)
