     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   BURGLARY & THEFT COVERAGE WORK FILE (CO#/POL#/CC/...     **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A          R PBT01                     PFILE(CABTP)
     A          K BTCO#
     A          K BTPOL#
     A          K BTCC
     A          K BTLOC#
     A          K BTPRM#
     A          K BTFRM
     A          K BTRTGP
     A          K BTCLAS
     A          K BTTRDR
