     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   LOSS DEVELOPMENT DETAIL FILE                             **
     A**                                                            **
     A**   PROGRAMMER: C:31                                         **
     A**   CREATED: 12/21/95         PROJECT: 67CEH                 **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      REF(CREFP)
     A          R PLD01                     TEXT('LOSS DEVELOPMENT DETAIL')
     A            LDCO#     R               REFFLD(CO#)
     A            LDCLM#    R               REFFLD(CLM#)
     A            LDCOV          3A         TEXT('COVERAGE')
     A            LDLIM         18A         TEXT('LIMITS/DEDUCTIONS')
     A            LDTER     R               REFFLD(TERA)
     A            LDMPL     R               REFFLD(A112)
     A                                      COLHDG('MTD PAID LOSS')
     A            LDMRL     R               REFFLD(A112)
     A                                      COLHDG('MTD RESERVE LOSS')
     A            LDMPE     R               REFFLD(A112)
     A                                      COLHDG('MTD PAID EXPENSE')
     A            LDMRE     R               REFFLD(A112)
     A                                      COLHDG('MTD RESERVE EXPENSE')
     A            LDMSV     R               REFFLD(A112)
     A                                      COLHDG('MTD SALVAGE')
     A            LDMSR     R               REFFLD(A112)
     A                                      COLHDG('MTD SUBROGATION')
     A            LDMTT     R               REFFLD(A112)
     A                                      COLHDG('MTD TOTAL')
     A            LDCPL     R               REFFLD(A112)
     A                                      COLHDG('CUMM PAID LOSS')
     A            LDCRL     R               REFFLD(A112)
     A                                      COLHDG('CUMM RESERVE LOSS')
     A            LDCPE     R               REFFLD(A112)
     A                                      COLHDG('CUMM PAID EXPENSE')
     A            LDCRE     R               REFFLD(A112)
     A                                      COLHDG('CUMM RESERVE EXPENSE')
     A            LDCSV     R               REFFLD(A112)
     A                                      COLHDG('CUMM SALVAGE')
     A            LDCSR     R               REFFLD(A112)
     A                                      COLHDG('CUMM SUBROGATION')
     A            LDCTT     R               REFFLD(A112)
     A                                      COLHDG('CUMM TOTAL')
     A            LDOCST    R               REFFLD(STAT)
     A                                      COLHDG('OPEN/CLOSED STATUS')
     A            LDSTAT    R               REFFLD(STAT)
     A            LDUSER    R               REFFLD(USER)
     A            LDPGM     R               REFFLD(PGM)
     A            LDTIME    R               REFFLD(TIME)
     A            LDDT      R               REFFLD(DT)
