     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   WORK FILE - CLASSIFICATION EXPERIENCE DETAIL (TERA/...   **
     A**                                                            **
     A**   PROGRAMMER: C:31                                         **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A          R PRC01                     PFILE(CARCP)
     A          K RCTERA
     A          K RCCOV
     A          K RCCLAS
     A          K RCROW
