     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   CLAIMS ITEM FILE DETAIL (CO#/CC/CLM#/CLID/LOC#/PRM#/...  **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A          R PCI01                     PFILE(CDCIP)
     A          K CICO#
     A          K CICC
     A          K CICLM#
     A          K CICLID
     A          K CILOC#
     A          K CIPRM#
     A          K CICLAS
     A          K CIITM#
