     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   VIEW CHECK FILE                                          **
     A**                                                            **
     A**   PROGRAMMER: C:31                                         **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      REF(CREFP)
     A          R PRP01                     TEXT('VIEW CHECK FILE'     )
     A            RPCO#     R               REFFLD(CO#)
     A            RPCLM#    R               REFFLD(CLM#)
     A            RPCLID    R               REFFLD(CLID)
     A            RPCC      R               REFFLD(CDE)
     A                                      COLHDG('SECTION CODE')
     A            RPTRDT    R               REFFLD(DT)
     A                                      COLHDG('TRANSACTION' 'DATE')
     A            RPCHK#    R               REFFLD(CHK#)
     A            RPTYPE    R               REFFLD(FLAG)
     A                                      COLHDG('PAYMENT TYPE')
     A            RPRETP    R               REFFLD(FLAG)
     A                                      COLHDG('RESERVE' 'TYPE')
     A            RPRECD    R               REFFLD(CDE)
     A                                      COLHDG('RESERVE' 'CODE')
     A            RPRMDS    R               REFFLD(DS30)
     A                                      TEXT('REMARKS')
     A            RPRMK1    R               REFFLD(CODE)
     A                                      TEXT('REMARK CODE 1')
     A            RPRMK2    R               REFFLD(CDE)
     A                                      TEXT('REMARK CODE 2')
     A            RPRMK3    R               REFFLD(CDE)
     A                                      TEXT('REMARK CODE 3')
     A            RPCKEN    R               REFFLD(CDE)
     A                                      COLHDG('CHECK ENCLOSURE CODE')
     A            RPNAM1    R               REFFLD(NAME)
     A            RPNAM2    R               REFFLD(NAME)
     A            RPADR1    R               REFFLD(ADR1)
     A            RPADR2    R               REFFLD(ADR2)
     A            RPCTY     R               REFFLD(CTY)
     A            RPST      R               REFFLD(ST)
     A            RPZIP     R               REFFLD(ZIP)
     A            RPAREA    R               REFFLD(AREA)
     A            RPPHN#    R               REFFLD(PHN#)
     A            RPSTAT    R               REFFLD(STAT)
     A            RPUSER    R               REFFLD(USER)
     A            RPPGM     R               REFFLD(PGM)
     A            RPTIME    R               REFFLD(TIME)
     A            RPDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            RPBUL2    R               REFFLD(BUL#2)
