     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   DRIVER MASTER FILE                                       **
     A**                                                            **
     A****************************************************************
     A** REVISIONS                                                  **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      REF(CREFP)
     A          R PDR01                     TEXT('DRIVER MASTER FILE')
     A            DRCO#     R               REFFLD(CO#)
     A            DRPOL#    R               REFFLD(POL#)
     A            DRLSN     R               REFFLD(LSN)
     A            DRFSN     R               REFFLD(FSN)
     A            DRMID     R               REFFLD(MID)
     A            DRDOB     R               REFFLD(DT)
     A                                      COLHDG('DATE OF BIRTH')
     A            DRLIC#    R               REFFLD(LIC#)
     A            DRSTI     R               REFFLD(ST)
     A                                      COLHDG('STATE ISSUED')
     A            DREMDT    R               REFFLD(DT)
     A                                      COLHDG('EMPLOYMENT DATE')
     A            DRVROD    R               REFFLD(DT)
     A                                      COLHDG('MVR ORDERED DT')
     A            DRVRRD    R               REFFLD(DT)
     A                                      COLHDG('MVR RECEIVED DT')
     A            DRCOMM    R               REFFLD(COMM)
     A            DRSTAT    R               REFFLD(STAT)
     A            DRUSER    R               REFFLD(USER)
     A            DRPGM     R               REFFLD(PGM)
     A            DRTIME    R               REFFLD(TIME)
     A            DRDT      R               REFFLD(DT)
     A            DROWN     R               REFFLD(FLAG)
     A                                      COLHDG('OWNER/DRIVER Y/N')
     A            DRITM#    R               REFFLD(ITM#)
     A            DRITM2    R               REFFLD(ITM#)
     A                                      COLHDG('VEHICLE # 2')
     A            DRITM3    R               REFFLD(ITM#)
     A                                      COLHDG('VEHICLE # 3')
     A            DRITM4    R               REFFLD(ITM#)
     A                                      COLHDG('VEHICLE # 4')
     A            DRITM5    R               REFFLD(ITM#)
     A                                      COLHDG('VEHICLE # 5')
     A            DRCLS     R               REFFLD(FLAG)
     A                                      COLHDG('DRIVER CLASS CODE')
