     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   COMMERCIAL FIRE SECTION FILE (CO#/POL#/CC/TRNS)          **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A          R PFA01                     PFILE(CMFAP)
     A          K FACO#
     A          K FAPOL#
     A          K FACC
     A          K FATRNS
