     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   FARM AND RANCH OWNERS SECTION FILE                       **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      REF(CREFP)
     A          R PFR01                     TEXT('FARM & RANCH OWNERS SECTION')
     A            FRCO#     R               REFFLD(CO#)
     A            FRPOL#    R               REFFLD(POL#)
     A            FRCC      R               REFFLD(CDE)
     A            FRLOC#    R               REFFLD(LOC#)
     A            FRPRM#    R               REFFLD(PRM#)
     A            FRFORM    R               REFFLD(FLAG)
     A                                      COLHDG('FORM CODE')
     A            FRTRNS    R               REFFLD(TRNS)
     A            FRTRDT    R               REFFLD(DT)
     A                                      COLHDG('EFFECTIVE DATE')
     A            FREND#    R               REFFLD(END#)
     A            FRTERR    R               REFFLD(TERF)
     A                                      COLHDG('TERRITORY CODE')
     A            FRSUBL    R               REFFLD(SUBL)
     A            FRCLAS    R               REFFLD(CLAS)
     A            FRDECD    R               REFFLD(CDE)
     A                                      COLHDG('DEDUCTIBLE CODE')
     A            FREXP     R               REFFLD(EXP)
     A            FRPREM    R               REFFLD(A80)
     A                                      COLHDG('PREMIUM')
     A            FRACMY    R               REFFLD(ACMY)
     A            FRSTAT    R               REFFLD(STAT)
     A            FRUSER    R               REFFLD(USER)
     A            FRPGM     R               REFFLD(PGM)
     A            FRTIME    R               REFFLD(TIME)
     A            FRDT      R               REFFLD(DT)
     A            FRBUL3    R               REFFLD(BUL#3)
     A            FRRCDT    R               REFFLD(DT)
     A                                      COLHDG('RECORD DATE')
