     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   REQUEST REFUND FILE (CO#/CC/CLM#/CLID/ITM#/CLAS/COVL)    **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A          R PRR01                     PFILE(CMRRP)
     A          K RRCO#
     A          K RRCC
     A          K RRCLM#
     A          K RRCLID
     A          K RRITM#
     A          K RRCLAS
     A          K RRCOVL
