     A*  (C) Copyright Progressive Data Solutions Inc., 1996
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CSREFP)
     A                                      CHGINPDFT(CS)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                      SETOF(20)
     A                                      SETOF(21)
     A            SCFILE    R        O  1  3REFFLD(FLE)
     A            SCRECF    R        O  1 71REFFLD(RECF)
     A            SCCARR    R        B  8 47REFFLD(CARR)
     A                                      DSPATR(CS)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  20                                  ERRMSGID(CSM0503 *LIBL/CSMESG)
     A                                 23  2'F3=Exit'
     A                                      COLOR(BLU)
     A                                  8 29'Carrier Number:'
     A                                  2 28'Carrier Master Maintenance'
     A                                  1 32'Claim Scan System'
     A                                      DSPATR(HI)
     A          R SCR02
     A*  90/10/12  08:44:41    LDAPPER     REL-R02M00  5728-PW1
     A                                      CF12
     A N09N40                               CF20
     A  64                                  CF23
     A                                      SETOF(20)
     A            SCFILE    R        O  1  3REFFLD(FLE)
     A            SCRECF    R        O  1 71REFFLD(RECF)
     A            SCMODE    R        O  3 71REFFLD(NM10)
     A                                      TEXT('ADD/UPDATE MODE')
     A                                  5 54'Status:'
     A            SCSTAT    R        O  5 63REFFLD(FLAG)
     A                                      TEXT('Status')
     A                                  7 10'Carrier Number:'
     A            SCCARR    R        O  7 30REFFLD(CARR)
     A                                      TEXT('Carrier Number')
     A                                  9 10'Carrier Name:'
     A            SCNAME    R        B  9 30REFFLD(NAME)
     A                                      TEXT('Carrier Name')
     A N09                                  DSPATR(CS)
     A  09                                  DSPATR(PR)
     A  20                                  ERRMSGID(CSM0503 *LIBL/CSMESG)
     A N09                                  DSPATR(UL)
     A                                 23  2'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 17'F12=Cancel  '
     A                                      COLOR(BLU)
     A                                 23 40'F20=Change status'
     A                                      COLOR(BLU)
     A  09
     AO 40                                  DSPATR(ND)
     A            SCCMDD    R        O 23 68REFFLD(DS10)
     A                                      TEXT('F23=DELETE')
     A                                  2 28'Carrier Master Maintenance'
     A                                  1 32'Claim Scan System'
     A                                      DSPATR(HI)
     A          R SCR99
     A*            11:14:47    TLB         REL-R08M00  5714-UT1
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A          R SCR03
     A*  90/08/23  09:11:05    LDAPPER     REL-R02M00  5728-PW1
