     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   FORMAT DESCRIPTION:                                      **
     A** P & C BILLING SCHEDULE CODE TABLE FILE
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      REF(CREFP)
     A          R PBC01                     TEXT('BILLING CODE FILE')
     A            BCCO#     R               REFFLD(CO#)
     A            BCKEY     R               REFFLD(KEY)
     A            BCDESC    R               REFFLD(DS30)
     A            BCAB01    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  1')
     A            BCAB02    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  2')
     A            BCAB03    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  3')
     A            BCAB04    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  4')
     A            BCAB05    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  5')
     A            BCAB06    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  6')
     A            BCAB07    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  7')
     A            BCAB08    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  8')
     A            BCAB09    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH  9')
     A            BCAB10    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH 10')
     A            BCAB11    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH 11')
     A            BCAB12    R               REFFLD(PC43)
     A                                      COLHDG('ANNUAL BILL' '% MONTH 12')
     A            BCACDB    R               REFFLD(FLAG)
     A                                      COLHDG('ACCOUNT CURRENT' 'DIR BILL')
     A            BCSTAT    R               REFFLD(STAT)
     A            BCUSER    R               REFFLD(USER)
     A            BCPGM     R               REFFLD(PGM)
     A            BCTIME    R               REFFLD(TIME)
     A            BCDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            BCINFE    R               REFFLD(FLAG)
     A                                      COLHDG('INSTALLMENT FEE Y/N?')
     A            BCINCD    R               REFFLD(CODE)
     A                                      COLHDG('A/R TRANSACTION CODE')
     A            BCINAM    R               REFFLD(A72)
     A                                      COLHDG('INSTALLMENT' 'FEE' 'AMOUNT')
