     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   PAYMENT CODE TABLE                                       **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A                                      REF(CREFP)
     A          R PPC01                     TEXT('PAYMENT CODE TABLE')
     A            PCCO#     R               REFFLD(CO#)
     A            PCKEY     R               REFFLD(KEY)
     A            PCDESC    R               REFFLD(DS40)
     A            PCRECD    R               REFFLD(CODE)
     A                                      COLHDG('RESERVE' 'CODE')
     A            PCTRTP    R               REFFLD(FLAG)
     A                                      COLHDG('TRANSACTION' 'TYPE')
     A            PCSTAT    R               REFFLD(STAT)
     A            PCUSER    R               REFFLD(USER)
     A            PCPGM     R               REFFLD(PGM)
     A            PCTIME    R               REFFLD(TIME)
     A            PCDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
