     A          R PVO01                     PFILE(CVOUT)
     A          K @@KEY
     A          K @@SEQ#
     A          K @@OFLR
     A          K @@OID
