     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  71 72 66                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN71","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN72","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"valid comm-
     A                                      and key":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-23"},"items":[{"id":"C-
     A                                      VTCMSICDP_SCR01_avKeys","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"AV_KEYS","dataLength":"1134","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[AV_KEYS]"},"lef-
     A                                      t":"0px","top":"0px","visibility":"-
     A                                      hidden"},{"id":"CVTHCIAF_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"C-
     A                                      VTHCIAF_SCR01_BtnIconMenuSystemTool-
     A                                      s","tool tip":"System Tools","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"CVTHCIAF_SCR01_ButtonBa-
     A                                      r","top":"35px","left":"1036px","wi-
     A                                      dth":"187px","height":"28px","css c-
     A                                      lass":"stationary","visibility":"hi-
     A                                      dden","locked in place":"true"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1040px","id":"CV-
     A                                      THCIAF_SCR01_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"u')
     A                                  1  2HTML('rl(''/profoundui/userdata/ima-
     A                                      ges/systool/save.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1066px","id":"CVTHCIAF-
     A                                      _SCR01_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"CVTHCIAF_SCR01_BtnSear-
     A                                      ch","tool tip":"Search","onclick":"-
     A                                      SystemToolbarSearch","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/search.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1118px","id":"CVTHC-
     A                                      IAF_SCR01_BtnDiaryItems","tool tip"-
     A                                      :"Diary/Work Items - IDARTS","oncli-
     A                                      ck":"SystemToolbarDiary","backgroun-
     A                                      d image":{"fieldName":"DryIcnURL","-
     A                                      dataLength":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1144px","id":"CVTHCIAF-
     A                                      _SCR01_BtnSystemMessages","tool tip-
     A                                      ":"System Messages","onclick":"Syst-
     A                                      emToolbarMessages","background imag-
     A                                      e":{"fieldName":"MsgIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background co')
     A                                  1  2HTML('lor":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"CVTHCIAF_SCR01_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"CVTHCIAF_SCR01-
     A                                      _ImgSysToolBottom","field type":"im-
     A                                      age","image source":"/profoundui/us-
     A                                      erdata/images/systool/butbarbot.png-
     A                                      ","left":"1036px","top":"64px","wid-
     A                                      th":"187px","locked in place":"true-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden"},{"id":"CVTHCIAF_SCR0-
     A                                      1_MainTabPanel","field type":"tab p-
     A                                      anel","tab panel style":"Transform"-
     A                                      ,"tab names":{"fieldName":"SCPRDS",-
     A                                      "designValue":"[SCPRDS]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"CVT-
     A                                      HCIAF_SCR01_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCUSE-
     A                                      R","field type":"output field","val-
     A                                      ue":{"fieldName":"SCUSER","designVa-
     A                                      lue":"[SCUSER]","refField":"USER","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","parent tab pane-
     A                                      l":"CVTHCIAF_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SCCONM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCCONM","designValue":"[-
     A                                      SCCONM]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      14px","cursor column":"21","top":"1-
     A                                      10px","cursor row":"1","css class 2-
     A                                      ":"top-line","css class 3":"HI","de-
     A                                      scription":"COMPANY NAME","parent t-
     A                                      ab panel":"CVTHCIAF_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 4"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant1","field type":"output field","-
     A                                      left":"778px","cursor column":"73",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class":"top-line","v')
     A                                  1  2HTML('alue":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"CVTHCIAF_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"CVTCM-
     A                                      SICDP_SCR01_fkeyMenu","field type":-
     A                                      "menu","left":"10px","top":"120px",-
     A                                      "height":"350px","width":"230px","h-
     A                                      over background color":"#9AAA61","h-
     A                                      over text color":"#FFFFFF","border -
     A                                      color":"#4C6106","menu option inden-
     A                                      t":"10px","background color":"#758B-
     A                                      27","css class":"action-menu","css -
     A                                      class 2":"stationary","z index":"10-
     A                                      1"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"CVTHCIAF-
     A                                      _SCR01_BtnHiddenRefresh","value":"b-
     A                                      tnRefresh","top":"125px","response"-
     A                                      :{"fieldName":"btnRefresh","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant2","field type":"output fiel-
     A                                      d","value":"CVTCMSICDP","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"CVTHCIA-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPRDS","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"130px","curs-
     A                                      or row":"2","css class 2":"HI","des-
     A                                      cription":"PROGRAM NAME","parent ta-
     A                                      b panel":"CVTHCIAF_SCR01_MainTabPan-
     A                                      el","parent tab":"0","visibility":"-
     A                                      hidden","css class 3":"profound-con-
     A                                      verted"},{"id":"constant3","field t-
     A                                      ype":"output field","value":"SCR01"-
     A                                      ,"css class":"constant","left":"799-
     A                                      px","cursor column":"76","top":"130-
     A                                      px","cursor row":"2","parent tab pa-
     A                                      nel":"CVTHCIAF_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"CVTHCIAF_SCR01_BtnHiddenSearc-
     A                                      h","value":"btnSearch","top":"150px-
     A                                      ","response":{"fieldName":"btnSearc-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant9","field type":"-
     A                                      output field","value":"Please place-
     A                                       the ICD - 10 file in the appropria-
     A                                      te folder before processing","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"66","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"335-
     A                                      px","cursor column":"11","top":"200-
     A                                      px","cursor row":"4",')
     A                                  1  2HTML('"parent tab panel":"CVTHCIAF_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"CVTHCIAF_-
     A                                      SCR01_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"CVTHCIAF_SCR01_BtnHidd-
     A                                      enSystemMessages","value":"btnMessa-
     A                                      ge","top":"200px","response":{"fiel-
     A                                      dName":"btnMessage","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      10","field type":"output field","va-
     A                                      lue":"IFS folder    :","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"66","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"375px","c-
     A                                      ursor column":"2","top":"240px","cu-
     A                                      rsor row":"6","parent tab panel":"C-
     A                                      VTHCIAF_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"C-
     A                                      VTHCIAF_SCR01_BtnHiddenWorkSubmitJo-
     A                                      b","value":"btnWrksbmjob","top":"22-
     A                                      5px","response":{"fieldName":"btnWr-
     A                                      kJob","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant11","field typ-
     A                                      e":"output field","value":"CMS file-
     A                                       name :","css class":"constant","vi-
     A                                      sibility":{"fieldName":"66","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"375px","cursor column":-
     A                                      "3","top":"260px","cursor row":"7",-
     A                                      "parent tab panel":"CVTHCIAF_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"CVTHCIAF_SCR01_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant12","field type":"outpu-
     A                                      t field","value":"Remember to load -
     A                                      the CMS ICD 10 file","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "66","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"405px","cur-
     A                                      sor column":"11","top')
     A                                  1  2HTML('":"335px","cursor row":"9","p-
     A                                      arent tab panel":"CVTHCIAF_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"CVTHCIAF_SCR01_Bt-
     A                                      nHiddenImageQueue","value":"btnImgQ-
     A                                      ue","top":"275px","response":{"fiel-
     A                                      dName":"btnImgQue","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"CVTHCIAF_SCR01_BtnHiddenHelp-
     A                                      ","value":"btnHelp","top":"300px","-
     A                                      response":{"fieldName":"btnHelp","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant16","field type":"outp-
     A                                      ut field","value":"Press Enter when-
     A                                       ready","css class":"constant","vis-
     A                                      ibility":{"fieldName":"66","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"440px","cursor column":"-
     A                                      23","top":"385px","cursor row":"15"-
     A                                      ,"parent tab panel":"CVTHCIAF_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"btnSubmit","field type":"butto-
     A                                      n","value":"Enter","shortcut key":"-
     A                                      Enter","left":"14px","top":"150px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF03","field type":"button","value"-
     A                                      :"Exit","shortcut key":"F3","left":-
     A                                      "14px","top":"183px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnHELP","field t-
     A                                      ype":"button","shortcut key":"Alt-F-
     A                                      1","bypass validation":"true","valu-
     A                                      e":"HELP","response":{"fieldName":"-
     A                                      *IN10","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"14px","top":"216px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"SCIF-
     A                                      S","field type":"output field","css-
     A                                       class":"output-field","value":{"fi-
     A                                      eldName":"SCIFS","dataLength":"30",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[SCIFS]"},"lef-
     A                                      t":"490px","top":"240px","parent ta-
     A                                      b panel":"CVTHCIAF_SCR01_MainTabPan-
     A                                      el","parent tab":"0","width":"255px-
     A                                      "},{"id":"SCICD1","field type":"out-
     A                                      put field","css class":"output-fiel-
     A                                      d","value":{"fieldName":"SCICD1","d-
     A                                      ataLength":"30","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill')
     A                                  1  2HTML('":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[SCICD1]"},"l-
     A                                      eft":"490px","top":"260px","parent -
     A                                      tab panel":"CVTHCIAF_SCR01_MainTabP-
     A                                      anel","parent tab":"0","width":"250-
     A                                      px"},{"id":"OutAfterHoursMsg","fiel-
     A                                      d type":"output field","css class":-
     A                                      "output-field","value":"Note that u-
     A                                      sers must be out of the Claims appl-
     A                                      ication when this process is being -
     A                                      run","left":"335px","top":"425px","-
     A                                      color":"#FF0000","font size":"12px"-
     A                                      ,"parent tab panel":"CVTHCIAF_SCR01-
     A                                      _MainTabPanel","parent tab":"0","fo-
     A                                      nt style":"italic"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCICD1        30A  H
     A            SCIFS         30A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR99
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"CVTHCIAF_SCR99_avKeys","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"AV_KEYS","dataLength":"-
     A                                      1134","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[AV_KEYS-
     A                                      ]"},"left":"0px","top":"0px","visib-
     A                                      ility":"hidden"},{"id":"CVTHCIAF_SC-
     A                                      R99_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"CVTHCIAF_SCR99_BtnIconMenuSy-
     A                                      stemTools","tool tip":"System Tools-
     A                                      ","icon source":"/profoundui/userda-
     A                                      ta/images/systool/systools.png","da-
     A                                      ta function":"SystemToolbarSystools-
     A                                      ","show down arrow":"Yes"},{"field -
     A                                      type":"panel","panel style":"Transf-
     A                                      ormButtonBar","id":"CVTHCIAF_SCR99_-
     A                                      ButtonBar","top":"35px","left":"103-
     A                                      6px","width":"187px","height":"28px-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1040px",-
     A                                      "id":"CVTHCIAF_SCR99_BtnSave","tool-
     A                                       tip":"Save","onclick":"SystemToolb-
     A                                      arSave","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      save.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left sty')
     A                                  1  2HTML('le":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1066px","id":"-
     A                                      CVTHCIAF_SCR99_BtnRefresh","tool ti-
     A                                      p":"Refresh","onclick":"SystemToolb-
     A                                      arRefresh","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/refresh.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1092px","id":"CVTHCIAF_SCR99-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"CVTHCIAF_SCR99_BtnDiaryItems","t-
     A                                      ool tip":"Diary/Work Items - IDARTS-
     A                                      ","onclick":"SystemToolbarDiary","b-
     A                                      ackground image":{"fieldName":"DryI-
     A                                      cnURL","dataLength":"128","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"}},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1144px","id":"-
     A                                      CVTHCIAF_SCR99_BtnSystemMessages","-
     A                                      tool tip":"System Messages","onclic-
     A                                      k":"SystemToolbarMessages","backgro-
     A                                      und image":{"fieldName":"MsgIcnURL"-
     A                                      ,"dataLength":"128","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"}},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1196px","id":"CVTHCI-
     A                                      AF_SCR99_BtnHelp","tool tip":"Help"-
     A                                      ,"onclick":"SystemToo')
     A                                  1  2HTML('lbarHelp","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/help.png'')"},{"id":"CVTHCI-
     A                                      AF_SCR99_ImgSysToolBottom","field t-
     A                                      ype":"image","image source":"/profo-
     A                                      undui/userdata/images/systool/butba-
     A                                      rbot.png","left":"1036px","top":"64-
     A                                      px","width":"187px","locked in plac-
     A                                      e":"true","css class":"stationary",-
     A                                      "visibility":"hidden"},{"id":"CVTHC-
     A                                      IAF_SCR99_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":"Tab 1","activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"CVTHCIAF_SCR99_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"CVTHCIAF_SCR99_fkeyMenu","-
     A                                      field type":"menu","left":"10px","t-
     A                                      op":"120px","height":"350px","width-
     A                                      ":"230px","hover background color":-
     A                                      "#9AAA61","hover text color":"#FFFF-
     A                                      FF","border color":"#4C6106","menu -
     A                                      option indent":"10px","background c-
     A                                      olor":"#758B27","css class":"action-
     A                                      -menu","css class 2":"stationary","-
     A                                      z index":"101"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"CVTHCIAF_SCR99_BtnHiddenRefresh-
     A                                      ","value":"btnRefresh","top":"125px-
     A                                      ","response":{"fieldName":"btnRefre-
     A                                      sh","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCERR","field type":"pas-
     A                                      sword field","css class":"input","c-
     A                                      ss class 2":"textbox","input only":-
     A                                      "true","value":{"fieldName":"SCERR"-
     A                                      ,"designValue":"[SCERR]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"288px","cursor-
     A                                       column":"3","top":"150px","cursor -
     A                                      row":"3","width":"8px","read only":-
     A                                      "true","css class 3":"PR-UL","paren-
     A                                      t tab panel":"CVTHCIAF_SCR99_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"CVTHCIAF_SCR99_BtnHid-
     A                                      denSearch","value":"btnSearch","top-
     A                                      ":"150px","response":{"fieldName":"-
     A                                      btnSearch","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field ty')
     A                                  1  2HTML('pe":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"CVTHCIAF_SCR99_B-
     A                                      tnHiddenDiaryItems","value":"btnDia-
     A                                      ry","top":"175px","response":{"fiel-
     A                                      dName":"btnDiary","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"CVTHCIAF_SCR99_BtnHiddenSyste-
     A                                      mMessages","value":"btnMessage","to-
     A                                      p":"200px","response":{"fieldName":-
     A                                      "btnMessage","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "CVTHCIAF_SCR99_BtnHiddenWorkSubmit-
     A                                      Job","value":"btnWrksbmjob","top":"-
     A                                      225px","response":{"fieldName":"btn-
     A                                      WrkJob","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"CVTH-
     A                                      CIAF_SCR99_BtnHiddenWorkPrinterOutp-
     A                                      ut","value":"btnWrkprtout","top":"2-
     A                                      50px","response":{"fieldName":"btnW-
     A                                      rkPrnt","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"CVTH-
     A                                      CIAF_SCR99_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"CVTHCIAF_SCR99_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","value":"Exit","shortcut key"-
     A                                      :"F3","left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnH-
     A                                      ELP","field type":"button","shortcu-
     A                                      t key":"Alt-F1","bypa')
     A                                  1  2HTML('ss validation":"true","value"-
     A                                      :"HELP","response":{"fieldName":"*I-
     A                                      N10","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"14px","top":"216px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
