     A****************************************************************
     A** (C) COPYRIGHT INSURANCE INFORMATION SYSTEMS INC., 1996     **
     A****************************************************************
     A**   ISO WORK FILE FOR BURGLARY AND THEFT                     **
     A**                                                            **
     A****************************************************************
     A** REVISIONS:                                                 **
     A**  11/18/96 *** C:107 *** V2000 ***                          **
     A**           1. Version 2 format changes.                     **
     A****************************************************************
     A**
     A          R PDT01                     TEXT('WORKFILE FOR BT SECTION')
     A            DTDATA       150          TEXT('DATA - 150A')
