     A*=========================================================================
     A* (c)Copyright - Progressive Data Solutions, Inc., 2000
     A*=========================================================================
     A* DAREXPP - Ascent Captured Data for document type NDPPOL
     A*=========================================================================
     A* Created   : 07/28/00
     A* Programmer: C:113
     A* Project   : DR113
     A*
     A*=========================================================================
     A* Revisions:
     A*
     A*
     A* (NOTE: Please add comments to the top of revisions.)
     A*=========================================================================

     A          R PA801                     TEXT('NDPPOL CAPTURED DATA')
     A            IMDTYP         8          COLHDG('DOCUMENT TYPE')
     A            IMDCID        12          COLHDG('DOCUMENT ID')
     A            IMDFS         10          COLHDG('FILE SYSTEM - QDLS')
     A            IMDDIR        80          COLHDG('DOCUMENT PATH')
     A            IMSDAT         8P 0       COLHDG('SCAN DATE')
     A            IMSTIM         6P 0       COLHDG('SCAN TIME')
     A            IMSUSR        10          COLHDG('SCAN USER')
     A            IMDKEY        40          COLHDG('DARTS KEY')
     A            IMSTAT         1          COLHDG('STATUS')
     A            A8BFCD         3          COLHDG('INSURANCE COMPANY ID')
     A            A8AWS0         1          COLHDG('EXTRACT STS')
     A            A8B4CH        11          COLHDG('REFERENCE ID')
     A            A8B5CH        11          COLHDG('POLICY ID  FILE')
     A            A8TYPP         1          COLHDG('TYPE OF POLICY')
     A            A8COVL         2P 0       COLHDG('COVERED LIVES')
     A            A8POLL         1          COLHDG('POLICY LANGUAGE')
     A            A8CENA         4          COLHDG('NAME PREFIX')
     A            A8CBNA        20          COLHDG('FIRST NAME')
     A            A8CCNA        20          COLHDG('MIDDLE NAME ')
     A            A8B9NA        30          COLHDG('LAST NAME')
     A            A8ACDX         8P 0       COLHDG('BIRTH DATE')
     A            A8B5NA        29          COLHDG('CITY OF BIRTH')
     A            A8DCST         1          COLHDG('MALE')
     A            A8DCS1         1          COLHDG('FEMALE')
     A            A8EYTX        11          COLHDG('INSURED TAX ID')
     A            A8CDCD         1          COLHDG('SMOKER')
     A            A8CDC1         1          COLHDG('NON-SMOKER')
     A            A8B2NA        30          COLHDG('ADDRESS LINE 1')
     A            A8B3NA        30          COLHDG('ADDRESS LINE 2')
     A            A8COCD         2          COLHDG('STATE/PROVINCE ID')
     A            A8CPCD         2          COLHDG('COUNTRY ID')
     A            A8EXTX        10          COLHDG('INSURED ZIP')
     A            A8HECD        31          COLHDG('PHONE NUMBER')
     A            A8K1CD         4          COLHDG('PHONE EXTENSION')
     A            A8TEAI         8P 0       COLHDG('TOTAL EARNED' 'ANNUAL INC')
     A            A8TNW          8P 0       COLHDG('TOTAL NET WORTH')
     A            A8IEMP        40          COLHDG('INS EMPLOYER')
     A            A8IOCC        40          COLHDG('INS OCCUPATION')
     A            A8UEND         4          COLHDG('OWNER PREFIX')
     A            A8UBND        20          COLHDG('OWNER FIRST NME')
     A            A8UCND        20          COLHDG('OWNER MIDDLE NME')
     A            A8UDND        30          COLHDG('OWNER LAST NME')
     A            A8UZND        40          COLHDG('OWNER COMPANY NME')
     A            A8BOCH         3          COLHDG('OWNER RELATION CDE')
     A            A8UWND        30          COLHDG('OWNER RELAT DESC')
     A            A8R1DA         8P 0       COLHDG('OWNER BIRTH DTE')
     A            A8UJND        29          COLHDG('OWNER BIRTH PLACE')
     A            A8Z4SN         1          COLHDG('OWNER MALE')
     A            A8Z4S1         1          COLHDG('OWNER FEMALE')
     A            A8OSM1         1          COLHDG('OWNER SMOKER')
     A            A8OSM2         1          COLHDG('OWNER NON-SMOKER')
     A            A8DRNH        11          COLHDG('OWNER TAX ID')
     A            A8UFND        30          COLHDG('OWNER ADDRESS LN 1')
     A            A8UGND        30          COLHDG('OWNER ADDRESS LN 2')
     A            A8UIND        29          COLHDG('OWNER CITY NME')
     A            A8BMCH         2          COLHDG('OWNER STATE/PROV')
     A            A8BNCH         2          COLHDG('OWNER COUNTRY')
     A            A8DPNH        10          COLHDG('OWNER ZIP')
     A            A8BQCH        31          COLHDG('OWNER RES PHONE')
     A            A8BRCH         4          COLHDG('OWNER RES PHONE EX')
     A            A8BSCH        31          COLHDG('OWNER BUS PHONE')
     A            A8BTCH         4          COLHDG('OWNER BUS PHONE EX')
     A            A8UKND        30          COLHDG('BENEF NAME 1')
     A            A8UMND        30          COLHDG('BENEF NAME 2')
     A            A8ULND        30          COLHDG('BENEF NAME 3')
     A            A8Z9SN         1          COLHDG('PRIMARY BFC IND 2')
     A            A8AAS0         1          COLHDG('PRIMARY BFC IND 3')
     A            A8BUCH         3          COLHDG('BENEF RELATION CD1')
     A            A8BVCH         3          COLHDG('BENEF RELATION CD2')
     A            A8BWCH         3          COLHDG('BENEF RELATION CD3')
     A            A8UTND        30          COLHDG('BENEF REL DESCR 1')
     A            A8UUND        30          COLHDG('BENEF REL DESCR 2')
     A            A8UVND        30          COLHDG('BENEF REL DESCR 3')
     A            A8E6PC         7P 4       COLHDG('BENEFICIARY PCT 1')
     A            A8E7PC         7P 4       COLHDG('BENEFICIARY PCT 2')
     A            A8E8PC         7P 4       COLHDG('BENEFICIARY PCT 3')
     A            A8Z5SN         1          COLHDG('BENEFICIARY TYPE 1')
     A            A8Z6SN         1          COLHDG('BENEFICIARY TYPE 2')
     A            A8Z7SN         1          COLHDG('BENEFICIARY TYPE 3')
     A            A8BXCH        11          COLHDG('BASE MNEMONIC PLAN')
     A            A8AFS0         3          COLHDG('BASE BENEFIT TYP')
     A            A8S8VE        15P 4       COLHDG('BASE UNITS')
     A            A8R2DA         8P 0       COLHDG('ISSUE DATE')
     A            A8LVST         1          COLHDG('DIVIDEND OPTION')
     A            A8XZST         1          COLHDG('DIVIDEND OPT 2')
     A            A8BYCH        11          COLHDG('RIDER MNEMONIC 1')
     A            A8AGS0         3          COLHDG('RIDER 1 BEN TYP')
     A            A8S9VE        15P 4       COLHDG('RIDER UNITS 1')
     A            A8BZCH        11          COLHDG('RIDER MNEMONIC 2')
     A            A8AHS0         3          COLHDG('RIDER 2 BEN TYP')
     A            A8TAVE        15P 4       COLHDG('RIDER UNITS 2')
     A            A8B0CH        11          COLHDG('RIDER MNEMONIC 3')
     A            A8AIS0         3          COLHDG('RIDER 3 BEN TYP')
     A            A8TBVE        15P 4       COLHDG('RIDER UNITS 3')
     A            A8TDVE         9P 2       COLHDG('PLANNED PREMIUM')
     A            A8TCVE         9P 2       COLHDG('CWA AMOUNT')
     A            A8TEVE         9P 2       COLHDG('LUMP SUM')
     A            A8AXSS         1          COLHDG('FREQUENCY RULE')
     A            A8ABS0         1          COLHDG('BILLING METHOD')
     A            A8AVS0         1          COLHDG('BILLING MTHSEQ')
     A            A8ACS0         1          COLHDG('NFO OPT')
     A            A8ADS0         1          COLHDG('APL IND')
     A            A8AES0         1          COLHDG('DB OPT')
     A            A8CCCH         6          COLHDG('UNDERWRITING' 'REQUIREMENT')
     A            A8ORND        78          COLHDG('EMAIL ADDRESS')
     A            A8CDCH        12          COLHDG('DOCUMENT ID')
     A            A8U0ND        20          COLHDG('AGENT FIRST NME1')
     A            A8U1ND        20          COLHDG('AGENT MIDDLE NME1')
     A            A8U2ND        30          COLHDG('AGENT LAST NME1')
     A            A8E9PC         7P 4       COLHDG('AGENT % SHARE')
     A            A8B1CH        11          COLHDG('AGENT ID')
