     A*************************************************************************
      * (C) 2020 Sapiens International. All Rights Reserved.               *
     A*************************************************************************
     A*  DTTFRRCPMT - iDarts Tranfer by Remark Code Prompt                    *
     A*                                                                       *
     A*************************************************************************
     A*  Created on 01/14/2020 by C:180 for Project 129WVT                    *
     A*************************************************************************
     A* Revisions:                                                          *
     A*                                                                       *
     A*************************************************************************
     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDDRTRMK1
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdDrtRmk1","onload":"         -
     A                                                         ","description":-
     A                                      "Darts Remark Transfer - Prompt","o-
     A                                      verlay":"true","assume":"true","des-
     A                                      ign overlay formats":"RcdDrtRmk2"},-
     A                                      "items":[{"id":"HdgDartsExtract","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"heading","value":"Darts Remark -
     A                                      Transfer","left":"250px","top":"10p-
     A                                      x","description":"Darts Image/Notes-
     A                                       Extract - Prompt","z index":"11","-
     A                                      width":"195px","heading type":"Page-
     A                                       Title"},{"id":"TabDartsRmk","field-
     A                                       type":"tab panel","css class":"tab-
     A                                      -panel","left":"250px","top":"65px"-
     A                                      ,"width":"970px","height":"610px","-
     A                                      tab names":"Selection Criteria","z -
     A                                      index":"0","tab panel style":"CompS-
     A                                      uite Tab Panel","active tab":{"fiel-
     A                                      dName":"TabIndex","dataLength":"5",-
     A                                      "decPos":"0","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","units":"","negN-
     A                                      um":"-999.00"},"ontabclick":"pui.cl-
     A                                      ick(\"BtnTabClick\")"}]}')
     A            TABINDEX       5S 0H
     A          R RCDDRTRMK2
     A                                  1  2HTML('QPUIREC5    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 RERRMSGID  5    C17   -
     A                                      TxtFromRemarkCodeFMSFROMRMK FERMSGF-
     A                                      ILE C5    *LIBLC0    FERFROMRMK RER-
     A                                      RMSGID  5    C15   TxtToRemarkCodeF-
     A                                      MSTORMK   FERMSGFILE C5    *LIBLC0 -
     A                                         FERTORMK   ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdDrtRmk2","overlay":"true","e-
     A                                      xternal css":"label","onload":"docu-
     A                                      ment.body.style.background = \"#EBF-
     A                                      5FF\"; fillDetailBox(''sflPayValue'-
     A                                      ',1,''OutPayRRN#'', ''WPICLMPV01'')-
     A                                      ;       fillDetailBox(''sflPayValue-
     A                                      Edi'',1,''OutPayRRN#E'', ''WPICLMPV-
     A                                      01'');                             -
     A                                           ","description":"Darts Remark -
     A                                      Transfer  Prompt 2","assume":"true"-
     A                                      ,"overlay range":"1-1","design over-
     A                                      lay formats":"RcdDrtRmk1","header t-
     A                                      ext align":"Left,Right","csv file n-
     A                                      ame":"Payment Value 1 Codes","selec-
     A                                      tion value":"A"},"items":[{"id":"Lb-
     A                                      lFromRemarkCode","field type":"outp-
     A                                      ut field","css class":"label","valu-
     A                                      e":"From remark code","left":"260px-
     A                                      ","top":"140px","width":"110px"},{"-
     A                                      id":"ImgRequired1","field type":"im-
     A                                      age","css class":"image","left":"37-
     A                                      0px","top":"135px","height":"8px","-
     A                                      width":"8px","image source":"/profo-
     A                                      undui/userdata/images/asterisk_oran-
     A                                      ge_small.png","css class 2":"requir-
     A                                      ed-icon"},{"id":"BtnCancel","field -
     A                                      type":"button","css class":"button"-
     A                                      ,"value":"Cancel","left":"660px","t-
     A                                      op":"525px","width":"100px","cursor-
     A                                      ":"default","description":"Cancel B-
     A                                      utton","response":{"fieldName":"Btn-
     A                                      Cancel","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"shortcut key":"F3","visibilit-
     A                                      y":"visible"},{"id":"BtnSubmit","fi-
     A                                      eld type":"button","css class":"but-
     A                                      ton","cursor":"default","descriptio-
     A                                      n":"Submit button","value":"Submit"-
     A                                      ,"response":{"fieldName":"BtnSubmit-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      shortcut key":"Enter","left":"770px-
     A                                      ","top":"525px","width":"100px","vi-
     A                                      sibility":"visible"},{"id":"TxtFrom-
     A                                      RemarkCode","field type":"textbox",-
     A                                      "css class":"input","value":{"field-
     A                                      Name":"scFromRmk","dataLength":"5",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scFromRmk]"},-
     A                                      "text transform":"uppercase","error-
     A                                       messages":"1 message","choices dat-
     A                                      abase file":"STCTL","choice options-
     A                                       field":"TRIM(CTRMCD) || '' - '' ||-
     A                                       CTDESC","choice values field":"CTR-
     A                                      MCD","contains match":"true","left"-
     A                                      :"260px","top":"155px","width":"250-
     A                                      px","css class 2":"Textbox","error -
     A                                      message id":{"fieldName":"msFromRmk-
     A                                      ","dataLength":"10","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"},"error m-
     A                                      essage file":{"fieldName":"ermsgFil-
     A                                      e","dataLength":"10","trimLeading":-
     A                                      "false","trimTrailing')
     A                                  1  2HTML('":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"},"error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"erFromRmk","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                      ":"0"},{"id":"LblToRemarkCode","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"label","value":"To remark code","-
     A                                      left":"260px","top":"195px","width"-
     A                                      :"95px"},{"id":"ImgRequired1_copy",-
     A                                      "field type":"image","css class":"i-
     A                                      mage","image source":"/profoundui/u-
     A                                      serdata/images/asterisk_orange_smal-
     A                                      l.png","left":"355px","top":"190px"-
     A                                      ,"height":"8px","width":"8px","css -
     A                                      class 2":"required-icon"},{"id":"Tx-
     A                                      tToRemarkCode","field type":"textbo-
     A                                      x","css class":"input","value":{"fi-
     A                                      eldName":"scToRmk","dataLength":"5"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scToRmk]"},"-
     A                                      text transform":"uppercase","error -
     A                                      messages":"1 message","choices data-
     A                                      base file":"STCTL","choice options -
     A                                      field":"TRIM(CTRMCD) || '' - '' || -
     A                                      CTDESC","choice values field":"CTRM-
     A                                      CD","contains match":"true","left":-
     A                                      "260px","top":"210px","width":"250p-
     A                                      x","css class 2":"Textbox","error m-
     A                                      essage id":{"fieldName":"msToRmk","-
     A                                      dataLength":"10","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"},"error mess-
     A                                      age file":{"fieldName":"ermsgFile",-
     A                                      "dataLength":"10","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"erToRmk","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error enh-
     A                                      anced mode":"0"}]}')
     A            BTNCANCEL      1A  H
     A            BTNSUBMIT      1A  H
     A            ERFROMRMK      1A  H
     A            ERMSGFILE     10A  H
     A            ERTORMK        1A  H
     A            MSFROMRMK     10A  H
     A            MSTORMK       10A  H
     A            SCFROMRMK      5A  H
     A            SCTORMK        5A  H
