     A* (c) Copyright Progressive Data Systems, Inc., 2005
     A*****************************************************************
     A* WORKERS' COMP File Edit Errors                 P:SY058   C:58
     A*****************************************************************
     A* REVISIONS:
     A                                      REF(WREFP)
     A          R EER01                     TEXT('WC FILE EDIT ERRORS')
     A            EEKEY         40A         COLHDG('Entity/account KEY')
     A            EEFLD     R               REFFLD(NM10)
     A                                      COLHDG('File field')
     A            EEFLIB    R               REFFLD(NM10)
     A                                      COLHDG('File library')
     A            EEFILE    R               REFFLD(NM10)
     A                                      COLHDG('File name')
     A            EECODE    R               REFFLD(A30)
     A                                      COLHDG('Error code')
     A            EEDATA    R               REFFLD(DS60)
     A                                      COLHDG('Error data')
     A            EETYPE    R               REFFLD(FLAG)
     A                                      COLHDG('Error type')
     A*   Error types:
     A*                   M = missing: blank, zero, or null
     A*                   F = data format error
     A*                   I = invalid - by logic, range
     A*                   D = invalid - not a valid date
     A*                   T = invalid - by table value
     A*                   R = relationship error
     A*                   U = unreasonable value
     A*
     A*
     A            EESTAT    R               REFFLD(STAT)
     A                                      COLHDG('Record status')
     A*
     A*      ID fields from Erroneous record
     A            ERIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            ERIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            ERIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            ERITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            ERUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINT' 'USER')
     A            ERPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINT' 'PROGRAM')
     A            ERDT      R               REFFLD(DT)
     A                                      COLHDG('MAINT' 'DATE')
     A            ERTIME    R               REFFLD(TIME)
     A                                      COLHDG('MAINT' 'TIME')
     A*-------------------------------------------------------------------
     A*   Audit trail
     A            EEIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            EEIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            EEIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            EEITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            EEUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINT' 'USER')
     A            EEPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINT' 'PROGRAM')
     A            EEDT      R               REFFLD(DT)
     A                                      COLHDG('MAINT' 'DATE')
     A            EETIME    R               REFFLD(TIME)
     A                                      COLHDG('MAINT' 'TIME')
