     A*  (C) Copyright Progressive Data Systems, Inc., 1990
     A*
     A** EMP EXP MOD WEIGHTING AND BALLAST VALUE MASTER FILE
     A*
     A          R PWB01                     PFILE(EMWBP)
     A          K WBCO#
     A          K WBLOSS
