     A*  (C) Copyright Progressive Data Systems, Inc., 1991
     A**
     A** EMP EXPERIENCE MOD WEIGHTING and BALLAST VALUE MASTER FILE
     A                                      REF(EREFP)
     A          R PWB01                     TEXT('WEIGHTING & BALLAST VALUES')
     A            WBCO#     R               REFFLD(CO#)
     A            WBLOSS    R               REFFLD(CNT)
     A                                      COLHDG('EXP LOSS AMT 7/0')
     A            WBWEIG    R               REFFLD(AP3)
     A                                      COLHDG('WEIGHTING VALUE' '3/0')
     A            WBBALL    R               REFFLD(CLAS)
     A                                      COLHDG('BALLAST VALUE' '5/0')
     A            WBSTAT    R               REFFLD(STAT)
     A                                      COLHDG('STATUS')
     A            WBUSER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            WBPGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            WBTIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME' 'MAINTAINED')
     A            WBDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            WBIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            WBIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
