     A*  (C) Copyright Progressive Data Solutions, Inc., 2003         *
     A*                                                               *
     A*  EXP2P - EXPOSURE RATE FILE                                   *
     A*****************************************************************
     A*  Descriptions:                                                *
     A*                                                               *
     A*  Created: 08/01/03       Programmer: 087                      *
     A*****************************************************************
     A*  Revisions:                                                   *
     A*  09/29/11 c:65  PROJECT: FQ127                                *
     A*                 ADD PAYROLL TYPE FIELD                        *
     A*                                                               *
     A*****************************************************************
     A
     A          R PP201                     TEXT('Exposure Rate')
     A
     A            P2CLAS        10
     A            P2ST           2
     A            P2HAZ          1
     A            P2STD          1
     A            P2EXFL         1
     A            P2RTCL         5
     A            P2EFDT        10
     A            P2TYPE        16
     A            P2MINP        15
     A            P2TERR         5
     A            P2RATE        10
     A            P2PCF          1

     A          K P2CLAS
     A          K P2ST
     A          K P2HAZ
     A          K P2STD
     A          K P2EFDT
