     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  09                                  CA01
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-24"},"items":[{"-
     A                                      id":"F0041F_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"F0041F_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"F-
     A                                      0041F_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon al-
     A                                      ignment":"middle left","icon width"-
     A                                      :"16px","icon height":"24px","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"F0041F_SCR01_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"F004-
     A                                      1F_SCR01_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"F0041F_SCR01_BtnRefresh","tool t-
     A                                      ip":"Refresh","onclick":"SystemTool-
     A                                      barRefresh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"F0041F_SCR01_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"F0041F_SCR01_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"F00-
     A                                      41F_SCR01_BtnSystemMessages","tool -
     A                                      tip":"System Messages","onclick":"S-
     A                                      ystemToolbarMessages","background i-
     A                                      mage":{"fieldName":"MsgIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":')
     A                                  1  4HTML('"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1196px","i-
     A                                      d":"F0041F_SCR01_BtnHelp","tool tip-
     A                                      ":"Help","onclick":"SystemToolbarHe-
     A                                      lp","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/help-
     A                                      .png'')"},{"id":"F0041F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"F0041F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"active tab":"0","left":"250-
     A                                      px","top":"70px","width":"970px","h-
     A                                      eight":"657px","z index":"8","locke-
     A                                      d in place":"true","css class":"tab-
     A                                      -panel","css class 2":"stationary"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0041F_SCR0-
     A                                      1_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCUSER","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCUSER","designValue":"[SCU-
     A                                      SER]","refField":"USER","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"110px-
     A                                      ","cursor row":"1","css class 2":"t-
     A                                      op-line","parent tab panel":"F0041F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCCONM","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCONM","designValue":"[SCCONM]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"414px","curso-
     A                                      r column":"21","top":"110px","curso-
     A                                      r row":"1","css class 2":"top-line"-
     A                                      ,"css class 3":"HI","description":"-
     A                                      COMPANY NAME","parent tab panel":"F-
     A                                      0041F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"constant1","field t-
     A                                      ype":"output field","left":"778px",-
     A                                      "cursor column":"73","top":"110px",-
     A                                      "cursor row":"1","css class":"top-l-
     A                                      ine","value":"js: currentDate()","c-
     A                                      ss class 2":"output-field","parent -
     A                                      tab panel":"F0041F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"F0041F-
     A                                      _SCR01_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0041F_SCR01_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      2","field type":"output field","val-
     A                                      ue":"F0041F","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"F0041F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","description":"PR-
     A                                      OGRAM NAME","parent tab panel":"F00-
     A                                      41F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","visibility":"hidden","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant3","field type":"output fi-
     A                                      eld","value":"SCR01","css class":"c-
     A                                      onstant","left":"799px","cursor col-
     A                                      umn":"76","top":"130px","cursor row-
     A                                      ":"2","parent tab panel":"F0041F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCMODE","field type":"outpu-
     A                                      t field","value":{"fieldNa')
     A                                  1  5HTML('me":"SCMODE","designValue":"[-
     A                                      SCMODE]","refField":"NM10","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"7-
     A                                      64px","cursor column":"71","top":"1-
     A                                      50px","cursor row":"3","css class 2-
     A                                      ":"HI","description":"ADD/UPDATE MO-
     A                                      DE","parent tab panel":"F0041F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0041F_SCR01_-
     A                                      BtnHiddenSearch","value":"btnSearch-
     A                                      ","top":"150px","response":{"fieldN-
     A                                      ame":"btnSearch","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant4",-
     A                                      "field type":"output field","value"-
     A                                      :"Provider               :","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"170px","curs-
     A                                      or row":"4","parent tab panel":"F00-
     A                                      41F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCFEIN","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCFEIN","designValue":"[SCFEIN]",-
     A                                      "refField":"FEIN","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"true","curSym":"","units":"-
     A                                      ","negNum":"-999.00"},"css class":"-
     A                                      output-field","left":"456px","curso-
     A                                      r column":"27","top":"170px","curso-
     A                                      r row":"4","width":"63px","text ali-
     A                                      gn":"right","parent tab panel":"F00-
     A                                      41F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCMOD","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCMOD","designValue":"[SCMOD]","re-
     A                                      fField":"MOD","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00"},"css class":"outp-
     A                                      ut-field","left":"526px","cursor co-
     A                                      lumn":"37","top":"170px","cursor ro-
     A                                      w":"4","width":"21px","text align":-
     A                                      "right","parent tab panel":"F0041F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCNAME","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      NAME","designValue":"[SCNAME]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"554px","cursor-
     A                                       column":"41","top":"170px","cursor-
     A                                       row":"4","parent tab panel":"F0041-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0041F_-
     A                                      SCR01_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0041F_SCR01_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant20-
     A                                      ","field type":"output field","valu-
     A                                      e":"Type information, press Enter."-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"210p-
     A                                      x","cursor row":"6","css class 2":"-
     A                                      BLU","parent tab panel":"F0041F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0041F_SCR01-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant5","field type":"output fie-
     A                                      ld","value":"Group name (if diff) :-
     A                                      ","css class":"constant","left":"29-
     A                                      5px","cursor column":"4","top":"230-
     A                                      px","cursor row":"7","parent tab pa-
     A                                      nel":"F0041F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCGPN2","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCGPN2","designValue-
     A                                      ":"[SCGPN2]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"456px","cursor column":"27-
     A                                      ","top":"230px","cursor row":"7","w-
     A                                      idth":"281px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customT')
     A                                  1  6HTML('rue":"HI","customFalse":""},"-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"parent tab panel":"F00-
     A                                      41F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant6","field typ-
     A                                      e":"output field","value":"Comments-
     A                                                   :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"250px","cursor row":"8",-
     A                                      "parent tab panel":"F0041F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCCOM3","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCCOM3-
     A                                      ","designValue":"[SCCOM3]","refFiel-
     A                                      d":"DS50","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"456px","curs-
     A                                      or column":"27","top":"250px","curs-
     A                                      or row":"8","width":"351px","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"parent tab panel":"F004-
     A                                      1F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0041F-
     A                                      _SCR01_BtnHiddenWorkPrinterOutput",-
     A                                      "value":"btnWrkprtout","top":"250px-
     A                                      ","response":{"fieldName":"btnWrkPr-
     A                                      nt","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0041F_S-
     A                                      CR01_BtnHiddenImageQueue","value":"-
     A                                      btnImgQue","top":"275px","response"-
     A                                      :{"fieldName":"btnImgQue","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant7","field type":"output field-
     A                                      ","value":"Beds","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"290px","cursor row":"10-
     A                                      ","css class 2":"UL","parent tab pa-
     A                                      nel":"F0041F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F0041F_SCR01_BtnHiddenHelp","va-
     A                                      lue":"btnHelp","top":"300px","respo-
     A                                      nse":{"fieldName":"btnHelp","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant8","field type":"output fie-
     A                                      ld","value":"Intensive care unit:",-
     A                                      "css class":"constant","left":"309p-
     A                                      x","cursor column":"6","top":"310px-
     A                                      ","cursor row":"11","parent tab pan-
     A                                      el":"F0041F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCICUB","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCICUB","designValue"-
     A                                      :"[SCICUB]","refField":"A30","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00","n-
     A                                      umBlankFill":"true"},"left":"456px"-
     A                                      ,"cursor column":"27","top":"310px"-
     A                                      ,"cursor row":"11","width":"22px","-
     A                                      text align":"right","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"parent tab panel":"F0041F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      id":"constant9","field type":"outpu-
     A                                      t field","value":"Cardiac ')
     A                                  1  7HTML('care unit  :","css class":"co-
     A                                      nstant","left":"309px","cursor colu-
     A                                      mn":"6","top":"330px","cursor row":-
     A                                      "12","parent tab panel":"F0041F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCCCUB","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CCCUB","designValue":"[SCCCUB]","re-
     A                                      fField":"A30","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00","numBlankFill":"t-
     A                                      rue"},"left":"456px","cursor column-
     A                                      ":"27","top":"330px","cursor row":"-
     A                                      12","width":"22px","text align":"ri-
     A                                      ght","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"parent tab -
     A                                      panel":"F0041F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted"},{"id":"constant10-
     A                                      ","field type":"output field","valu-
     A                                      e":"PCU                :","css clas-
     A                                      s":"constant","left":"309px","curso-
     A                                      r column":"6","top":"350px","cursor-
     A                                       row":"13","parent tab panel":"F004-
     A                                      1F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCPCUB","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCPCUB","designValue":"[SCPCUB-
     A                                      ]","refField":"A30","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","numBlankFi-
     A                                      ll":"true"},"left":"456px","cursor -
     A                                      column":"27","top":"350px","cursor -
     A                                      row":"13","width":"22px","text alig-
     A                                      n":"right","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"paren-
     A                                      t tab panel":"F0041F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant11","field type":"output field"-
     A                                      ,"value":"MLS                :","cs-
     A                                      s class":"constant","left":"309px",-
     A                                      "cursor column":"6","top":"370px","-
     A                                      cursor row":"14","parent tab panel"-
     A                                      :"F0041F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCMLSB","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCMLSB","designValue":"[-
     A                                      SCMLSB]","refField":"A30","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","numB-
     A                                      lankFill":"true"},"left":"456px","c-
     A                                      ursor column":"27","top":"370px","c-
     A                                      ursor row":"14","width":"22px","tex-
     A                                      t align":"right","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "parent tab panel":"F0041F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant12","field type":"output -
     A                                      field","value":"Ortho              -
     A                                      :","css class":"constant","left":"3-
     A                                      09px","cursor column":"6","top":"39-
     A                                      0px","cursor row":"15","parent tab -
     A                                      panel":"F0041F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCORTB","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCORTB","designVal-
     A                                      ue":"[SCORTB]","refField":"A30","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum"')
     A                                  1  8HTML(':"999.00","numBlankFill":"tru-
     A                                      e"},"left":"456px","cursor column":-
     A                                      "27","top":"390px","cursor row":"15-
     A                                      ","width":"22px","text align":"righ-
     A                                      t","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"parent tab pa-
     A                                      nel":"F0041F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant13",-
     A                                      "field type":"output field","value"-
     A                                      :"Ped                :","css class"-
     A                                      :"constant","left":"309px","cursor -
     A                                      column":"6","top":"410px","cursor r-
     A                                      ow":"16","parent tab panel":"F0041F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPEDB","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPEDB","designValue":"[SCPEDB]"-
     A                                      ,"refField":"A30","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00","numBlankFill-
     A                                      ":"true"},"left":"456px","cursor co-
     A                                      lumn":"27","top":"410px","cursor ro-
     A                                      w":"16","width":"22px","text align"-
     A                                      :"right","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"parent -
     A                                      tab panel":"F0041F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt14","field type":"output field","-
     A                                      value":"Ob                 :","css -
     A                                      class":"constant","left":"309px","c-
     A                                      ursor column":"6","top":"430px","cu-
     A                                      rsor row":"17","parent tab panel":"-
     A                                      F0041F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCOBB","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCOBB","designValue":"[SCOB-
     A                                      B]","refField":"A30","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00","numBlankF-
     A                                      ill":"true"},"left":"456px","cursor-
     A                                       column":"27","top":"430px","cursor-
     A                                       row":"17","width":"22px","text ali-
     A                                      gn":"right","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"pare-
     A                                      nt tab panel":"F0041F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted"},{"id":"con-
     A                                      stant15","field type":"output field-
     A                                      ","value":"Gyn                :","c-
     A                                      ss class":"constant","left":"309px"-
     A                                      ,"cursor column":"6","top":"450px",-
     A                                      "cursor row":"18","parent tab panel-
     A                                      ":"F0041F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCGYNB","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCGYNB","designValue":"-
     A                                      [SCGYNB]","refField":"A30","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00","num-
     A                                      BlankFill":"true"},"left":"456px","-
     A                                      cursor column":"27","top":"450px","-
     A                                      cursor row":"18","width":"22px","te-
     A                                      xt align":"right","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":')
     A                                  1  9HTML('"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"parent tab panel":-
     A                                      "F0041F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted"},{"id":"constant16","fiel-
     A                                      d type":"output field","value":"Nur-
     A                                      s               :","css class":"con-
     A                                      stant","left":"309px","cursor colum-
     A                                      n":"6","top":"470px","cursor row":"-
     A                                      19","parent tab panel":"F0041F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCNURB","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      NURB","designValue":"[SCNURB]","ref-
     A                                      Field":"A30","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00","numBlankFill":"tr-
     A                                      ue"},"left":"456px","cursor column"-
     A                                      :"27","top":"470px","cursor row":"1-
     A                                      9","width":"22px","text align":"rig-
     A                                      ht","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"parent tab p-
     A                                      anel":"F0041F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"constant17"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Other 1            :","css class-
     A                                      ":"constant","left":"309px","cursor-
     A                                       column":"6","top":"490px","cursor -
     A                                      row":"20","parent tab panel":"F0041-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCOT1B","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCOT1B","designValue":"[SCOT1B]-
     A                                      ","refField":"A30","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00","numBlankFil-
     A                                      l":"true"},"left":"456px","cursor c-
     A                                      olumn":"27","top":"490px","cursor r-
     A                                      ow":"20","width":"22px","text align-
     A                                      ":"right","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"parent-
     A                                       tab panel":"F0041F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant18","field type":"output field",-
     A                                      "value":"Other 2            :","css-
     A                                       class":"constant","left":"309px","-
     A                                      cursor column":"6","top":"510px","c-
     A                                      ursor row":"21","parent tab panel":-
     A                                      "F0041F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCOT2B","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCOT2B","designValue":"[S-
     A                                      COT2B]","refField":"A30","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00","numBl-
     A                                      ankFill":"true"},"left":"456px","cu-
     A                                      rsor column":"27","top":"510px","cu-
     A                                      rsor row":"21","width":"22px","text-
     A                                       align":"right","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      parent tab panel":"F0041F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant19","field type":"output f-
     A                                      ield","value":"Other 3            :-
     A                                      ","css class":"constant","left":"30-
     A                                      9px","cursor column":"6","top":"530-
     A                                      px","cursor row":"22","parent tab p-
     A                                      anel":"F0041F_SCR01_MainTa')
     A                                  1 10HTML('bPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCOT3B","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCOT-
     A                                      3B","designValue":"[SCOT3B]","refFi-
     A                                      eld":"A30","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","numBlankFill":"true-
     A                                      "},"left":"456px","cursor column":"-
     A                                      27","top":"530px","cursor row":"22"-
     A                                      ,"width":"22px","text align":"right-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F0041F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"btnSubmit","f-
     A                                      ield type":"button","value":"Enter"-
     A                                      ,"shortcut key":"Enter","left":"14p-
     A                                      x","top":"150px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF03","field type"-
     A                                      :"button","value":"Exit","shortcut -
     A                                      key":"F3","left":"14px","top":"183p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF12","field type":"button","val-
     A                                      ue":"Cancel","shortcut key":"F12","-
     A                                      left":"14px","top":"216px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF14","f-
     A                                      ield type":"button","value":"DARTS"-
     A                                      ,"shortcut key":"F14","left":"14px"-
     A                                      ,"top":"249px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCCUB    R        H      REFFLD(A30)
     A            SCCOM3    R        H      REFFLD(DS50)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCGPN2    R        H      REFFLD(NAME)
     A            SCGYNB    R        H      REFFLD(A30)
     A            SCICUB    R        H      REFFLD(A30)
     A            SCMLSB    R        H      REFFLD(A30)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCNURB    R        H      REFFLD(A30)
     A            SCOBB     R        H      REFFLD(A30)
     A            SCORTB    R        H      REFFLD(A30)
     A            SCOT1B    R        H      REFFLD(A30)
     A            SCOT2B    R        H      REFFLD(A30)
     A            SCOT3B    R        H      REFFLD(A30)
     A            SCPCUB    R        H      REFFLD(A30)
     A            SCPEDB    R        H      REFFLD(A30)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A  71 72 73
     A  09                                  CA01(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                  1  2HTML('QPUIREC4    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCLEXPC7    MCR0500C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C6    SCMPEDC7    MCR0500-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     72RERRMSGID  5    C6    SCBND-
     A                                      TC7    MCR0500C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     73')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN71","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN72","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN73","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"overlay ra-
     A                                      nge":"1-23"},"items":[{"id":"F0041F-
     A                                      _SCR02_avKeys","field type":"output-
     A                                       field","value":{"fieldName":"AV_KE-
     A                                      YS","dataLength":"1134","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[AV_KEYS]"},"left":"0px",-
     A                                      "top":"0px","visibility":"hidden"},-
     A                                      {"id":"F0041F_SCR02_action","field -
     A                                      type":"html container","white space-
     A                                      ":"normal","left":"0px","top":"10px-
     A                                      ","width":"230px","css class":"acti-
     A                                      on-panel-converted","height":"700px-
     A                                      ","html":"<div class=\"top\"></div>-
     A                                      <div class=\"imagetop\"><img src=\"-
     A                                      /profoundui/userdata/images/bar_top-
     A                                      .png\" /></div><div class=\"menulin-
     A                                      ks\"></div><div class=\"imagebottom-
     A                                      \"><img src=\"/profoundui/userdata/-
     A                                      images/bar_bottom.png\" /></div><di-
     A                                      v class=\"bottom\"></div>"},{"field-
     A                                       type":"icon menu button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"32px","z index":-
     A                                      "20","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1170px","id":"F0041F_SCR02-
     A                                      _BtnIconMenuSystemTools","tool tip"-
     A                                      :"System Tools","icon alignment":"m-
     A                                      iddle left","icon width":"16px","ic-
     A                                      on height":"24px","icon source":"/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ystools.png","data function":"Syste-
     A                                      mToolbarSystools","show down arrow"-
     A                                      :"Yes"},{"field type":"panel","pane-
     A                                      l style":"TransformButtonBar","id":-
     A                                      "F0041F_SCR02_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"F0041F_SCR02_Bt-
     A                                      nSave","tool tip":"Save","onclick":-
     A                                      "SystemToolbarSave","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/save.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1066px","id":"F0041F_S-
     A                                      CR02_BtnRefresh","tool tip":"Refres-
     A                                      h","onclick":"SystemToolbarRefresh"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/refresh-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"109-
     A                                      2px","id":"F0041F_SCR02_BtnSearch",-
     A                                      "tool tip":"Search","onclick":"Syst-
     A                                      emToolbarSearch","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/search.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1118px","id":"F0041F_SC-
     A                                      R02_BtnDiaryItems","tool tip":"Diar-
     A                                      y/Work Items - IDARTS","onclick":"S-
     A                                      ystemToolbarDiary","background imag-
     A                                      e":{"fieldName":"DryIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place"')
     A                                  1  4HTML(':"true","left":"1144px","id":-
     A                                      "F0041F_SCR02_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1196px","id":"F0041F_-
     A                                      SCR02_BtnHelp","tool tip":"Help","o-
     A                                      nclick":"SystemToolbarHelp","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/help.png'')"},{-
     A                                      "id":"F0041F_SCR02_ImgSysToolBottom-
     A                                      ","field type":"image","image sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/butbarbot.png","left":"1036px"-
     A                                      ,"top":"64px","width":"187px","lock-
     A                                      ed in place":"true","css class":"st-
     A                                      ationary","visibility":"hidden"},{"-
     A                                      id":"F0041F_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0041F_SCR02_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCR02_SCUSER","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCUSER","designValue":"[SCUSER]"-
     A                                      ,"refField":"USER","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"110px","cu-
     A                                      rsor row":"1","css class 2":"top-li-
     A                                      ne","parent tab panel":"F0041F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCR02_SCCONM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCCONM","designValue":"[SCCONM]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"110px","curs-
     A                                      or row":"1","css class 2":"top-line-
     A                                      ","css class 3":"HI","description":-
     A                                      "COMPANY NAME","parent tab panel":"-
     A                                      F0041F_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant21","field-
     A                                       type":"output field","left":"778px-
     A                                      ","cursor column":"73","top":"110px-
     A                                      ","cursor row":"1","css class":"top-
     A                                      -line","value":"js: currentDate()",-
     A                                      "css class 2":"output-field","paren-
     A                                      t tab panel":"F0041F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"F004-
     A                                      1F_SCR02_fkeyMenu","field type":"me-
     A                                      nu","left":"10px","top":"120px","he-
     A                                      ight":"350px","width":"230px","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFFF","border col-
     A                                      or":"#4C6106","menu option indent":-
     A                                      "10px","background color":"#758B27"-
     A                                      ,"css class":"action-menu","css cla-
     A                                      ss 2":"stationary","z index":"101"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0041F_SCR0-
     A                                      2_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt22","field type":"output field","-
     A                                      value":"F0041F","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"F0041F_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCPRDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"130px","cursor r-
     A                                      ow":"2","css class 2":"HI","descrip-
     A                                      tion":"PROGRAM NAME","parent tab pa-
     A                                      nel":"F0041F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-')
     A                                  1  5HTML('converted"},{"id":"constant23-
     A                                      ","field type":"output field","valu-
     A                                      e":"SCR02","css class":"constant","-
     A                                      left":"799px","cursor column":"76",-
     A                                      "top":"130px","cursor row":"2","par-
     A                                      ent tab panel":"F0041F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      R02_SCMODE","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCMODE",-
     A                                      "designValue":"[SCMODE]","refField"-
     A                                      :"NM10","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"764px","cursor colum-
     A                                      n":"71","top":"150px","cursor row":-
     A                                      "3","css class 2":"HI","description-
     A                                      ":"ADD/UPDATE MODE","parent tab pan-
     A                                      el":"F0041F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0041F_SCR02_BtnHiddenSearch","v-
     A                                      alue":"btnSearch","top":"150px","re-
     A                                      sponse":{"fieldName":"btnSearch","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant24","field type":"outp-
     A                                      ut field","value":"Provider        -
     A                                             :","css class":"constant","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"170px","cursor row":"4","paren-
     A                                      t tab panel":"F0041F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR0-
     A                                      2_SCFEIN","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCFEIN","d-
     A                                      esignValue":"[SCFEIN]","refField":"-
     A                                      FEIN","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00"},"css class":"output-field-
     A                                      ","left":"456px","cursor column":"2-
     A                                      7","top":"170px","cursor row":"4","-
     A                                      width":"63px","text align":"right",-
     A                                      "parent tab panel":"F0041F_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCMOD","field type":"output-
     A                                       field","value":{"fieldName":"SCMOD-
     A                                      ","designValue":"[SCMOD]","refField-
     A                                      ":"MOD","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00"},"css class":"output-fie-
     A                                      ld","left":"526px","cursor column":-
     A                                      "37","top":"170px","cursor row":"4"-
     A                                      ,"width":"21px","text align":"right-
     A                                      ","parent tab panel":"F0041F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR02_SCNAME","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      NAME","designValue":"[SCNAME]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"554px","cursor-
     A                                       column":"41","top":"170px","cursor-
     A                                       row":"4","parent tab panel":"F0041-
     A                                      F_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0041F_-
     A                                      SCR02_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0041F_SCR02_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant36-
     A                                      ","field type":"output field","valu-
     A                                      e":"Type information, press Enter."-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"210p-
     A                                      x","cursor row":"6","css class 2":"-
     A                                      BLU","parent tab panel":"F0041F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0041F_SCR02-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant25","field type":"output fi-
     A                                      eld","value":"Staff physicians     -
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"25-
     A                                      0px","cursor row":"8","parent tab p-
     A                                      anel":"F0041F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCSPHY","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCSPHY","designValu-
     A                                      e":"[SCSPHY]","refField":"')
     A                                  1  6HTML('A30","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","numBlankFill":"true-
     A                                      "},"left":"456px","cursor column":"-
     A                                      27","top":"250px","cursor row":"8",-
     A                                      "width":"22px","text align":"right"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"F0041F_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0041F_SCR02_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant26","fie-
     A                                      ld type":"output field","value":"St-
     A                                      aff percentage     :","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"270px","cursor row-
     A                                      ":"9","parent tab panel":"F0041F_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCSTPC","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCSTPC","designValue":"[SCSTPC]","r-
     A                                      efField":"PC32","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00","numBlankFill":-
     A                                      "true"},"left":"456px","cursor colu-
     A                                      mn":"27","top":"270px","cursor row"-
     A                                      :"9","width":"29px","text align":"r-
     A                                      ight","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"parent tab-
     A                                       panel":"F0041F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0041F_SCR02_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant27","field typ-
     A                                      e":"output field","value":"Nurse st-
     A                                      aff          :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"290px","cursor row":"10"-
     A                                      ,"parent tab panel":"F0041F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCNURS","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCNUR-
     A                                      S","designValue":"[SCNURS]","refFie-
     A                                      ld":"A30","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00","numBlankFill":"true"-
     A                                      },"left":"456px","cursor column":"2-
     A                                      7","top":"290px","cursor row":"10",-
     A                                      "width":"22px","text align":"right"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"F0041F_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0041F_SCR02_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px"')
     A                                  1  7HTML(',"response":{"fieldName":"btn-
     A                                      Help","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant28","field typ-
     A                                      e":"output field","value":"Agency p-
     A                                      ercentage  . :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"310px","cursor row":"11"-
     A                                      ,"parent tab panel":"F0041F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCAGPC","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCAGP-
     A                                      C","designValue":"[SCAGPC]","refFie-
     A                                      ld":"PC32","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","numBlankFill":"true-
     A                                      "},"left":"456px","cursor column":"-
     A                                      27","top":"310px","cursor row":"11"-
     A                                      ,"width":"29px","text align":"right-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F0041F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"constant29","-
     A                                      field type":"output field","value":-
     A                                      "Prof license #       :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"350px","cursor -
     A                                      row":"13","parent tab panel":"F0041-
     A                                      F_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCLIC#","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCLIC#","designValue":"[SCLIC#]-
     A                                      ","refField":"LIC#","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","left":"45-
     A                                      6px","cursor column":"27","top":"35-
     A                                      0px","cursor row":"13","width":"92p-
     A                                      x","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"parent tab pa-
     A                                      nel":"F0041F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant30",-
     A                                      "field type":"output field","value"-
     A                                      :"License exp date     :","css clas-
     A                                      s":"constant","left":"295px","curso-
     A                                      r column":"4","top":"370px","cursor-
     A                                       row":"14","parent tab panel":"F004-
     A                                      1F_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCLEXP","field type":"-
     A                                      date field","css class":"input","cs-
     A                                      s class 2":"date-field","value":{"f-
     A                                      ieldName":"SCLEXP","designValue":"[-
     A                                      SCLEXP]","refField":"DT8","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","edt-
     A                                      Wrd":"''  /  /    ''","dateFormat":-
     A                                      "m/d/Y"},"left":"456px","cursor col-
     A                                      umn":"27","top":"370px","cursor row-
     A                                      ":"14","width":"71px","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"error message id":"MCR0500","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"71","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"1 message","parent tab pa-
     A                                      nel":"F0041F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant31",-
     A                                      "field type":"output field","value"-
     A                                      :"Medicare exp date  . :","css clas-
     A                                      s":"constant","left":"295px","curso-
     A                                      r column":"4","top":"390px","cursor-
     A                                       row":"15","parent tab pan')
     A                                  1  8HTML('el":"F0041F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCMPED"-
     A                                      ,"field type":"date field","css cla-
     A                                      ss":"input","css class 2":"date-fie-
     A                                      ld","value":{"fieldName":"SCMPED","-
     A                                      designValue":"[SCMPED]","refField":-
     A                                      "DT8","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''  /  /    ''-
     A                                      ","dateFormat":"m/d/Y"},"left":"456-
     A                                      px","cursor column":"27","top":"390-
     A                                      px","cursor row":"15","width":"71px-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"error message -
     A                                      id":"MCR0500","error message file":-
     A                                      "FSMESG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"72","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"1 message"-
     A                                      ,"parent tab panel":"F0041F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant32","field type":"output-
     A                                       field","value":"BNND (DEA) #      -
     A                                         :","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "410px","cursor row":"16","parent t-
     A                                      ab panel":"F0041F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCBN#",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCBN#","designVa-
     A                                      lue":"[SCBN#]","refField":"A10#","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","left":"456px","cursor column":"-
     A                                      27","top":"410px","cursor row":"16"-
     A                                      ,"width":"71px","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      parent tab panel":"F0041F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant33","field type":"output f-
     A                                      ield","value":"BNND exp date       -
     A                                       :","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"4-
     A                                      30px","cursor row":"17","parent tab-
     A                                       panel":"F0041F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCBNDT","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCBNDT","de-
     A                                      signValue":"[SCBNDT]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","edtWrd":"''  /  /    ''",-
     A                                      "dateFormat":"m/d/Y"},"left":"456px-
     A                                      ","cursor column":"27","top":"430px-
     A                                      ","cursor row":"17","width":"71px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 5":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"error message id-
     A                                      ":"MCR0500","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "73","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"F0041F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant34","field type":"output f-
     A                                      ield","value":"Medicaid #          -
     A                                       :","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"4-
     A                                      50px","cursor row":"18","parent tab-
     A                                       panel":"F0041F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css cla')
     A                                  1  9HTML('ss 2":"profound-converted"},{-
     A                                      "id":"SCMCA#","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      MCA#","designValue":"[SCMCA#]","ref-
     A                                      Field":"A10#","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"456px","-
     A                                      cursor column":"27","top":"450px","-
     A                                      cursor row":"18","width":"71px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"parent tab panel":"-
     A                                      F0041F_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"constant35","field-
     A                                       type":"output field","value":"Comm-
     A                                      ents :","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"490px","cursor row":"20","parent-
     A                                       tab panel":"F0041F_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCCM2-
     A                                      1","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCCM21","desi-
     A                                      gnValue":"[SCCM21]","refField":"DS6-
     A                                      0","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"372px","cursor colu-
     A                                      mn":"15","top":"490px","cursor row"-
     A                                      :"20","width":"421px","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"parent tab panel":"F0041F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"SCCM22","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CCM22","designValue":"[SCCM22]","re-
     A                                      fField":"DS60","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","left":"372px",-
     A                                      "cursor column":"15","top":"510px",-
     A                                      "cursor row":"21","width":"421px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"F0041F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF03","field type":"b-
     A                                      utton","value":"Exit","shortcut key-
     A                                      ":"F3","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF12","field type":"button","value"-
     A                                      :"Cancel","shortcut key":"F12","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF14","fiel-
     A                                      d type":"button","value":"DARTS","s-
     A                                      hortcut key":"F14","left":"14px","t-
     A                                      op":"249px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCAGPC    R        H      REFFLD(PC32)
     A            SCBN#     R        H      REFFLD(A10#)
     A            SCBNDT    R        H      REFFLD(DT8)
     A            SCCM21    R        H      REFFLD(DS60)
     A            SCCM22    R        H      REFFLD(DS60)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCLEXP    R        H      REFFLD(DT8)
     A            SCLIC#    R        H      REFFLD(LIC#)
     A            SCMCA#    R        H      REFFLD(A10#)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCMPED    R        H      REFFLD(DT8)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCNURS    R        H      REFFLD(A30)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSPHY    R        H      REFFLD(A30)
     A            SCSTPC    R        H      REFFLD(PC32)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR03
     A  74 09                               CA01(74 'Response Indicator *IN74')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCPEDTC7    MCR0500C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     74')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN74","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"over-
     A                                      lay range":"1-23"},"items":[{"id":"-
     A                                      F0041F_SCR03_avKeys","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "AV_KEYS","dataLength":"1134","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[AV_KEYS]"},"left":-
     A                                      "0px","top":"0px","visibility":"hid-
     A                                      den"},{"id":"F0041F_SCR03_action","-
     A                                      field type":"html container","white-
     A                                       space":"normal","left":"0px","top"-
     A                                      :"10px","width":"230px","css class"-
     A                                      :"action-panel-converted","height":-
     A                                      "700px","html":"<div class=\"top\">-
     A                                      </div><div class=\"imagetop\"><img -
     A                                      src=\"/profoundui/userdata/images/b-
     A                                      ar_top.png\" /></div><div class=\"m-
     A                                      enulinks\"></div><div class=\"image-
     A                                      bottom\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_bottom.png\" /></d-
     A                                      iv><div class=\"bottom\"></div>"},{-
     A                                      "field type":"icon menu button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"32px","z i-
     A                                      ndex":"20","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1170px","id":"F0041F-
     A                                      _SCR03_BtnIconMenuSystemTools","too-
     A                                      l tip":"System Tools","icon alignme-
     A                                      nt":"middle left","icon width":"16p-
     A                                      x","icon height":"24px","icon sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/systools.png","data function":-
     A                                      "SystemToolbarSystools","show down -
     A                                      arrow":"Yes"},{"field type":"panel"-
     A                                      ,"panel style":"TransformButtonBar"-
     A                                      ,"id":"F0041F_SCR03_ButtonBar","top-
     A                                      ":"35px","left":"1036px","width":"1-
     A                                      87px","height":"28px","css class":"-
     A                                      stationary","visibility":"hidden","-
     A                                      locked in place":"true"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1040px","id":"F0041F_SC-
     A                                      R03_BtnSave","tool tip":"Save","onc-
     A                                      lick":"SystemToolbarSave","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/save.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1066px","id":"F0-
     A                                      041F_SCR03_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"F0041F_SCR03_BtnSe-
     A                                      arch","tool tip":"Search","onclick"-
     A                                      :"SystemToolbarSearch","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/search.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1118px","id":"F00-
     A                                      41F_SCR03_BtnDiaryItems","tool tip"-
     A                                      :"Diary/Work Items - IDARTS","oncli-
     A                                      ck":"SystemToolbarDiary","backgroun-
     A                                      d image":{"fieldName":"DryIcnURL","-
     A                                      dataLength":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1144px","id":"F0041F_S-
     A                                      CR03_BtnSystemMessages","tool tip":-
     A                                      "System Messages","onclick":"System-
     A                                      ToolbarMessages","background image"-
     A                                      :{"fieldName":"MsgIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"f')
     A                                  1  4HTML('alse","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1196px","id":"F-
     A                                      0041F_SCR03_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"F0041F_SCR03_ImgSysTool-
     A                                      Bottom","field type":"image","image-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/butbarbot.png","left":"1-
     A                                      036px","top":"64px","width":"187px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n"},{"id":"F0041F_SCR03_MainTabPane-
     A                                      l","field type":"tab panel","tab pa-
     A                                      nel style":"Transform","tab names":-
     A                                      {"fieldName":"SCPRDS","designValue"-
     A                                      :"[SCPRDS]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0041F_SCR03_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"SCR03_SCUSER","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCUSER","designValue":"[SC-
     A                                      USER]","refField":"USER","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"281-
     A                                      px","cursor column":"2","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","parent tab panel":"F0041-
     A                                      F_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCR03_SCCONM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCONM","designValue":"[SCCON-
     A                                      M]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","css class 3":"HI","descrip-
     A                                      tion":"COMPANY NAME","parent tab pa-
     A                                      nel":"F0041F_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 4":"profo-
     A                                      und-converted"},{"id":"constant37",-
     A                                      "field type":"output field","left":-
     A                                      "778px","cursor column":"73","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                      ":"top-line","value":"js: currentDa-
     A                                      te()","css class 2":"output-field",-
     A                                      "parent tab panel":"F0041F_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"F0041F_SCR03_fkeyMenu","field typ-
     A                                      e":"menu","left":"10px","top":"120p-
     A                                      x","height":"350px","width":"230px"-
     A                                      ,"hover background color":"#9AAA61"-
     A                                      ,"hover text color":"#FFFFFF","bord-
     A                                      er color":"#4C6106","menu option in-
     A                                      dent":"10px","background color":"#7-
     A                                      58B27","css class":"action-menu","c-
     A                                      ss class 2":"stationary","z index":-
     A                                      "101"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0041-
     A                                      F_SCR03_BtnHiddenRefresh","value":"-
     A                                      btnRefresh","top":"125px","response-
     A                                      ":{"fieldName":"btnRefresh","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant38","field type":"output fi-
     A                                      eld","value":"F0041F","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"130px","cursor row-
     A                                      ":"2","parent tab panel":"F0041F_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCR03_SCPRDS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"130px","cu-
     A                                      rsor row":"2","css class 2":"HI","d-
     A                                      escription":"PROGRAM NAME","parent -
     A                                      tab panel":"F0041F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","visibility":"-
     A                                      hidden","css class 3":"profound-con-
     A                                      verted"},{"id":"constant39","field -
     A                                      type":"output field","value":"SCR03-
     A                                      ","css class":"constant","left":"79-
     A                                      9px","cursor column":"76","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"F0041F_SCR03_MainTa')
     A                                  1  5HTML('bPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR03_SCMODE","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MODE","designValue":"[SCMODE]","ref-
     A                                      Field":"NM10","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"764px","cursor-
     A                                       column":"71","top":"150px","cursor-
     A                                       row":"3","css class 2":"HI","descr-
     A                                      iption":"ADD/UPDATE MODE","parent t-
     A                                      ab panel":"F0041F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0041F_SCR03_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant40","field type"-
     A                                      :"output field","value":"Provider  -
     A                                                   :","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"170px","cursor row":"4",-
     A                                      "parent tab panel":"F0041F_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR03_SCFEIN","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCFE-
     A                                      IN","designValue":"[SCFEIN]","refFi-
     A                                      eld":"FEIN","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"true","curSym":"","units":"","neg-
     A                                      Num":"-999.00"},"css class":"output-
     A                                      -field","left":"456px","cursor colu-
     A                                      mn":"27","top":"170px","cursor row"-
     A                                      :"4","width":"63px","text align":"r-
     A                                      ight","parent tab panel":"F0041F_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCR03_SCMOD","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCMOD","designValue":"[SCMOD]","re-
     A                                      fField":"MOD","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00"},"css class":"outp-
     A                                      ut-field","left":"526px","cursor co-
     A                                      lumn":"37","top":"170px","cursor ro-
     A                                      w":"4","width":"21px","text align":-
     A                                      "right","parent tab panel":"F0041F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR03_SCNAME","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCNAME","designValue":"[SCNAME]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"554px","-
     A                                      cursor column":"41","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "F0041F_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0041F_SCR03_BtnHiddenDiaryItems","v-
     A                                      alue":"btnDiary","top":"175px","res-
     A                                      ponse":{"fieldName":"btnDiary","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0041F_SCR03_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px","response":{"-
     A                                      fieldName":"btnMessage","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant53","field type":"output field"-
     A                                      ,"value":"Type information, press E-
     A                                      nter.","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"210px","cursor row":"6","css clas-
     A                                      s 2":"BLU","parent tab panel":"F004-
     A                                      1F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0041F-
     A                                      _SCR03_BtnHiddenWorkSubmitJob","val-
     A                                      ue":"btnWrksbmjob","top":"225px","r-
     A                                      esponse":{"fieldName":"btnWrkJob","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant41","field type":"out-
     A                                      put field","value":"CEO last name  -
     A                                            :","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"250px","cursor row":"8","parent-
     A                                       tab panel":"F0041F_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCCEO-
     A                                      L","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCCEOL","desi-
     A                                      gnValue":"[SCCEOL]","refField":"NM2-
     A                                      0","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"456px","cursor colu-
     A                                      mn":"27","top":"250px","cu')
     A                                  1  6HTML('rsor row":"8","width":"141px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"F0041F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0041F_SCR03_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant42","fie-
     A                                      ld type":"output field","value":"CE-
     A                                      O first name/MI  . :","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"270px","cursor row-
     A                                      ":"9","parent tab panel":"F0041F_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCCEOF","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCCEOF","designValue":"[SCCEOF]","r-
     A                                      efField":"NM20","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"456px"-
     A                                      ,"cursor column":"27","top":"270px"-
     A                                      ,"cursor row":"9","width":"141px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"F0041F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"SCCEOM","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCCEOM","designValue":"[-
     A                                      SCCEOM]","refField":"MID","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"603px","cursor column":"48","to-
     A                                      p":"270px","cursor row":"9","width"-
     A                                      :"8px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"parent ta-
     A                                      b panel":"F0041F_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0041F_SCR03_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant43","field ty-
     A                                      pe":"output field","value":"CFO las-
     A                                      t name        :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"290px","cursor row":"10-
     A                                      ","parent tab panel":"F0041F_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCCFOL","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCCF-
     A                                      OL","designValue":"[SCCFOL]","refFi-
     A                                      eld":"NM20","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase"},"text transf-
     A                                      orm":"uppercase","left":"456px","cu-
     A                                      rsor column":"27","top":"290px","cu-
     A                                      rsor row":"10","width":"141px","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"css class 4":{"fieldName')
     A                                  1  7HTML('":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"paren-
     A                                      t tab panel":"F0041F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0041F_SCR03_BtnHiddenH-
     A                                      elp","value":"btnHelp","top":"300px-
     A                                      ","response":{"fieldName":"btnHelp"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant44","field type":"o-
     A                                      utput field","value":"CFO first nam-
     A                                      e/MI  . :","css class":"constant","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"310px","cursor row":"11","par-
     A                                      ent tab panel":"F0041F_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      CFOF","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCCFOF","d-
     A                                      esignValue":"[SCCFOF]","refField":"-
     A                                      NM20","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"456px","cursor c-
     A                                      olumn":"27","top":"310px","cursor r-
     A                                      ow":"11","width":"141px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"parent tab panel":"F0041F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"SCCFOM","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCCFOM","designValue":"[SCCFOM]",-
     A                                      "refField":"MID","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"603px-
     A                                      ","cursor column":"48","top":"310px-
     A                                      ","cursor row":"11","width":"8px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"F0041F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"constant45","fie-
     A                                      ld type":"output field","value":"Co-
     A                                      mments:","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"330px","cursor row":"12","paren-
     A                                      t tab panel":"F0041F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCCM-
     A                                      11","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCCM11","des-
     A                                      ignValue":"[SCCM11]","refField":"DS-
     A                                      60","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"365px","cursor col-
     A                                      umn":"14","top":"330px","cursor row-
     A                                      ":"12","width":"421px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"parent tab panel":"F0041F_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant46","field type":"o-
     A                                      utput field","value":"Profit liab c-
     A                                      arrier  :","css class":"co')
     A                                  1  8HTML('nstant","left":"295px","curso-
     A                                      r column":"4","top":"370px","cursor-
     A                                       row":"14","parent tab panel":"F004-
     A                                      1F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCLIAC","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCLIAC","designValue":"[SCLIAC-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"4-
     A                                      56px","cursor column":"27","top":"3-
     A                                      70px","cursor row":"14","width":"28-
     A                                      1px","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"parent tab -
     A                                      panel":"F0041F_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted"},{"id":"constant47-
     A                                      ","field type":"output field","valu-
     A                                      e":"Limits (1)         :","css clas-
     A                                      s":"constant","left":"309px","curso-
     A                                      r column":"6","top":"390px","cursor-
     A                                       row":"15","parent tab panel":"F004-
     A                                      1F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCLIM1","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCLIM1","designValue":"[SCLIM1-
     A                                      ]","refField":"A92","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","numBlankFi-
     A                                      ll":"true"},"left":"456px","cursor -
     A                                      column":"27","top":"390px","cursor -
     A                                      row":"15","width":"71px","text alig-
     A                                      n":"right","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"paren-
     A                                      t tab panel":"F0041F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant48","field type":"output field"-
     A                                      ,"value":"Limits (2)         :","cs-
     A                                      s class":"constant","left":"309px",-
     A                                      "cursor column":"6","top":"410px","-
     A                                      cursor row":"16","parent tab panel"-
     A                                      :"F0041F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCLIM2","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCLIM2","designValue":"[-
     A                                      SCLIM2]","refField":"A92","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","numB-
     A                                      lankFill":"true"},"left":"456px","c-
     A                                      ursor column":"27","top":"410px","c-
     A                                      ursor row":"16","width":"71px","tex-
     A                                      t align":"right","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "parent tab panel":"F0041F_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant49","field type":"output -
     A                                      field","value":"Limits (3)         -
     A                                      :","css class":"constant","left":"3-
     A                                      09px","cursor column":"6","top":"43-
     A                                      0px","cursor row":"17","parent tab -
     A                                      panel":"F0041F_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCLIM3","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCLIM3","designVal-
     A                                      ue":"[SCLIM3]","refField":"A92","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      ,"numBlankFill":"true"},"left":"456-
     A                                      px","cursor column":"27","')
     A                                  1  9HTML('top":"430px","cursor row":"17-
     A                                      ","width":"71px","text align":"righ-
     A                                      t","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"parent tab pa-
     A                                      nel":"F0041F_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant50",-
     A                                      "field type":"output field","value"-
     A                                      :"Policy number      :","css class"-
     A                                      :"constant","left":"309px","cursor -
     A                                      column":"6","top":"450px","cursor r-
     A                                      ow":"18","parent tab panel":"F0041F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPOL#","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPOL#","designValue":"[SCPOL#]"-
     A                                      ,"refField":"DS20","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"456-
     A                                      px","cursor column":"27","top":"450-
     A                                      px","cursor row":"18","width":"141p-
     A                                      x","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"parent tab pa-
     A                                      nel":"F0041F_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant51",-
     A                                      "field type":"output field","value"-
     A                                      :"Expiration Date  . :","css class"-
     A                                      :"constant","left":"309px","cursor -
     A                                      column":"6","top":"470px","cursor r-
     A                                      ow":"19","parent tab panel":"F0041F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPEDT","field type":"da-
     A                                      te field","css class":"input","css -
     A                                      class 2":"date-field","value":{"fie-
     A                                      ldName":"SCPEDT","designValue":"[SC-
     A                                      PEDT]","refField":"DT8","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"left":"456px","cursor colum-
     A                                      n":"27","top":"470px","cursor row":-
     A                                      "19","width":"71px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"error message id":"MCR0500","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"74","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"1 message","parent tab pane-
     A                                      l":"F0041F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"id":"constant52","f-
     A                                      ield type":"output field","value":"-
     A                                      Deductible         :","css class":"-
     A                                      constant","left":"309px","cursor co-
     A                                      lumn":"6","top":"490px","cursor row-
     A                                      ":"20","parent tab panel":"F0041F_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCDEC","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCDEC","designValue":"[SCDEC]","ref-
     A                                      Field":"A92","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00","numBlankFill":"tr-
     A                                      ue"},"left":"456px","cursor column"-
     A                                      :"27","top":"490px","cursor row":"2-
     A                                      0","width":"71px","text align":"rig-
     A                                      ht","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indF')
     A                                  1 10HTML('ormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"parent tab panel":"F0041F_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"150px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F03","field type":"button","value":-
     A                                      "Exit","shortcut key":"F3","left":"-
     A                                      14px","top":"183px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF12","field ty-
     A                                      pe":"button","value":"Cancel","shor-
     A                                      tcut key":"F12","left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF14","field type":"button-
     A                                      ","value":"DARTS","shortcut key":"F-
     A                                      14","left":"14px","top":"249px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCEOF    R        H      REFFLD(NM20)
     A            SCCEOL    R        H      REFFLD(NM20)
     A            SCCEOM    R        H      REFFLD(MID)
     A            SCCFOF    R        H      REFFLD(NM20)
     A            SCCFOL    R        H      REFFLD(NM20)
     A            SCCFOM    R        H      REFFLD(MID)
     A            SCCM11    R        H      REFFLD(DS60)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDEC     R        H      REFFLD(A92)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCLIAC    R        H      REFFLD(NAME)
     A            SCLIM1    R        H      REFFLD(A92)
     A            SCLIM2    R        H      REFFLD(A92)
     A            SCLIM3    R        H      REFFLD(A92)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPEDT    R        H      REFFLD(DT8)
     A            SCPOL#    R        H      REFFLD(DS20)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR99
     A                                  1  2HTML('QPUIREC3    RASSUME    0     -
     A                                      RROWS      2    C1    3C1    3 FSCE-
     A                                      RR     INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","overlay range":"3--
     A                                      3"},"items":[{"id":"F0041F_SCR99_av-
     A                                      Keys","field type":"output field","-
     A                                      value":{"fieldName":"AV_KEYS","data-
     A                                      Length":"1134","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[AV_KEYS]"},"left":"0px","top":"0p-
     A                                      x","visibility":"hidden"},{"id":"F0-
     A                                      041F_SCR99_action","field type":"ht-
     A                                      ml container","white space":"normal-
     A                                      ","left":"0px","top":"10px","width"-
     A                                      :"230px","css class":"action-panel--
     A                                      converted","height":"700px","html":-
     A                                      "<div class=\"top\"></div><div clas-
     A                                      s=\"imagetop\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_top.png\" />-
     A                                      </div><div class=\"menulinks\"></di-
     A                                      v><div class=\"imagebottom\"><img s-
     A                                      rc=\"/profoundui/userdata/images/ba-
     A                                      r_bottom.png\" /></div><div class=\-
     A                                      "bottom\"></div>"},{"field type":"i-
     A                                      con menu button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"32px","z index":"20","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1170px","id":"F0041F_SCR99_BtnIconM-
     A                                      enuSystemTools","tool tip":"System -
     A                                      Tools","icon alignment":"middle lef-
     A                                      t","icon width":"16px","icon height-
     A                                      ":"24px","icon source":"/profoundui-
     A                                      /userdata/images/systool/systools.p-
     A                                      ng","data function":"SystemToolbarS-
     A                                      ystools","show down arrow":"Yes"},{-
     A                                      "field type":"panel","panel style":-
     A                                      "TransformButtonBar","id":"F0041F_S-
     A                                      CR99_ButtonBar","top":"35px","left"-
     A                                      :"1036px","width":"187px","height":-
     A                                      "28px","css class":"stationary","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"104-
     A                                      0px","id":"F0041F_SCR99_BtnSave","t-
     A                                      ool tip":"Save","onclick":"SystemTo-
     A                                      olbarSave","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/save.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1066px","id":"F0041F_SCR99_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"F0041F_SCR99_BtnSearch","tool tip-
     A                                      ":"Search","onclick":"SystemToolbar-
     A                                      Search","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      search.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1118px","id":"F0041F_SCR99_BtnDi-
     A                                      aryItems","tool tip":"Diary/Work It-
     A                                      ems - IDARTS","onclick":"SystemTool-
     A                                      barDiary","background image":{"fiel-
     A                                      dName":"DryIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      44px","id":"F0041F_SCR99_BtnSystemM-
     A                                      essages","tool tip":"System Message-
     A                                      s","onclick":"SystemToolbarMessages-
     A                                      ","background image":{"fieldName":"-
     A                                      MsgIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char')
     A                                  1  4HTML('","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1196px","id":"F0041F_SCR99_Btn-
     A                                      Help","tool tip":"Help","onclick":"-
     A                                      SystemToolbarHelp","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/help.png'')"},{"id":"F00-
     A                                      41F_SCR99_ImgSysToolBottom","field -
     A                                      type":"image","image source":"/prof-
     A                                      oundui/userdata/images/systool/butb-
     A                                      arbot.png","left":"1036px","top":"6-
     A                                      4px","width":"187px","locked in pla-
     A                                      ce":"true","css class":"stationary"-
     A                                      ,"visibility":"hidden"},{"id":"F004-
     A                                      1F_SCR99_MainTabPanel","field type"-
     A                                      :"tab panel","tab panel style":"Tra-
     A                                      nsform","tab names":"Tab 1","active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0041F_SCR99_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"F0041F_SCR99_fkeyMenu","field-
     A                                       type":"menu","left":"10px","top":"-
     A                                      120px","height":"350px","width":"23-
     A                                      0px","hover background color":"#9AA-
     A                                      A61","hover text color":"#FFFFFF","-
     A                                      border color":"#4C6106","menu optio-
     A                                      n indent":"10px","background color"-
     A                                      :"#758B27","css class":"action-menu-
     A                                      ","css class 2":"stationary","z ind-
     A                                      ex":"101"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0041F_SCR99_BtnHiddenRefresh","valu-
     A                                      e":"btnRefresh","top":"125px","resp-
     A                                      onse":{"fieldName":"btnRefresh","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCERR","field type":"password f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"textbox","input only":"true",-
     A                                      "value":{"fieldName":"SCERR","desig-
     A                                      nValue":"[SCERR]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"288px","cursor column-
     A                                      ":"3","top":"150px","cursor row":"3-
     A                                      ","width":"8px","read only":"true",-
     A                                      "css class 3":"PR-UL","parent tab p-
     A                                      anel":"F0041F_SCR99_MainTabPanel","-
     A                                      parent tab":"0","css class 4":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0041F_SCR99_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0041F_SCR99-
     A                                      _BtnHiddenDiaryItems","value":"btnD-
     A                                      iary","top":"175px","response":{"fi-
     A                                      eldName":"btnDiary","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0041F_SCR99_BtnHiddenSyste-
     A                                      mMessages","value":"btnMessage","to-
     A                                      p":"200px","response":{"fieldName":-
     A                                      "btnMessage","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0041F_SCR99_BtnHiddenWorkSubmitJo-
     A                                      b","value":"btnWrksbmjob","top":"22-
     A                                      5px","response":{"fieldName":"btnWr-
     A                                      kJob","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0041F-
     A                                      _SCR99_BtnHiddenWorkPrinterOutput",-
     A                                      "value":"btnWrkprtout","top":"250px-
     A                                      ","response":{"fieldName":"btnWrkPr-
     A                                      nt","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0041F_S-
     A                                      CR99_BtnHiddenImageQueue",')
     A                                  1  5HTML('"value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0041F-
     A                                      _SCR99_BtnHiddenHelp","value":"btnH-
     A                                      elp","top":"300px","response":{"fie-
     A                                      ldName":"btnHelp","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"btnSubmit"-
     A                                      ,"field type":"button","value":"Ent-
     A                                      er","shortcut key":"Enter","left":"-
     A                                      14px","top":"150px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
