     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0058F_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"F0058F_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"F-
     A                                      0058F_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon al-
     A                                      ignment":"middle left","icon width"-
     A                                      :"16px","icon height":"24px","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"F0058F_SCR01_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"F005-
     A                                      8F_SCR01_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"F0058F_SCR01_BtnRefresh","tool t-
     A                                      ip":"Refresh","onclick":"SystemTool-
     A                                      barRefresh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"F0058F_SCR01_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"F0058F_SCR01_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"F00-
     A                                      58F_SCR01_BtnSystemMessages","tool -
     A                                      tip":"System Messages","on')
     A                                  1  4HTML('click":"SystemToolbarMessages-
     A                                      ","background image":{"fieldName":"-
     A                                      MsgIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1196px","i-
     A                                      d":"F0058F_SCR01_BtnHelp","tool tip-
     A                                      ":"Help","onclick":"SystemToolbarHe-
     A                                      lp","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/help-
     A                                      .png'')"},{"id":"F0058F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"F0058F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"active tab":"0","left":"250-
     A                                      px","top":"70px","width":"970px","h-
     A                                      eight":"657px","z index":"8","locke-
     A                                      d in place":"true","css class":"tab-
     A                                      -panel","css class 2":"stationary"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0058F_SCR0-
     A                                      1_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCUSER","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCUSER","designValue":"[SCU-
     A                                      SER]","refField":"USER","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"110px-
     A                                      ","cursor row":"1","css class 2":"t-
     A                                      op-line","parent tab panel":"F0058F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCCONM","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCONM","designValue":"[SCCONM]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"414px","curso-
     A                                      r column":"21","top":"110px","curso-
     A                                      r row":"1","css class 2":"top-line"-
     A                                      ,"css class 3":"HI","description":"-
     A                                      COMPANY NAME","parent tab panel":"F-
     A                                      0058F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"constant1","field t-
     A                                      ype":"output field","left":"778px",-
     A                                      "cursor column":"73","top":"110px",-
     A                                      "cursor row":"1","css class":"top-l-
     A                                      ine","value":"js: currentDate()","c-
     A                                      ss class 2":"output-field","parent -
     A                                      tab panel":"F0058F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"F0058F-
     A                                      _SCR01_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0058F_SCR01_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      2","field type":"output field","val-
     A                                      ue":"F0058F","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"F0058F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","description":"PR-
     A                                      OGRAM NAME","parent tab panel":"F00-
     A                                      58F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","visibility":"hidden","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant3","field type":"output fi-
     A                                      eld","value":"SCR01","css class":"c-
     A                                      onstant","left":"799px","c')
     A                                  1  5HTML('ursor column":"76","top":"130-
     A                                      px","cursor row":"2","parent tab pa-
     A                                      nel":"F0058F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F0058F_SCR01_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0058F_SCR01_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0058F_SCR01_BtnHiddenSystem-
     A                                      Messages","value":"btnMessage","top-
     A                                      ":"200px","response":{"fieldName":"-
     A                                      btnMessage","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0058F_SCR01_BtnHiddenWorkSubmitJob-
     A                                      ","value":"btnWrksbmjob","top":"225-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Job","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0058F_-
     A                                      SCR01_BtnHiddenWorkPrinterOutput","-
     A                                      value":"btnWrkprtout","top":"250px"-
     A                                      ,"response":{"fieldName":"btnWrkPrn-
     A                                      t","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant4","field type":"-
     A                                      output field","value":"Please make -
     A                                      sure that the most current Medispan-
     A                                       document","css class":"constant","-
     A                                      left":"358px","cursor column":"13",-
     A                                      "top":"270px","cursor row":"9","css-
     A                                       class 2":"BLU","parent tab panel":-
     A                                      "F0058F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0058F_SCR01_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"275px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant5","field type":"outpu-
     A                                      t field","value":"(in the format of-
     A                                       Medispan.txt) is in the MEDISPAN f-
     A                                      older.","css class":"constant","lef-
     A                                      t":"351px","cursor column":"12","to-
     A                                      p":"290px","cursor row":"10","css c-
     A                                      lass 2":"BLU","parent tab panel":"F-
     A                                      0058F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F00-
     A                                      58F_SCR01_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t6","field type":"output field","va-
     A                                      lue":"Press","css class":"constant"-
     A                                      ,"left":"470px","cursor column":"29-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      css class 2":"BLU","parent tab pane-
     A                                      l":"F0058F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant7","fi-
     A                                      eld type":"output field","value":"E-
     A                                      nter","css class":"constant","left"-
     A                                      :"512px","cursor column":"35","top"-
     A                                      :"310px","cursor row":"11","css cla-
     A                                      ss 2":"HI","parent tab panel":"F005-
     A                                      8F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant8","field type-
     A                                      ":"output field","value":"when read-
     A                                      y.","css class":"constant","left":"-
     A                                      554px","cursor column":"41","top":"-
     A                                      310px","cursor row":"11","css class-
     A                                       2":"BLU","parent tab panel":"F0058-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF03","field type":"button",-
     A                                      "value":"Exit","shortcut key":"F3",-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF13","-
     A                                      field type":"button","value":"Chg u-
     A                                      ser parms","shortcut key":"F13","le-
     A                                      ft":"14px","top":"216px","')
     A                                  1  6HTML('width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnHELP","field type":"button","s-
     A                                      hortcut key":"Alt-F1","bypass valid-
     A                                      ation":"true","value":"HELP","respo-
     A                                      nse":{"fieldName":"*IN10","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"249px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR99
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"F0058F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"F0058F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0058F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F0058F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      F0058F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"F0058F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"F0058F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"F0058F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "F0058F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"F0058F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"F0058F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"F0058F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0058F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"F0058-
     A                                      F_SCR99_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0058F_SCR99-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCERR",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","input only":"true","value":{"f-
     A                                      ieldName":"SCERR","designValue":"[S-
     A                                      CERR]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      8px","read only":"true","css class -
     A                                      3":"PR-UL","parent tab panel":"F005-
     A                                      8F_SCR99_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0058F-
     A                                      _SCR99_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0058F_SCR99_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F00-
     A                                      58F_SCR99_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0058F_SCR-
     A                                      99_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0058F_SCR99_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css cla')
     A                                  1  5HTML('ss":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F005-
     A                                      8F_SCR99_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0058F_SCR99_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF03","field type":"button-
     A                                      ","value":"Exit","shortcut key":"F3-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnHELP"-
     A                                      ,"field type":"button","shortcut ke-
     A                                      y":"Alt-F1","bypass validation":"tr-
     A                                      ue","value":"HELP","response":{"fie-
     A                                      ldName":"*IN10","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"14px","top":-
     A                                      "216px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
