     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDATA        45A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCAST     R        H      REFFLD(CODE)
     A            SCAUTH    R        H      REFFLD(FLAG)
     A            SCFND     R        H      REFFLD(FND)
     A            SCNAME    R        H      REFFLD(DS60)
     A            SCOUTA    R        H      REFFLD(FLAG)
     A            SCSHNM    R        H      REFFLD(DS30)
     A            SCSTAT    R        H      REFFLD(FLAG)
     A            SCWCF#    R        H      REFFLD(FND)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 22
     A  23 24 25                            CA01(01 'Response Indicator *IN01')
     A  26 27 28
     A  29 71 72
     A  73 74 91                            CA02(02 'Response Indicator *IN02')
     A  93 94 95
     A  06                                  CA03
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    8 RSFLSIZ    1    C2    11 1  -
     A                                        RSFLNXTCHG 0    E1    3     0812 -
     A                                        ROVERLAY   0     RROWS      2    -
     A                                      C1    1C2    20 RSFLMSGID  4    C7 -
     A                                         MC40002C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     71RSFLMSGID  4    C-
     A                                      7    MC40013C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     72RSFLMSGID  4   -
     A                                       C7    MC40184C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     73RSFLMSGID  4 -
     A                                         C7    MC40185C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     74RSFLMSGID  -
     A                                      4    C7    CPD6A7CC7    QCPFMSGC5  -
     A                                        *LIBLC0    E1    3     93RERRMSGI-
     A                                      D  5    C6    SCUSERC7    CPF5203C7-
     A                                          QCPFMSGC5    *LIBLC0    E1    3-
     A                                           91RERRMSGID  5    C6    SCUSER-
     A                                      C7    CPF5204C7    QCPFMSGC5    *LI-
     A                                      BLC0    E1    3     94FSCPST2    IN-
     A                                      PUTONLY 0     FSCPST3    INPUTONLY -
     A                                      0     FSCPST1    INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"MC40002","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "71","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"5 messages",-
     A                                      "error message id 2":"MC40013","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"72","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 3":"MC40184","error me-
     A                                      ssage file 3":"FSMESG","error messa-
     A                                      ge library 3":"*LIBL","error condit-
     A                                      ion 3":{"fieldName":"73","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 4":"MC40185","error message-
     A                                       file 4":"FSMESG","error message li-
     A                                      brary 4":"*LIBL","error condition 4-
     A                                      ":{"fieldName":"74","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 5":"CPD6A7C","error message file-
     A                                       5":"QCPFMSG","error message librar-
     A                                      y 5":"*LIBL","error condition 5":{"-
     A                                      fieldName":"93","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"overlay range":"1--
     A                                      20"},"items":[{"id":"SCPST9","field-
     A                                       type":"output field","visibility":-
     A                                      {"fieldName":"29","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"value-
     A                                      ":{"fieldName":"SCPST9","designValu-
     A                                      e":"[SCPST9]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none","dataLength":"1"},"le-
     A                                      ft":"0px","top":"-30px","css class"-
     A                                      :"profound-converted"},{"id":"SCRRN-
     A                                      1","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"SCRRN1","designValue":"[SCRRN1-
     A                                      ]","dataType":"zoned","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"true","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","dataLength":"4","decPos":"0"},"l-
     A                                      eft":"0px","top":"-30px","width":"2-
     A                                      8px","text align":"right","css clas-
     A                                      s":"profound-converted"},{"id":"SCP-
     A                                      ST8","field type":"output field","v-
     A                                      isibility":{"fieldName":"28","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"value":{"fieldName":"SCPST8",-
     A                                      "designValue":"[SCPST8]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"1"},"left":"0px","top":"-30px",-
     A                                      "css class":"profound-converted"},{-
     A                                      "id":"SCPST6","field type":"output -
     A                                      field","visibility":{"fieldName":"2-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":{"fieldName":-
     A                                      "SCPST6","designValue":"[SCPST6]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"1"},"left":"0px","top"-
     A                                      :"-30px","css class":"profound-conv-
     A                                      erted"},{"id":"SCPST5","field type"-
     A                                      :"output field","visibility":{"fiel-
     A                                      dName":"25","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"value":{"fi-
     A                                      eldName":"SCPST5","designValue":"[S-
     A                                      CPST5]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none","dataLength":"1"},"left":"0-
     A                                      px","top":"-30px","css class":"prof-
     A                                      ound-converted"},{"id":"SCPST4","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":{"fieldName":"24","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"va-
     A                                      lue":{"fieldName":"SCPST4","designV-
     A                                      alue":"[SCPST4]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none","dataLength":"1"},-
     A                                      "left":"0px","top":"-30px","css cla-
     A                                      ss":"profound-converted"},{"id":"SC-
     A                                      PST7","field type":"output field","-
     A                                      visibility":{"fieldName":"27","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"value":{"fieldName":"SCPST7"-
     A                                      ,"designValue":"[SCPST7]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"1"},"left":"0px","top":"-30px"-
     A                                      ,"css class":"profound-converted"},-
     A                                      {"id":"SFLMOD","field type":"output-
     A                                       field","visibility":"hidden","valu-
     A                                      e":{"fieldName":"SFLMOD","designVal-
     A                                      ue":"[SFLMOD]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"1"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"F006-
     A                                      0F_SCR01C_avKeys","field type":"out-
     A                                      put field","value":{"fieldName":"AV-
     A                                      _KEYS","dataLength":"1134","trimLea-
     A                                      ding":"false","trimTrailin')
     A                                  1  4HTML('g":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[AV_KEY-
     A                                      S]"},"left":"0px","top":"0px","visi-
     A                                      bility":"hidden"},{"id":"F0060F_SCR-
     A                                      01C_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"F0060F_SCR01C_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"F0060F_SCR01C_-
     A                                      ButtonBar","top":"35px","left":"103-
     A                                      6px","width":"187px","height":"28px-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1040px",-
     A                                      "id":"F0060F_SCR01C_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"F0060F_SCR01C_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      0060F_SCR01C_BtnSearch","tool tip":-
     A                                      "Search","onclick":"SystemToolbarSe-
     A                                      arch","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/se-
     A                                      arch.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1118px","id":"F0060F_SCR01C_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F0060F_SCR01C_BtnSystemM-
     A                                      essages","tool tip":"System Message-
     A                                      s","onclick":"SystemToolbarMessages-
     A                                      ","background image":{"fieldName":"-
     A                                      MsgIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1')
     A                                  1  5HTML('196px","id":"F0060F_SCR01C_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"F0-
     A                                      060F_SCR01C_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"F0-
     A                                      060F_SCR01C_MainTabPanel","field ty-
     A                                      pe":"tab panel","tab panel style":"-
     A                                      Transform","tab names":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"active ta-
     A                                      b":"0","left":"250px","top":"70px",-
     A                                      "width":"970px","height":"657px","z-
     A                                       index":"8","locked in place":"true-
     A                                      ","css class":"tab-panel","css clas-
     A                                      s 2":"stationary"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0060F_SCR01C_BtnHiddenSave"-
     A                                      ,"value":"btnSave","top":"100px","r-
     A                                      esponse":{"fieldName":"btnSave","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCUSER","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCUSER",-
     A                                      "designValue":"[SCUSER]","refField"-
     A                                      :"USER","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"110px","cursor row":"-
     A                                      1","css class 2":"top-line","error -
     A                                      message id":"CPF5203","error messag-
     A                                      e file":"QCPFMSG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"91","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"CP-
     A                                      F5204","error message file 2":"QCPF-
     A                                      MSG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"94","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"parent tab panel":"F0060F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCCONM","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      CONM","designValue":"[SCCONM]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"414px","cursor-
     A                                       column":"21","top":"110px","cursor-
     A                                       row":"1","css class 2":"top-line",-
     A                                      "css class 3":"HI","parent tab pane-
     A                                      l":"F0060F_SCR01C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 4":"profou-
     A                                      nd-converted"},{"id":"constant1","f-
     A                                      ield type":"output field","left":"7-
     A                                      78px","cursor column":"73","top":"1-
     A                                      10px","cursor row":"1","css class":-
     A                                      "top-line","value":"js: currentDate-
     A                                      ()","css class 2":"output-field","p-
     A                                      arent tab panel":"F0060F_SCR01C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "F0060F_SCR01C_fkeyMenu","field typ-
     A                                      e":"menu","left":"10px","top":"120p-
     A                                      x","height":"350px","width":"230px"-
     A                                      ,"hover background color":"#9AAA61"-
     A                                      ,"hover text color":"#FFFFFF","bord-
     A                                      er color":"#4C6106","menu option in-
     A                                      dent":"10px","background color":"#7-
     A                                      58B27","css class":"action-menu","c-
     A                                      ss class 2":"stationary","z index":-
     A                                      "101"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0060-
     A                                      F_SCR01C_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "Q1PGM","field type":"output field"-
     A                                      ,"value":{"fieldName":"Q1PGM","desi-
     A                                      gnValue":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"F0060F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCPRD-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCPRDS","designVa-
     A                                      lue":"[SCPRDS]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"130px","cursor row":"2","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      0060F_SCR01C_MainTabPanel","parent -
     A                                      tab":"0","visibility":"hidden","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant2","field type":"output-
     A                                       field","value":"SCR01","css class"-
     A                                      :"constant","left":"799px","cursor -
     A                                      column":"76","top":"130px"')
     A                                  1  6HTML(',"cursor row":"2","parent tab-
     A                                       panel":"F0060F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0060F_SCR01C_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant3","field type":-
     A                                      "output field","value":"Subscriber:-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"170-
     A                                      px","cursor row":"4","parent tab pa-
     A                                      nel":"F0060F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCSUB#","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCSUB#","designValue":"-
     A                                      [SCSUB#]","refField":"SUB#","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"37-
     A                                      2px","cursor column":"15","top":"17-
     A                                      0px","cursor row":"4","width":"35px-
     A                                      ","text align":"right","parent tab -
     A                                      panel":"F0060F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSNAM","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCSNAM","designValue"-
     A                                      :"[SCSNAM]","refField":"DS40","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"421px","cursor column":"22","top"-
     A                                      :"170px","cursor row":"4","parent t-
     A                                      ab panel":"F0060F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0060F_SCR01C_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F006-
     A                                      0F_SCR01C_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant6","field type":"o-
     A                                      utput field","value":"Position to S-
     A                                      hort name:","css class":"constant",-
     A                                      "visibility":{"fieldName":"23","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"281px","cursor colum-
     A                                      n":"2","top":"210px","cursor row":"-
     A                                      6","parent tab panel":"F0060F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant4","field type":"outp-
     A                                      ut field","value":"Position to . . -
     A                                      . Group #:","css class":"constant",-
     A                                      "visibility":{"fieldName":"21","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"281px","cursor colum-
     A                                      n":"2","top":"210px","cursor row":"-
     A                                      6","parent tab panel":"F0060F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant5","field type":"outp-
     A                                      ut field","value":"Position to Name-
     A                                      :","css class":"constant","visibili-
     A                                      ty":{"fieldName":"22","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"210px","cursor row":"6","paren-
     A                                      t tab panel":"F0060F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      ST2","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","input only":"true","value":{"fie-
     A                                      ldName":"SCPST2","designValue":"[SC-
     A                                      PST2]","refField":"DS60","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","visi-
     A                                      bility":{"fieldName":"22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"414px","cursor column":"2-
     A                                      1","top":"210px","cursor row":"6","-
     A                                      width":"421px","set focus":{"fieldN-
     A                                      ame":"N06","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"parent tab panel-
     A                                      ":"F0060F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCPST3","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","input on-
     A                                      ly":"true","value":{"fieldName":"SC-
     A                                      PST3","designValue":"[SCPST3]","ref-
     A                                      Field":"DS30","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true"},"vi-
     A                                      sibility":{"fieldName":"23","dataTy-
     A                                      pe":"expression","formatti')
     A                                  1  7HTML('ng":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"456px","-
     A                                      cursor column":"27","top":"210px","-
     A                                      cursor row":"6","width":"211px","se-
     A                                      t focus":{"fieldName":"N06","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "parent tab panel":"F0060F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCPST1","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","input only":"true","value"-
     A                                      :{"fieldName":"SCPST1","designValue-
     A                                      ":"[SCPST1]","refField":"DS3","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase","blankFill":"true"},"text tran-
     A                                      sform":"uppercase","visibility":{"f-
     A                                      ieldName":"21","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"4-
     A                                      77px","cursor column":"30","top":"2-
     A                                      10px","cursor row":"6","width":"22p-
     A                                      x","text align":"right","set focus"-
     A                                      :{"fieldName":"N06","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"parent -
     A                                      tab panel":"F0060F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0060F_SCR01C_BtnHiddenW-
     A                                      orkSubmitJob","value":"btnWrksbmjob-
     A                                      ","top":"225px","response":{"fieldN-
     A                                      ame":"btnWrkJob","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant7",-
     A                                      "field type":"output field","value"-
     A                                      :"Type options, press Enter.","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"250px","cu-
     A                                      rsor row":"8","css class 2":"BLU","-
     A                                      parent tab panel":"F0060F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0060F_SCR01C_Btn-
     A                                      HiddenWorkPrinterOutput","value":"b-
     A                                      tnWrkprtout","top":"250px","respons-
     A                                      e":{"fieldName":"btnWrkPrnt","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCOPL1","field type":"output field-
     A                                      ","value":{"fieldName":"SCOPL1","de-
     A                                      signValue":"[SCOPL1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"76"},"css class":"output-field","-
     A                                      left":"295px","cursor column":"4","-
     A                                      top":"270px","cursor row":"9","css -
     A                                      class 2":"BLU","parent tab panel":"-
     A                                      F0060F_SCR01C_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0060F_SCR01C_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SCOPL2","field type":"output -
     A                                      field","value":{"fieldName":"SCOPL2-
     A                                      ","designValue":"[SCOPL2]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"76"},"css class":"output-fie-
     A                                      ld","left":"295px","cursor column":-
     A                                      "4","top":"290px","cursor row":"10"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"F0060F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0060F_SCR01C_BtnHiddenHelp","-
     A                                      value":"btnHelp","top":"300px","res-
     A                                      ponse":{"fieldName":"btnHelp","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant8","field type":"output f-
     A                                      ield","value":"WC xref","css class"-
     A                                      :"constant","left":"715px","cursor -
     A                                      column":"64","top":"310px","cursor -
     A                                      row":"11","css class 2":"HI","paren-
     A                                      t tab panel":"F0060F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted","css class -
     A                                      4":"subfile-heading"},{"id":"consta-
     A                                      nt9","field type":"output field","v-
     A                                      alue":"Opt","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"330px","cursor row":"12","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F0060F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted","css class 4":"subfile-h-
     A                                      eading"},{"id":"SCHDL1","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCHDL1","designValue":"[SCHDL1]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"74"},"css class":"-
     A                                      output-field","left":"309p')
     A                                  1  8HTML('x","cursor column":"6","top":-
     A                                      "330px","cursor row":"12","css clas-
     A                                      s 2":"HI","parent tab panel":"F0060-
     A                                      F_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted","css class 4":"subfile-heading-
     A                                      "},{"id":"SCR01S","field type":"gri-
     A                                      d","number of columns":"5","record -
     A                                      format name":"SCR01S","subfile next-
     A                                       changed":{"fieldName":"08","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "display subfile":{"fieldName":"04"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"display control record":{"-
     A                                      fieldName":"N03","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"clear subf-
     A                                      ile":{"fieldName":"03","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"subf-
     A                                      ile size":"11","place cursor":"true-
     A                                      ","header height":"40","row height"-
     A                                      :"20","css class":"subfilegrid","cs-
     A                                      s class 2":"profound-converted","pa-
     A                                      rent tab panel":"F0060F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","subfile-
     A                                       end":{"fieldName":"95","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"pag-
     A                                      e down response":{"fieldName":"*IN0-
     A                                      1","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"page up response":{"fieldName":"-
     A                                      *IN02","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"show paging controls":"true"-
     A                                      ,"scrollbar":"none","number of rows-
     A                                      ":"9","top":"310px","left":"276px",-
     A                                      "column widths":"28,364,56,70,42","-
     A                                      return mode":{"fieldName":"SFLMOD",-
     A                                      "dataLength":"1","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"subfile record n-
     A                                      umber":{"fieldName":"SCRRN1","desig-
     A                                      nValue":"[SCRRN1]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"true","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"4",-
     A                                      "decPos":"0"}},{"id":"btnSubmit","f-
     A                                      ield type":"button","value":"Enter"-
     A                                      ,"shortcut key":"Enter","left":"14p-
     A                                      x","top":"150px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF03","field type"-
     A                                      :"button","value":"F3","shortcut ke-
     A                                      y":"F3","left":"14px","top":"183px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF05","field type":"button","value-
     A                                      ":"F5","shortcut key":"F5","left":"-
     A                                      14px","top":"216px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF06","field ty-
     A                                      pe":"button","value":"F6","shortcut-
     A                                       key":"F6","left":"14px","top":"249-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF11","field type":"button","va-
     A                                      lue":"F11","shortcut key":"F11","le-
     A                                      ft":"14px","top":"282px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF12","fie-
     A                                      ld type":"button","value":"Cancel",-
     A                                      "shortcut key":"F12","left":"14px",-
     A                                      "top":"315px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF13","field type":"b-
     A                                      utton","value":"F13","shortcut key"-
     A                                      :"F13","left":"14px","top":"348px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF17","field type":"button","value"-
     A                                      :"F17","shortcut key":"F17","left":-
     A                                      "14px","top":"381px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF23","field t-
     A                                      ype":"button","value":"F23","shortc-
     A                                      ut key":"F23","left":"14px","top":"-
     A                                      414px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnHELP","field type":"button",-
     A                                      "shortcut key":"Alt-F1","onclick":"-
     A                                      pui.showHelp()","value":"HELP","lef-
     A                                      t":"14px","top":"447px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"SCDBRR","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"SCDB-
     A                                      RR","designValue":"[SCDBRR]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"9","decPos":"0"},"left":"-58-
     A                                      px","top":"-379px","width":"63px","-
     A                                      text align":"right","css class":"pr-
     A                                      ofound-converted","grid":"SCR01S","-
     A                                      column":"0"},{"id":"SCNAME","field -
     A                                      type":"output field","visibility":"-
     A                                      hidden","value":{"fieldName":"SCNAM-
     A                                      E","designValue":"[SCNAME]","refFie-
     A                                      ld":"DS60","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none"},"left":"-')
     A                                  1  9HTML('45px","top":"-379px","css cla-
     A                                      ss":"profound-converted","grid":"SC-
     A                                      R01S","column":"0"},{"id":"SCAST","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "SCAST","designValue":"[SCAST]","re-
     A                                      fField":"CODE","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"left":"-45px"-
     A                                      ,"top":"-379px","css class":"profou-
     A                                      nd-converted","grid":"SCR01S","colu-
     A                                      mn":"0"},{"id":"SCAUTH","field type-
     A                                      ":"output field","visibility":"hidd-
     A                                      en","value":{"fieldName":"SCAUTH","-
     A                                      designValue":"[SCAUTH]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none"},"left":"-45px","top":"-
     A                                      -379px","css class":"profound-conve-
     A                                      rted","grid":"SCR01S","column":"0"}-
     A                                      ,{"id":"SCSHNM","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"SCSHNM","designVa-
     A                                      lue":"[SCSHNM]","refField":"DS30","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne"},"left":"-45px","top":"-379px",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR01S","column":"0"},{"id":"-
     A                                      SCFND","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"SCFND","designValue":"[SCF-
     A                                      ND]","refField":"FND","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00"},"left":"--
     A                                      16px","top":"-379px","width":"21px"-
     A                                      ,"text align":"right","css class":"-
     A                                      profound-converted","grid":"SCR01S"-
     A                                      ,"column":"0"},{"id":"SCSEL","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCSEL","designValue":"-
     A                                      [SCSEL]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase","dataLength":"2"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      px","cursor column":"2","top":"1px"-
     A                                      ,"cursor row":"13","width":"15px","-
     A                                      set focus":{"fieldName":"07","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 3":{"fieldName":"05","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"RI","customFalse-
     A                                      ":""},"description":"Selection Fiel-
     A                                      d","css class 4":"profound-converte-
     A                                      d","grid":"SCR01S","column":"0"},{"-
     A                                      id":"SCDATA","field type":"output f-
     A                                      ield","value":{"fieldName":"SCDATA"-
     A                                      ,"designValue":"[SCDATA]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"45"},"css class":"output-fiel-
     A                                      d","left":"5px","cursor column":"6"-
     A                                      ,"top":"1px","cursor row":"13","css-
     A                                       class 2":"profound-converted","gri-
     A                                      d":"SCR01S","column":"1"},{"id":"SC-
     A                                      OUTA","field type":"output field","-
     A                                      value":{"fieldName":"SCOUTA","desig-
     A                                      nValue":"[SCOUTA]","refField":"FLAG-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"58",-
     A                                      "top":"1px","cursor row":"13","css -
     A                                      class 2":"profound-converted","grid-
     A                                      ":"SCR01S","column":"2"},{"id":"SCW-
     A                                      CF#","field type":"output field","v-
     A                                      alue":{"fieldName":"SCWCF#","design-
     A                                      Value":"[SCWCF#]","refField":"FND",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"5px","cursor column":"66","top-
     A                                      ":"1px","cursor row":"13","width":"-
     A                                      21px","text align":"right","css cla-
     A                                      ss 2":"profound-converted","grid":"-
     A                                      SCR01S","column":"3"},{"id":"SCSTAT-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCSTAT","designVal-
     A                                      ue":"[SCSTAT]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"5px","cursor column":"76","top-
     A                                      ":"1px","cursor row":"13","css clas-
     A                                      s 2":"profound-converted","grid":"S-
     A                                      CR01S","column":"4"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        74A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPST1    R        H      REFFLD(DS3)
     A            SCPST2    R        H      REFFLD(DS60)
     A            SCPST3    R        H      REFFLD(DS30)
     A            SCSNAM    R        H      REFFLD(DS40)
     A            SCSUB#    R        H      REFFLD(SUB#)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    22C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      2-23"},"items":[{"id":"F0060F_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "F0060F_SCR01_action","field type":-
     A                                      "html container","white space":"nor-
     A                                      mal","left":"0px","top":"10px","wid-
     A                                      th":"230px","css class":"action-pan-
     A                                      el-converted","height":"700px","htm-
     A                                      l":"<div class=\"top\"></div><div c-
     A                                      lass=\"imagetop\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_top.png\"-
     A                                       /></div><div class=\"menulinks\"><-
     A                                      /div><div class=\"imagebottom\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_bottom.png\" /></div><div clas-
     A                                      s=\"bottom\"></div>"},{"field type"-
     A                                      :"icon menu button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"32px","z index":"20","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1170px","id":"F0060F_SCR01_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon alignment":"middle -
     A                                      left","icon width":"16px","icon hei-
     A                                      ght":"24px","icon source":"/profoun-
     A                                      dui/userdata/images/systool/systool-
     A                                      s.png","data function":"SystemToolb-
     A                                      arSystools","show down arrow":"Yes"-
     A                                      },{"field type":"panel","panel styl-
     A                                      e":"TransformButtonBar","id":"F0060-
     A                                      F_SCR01_ButtonBar","top":"35px","le-
     A                                      ft":"1036px","width":"187px","heigh-
     A                                      t":"28px","css class":"stationary",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1040px","id":"F0060F_SCR01_BtnSave"-
     A                                      ,"tool tip":"Save","onclick":"Syste-
     A                                      mToolbarSave","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/save.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1066px","id":"F0060F_SCR01_B-
     A                                      tnRefresh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"F0060F_SCR01_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"F0060F_SCR01_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"F0060F_SCR01_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0060F_SCR01_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F0060F_SCR01_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"F-
     A                                      0060F_SCR01_MainTabPanel","field ty-
     A                                      pe":"tab panel","tab panel style":"-
     A                                      Transform","tab names":"Tab 1","act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0060F_SCR01_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"F0060F_SCR01_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0060F_SCR01_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0060F_SCR01-
     A                                      _BtnHiddenSearch","value":"btnSearc-
     A                                      h","top":"150px","response":{"field-
     A                                      Name":"btnSearch","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0060F_SCR01_BtnHiddenDiaryIt-
     A                                      ems","value":"btnDiary","top":"175p-
     A                                      x","response":{"fieldName":"btnDiar-
     A                                      y","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0060F_SC-
     A                                      R01_BtnHiddenSystemMessages","value-
     A                                      ":"btnMessage","top":"200px","respo-
     A                                      nse":{"fieldName":"btnMessage","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0060F_SCR01_Btn-
     A                                      HiddenWorkSubmitJob","value":"btnWr-
     A                                      ksbmjob","top":"225px","response":{-
     A                                      "fieldName":"btnWrkJob","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0060F_SCR01_BtnHiddenW-
     A                                      orkPrinterOutput","value":"btnWrkpr-
     A                                      tout","top":"250px","response":{"fi-
     A                                      eldName":"btnWrkPrnt","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0060F_SCR01_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F00-
     A                                      60F_SCR01_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCFKL1"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFKL1","d')
     A                                  1  5HTML('esignValue":"[SCFKL1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"78"},"left":"281px","cursor-
     A                                       column":"2","top":"530px","cursor -
     A                                      row":"22","css class":"BLU","parent-
     A                                       tab panel":"F0060F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","visibility":-
     A                                      "hidden","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCFKL2","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCFKL2","designValue":"[SCFKL2-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"78"},"left":"281px-
     A                                      ","cursor column":"2","top":"550px"-
     A                                      ,"cursor row":"23","css class":"BLU-
     A                                      ","parent tab panel":"F0060F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","vis-
     A                                      ibility":"hidden","css class 2":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnHELP","field t-
     A                                      ype":"button","shortcut key":"Alt-F-
     A                                      1","onclick":"pui.showHelp()","valu-
     A                                      e":"HELP","left":"14px","top":"183p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnPAGEDOWN","field type":"button",-
     A                                      "value":"Page Down","shortcut key":-
     A                                      "PageDown","response":{"fieldName":-
     A                                      "*IN01","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"left":"14px","top":"216px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      PAGEUP","field type":"button","valu-
     A                                      e":"Page Up","shortcut key":"PageUp-
     A                                      ","response":{"fieldName":"*IN02","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"l-
     A                                      eft":"14px","top":"249px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        45A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    14 RSFLSIZ    1    C2    15 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       21 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-21"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"F0060F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"F0060F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"F0060F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      F0060F_SCR02C_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"F0060F_SCR02C_B-
     A                                      tnSave","tool tip":"Save","onclick"-
     A                                      :"SystemToolbarSave","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/save.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1066px","id":"F0060F_-
     A                                      SCR02C_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"F0060F_SCR02C_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"F0060F-
     A                                      _SCR02C_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","bord')
     A                                  1  4HTML('er bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1144px","-
     A                                      id":"F0060F_SCR02C_BtnSystemMessage-
     A                                      s","tool tip":"System Messages","on-
     A                                      click":"SystemToolbarMessages","bac-
     A                                      kground image":{"fieldName":"MsgIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1196px","id":"F0-
     A                                      060F_SCR02C_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"F0060F_SCR02C_ImgSysToo-
     A                                      lBottom","field type":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/systool/butbarbot.png","left":"-
     A                                      1036px","top":"64px","width":"187px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"F0060F_SCR02C_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRD2","designValu-
     A                                      e":"[SCPRD2]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0060F_SCR02C_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant10","fiel-
     A                                      d type":"output field","left":"281p-
     A                                      x","cursor column":"2","top":"110px-
     A                                      ","cursor row":"1","css class":"top-
     A                                      -line","value":"js: currentUser()",-
     A                                      "css class 2":"output-field","paren-
     A                                      t tab panel":"F0060F_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"SCR-
     A                                      02C_SCCONM","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCCONM",-
     A                                      "designValue":"[SCCONM]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"110px","cursor row":-
     A                                      "1","css class 2":"top-line","css c-
     A                                      lass 3":"HI","parent tab panel":"F0-
     A                                      060F_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"constant11","field -
     A                                      type":"output field","left":"778px"-
     A                                      ,"cursor column":"73","top":"110px"-
     A                                      ,"cursor row":"1","css class":"top--
     A                                      line","value":"js: currentDate()","-
     A                                      css class 2":"output-field","parent-
     A                                       tab panel":"F0060F_SCR02C_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"F006-
     A                                      0F_SCR02C_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0060F_SCR-
     A                                      02C_BtnHiddenRefresh","value":"btnR-
     A                                      efresh","top":"125px","response":{"-
     A                                      fieldName":"btnRefresh","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCR0-
     A                                      2C_Q1PGM","field type":"output fiel-
     A                                      d","value":{"fieldName":"Q1PGM","de-
     A                                      signValue":"[Q1PGM]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"css class":"output-field","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"130px","cursor row":"2","paren-
     A                                      t tab panel":"F0060F_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      RD2","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPRD2","design-
     A                                      Value":"[SCPRD2]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"130px","cursor row":"2","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F0060F_SCR02C_MainTabPane')
     A                                  1  5HTML('l","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant12","field type":"output fie-
     A                                      ld","value":"SCR02","css class":"co-
     A                                      nstant","left":"799px","cursor colu-
     A                                      mn":"76","top":"130px","cursor row"-
     A                                      :"2","parent tab panel":"F0060F_SCR-
     A                                      02C_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0060F_SCR0-
     A                                      2C_BtnHiddenSearch","value":"btnSea-
     A                                      rch","top":"150px","response":{"fie-
     A                                      ldName":"btnSearch","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      13","field type":"output field","va-
     A                                      lue":"Press Enter to confirm your c-
     A                                      hoices for 4=Delete.","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"170px","cursor row-
     A                                      ":"4","css class 2":"BLU","parent t-
     A                                      ab panel":"F0060F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0060F_SCR02C_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant14","field t-
     A                                      ype":"output field","value":"Press -
     A                                      F12 to return to change your choice-
     A                                      s.","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      90px","cursor row":"5","css class 2-
     A                                      ":"BLU","parent tab panel":"F0060F_-
     A                                      SCR02C_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0060F_S-
     A                                      CR02C_BtnHiddenSystemMessages","val-
     A                                      ue":"btnMessage","top":"200px","res-
     A                                      ponse":{"fieldName":"btnMessage","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0060F_SCR02C_-
     A                                      BtnHiddenWorkSubmitJob","value":"bt-
     A                                      nWrksbmjob","top":"225px","response-
     A                                      ":{"fieldName":"btnWrkJob","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"S-
     A                                      CR02C_SCHDL1","field type":"output -
     A                                      field","value":{"fieldName":"SCHDL1-
     A                                      ","designValue":"[SCHDL1]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none","dataLen-
     A                                      gth":"74"},"left":"281px","cursor c-
     A                                      olumn":"2","top":"230px","cursor ro-
     A                                      w":"7","css class":"HI","parent tab-
     A                                       panel":"F0060F_SCR02C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted","css class 3":"s-
     A                                      ubfile-heading"},{"id":"SCR02S","fi-
     A                                      eld type":"grid","number of columns-
     A                                      ":"2","record format name":"SCR02S"-
     A                                      ,"subfile next changed":"true","dis-
     A                                      play subfile":{"fieldName":"14","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"display control record":{"fiel-
     A                                      dName":"N13","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"clear subfile"-
     A                                      :{"fieldName":"13","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"subfile -
     A                                      size":"15","header height":"20","ro-
     A                                      w height":"20","css class":"subfile-
     A                                      grid","css class 2":"profound-conve-
     A                                      rted","parent tab panel":"F0060F_SC-
     A                                      R02C_MainTabPanel","parent tab":"0"-
     A                                      ,"subfile end":{"fieldName":"N15","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"page down response":{"fieldN-
     A                                      ame":"*IN01","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"page up response":{"fi-
     A                                      eldName":"*IN02","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"show paging contro-
     A                                      ls":"true","scrollbar":"none","numb-
     A                                      er of rows":"15","top":"230px","lef-
     A                                      t":"276px","column widths":"35,523"-
     A                                      ,"subfile record number":{"fieldNam-
     A                                      e":"SCRRN2","designValue":"[SCRRN2]-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"true","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      ,"dataLength":"4","decPos":"0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0060F_SCR02C_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"')
     A                                  1  6HTML('75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0060F_SCR02C_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"302px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0060F_SCR02-
     A                                      C_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"327px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":"Enter","-
     A                                      shortcut key":"Enter","left":"14px"-
     A                                      ,"top":"150px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF12","field type":"-
     A                                      button","value":"Cancel","shortcut -
     A                                      key":"F12","left":"14px","top":"183-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnHELP","field type":"button","sh-
     A                                      ortcut key":"Alt-F1","onclick":"pui-
     A                                      .showHelp()","value":"HELP","left":-
     A                                      "14px","top":"216px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"SCR02S_SCDBRR","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      SCDBRR","designValue":"[SCDBRR]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"9","decPos":"0"},"left":-
     A                                      "-58px","top":"-279px","width":"63p-
     A                                      x","text align":"right","css class"-
     A                                      :"profound-converted","grid":"SCR02-
     A                                      S","column":"0"},{"id":"SCSF1R","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      CSF1R","designValue":"[SCSF1R]","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"true","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","dat-
     A                                      aLength":"4","decPos":"0"},"left":"-
     A                                      -23px","top":"-279px","width":"28px-
     A                                      ","text align":"right","css class":-
     A                                      "profound-converted","grid":"SCR02S-
     A                                      ","column":"0"},{"id":"SCR02S_SCSEL-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCSEL","designValu-
     A                                      e":"[SCSEL]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none","dataLength":"2"},"cs-
     A                                      s class":"output-field","left":"5px-
     A                                      ","cursor column":"2","top":"1px","-
     A                                      cursor row":"8","description":"Sele-
     A                                      ction Field","css class 2":"profoun-
     A                                      d-converted","grid":"SCR02S","colum-
     A                                      n":"0"},{"id":"SCR02S_SCDATA","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCDATA","designValue":"[S-
     A                                      CDATA]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"45"},"css cl-
     A                                      ass":"output-field","left":"5px","c-
     A                                      ursor column":"7","top":"1px","curs-
     A                                      or row":"8","css class 2":"profound-
     A                                      -converted","grid":"SCR02S","column-
     A                                      ":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        74A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"F0060F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"F0060F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      F0060F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon a-
     A                                      lignment":"middle left","icon width-
     A                                      ":"16px","icon height":"24px","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"F0060F_SCR02_ButtonBar-
     A                                      ","top":"35px","left":"1036px","wid-
     A                                      th":"187px","height":"28px","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den","locked in place":"true"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1040px","id":"F00-
     A                                      60F_SCR02_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1066px","i-
     A                                      d":"F0060F_SCR02_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"F0060F_SCR02-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"F0060F_SCR02_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"F0-
     A                                      060F_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting"')
     A                                  1  4HTML(':"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"F0060F_SCR02_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"F0060F_SCR02_ImgS-
     A                                      ysToolBottom","field type":"image",-
     A                                      "image source":"/profoundui/userdat-
     A                                      a/images/systool/butbarbot.png","le-
     A                                      ft":"1036px","top":"64px","width":"-
     A                                      187px","locked in place":"true","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden"},{"id":"F0060F_SCR02_MainT-
     A                                      abPanel","field type":"tab panel","-
     A                                      tab panel style":"Transform","tab n-
     A                                      ames":"Tab 1","active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F006-
     A                                      0F_SCR02_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"F0060F_S-
     A                                      CR02_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0060F_SCR02_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0060F_SCR02_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0060F_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0060F_SCR02_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0060F_SCR02_BtnHiddenWorkSubmitJ-
     A                                      ob","value":"btnWrksbmjob","top":"2-
     A                                      25px","response":{"fieldName":"btnW-
     A                                      rkJob","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0060-
     A                                      F_SCR02_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"fieldName":"btnWrkP-
     A                                      rnt","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0060F_-
     A                                      SCR02_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0060F_SCR02_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px"')
     A                                  1  5HTML(',"top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnHELP","field t-
     A                                      ype":"button","shortcut key":"Alt-F-
     A                                      1","onclick":"pui.showHelp()","valu-
     A                                      e":"HELP","left":"14px","top":"183p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnPAGEDOWN","field type":"button",-
     A                                      "value":"Page Down","shortcut key":-
     A                                      "PageDown","response":{"fieldName":-
     A                                      "*IN01","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"left":"14px","top":"216px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      PAGEUP","field type":"button","valu-
     A                                      e":"Page Up","shortcut key":"PageUp-
     A                                      ","response":{"fieldName":"*IN02","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"l-
     A                                      eft":"14px","top":"249px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02 89                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC3    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 RERR-
     A                                      MSGID  5    C6    SSSTATC7    MC400-
     A                                      01C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     89')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"constant15","field type":"out-
     A                                      put field","left":"29px","cursor co-
     A                                      lumn":"2","top":"65px","cursor row"-
     A                                      :"1","value":"js: currentUser()","c-
     A                                      ss class":"output-field","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRD3","field type":"output field","-
     A                                      value":{"fieldName":"SCPRD3","desig-
     A                                      nValue":"[SCPRD3]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"127px","cursor column":"16-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant16"-
     A                                      ,"field type":"output field","value-
     A                                      ":"SCR03","css class":"constant","l-
     A                                      eft":"477px","cursor column":"66","-
     A                                      top":"65px","cursor row":"1","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant17","field type":"output -
     A                                      field","value":"Type choices, press-
     A                                       Enter.","css class":"constant","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"105px","cursor row":"3","css cla-
     A                                      ss 2":"BLU","css class 3":"profound-
     A                                      -converted"},{"id":"constant18","fi-
     A                                      eld type":"output field","value":"S-
     A                                      tatus (A/I):","css class":"constant-
     A                                      ","left":"43px","cursor column":"4"-
     A                                      ,"top":"145px","cursor row":"5","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SSSTAT","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SSS-
     A                                      TAT","designValue":"[SSSTAT]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"141px","c-
     A                                      ursor column":"18","top":"145px","c-
     A                                      ursor row":"5","width":"8px","error-
     A                                       message id":"MC40001","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"89","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","css class 3":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"290px","width":"80px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"104px","top":"290px-
     A                                      ","width":"80px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nHELP","field type":"button","short-
     A                                      cut key":"Alt-F1","onclick":"pui.sh-
     A                                      owHelp()","value":"HELP","left":"19-
     A                                      4px","top":"290px","width":"80px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","visibility"-
     A                                      :"hidden","cursor":"default"},{"id"-
     A                                      :"btnPAGEDOWN","field type":"button-
     A                                      ","value":"Page Down","shortcut key-
     A                                      ":"PageDown","response":{"fieldName-
     A                                      ":"*IN01","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"284px","top":"290p-
     A                                      x","width":"80px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","visibility":"hidden","curso-
     A                                      r":"default"},{"id":"btnPAGEUP","fi-
     A                                      eld type":"button","value":"Page Up-
     A                                      ","shortcut key":"PageUp","response-
     A                                      ":{"fieldName":"*IN02","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"374px-
     A                                      ","top":"290px","width":"80px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","visibility":"h-
     A                                      idden","cursor":"default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SSSTAT    R        H      REFFLD(FLAG)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"F0060F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"F0060F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"F0060F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"F0060F_MSGSFLC-
     A                                      _ButtonBar","top":"35px","left":"10-
     A                                      36px","width":"187px","height":"28p-
     A                                      x","css class":"stationary","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1040px"-
     A                                      ,"id":"F0060F_MSGSFLC_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1066px","id":"F0060F_MSGSFLC_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"F0060F_MSGSFLC_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"F0060F_MSGSFLC_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"F0060F_MSGSFLC_BtnS-
     A                                      ystemMessages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType"')
     A                                  1  4HTML(':"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"F0060F_MSG-
     A                                      SFLC_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"F0060F_MSGSFLC_ImgSysToolBotto-
     A                                      m","field type":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/butbarbot.png","left":"1036px-
     A                                      ","top":"64px","width":"187px","loc-
     A                                      ked in place":"true","css class":"s-
     A                                      tationary","visibility":"hidden"},{-
     A                                      "id":"F0060F_MSGSFLC_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":"Ta-
     A                                      b 1","active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0060F_MSGSFL-
     A                                      C_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"F0060F_MSGSFLC_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0060F_MSGSFLC_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0060F_MSGSFLC_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0060F_MSGSF-
     A                                      LC_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0060F_MSGSFLC_BtnHiddenS-
     A                                      ystemMessages","value":"btnMessage"-
     A                                      ,"top":"200px","response":{"fieldNa-
     A                                      me":"btnMessage","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0060F_MSGSFLC_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0060F_MSGSFLC_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0060F_MSGSFLC_BtnHiddenImageQueue"-
     A                                      ,"value":"btnImgQue","top":"275px",-
     A                                      "response":{"fieldName":"btnImgQue"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0060F_MSGS-
     A                                      FLC_BtnHiddenHelp","value":"btnHelp-
     A                                      ","top":"300px","response":{"fieldN-
     A                                      ame":"btnHelp","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"MSGSFL","fiel-
     A                                      d type":"grid","number of ')
     A                                  1  5HTML('columns":"1","record format n-
     A                                      ame":"MSGSFL","display subfile":"tr-
     A                                      ue","display control record":"true"-
     A                                      ,"subfile size":"5","initialize sub-
     A                                      file":"true","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","parent tab p-
     A                                      anel":"F0060F_MSGSFLC_MainTabPanel"-
     A                                      ,"parent tab":"0","subfile end":{"f-
     A                                      ieldName":"N10","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"number of r-
     A                                      ows":"1","has header":"false","subf-
     A                                      ile program message queue":{"fieldN-
     A                                      ame":"Q1PGM","dataLength":"10","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"su-
     A                                      bfile control program message queue-
     A                                      ":{"fieldName":"Q1PGM","dataLength"-
     A                                      :"10","trimLeading":"false","trimTr-
     A                                      ailing":"true","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"subfile message key":{"fiel-
     A                                      dName":"MSGKEY","dataLength":"4","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      top":"570px","left":"269px","column-
     A                                       widths":"595"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnHELP","field type-
     A                                      ":"button","shortcut key":"Alt-F1",-
     A                                      "onclick":"pui.showHelp()","value":-
     A                                      "HELP","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      PAGEDOWN","field type":"button","va-
     A                                      lue":"Page Down","shortcut key":"Pa-
     A                                      geDown","response":{"fieldName":"*I-
     A                                      N01","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"14px","top":"216px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnPAG-
     A                                      EUP","field type":"button","value":-
     A                                      "Page Up","shortcut key":"PageUp","-
     A                                      response":{"fieldName":"*IN02","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"left-
     A                                      ":"14px","top":"249px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
