     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  10 11 12
     A  13 15 21
     A  22 24 25                            CA01(10 'Response Indicator *IN10')
     A  26 27 28
     A  29 32 33
     A  34 35 37                            CA02(11 'Response Indicator *IN11')
     A  38 39 40
     A  41 44 45
     A  46 47 48                            CA03(12 'Response Indicator *IN12')
     A  49 51 52
     A  53 54 55
     A  56 57 74                            CA04(13 'Response Indicator *IN13')
     A  92 93 99                            CA05(15 'Response Indicator *IN15')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(40 'Response Indicator *IN40')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                      SETOF(44 'Response Indicator *IN44')
     A                                      SETOF(45 'Response Indicator *IN45')
     A                                      SETOF(46 'Response Indicator *IN46')
     A                                      SETOF(47 'Response Indicator *IN47')
     A                                      SETOF(48 'Response Indicator *IN48')
     A                                      SETOF(49 'Response Indicator *IN49')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                      SETOF(55 'Response Indicator *IN55')
     A                                      SETOF(56 'Response Indicator *IN56')
     A                                      SETOF(57 'Response Indicator *IN57')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(92 'Response Indicator *IN92')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                  1  2HTML('QPUIREC37   RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCSUB#C7    MCR0508C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     11RERRMS-
     A                                      GID  5    C5    SCSS#C7    MCR0503C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           25RERRMSGID  5    C5    SCSS#C-
     A                                      7    MCR0719C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     22RERRMSGID  5   -
     A                                       C5    SCSS#C7    MCR0712C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     29RE-
     A                                      RRMSGID  5    C5    SCSS#C7    MCR0-
     A                                      205C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     27RERRMSGID  5    C6    SC-
     A                                      ACDTC7    MCR0502C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     21RERRMSGID -
     A                                       5    C6    SCACDTC7    MCR0719C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        22RERRMSGID  5    C6    SCACDTC7 -
     A                                         MCR0500C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     24RERRMSGID  5    C-
     A                                      6    SCACDTC7    MCR0712C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     29RER-
     A                                      RMSGID  5    C6    SCACDTC7    MCR0-
     A                                      205C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     27RERRMSGID  5    C6    SC-
     A                                      FEINC7    MCR0546C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     74RERRMSGID -
     A                                       5    C6    SCFEINC7    MCR0763C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        37RERRMSGID  5    C6    SCFEINC7 -
     A                                         MCR0457C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     48RERRMSGID  5    C-
     A                                      5    SCMODC7    MCR0546C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     74RERR-
     A                                      MSGID  5    C5    SCMODC7    MCR076-
     A                                      3C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     37RERRMSGID  5    C5    SCMO-
     A                                      DC7    MCR0457C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     48RERRMSGID  5 -
     A                                         C5    SCSYSC7    MCR0727C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     26-
     A                                      RERRMSGID  5    C5    SCSYSC7    MC-
     A                                      R0825C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     28RERRMSGID  5    C5    -
     A                                      SCSYSC7    MCR0328C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     38RERRMSGID-
     A                                        5    C5    SCSYSC7    MCR0330C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        10RERRMSGID  5    C6    SCPRTYC7 -
     A                                         MCR0704C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     32RERRMSGID  5    C-
     A                                      6    SCPRTYC7    MCR0704C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     15RER-
     A                                      RMSGID  5    C6    SCPRTYC7    MCR0-
     A                                      397C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     41RERRMSGID  5    C6    SC-
     A                                      PRTYC7    MCR0414C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     44RERRMSGID -
     A                                       5    C6    SCTYPEC7    MCR0451C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        45RERRMSGID  5    C6    SCTYPEC7 -
     A                                         MCR0452C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     46RERRMSGID  5    C-
     A                                      5    SCASTC7    MCR0504C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     39RERR-
     A                                      MSGID  5    C5    SCASTC7    MCR076-
     A                                      6C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     40RERRMSGID  5    C4    SCAR-
     A                                      C7    MCR0494C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     49RERRMSGID  5  -
     A                                        C4    SCARC7    MCR0495')
     A                                  1  2HTML('QPUIC6    FSMESGC5    *LIBLC0-
     A                                          E1    3     52RERRMSGID  5    C-
     A                                      4    SCARC7    MCR0496C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     53RERRM-
     A                                      SGID  5    C4    SCARC7    MCR0497C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           54RERRMSGID  5    C4    SCARC7-
     A                                          MCR0636C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     55RERRMSGID  5    -
     A                                      C6    SCEOB#C7    MCR0721C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     51RE-
     A                                      RRMSGID  5    C6    SCEOB#C7    MCR-
     A                                      0637C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     56RERRMSGID  5    C6    S-
     A                                      CEOB#C7    MCR0638C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     57')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"set cursor row":-
     A                                      {"fieldName":"SCLINE","dataLength":-
     A                                      "3","decPos":"0","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","dataType":"zoned"-
     A                                      ,"formatting":"Number","units":"","-
     A                                      negNum":"-999.00"},"set cursor colu-
     A                                      mn":{"fieldName":"SCPOS","dataLengt-
     A                                      h":"3","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","dataType":"zon-
     A                                      ed","formatting":"Number","units":"-
     A                                      ","negNum":"-999.00"},"set off":{"f-
     A                                      ieldName":"*IN10","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 2":{"fiel-
     A                                      dName":"*IN11","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 3":{"fieldNa-
     A                                      me":"*IN13","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 4":{"fieldName"-
     A                                      :"*IN15","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 5":{"fieldName":"*-
     A                                      IN21","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 6":{"fieldName":"*IN2-
     A                                      2","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 7":{"fieldName":"*IN24",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 8":{"fieldName":"*IN25","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 9":{"fieldName":"*IN26","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 10":{"fieldName":"*IN27","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      11":{"fieldName":"*IN28","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 12-
     A                                      ":{"fieldName":"*IN29","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 13":-
     A                                      {"fieldName":"*IN32","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 14":{"-
     A                                      fieldName":"*IN33","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 15":{"fi-
     A                                      eldName":"*IN34","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set')
     A                                  1  2HTML(' off 16":{"fieldName":"*IN35"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 17":{"fieldName":"*IN37","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 18":{"fieldName":"*IN38","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 19":{"fieldName":"*IN39","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 20":{"fieldName":"*IN40","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       21":{"fieldName":"*IN41","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 2-
     A                                      2":{"fieldName":"*IN44","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 23"-
     A                                      :{"fieldName":"*IN45","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 24":{-
     A                                      "fieldName":"*IN46","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 25":{"f-
     A                                      ieldName":"*IN47","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 26":{"fie-
     A                                      ldName":"*IN48","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 27":{"field-
     A                                      Name":"*IN49","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 28":{"fieldNa-
     A                                      me":"*IN51","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 29":{"fieldName-
     A                                      ":"*IN52","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 30":{"fieldName":-
     A                                      "*IN53","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 31":{"fieldName":"*-
     A                                      IN54","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 32":{"fieldName":"*IN-
     A                                      55","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 33":{"fieldName":"*IN56-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 34":{"fieldName":"*IN57",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 35":{"fieldName":"*IN74","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 36":{"fieldName":"*IN92","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 37":{"fieldName":"*IN93","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"valid -
     A                                      command key":{"fieldName":"*IN12","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"o-
     A                                      verlay range":"1-24"},"items":[{"id-
     A                                      ":"HFLD","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"HFLD","des')
     A                                  1  2HTML('ignValue":"[HFLD]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"left":"0px","top":"-30px"-
     A                                      ,"css class":"profound-converted"},-
     A                                      {"id":"SCPOS","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"SCPOS","designValue-
     A                                      ":"[SCPOS]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"3","decPos-
     A                                      ":"0"},"left":"0px","top":"-30px","-
     A                                      width":"21px","text align":"right",-
     A                                      "css class":"profound-converted"},{-
     A                                      "id":"SCLINE","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"SCLINE","designValu-
     A                                      e":"[SCLINE]","dataType":"zoned","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","dataLength":"3","decP-
     A                                      os":"0"},"left":"0px","top":"-30px"-
     A                                      ,"width":"21px","text align":"right-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"HREC","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"HREC","designValue"-
     A                                      :"[HREC]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none","dataLength":"10"},"left"-
     A                                      :"0px","top":"-30px","css class":"p-
     A                                      rofound-converted"},{"id":"F0090F_S-
     A                                      CR01_avKeys","field type":"output f-
     A                                      ield","value":{"fieldName":"AV_KEYS-
     A                                      ","dataLength":"1134","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[AV_KEYS]"},"left":"0px","t-
     A                                      op":"0px","visibility":"hidden"},{"-
     A                                      id":"F0090F_SCR01_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"F0090F_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButton')
     A                                  1  2HTML('Bar","id":"F0090F_SCR01_Butto-
     A                                      nBar","top":"35px","left":"1036px",-
     A                                      "width":"187px","height":"28px","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden","locked in place":"true"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1040px","id":-
     A                                      "F0090F_SCR01_BtnSave","tool tip":"-
     A                                      Save","onclick":"SystemToolbarSave"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/save.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1066px-
     A                                      ","id":"F0090F_SCR01_BtnRefresh","t-
     A                                      ool tip":"Refresh","onclick":"Syste-
     A                                      mToolbarRefresh","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/refresh.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1092px","id":"F0090F_S-
     A                                      CR01_BtnSearch","tool tip":"Search"-
     A                                      ,"onclick":"SystemToolbarSearch","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/search.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1118px"-
     A                                      ,"id":"F0090F_SCR01_BtnDiaryItems",-
     A                                      "tool tip":"Diary/Work Items - IDAR-
     A                                      TS","onclick":"SystemToolbarDiary",-
     A                                      "background image":{"fieldName":"Dr-
     A                                      yIcnURL","dataLength":"128","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"}}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border')
     A                                  1  2HTML(' top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1144px","id":"F0090F_SCR01_-
     A                                      BtnSystemMessages","tool tip":"Syst-
     A                                      em Messages","onclick":"SystemToolb-
     A                                      arMessages","background image":{"fi-
     A                                      eldName":"MsgIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1196px","id":"F0090F_SCR01_BtnHelp"-
     A                                      ,"tool tip":"Help","onclick":"Syste-
     A                                      mToolbarHelp","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/help.png'')"},{"id":"F0090F_S-
     A                                      CR01_ImgSysToolBottom","field type"-
     A                                      :"image","image source":"/profoundu-
     A                                      i/userdata/images/systool/butbarbot-
     A                                      .png","left":"1036px","top":"64px",-
     A                                      "width":"187px","locked in place":"-
     A                                      true","css class":"stationary","vis-
     A                                      ibility":"hidden"},{"id":"F0090F_SC-
     A                                      R01_MainTabPanel","field type":"tab-
     A                                       panel","tab panel style":"Transfor-
     A                                      m","tab names":{"fieldName":"SCPRDS-
     A                                      ","designValue":"[SCPRDS]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0090F_SCR01_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCUSE-
     A                                      R","field type":"output field","val-
     A                                      ue":{"fieldName":"SCUSER","designVa-
     A                                      lue":"[SCUSER]","refField":"USER","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","parent tab pane-
     A                                      l":"F0090F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCCONM","field-
     A                                       type":"output field"')
     A                                  1  2HTML(',"value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","des-
     A                                      cription":"COMPANY NAME","parent ta-
     A                                      b panel":"F0090F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      1","field type":"output field","lef-
     A                                      t":"778px","cursor column":"73","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass":"top-line","value":"js: curren-
     A                                      tDate()","css class 2":"output-fiel-
     A                                      d","parent tab panel":"F0090F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"F0090F_SCR01_fkeyMenu","field -
     A                                      type":"menu","left":"10px","top":"1-
     A                                      20px","height":"350px","width":"230-
     A                                      px","hover background color":"#9AAA-
     A                                      61","hover text color":"#FFFFFF","b-
     A                                      order color":"#4C6106","menu option-
     A                                       indent":"10px","background color":-
     A                                      "#758B27","css class":"action-menu"-
     A                                      ,"css class 2":"stationary","z inde-
     A                                      x":"101"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      090F_SCR01_BtnHiddenRefresh","value-
     A                                      ":"btnRefresh","top":"125px","respo-
     A                                      nse":{"fieldName":"btnRefresh","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant2","field type":"output -
     A                                      field","value":"F0090F","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"F0090F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCPRDS","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      PRDS","designValue":"[SCPRDS]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"414px","cursor-
     A                                       column":"21","top":"130px","cursor-
     A                                       row":"2","description":"PROGRAM NA-
     A                                      ME","parent tab panel":"F0090F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","v-
     A                                      isibility":"hidden","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t3","field type":"output field","va-
     A                                      lue":"SCR01","css class":"constant"-
     A                                      ,"left":"799px","cursor column":"76-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F0090F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default')
     A                                  1  2HTML('","visibility":"hidden","id":-
     A                                      "F0090F_SCR01_BtnHiddenSearch","val-
     A                                      ue":"btnSearch","top":"150px","resp-
     A                                      onse":{"fieldName":"btnSearch","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"Subscriber:","css c-
     A                                      lass":"constant","left":"288px","cu-
     A                                      rsor column":"3","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"F0-
     A                                      090F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCSUB#","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCSUB#","designValue":"[SCSUB#]"-
     A                                      ,"refField":"PREF01/SUB# *LIBL/FSRE-
     A                                      FP","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"372px","cursor column":"15-
     A                                      ","top":"170px","cursor row":"4","w-
     A                                      idth":"35px","text align":"right","-
     A                                      css class 2":"HI","error message id-
     A                                      ":"MCR0508","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "11","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"F0090F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCSBNM","field type":"output field-
     A                                      ","value":{"fieldName":"SCSBNM","de-
     A                                      signValue":"[SCSBNM]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"421px","cursor column":-
     A                                      "22","top":"170px","cursor row":"4"-
     A                                      ,"css class 2":"HI","description":"-
     A                                      SUBSCRIBER NAME","parent tab panel"-
     A                                      :"F0090F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0090F_SCR01_BtnHiddenDiaryItems","-
     A                                      value":"btnDiary","top":"175px","re-
     A                                      sponse":{"fieldName":"btnDiary","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant5","field type":"output-
     A                                       field","value":"Group.....:","css -
     A                                      class":"constant","left":"288px","c-
     A                                      ursor column":"3","top":"190px","cu-
     A                                      rsor row":"5","parent tab panel":"F-
     A                                      0090F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCFND","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCFND","designValue":"[SCFND]","-
     A                                      refField":"FND","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym')
     A                                  1  2HTML('":"","units":"","negNum":"999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"372px","cursor column":"15","-
     A                                      top":"190px","cursor row":"5","widt-
     A                                      h":"21px","text align":"right","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F0090F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCGRNM","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCGRNM","designValue":"[SCGRNM-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"421px",-
     A                                      "cursor column":"22","top":"190px",-
     A                                      "cursor row":"5","css class 2":"HI"-
     A                                      ,"description":"FUND NAME","parent -
     A                                      tab panel":"F0090F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0090F_SCR01_BtnHiddenSys-
     A                                      temMessages","value":"btnMessage","-
     A                                      top":"200px","response":{"fieldName-
     A                                      ":"btnMessage","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0090F_SCR01_BtnHiddenWorkSubmit-
     A                                      Job","value":"btnWrksbmjob","top":"-
     A                                      225px","response":{"fieldName":"btn-
     A                                      WrkJob","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant6","field ty-
     A                                      pe":"output field","value":"Social -
     A                                      Security Number.","css class":"cons-
     A                                      tant","left":"386px","cursor column-
     A                                      ":"17","top":"230px","cursor row":"-
     A                                      7","parent tab panel":"F0090F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCSS#","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCSS-
     A                                      #","designValue":"[SCSS#]","refFiel-
     A                                      d":"SS#","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"554px","curso-
     A                                      r column":"41","top":"230px","curso-
     A                                      r row":"7","width":"64px","set focu-
     A                                      s":{"fieldName":"13","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"error -
     A                                      message id":"MCR0503","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"25","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"4 -
     A                                      messages","error message id 2":"MCR-
     A                                      0719","error message file 2":"FSMES-
     A                                      G","error message lib')
     A                                  1  2HTML('rary 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"22","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 3":"MCR0712","error message-
     A                                       file 3":"FSMESG","error message li-
     A                                      brary 3":"*LIBL","error condition 3-
     A                                      ":{"fieldName":"29","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 4":"MCR0205","error message file-
     A                                       4":"FSMESG","error message library-
     A                                       4":"*LIBL","error condition 4":{"f-
     A                                      ieldName":"27","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"description":"SOCIA-
     A                                      L SECURITY NUMBER","parent tab pane-
     A                                      l":"F0090F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant7","fi-
     A                                      eld type":"output field","value":"A-
     A                                      ccident Date..........","css class"-
     A                                      :"constant","left":"386px","cursor -
     A                                      column":"17","top":"250px","cursor -
     A                                      row":"8","parent tab panel":"F0090F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCACDT","field type":"da-
     A                                      te field","css class":"input","css -
     A                                      class 2":"date-field","value":{"fie-
     A                                      ldName":"SCACDT","designValue":"[SC-
     A                                      ACDT]","refField":"DT8","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","numBl-
     A                                      ankFill":"true","edtWrd":"''  /  / -
     A                                         ''","dateFormat":"m/d/Y"},"left"-
     A                                      :"554px","cursor column":"41","top"-
     A                                      :"250px","cursor row":"8","width":"-
     A                                      71px","text align":"right","error m-
     A                                      essage id":"MCR0502","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"21","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"5 m-
     A                                      essages","error message id 2":"MCR0-
     A                                      719","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      22","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 3":"MCR0500",-
     A                                      "error message file 3":"FSMESG","er-
     A                                      ror message library 3":"*LIBL","err-
     A                                      or condition 3":{"fieldName":"24","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 4":"MCR0712","erro-
     A                                      r message file 4":"FSMESG","error m-
     A                                      essage library 4":"*LIBL","error co-
     A                                      ndition 4":{"fieldName":"29","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 5":"MCR0205","error mes-
     A                                      sage file 5":"FSMESG","error messag-
     A                                      e library 5":"*LIBL","error conditi-
     A                                      on 5":{"fieldName":"27","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"descriptio-
     A                                      n":"Accident date","p')
     A                                  1  2HTML('arent tab panel":"F0090F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0090F_SCR01_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0090F_SCR01_Bt-
     A                                      nHiddenImageQueue","value":"btnImgQ-
     A                                      ue","top":"275px","response":{"fiel-
     A                                      dName":"btnImgQue","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant8-
     A                                      ","field type":"output field","valu-
     A                                      e":"Provider/Mod...........","css c-
     A                                      lass":"constant","left":"386px","cu-
     A                                      rsor column":"17","top":"290px","cu-
     A                                      rsor row":"10","parent tab panel":"-
     A                                      F0090F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCFEIN","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCFEIN","designValue":"[SC-
     A                                      FEIN]","refField":"FEIN","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00","numBl-
     A                                      ankFill":"true"},"left":"554px","cu-
     A                                      rsor column":"41","top":"290px","cu-
     A                                      rsor row":"10","width":"64px","text-
     A                                       align":"right","set focus":{"field-
     A                                      Name":"47","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"MCR0546","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "74","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"3 messages",-
     A                                      "error message id 2":"MCR0763","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"37","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 3":"MCR0457","error me-
     A                                      ssage file 3":"FSMESG","error messa-
     A                                      ge library 3":"*LIBL","error condit-
     A                                      ion 3":{"fieldName":"48","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"descripti-
     A                                      on":"FEDERAL TAX ID","parent tab pa-
     A                                      nel":"F0090F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SCMOD","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCMOD","designValue":-
     A                                      "[SCMOD]","refField":')
     A                                  1  2HTML('"MOD","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00","numBlankFill":"tru-
     A                                      e"},"left":"624px","cursor column":-
     A                                      "51","top":"290px","cursor row":"10-
     A                                      ","width":"22px","text align":"righ-
     A                                      t","error message id":"MCR0546","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"74","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"3 messages","error message -
     A                                      id 2":"MCR0763","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"37","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 3"-
     A                                      :"MCR0457","error message file 3":"-
     A                                      FSMESG","error message library 3":"-
     A                                      *LIBL","error condition 3":{"fieldN-
     A                                      ame":"48","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"description":"MODIFIER",-
     A                                      "parent tab panel":"F0090F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0090F_SCR01_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant9","field typ-
     A                                      e":"output field","value":"System .-
     A                                      ...............","css class":"const-
     A                                      ant","left":"386px","cursor column"-
     A                                      :"17","top":"350px","cursor row":"1-
     A                                      3","parent tab panel":"F0090F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCSYS","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCSY-
     A                                      S","designValue":"[SCSYS]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"554px","curs-
     A                                      or column":"41","top":"350px","curs-
     A                                      or row":"13","width":"8px","set foc-
     A                                      us":{"fieldName":"33","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message id":"MCR0727","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"26","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"4-
     A                                       messages","error message id 2":"MC-
     A                                      R0825","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"28","dataType":"exp')
     A                                  1  2HTML('ression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 3":"MCR0328","error messag-
     A                                      e file 3":"FSMESG","error message l-
     A                                      ibrary 3":"*LIBL","error condition -
     A                                      3":{"fieldName":"38","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                       id 4":"MCR0330","error message fil-
     A                                      e 4":"FSMESG","error message librar-
     A                                      y 4":"*LIBL","error condition 4":{"-
     A                                      fieldName":"10","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"description":"Syst-
     A                                      em Type","parent tab panel":"F0090F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant10","field type"-
     A                                      :"output field","value":"Bill Type.-
     A                                      .............","css class":"constan-
     A                                      t","left":"386px","cursor column":"-
     A                                      17","top":"370px","cursor row":"14"-
     A                                      ,"parent tab panel":"F0090F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCPRTY","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCPRT-
     A                                      Y","designValue":"[SCPRTY]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"554px","cur-
     A                                      sor column":"41","top":"370px","cur-
     A                                      sor row":"14","width":"8px","set fo-
     A                                      cus":{"fieldName":"34","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"MCR0704","error mess-
     A                                      age file":"FSMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"32","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      4 messages","error message id 2":"M-
     A                                      CR0704","error message file 2":"FSM-
     A                                      ESG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"15","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 3":"MCR039-
     A                                      7","error message file 3":"FSMESG",-
     A                                      "error message library 3":"*LIBL","-
     A                                      error condition 3":{"fieldName":"41-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 4":"MCR0414","e-
     A                                      rror message file 4":"FSMESG","erro-
     A                                      r message library 4":"*LIBL","error-
     A                                       condition 4":{"fieldName":"44","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"de-
     A                                      scription":"Prov/BILL Type","parent-
     A                                       tab panel":"F0090F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant11","field type":"output field",-
     A                                      "value":"(N = Medical Bill)","css c-
     A                                      lass":"constant","left":"582px","cu-
     A                                      rsor column":"45","top":"370px","cu-
     A                                      rsor row":"14","paren')
     A                                  1  2HTML('t tab panel":"F0090F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant12","field type":"output -
     A                                      field","value":"(H = Hospital Bill)-
     A                                      ","css class":"constant","left":"58-
     A                                      2px","cursor column":"45","top":"39-
     A                                      0px","cursor row":"15","parent tab -
     A                                      panel":"F0090F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCSMSG","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCSMSG","designValue":-
     A                                      "[SCSMSG]","refField":"PREF01/DS13 -
     A                                      *LIBL/FSREFP","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"582px","cursor-
     A                                       column":"45","top":"410px","cursor-
     A                                       row":"16","parent tab panel":"F009-
     A                                      0F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCSMS1","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCSMS1","designValue":"[SCSMS1]","-
     A                                      refField":"PREF01/DS17 *LIBL/FSREFP-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"680px","cursor column":"59-
     A                                      ","top":"410px","cursor row":"16","-
     A                                      parent tab panel":"F0090F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant13","field type":"output f-
     A                                      ield","value":"Bill Sub-Type.......-
     A                                      ...","css class":"constant","left":-
     A                                      "386px","cursor column":"17","top":-
     A                                      "430px","cursor row":"17","parent t-
     A                                      ab panel":"F0090F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCTYPE"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCTYPE","design-
     A                                      Value":"[SCTYPE]","refField":"PREF0-
     A                                      1/DS3 *LIBL/FSREFP","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","left":"55-
     A                                      4px","cursor column":"41","top":"43-
     A                                      0px","cursor row":"17","width":"22p-
     A                                      x","error message id":"MCR0451","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"45","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"2 messages","error message -
     A                                      id 2":"MCR0452","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"46","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"parent tab panel":"-
     A                                      F0090F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant14","field-
     A                                       type":"output field"')
     A                                  1  2HTML(',"value":"Override to Adj Sta-
     A                                      te..","css class":"constant","left"-
     A                                      :"386px","cursor column":"17","top"-
     A                                      :"470px","cursor row":"19","parent -
     A                                      tab panel":"F0090F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCAST"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCAST","designV-
     A                                      alue":"[SCAST]","refField":"PREF01/-
     A                                      ST *LIBL/FSREFP","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"554px-
     A                                      ","cursor column":"41","top":"470px-
     A                                      ","cursor row":"19","width":"15px",-
     A                                      "error message id":"MCR0504","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"39","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0766","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"40","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F00-
     A                                      90F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant15","field ty-
     A                                      pe":"output field","value":"Audit/R-
     A                                      econ............","css class":"cons-
     A                                      tant","visibility":{"fieldName":"99-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"386px","cursor-
     A                                       column":"17","top":"510px","cursor-
     A                                       row":"21","parent tab panel":"F009-
     A                                      0F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCAR","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCAR","designValue":"[SCAR]","re-
     A                                      fField":"PREF01/FLAG *LIBL/FSREFP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"99"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"554px","cursor -
     A                                      column":"41","top":"510px","cursor -
     A                                      row":"21","width":"8px","error mess-
     A                                      age id":"MCR0494","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"49","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"5 mess-
     A                                      ages","error message id 2":"MCR0495-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"52"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 3"')
     A                                  1  2HTML(':"MCR0496","error message fil-
     A                                      e 3":"FSMESG","error message librar-
     A                                      y 3":"*LIBL","error condition 3":{"-
     A                                      fieldName":"53","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 4-
     A                                      ":"MCR0497","error message file 4":-
     A                                      "FSMESG","error message library 4":-
     A                                      "*LIBL","error condition 4":{"field-
     A                                      Name":"54","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 5":"MC-
     A                                      R0636","error message file 5":"FSME-
     A                                      SG","error message library 5":"*LIB-
     A                                      L","error condition 5":{"fieldName"-
     A                                      :"55","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"F0090F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant16","field type":"o-
     A                                      utput field","value":"EOMB#........-
     A                                      ..........","css class":"constant",-
     A                                      "visibility":{"fieldName":"99","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"386px","cursor colum-
     A                                      n":"17","top":"530px","cursor row":-
     A                                      "22","parent tab panel":"F0090F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCEOB#","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CEOB#","designValue":"[SCEOB#]","re-
     A                                      fField":"PREF01/EOB# *LIBL/FSREFP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","numBlankFill":"true"},"visibil-
     A                                      ity":{"fieldName":"99","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"554px","cursor column":"41",-
     A                                      "top":"530px","cursor row":"22","wi-
     A                                      dth":"64px","text align":"right","e-
     A                                      rror message id":"MCR0721","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"51","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"3 messages","error message id 2"-
     A                                      :"MCR0637","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"56","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MCR-
     A                                      0638","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "57","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"F0090F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant17","field type":"ou-
     A                                      tput field","value":"        ","css-
     A                                       class":"constant","left":"428px","-
     A                                      cursor column":"23","')
     A                                  1  2HTML('top":"550px","cursor row":"23-
     A                                      ","parent tab panel":"F0090F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant18","field type":"outpu-
     A                                      t field","value":"          ","css -
     A                                      class":"constant","left":"610px","c-
     A                                      ursor column":"49","top":"550px","c-
     A                                      ursor row":"23","parent tab panel":-
     A                                      "F0090F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCCMD1","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCMD1","designValue":"[SCCMD-
     A                                      1]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"78"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"570px","curs-
     A                                      or row":"24","css class 2":"BLU","d-
     A                                      escription":"CMD KEYS","parent tab -
     A                                      panel":"F0090F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"btnSubmit"-
     A                                      ,"field type":"button","value":"Ent-
     A                                      er","shortcut key":"Enter","left":"-
     A                                      14px","top":"150px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF03","field ty-
     A                                      pe":"button","value":"F3","shortcut-
     A                                       key":"F3","left":"14px","top":"183-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF10","field type":"button","va-
     A                                      lue":"F10","shortcut key":"F10","le-
     A                                      ft":"14px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF11","fie-
     A                                      ld type":"button","value":"F11","sh-
     A                                      ortcut key":"F11","left":"14px","to-
     A                                      p":"249px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF13","field type":"butt-
     A                                      on","value":"F13","shortcut key":"F-
     A                                      13","left":"14px","top":"282px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      4","field type":"button","value":"F-
     A                                      14","shortcut key":"F14","left":"14-
     A                                      px","top":"315px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF15","field type-
     A                                      ":"button","value":"F15","shortcut -
     A                                      key":"F15","left":"14px","top":"348-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF16","field type":"button","va-
     A                                      lue":"F16","shortcut key":"F16","le-
     A                                      ft":"14px","top":"381px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF18","fie-
     A                                      ld type":"button","value":"F18","sh-
     A                                      ortcut key":"F18","le')
     A                                  1  2HTML('ft":"14px","top":"414px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF21-
     A                                      ","field type":"button","value":"F2-
     A                                      1","shortcut key":"F21","left":"14p-
     A                                      x","top":"447px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF23","field type"-
     A                                      :"button","visibility":{"fieldName"-
     A                                      :"99","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":"F23","sho-
     A                                      rtcut key":"F23","left":"14px","top-
     A                                      ":"480px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF24","field type":"butto-
     A                                      n","value":"F24","shortcut key":"F2-
     A                                      4","left":"14px","top":"513px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnHELP-
     A                                      ","field type":"button","shortcut k-
     A                                      ey":"F1","onclick":"pui.showHelp()"-
     A                                      ,"value":"HELP","left":"14px","top"-
     A                                      :"546px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCCMD1        78A  H
     A            SCLINE         3S 0H
     A            SCPOS          3S 0H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCAR      R        H      REFFLD(PREF01/FLAG *LIBL/FSREFP)
     A            SCAST     R        H      REFFLD(PREF01/ST *LIBL/FSREFP)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEOB#    R        H      REFFLD(PREF01/EOB# *LIBL/FSREFP)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCFND     R        H      REFFLD(FND)
     A            SCGRNM    R        H      REFFLD(NAME)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPRTY    R        H      REFFLD(FLAG)
     A            SCSBNM    R        H      REFFLD(NAME)
     A            SCSMS1    R        H      REFFLD(PREF01/DS17 *LIBL/FSREFP)
     A            SCSMSG    R        H      REFFLD(PREF01/DS13 *LIBL/FSREFP)
     A            SCSS#     R        H      REFFLD(SS#)
     A            SCSUB#    R        H      REFFLD(PREF01/SUB# *LIBL/FSREFP)
     A            SCSYS     R        H      REFFLD(FLAG)
     A            SCTYPE    R        H      REFFLD(PREF01/DS3 *LIBL/FSREFP)
     A            SCUSER    R        H      REFFLD(USER)
