     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 12 20
     A  11 13 14
     A  15 16 17                            CA01(10 'Response Indicator *IN10')
     A  18 21 22
     A  23 25 26
     A  27 28 29                            CA02(12 'Response Indicator *IN12')
     A  30 31 32
     A  38 39 40
     A  41 42 52                            CA03(20 'Response Indicator *IN20')
     A  43 44 45
     A  46 47 48
     A  49 50 51                            CA04
     A  53 54 55
     A  56 57 58
     A  59 61 62                            CA05
     A  63 64 65
     A  66 67 68
     A  69 71 72                            CA06
     A  73 74 75
     A  33 76 34
     A  77 78 35                            CA07
     A  79 36 80
     A  81 82 83
     A  84 37 85                            CA08
     A  86 87 88
     A  89 97 98
     A  99                                  CA09
     A                                  1  2HTML('QPUIREC91   RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCDT07C7    MCR0500C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C6    SCDT07C7    MCR2403-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     30RERRMSGID  5    C6    SCDT0-
     A                                      7C7    MCR0572C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     31RERRMSGID  5 -
     A                                         C6    SCDT07C7    MCR2413C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     3-
     A                                      9RERRMSGID  5    C6    SCDT07C7    -
     A                                      MCR2404C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     40RERRMSGID  5    C6  -
     A                                        SCDT07C7    MCR2405C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     27RERRMS-
     A                                      GID  5    C6    SCDT08C7    MCR0500-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     72RERRMSGID  5    C6    SCDT0-
     A                                      8C7    MCR2403C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     30RERRMSGID  5 -
     A                                         C6    SCDT08C7    MCR0572C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     3-
     A                                      2RERRMSGID  5    C6    SCDT08C7    -
     A                                      MCR0702C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     39RERRMSGID  5    C6  -
     A                                        SCDT08C7    MCR2404C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     40RERRMS-
     A                                      GID  5    C6    SCDT08C7    MCR2405-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     61RERRMSGID  5    C6    SCDT0-
     A                                      6C7    MCR0503C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     73RERRMSGID  5 -
     A                                         C6    SCDT06C7    MCR0500C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     6-
     A                                      3RERRMSGID  5    C6    SCDT06C7    -
     A                                      MCR2406C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     62RERRMSGID  5    C6  -
     A                                        SCDT06C7    MCR0572C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     64RERRMS-
     A                                      GID  5    C6    SCADHRC7    MCR0678-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     74RERRMSGID  5    C6    SCADT-
     A                                      YC7    MCR0503C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     75 33RERRMSGID -
     A                                       5    C6    SCADTYC7    MCR0513C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        75N33RERRMSGID  5    C6    SCADTY-
     A                                      C7    MCR2387C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     65RERRMSGID  5  -
     A                                        C6    SCADSCC7    MCR0503C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     76-
     A                                       34RERRMSGID  5    C6    SCADSCC7  -
     A                                        MCR0513C6    FSMESGC5    *LIBLC0 -
     A                                         E1    6     76N34RERRMSGID  5   -
     A                                       C6    SCADSCC7    MCR2387C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     11R-
     A                                      ERRMSGID  5    C6    SCDCHRC7    MC-
     A                                      R0678C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     77RERRMSGID  5    C6    -
     A                                      SCPATSC7    MCR0503C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     78 35RERRM-
     A                                      SGID  5    C6    SCPATSC7    MCR051-
     A                                      3C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     78N35RERRMSGID  5    C6    S-
     A                                      CPATSC7    MCR2387C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     13RERRMSGID-
     A                                        5    C6    SCOCD1C7    MCR0503C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         79 36RERRMSGID  5    C6    SCOCD-
     A                                      1C7    MCR0513C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     79N36RERRMSGID -
     A                                       5    C6    SCOCD1C7    MCR2387C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        14RERRMSGID  5    C6    SCODT1C7 -
     A                                         MCR0500C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     80RERRMSGID  5    C-
     A                                      6    SCODT1C7    MCR0572C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     28RER-
     A                                      RMSGID  5    C6    SCOSFDC7    MCR0-
     A                                      500C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     81RERRMSGID  5    C6    SC-
     A                                      OSFDC7    MCR0572C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     21RERRMSGID -
     A                                       5    C6    SCOSFDC7    MCR2384C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        23RERRMSGID  5    C6    SCOSFDC7 -
     A                                         MCR2409C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     29RERRMSGID  5    C-
     A                                      6    SCOSTDC7    MCR0500C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     82RER-
     A                                      RMSGID  5    C6    SCOSTDC7    MCR0-
     A                                      572C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     22RERRMSGID  5    C6    SC-
     A                                      OSTDC7    MCR2384C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     23RERRMSGID -
     A                                       5    C6    SCOSTDC7    MCR2409C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        29RERRMSGID  5    C6    SCHTOSC7 -
     A                                         MCR0513C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     38RERRMSGID  5    C-
     A                                      6    SCHTOSC7    MCR2387C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     15RER-
     A                                      RMSGID  5    C5    SCTOBC7    MCR03-
     A                                      19C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     83RERRMSGID  5    C5    SCT-
     A                                      OBC7    MCR2387C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     16RERRMSGID  5-
     A                                          C6    SCVC01C7    MCR0503C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      84 37RERRMSGID  5    C6    SCVC01C7-
     A                                          MCR0513C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     84N37RERRMSGID  5 -
     A                                         C6    SCVC01C7    MCR2387C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     1-
     A                                      7RERRMSGID  5    C6    SCVA01C7    -
     A                                      MCR0502C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     85RERRMSGID  5    C6  -
     A                                        SCACRTC7    MCR0502C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     86RERRMS-
     A                                      GID  5    C6    SCADDIC7    MCR0686-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     87RERRMSGID  5    C6    SCADD-
     A                                      IC7    MCR2388C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6    N52 59RERRMSGID -
     A                                       5    C6    SCADDIC7    MCR2390C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        52 59RERRMSGID  5    C6    SCPCDM-
     A                                      C7    MCR0490C6    FSMESGC5   ')
     A                                  1  3HTML('QPUI *LIBLC0    E1    3     8-
     A                                      8RERRMSGID  5    C6    SCPCDMC7    -
     A                                      MCR2387C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     18RERRMSGID  5    C6  -
     A                                        SC7A01C7    MCR0687C6    FSMESGC5-
     A                                          *LIBLC0    E1    6     89N52RER-
     A                                      RMSGID  5    C6    SC7A01C7    MCR2-
     A                                      393C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     89 52RERRMSGID  5    C6   -
     A                                       SC7A01C7    MCR2388C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6    N52 53RERR-
     A                                      MSGID  5    C6    SC7A01C7    MCR23-
     A                                      90C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     52 53RERRMSGID  5    C6    -
     A                                      SCDT13C7    MCR0500C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     41RERRMSGI-
     A                                      D  5    C6    SCDT13C7    MCR0572C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          66RERRMSGID  5    C6    SC7A02C-
     A                                      7    MCR0687C6    FSMESGC5    *LIBL-
     A                                      C0    E1    6     42N52RERRMSGID  5-
     A                                          C6    SC7A02C7    MCR2393C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      42 52RERRMSGID  5    C6    SC7A02C7-
     A                                          MCR2388C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6    N52 54RERRMSGID  5 -
     A                                         C6    SC7A02C7    MCR2390C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     5-
     A                                      2 54RERRMSGID  5    C6    SCDT14C7 -
     A                                         MCR0500C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     43RERRMSGID  5    C-
     A                                      6    SCDT14C7    MCR0572C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     67RER-
     A                                      RMSGID  5    C6    SC7A03C7    MCR0-
     A                                      687C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     44N52RERRMSGID  5    C6   -
     A                                       SC7A03C7    MCR2393C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     44 52RERR-
     A                                      MSGID  5    C6    SC7A03C7    MCR23-
     A                                      88C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6    N52 55RERRMSGID  5    C6    -
     A                                      SC7A03C7    MCR2390C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     52 55RERRM-
     A                                      SGID  5    C6    SCDT15C7    MCR050-
     A                                      0C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     45RERRMSGID  5    C6    SCDT-
     A                                      15C7    MCR0572C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     68RERRMSGID  5-
     A                                          C6    SC7A04C7    MCR0687C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      46N52RERRMSGID  5    C6    SC7A04C7-
     A                                          MCR2393C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     46 52RERRMSGID  5 -
     A                                         C6    SC7A04C7    MCR2388C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6    N5-
     A                                      2 56RERRMSGID  5    C6    SC7A04C7 -
     A                                         MCR2390C6    FSMESGC5    *LIBLC0-
     A                                          E1    6     52 56RERRMSGID  5  -
     A                                        C6    SCDT16C7    MCR0500C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     47-
     A                                      RERRMSGID  5    C6    SCDT16C7    M-
     A                                      CR0572C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     69RERRMSGID  5    C6   -
     A                                       SC7A05C7    MCR0687C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     48N52RERR-
     A                                      MSGID  5    C6    SC7A05C7    MCR23-
     A                                      93C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     48 52RERRMSGID  5    C6    -
     A                                      SC7A05C7    MCR2388C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6    N52 57RERRM-
     A                                      SGID  5    C6    SC7A05C7    MCR239-
     A                                      0C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     52 57RERRMSGID  5    C6    S-
     A                                      CDT17C7    MCR0500C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     49RERRMSGID-
     A                                        5    C6    SCDT17C7    MCR0572C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         26RERRMSGID  5    C6    SC7A06C7-
     A                                          MCR0687C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     50N52RERRMSGID  5 -
     A                                         C6    SC7A06C7    MCR2393C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     5-
     A                                      0 52RERRMSGID  5    C6    SC7A06C7 -
     A                                         MCR2388C6    FSMESGC5    *LIBLC0-
     A                                          E1    6    N52 58RERRMSGID  5  -
     A                                        C6    SC7A06C7    MCR2390C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     52-
     A                                       58RERRMSGID  5    C6    SCDT18C7  -
     A                                        MCR0500C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     51RERRMSGID  5    C6-
     A                                          SCDT18C7    MCR0572C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     25')
     A                                  1  4HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"set cursor row":-
     A                                      {"fieldName":"SCLI92","dataLength":-
     A                                      "3","decPos":"0","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","dataType":"zoned"-
     A                                      ,"formatting":"Number","units":"","-
     A                                      negNum":"-999.00"},"set cursor colu-
     A                                      mn":{"fieldName":"SCPS92","dataLeng-
     A                                      th":"3","decPos":"0","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","dataType":"zo-
     A                                      ned","formatting":"Number","units":-
     A                                      "","negNum":"-999.00"},"set off":{"-
     A                                      fieldName":"*IN20","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"valid command ke-
     A                                      y":{"fieldName":"*IN12","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"overlay ran-
     A                                      ge":"1-24"},"items":[{"id":"HFLD","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "HFLD","designValue":"[HFLD]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"10"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"SCLI92","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SCLI92","desi-
     A                                      gnValue":"[SCLI92]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00","dataLength":"3"-
     A                                      ,"decPos":"0"},"left":"0px","top":"-
     A                                      -30px","width":"21px","text align":-
     A                                      "right","css class":"profound-conve-
     A                                      rted"},{"id":"SCPS92","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"SCPS92","de-
     A                                      signValue":"[SCPS92]","dataType":"z-
     A                                      oned","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"true","curSym":"","units":"-
     A                                      ","negNum":"-999.00","dataLength":"-
     A                                      3","decPos":"0"},"left":"0px","top"-
     A                                      :"-30px","width":"21px","text align-
     A                                      ":"right","css class":"profound-con-
     A                                      verted"},{"id":"HREC","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"HREC","desi-
     A                                      gnValue":"[HREC]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"left":"0px","top":"-30px","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      F0092F_SCR01_avKeys","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "AV_KEYS","dataLength":"1134","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[AV_KEYS]"},"left":-
     A                                      "0px","top":"0px","visibility":"hid-
     A                                      den"},{"id":"F0092F_SCR01_action","-
     A                                      field type":"html container","white-
     A                                       space":"normal","left":"0px","top"-
     A                                      :"10px","width":"230px","css class"-
     A                                      :"action-panel-converted","height":-
     A                                      "700px","html":"<div class=\"top\">-
     A                                      </div><div class=\"imagetop\"><img -
     A                                      src=\"/profoundui/userdata/images/b-
     A                                      ar_top.png\" /></div><div class=\"m-
     A                                      enulinks\"></div><div class=\"image-
     A                                      bottom\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_bottom.png\" /></d-
     A                                      iv><div class=\"bottom\"></div>"},{-
     A                                      "field type":"icon menu button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"32px","z i-
     A                                      ndex":"20","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1170px","id":"F0092F-
     A                                      _SCR01_BtnIconMenuSystemTools","too-
     A                                      l tip":"System Tools","icon alignme-
     A                                      nt":"middle left","icon width":"16p-
     A                                      x","icon height":"24px","icon sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/systools.png","data function":-
     A                                      "SystemToolbarSystools","show down -
     A                                      arrow":"Yes"},{"field type":"panel"-
     A                                      ,"panel style":"TransformButtonBar"-
     A                                      ,"id":"F0092F_SCR01_ButtonBar","top-
     A                                      ":"35px","left":"1036px","width":"1-
     A                                      87px","height":"28px","css class":"-
     A                                      stationary","visibility":"hidden","-
     A                                      locked in place":"true"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1040px","id":"F0092F_SC-
     A                                      R01_BtnSave","tool tip":"Save","onc-
     A                                      lick":"SystemToolbarSave","backgrou-
     A                                      nd image":"url(''/profound')
     A                                  1  5HTML('ui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F0092F_SCR01_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F00-
     A                                      92F_SCR01_BtnSearch","tool tip":"Se-
     A                                      arch","onclick":"SystemToolbarSearc-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/searc-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      18px","id":"F0092F_SCR01_BtnDiaryIt-
     A                                      ems","tool tip":"Diary/Work Items --
     A                                       IDARTS","onclick":"SystemToolbarDi-
     A                                      ary","background image":{"fieldName-
     A                                      ":"DryIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1144px"-
     A                                      ,"id":"F0092F_SCR01_BtnSystemMessag-
     A                                      es","tool tip":"System Messages","o-
     A                                      nclick":"SystemToolbarMessages","ba-
     A                                      ckground image":{"fieldName":"MsgIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1196px","id":"F-
     A                                      0092F_SCR01_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"F0092F_SCR01_ImgSysTool-
     A                                      Bottom","field type":"image","image-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/butbarbot.png","left":"1-
     A                                      036px","top":"64px","width":"187px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n"},{"id":"F0092F_SCR01_MainTabPane-
     A                                      l","field type":"tab panel","tab pa-
     A                                      nel style":"Transform","tab names":-
     A                                      {"fieldName":"SCPRDS","designValue"-
     A                                      :"[SCPRDS]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0092F_SCR01_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"SCUSER","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCUSER","designValue":"[SCUSER]"-
     A                                      ,"refField":"USER","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"110px","cu-
     A                                      rsor row":"1","css class 2":"top-li-
     A                                      ne","parent tab panel":"F0092F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCPRDS","field type":"output -
     A                                      field","value":{"fieldName":"SCPRDS-
     A                                      ","designValue":"[SCPRDS]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLea')
     A                                  1  6HTML('ding":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"414-
     A                                      px","cursor column":"21","top":"110-
     A                                      px","cursor row":"1","css class 2":-
     A                                      "top-line","description":"PROGRAM N-
     A                                      AME","parent tab panel":"F0092F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      visibility":"hidden","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt1","field type":"output field","l-
     A                                      eft":"778px","cursor column":"73","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class":"top-line","value":"js: curr-
     A                                      entDate()","css class 2":"output-fi-
     A                                      eld","parent tab panel":"F0092F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"F0092F_SCR01_fkeyMenu","fiel-
     A                                      d type":"menu","left":"10px","top":-
     A                                      "120px","height":"350px","width":"2-
     A                                      30px","hover background color":"#9A-
     A                                      AA61","hover text color":"#FFFFFF",-
     A                                      "border color":"#4C6106","menu opti-
     A                                      on indent":"10px","background color-
     A                                      ":"#758B27","css class":"action-men-
     A                                      u","css class 2":"stationary","z in-
     A                                      dex":"101"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0092F_SCR01_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant2","field type":"outpu-
     A                                      t field","value":"F0092F","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"130px","cursor-
     A                                       row":"2","parent tab panel":"F0092-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCAST","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CAST","designValue":"[SCAST]","refF-
     A                                      ield":"ST","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"337px","cursor co-
     A                                      lumn":"10","top":"130px","cursor ro-
     A                                      w":"2","css class 2":"HI","parent t-
     A                                      ab panel":"F0092F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCGZIP"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCGZIP","designValu-
     A                                      e":"[SCGZIP]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"3"},"c-
     A                                      ss class":"output-field","left":"35-
     A                                      8px","cursor column":"13","top":"13-
     A                                      0px","cursor row":"2","css class 2"-
     A                                      :"HI","description":"GEO ZIP AREA",-
     A                                      "parent tab panel":"F0092F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCZIP","field type":"output field-
     A                                      ","value":{"fieldName":"SCZIP","des-
     A                                      ignValue":"[SCZIP]","refField":"ZIP-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"386px","cursor column":"17","-
     A                                      top":"130px","cursor row":"2","widt-
     A                                      h":"63px","text align":"right","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F0092F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCCNTY","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCCNTY","designValue":"[SCCNTY-
     A                                      ]","refField":"PREF01/DS40 *LIBL/FS-
     A                                      REFP","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"456px","cursor column"-
     A                                      :"27","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"F0092F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant3","field type":"output-
     A                                       field","value":"HOSP","css class":-
     A                                      "constant","left":"764px","cursor c-
     A                                      olumn":"71","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"F0092F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant4","field type":"-
     A                                      output field","value":"SCR01","css -
     A                                      class":"constant","left":"799px","c-
     A                                      ursor column":"76","top":"130px","c-
     A                                      ursor row":"2","parent tab panel":"-
     A                                      F0092F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant5","field -
     A                                      type":"output field","value":"PEND -
     A                                      ENTIRE CASE","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"99","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"281px","cursor colu-
     A                                      mn":"2","top":"150px","cursor row":-
     A                                      "3","css class 2":"HI","parent tab -
     A                                      panel":"F0092F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant6"-
     A                                      ,"field type":"output field","value-
     A                                      ":"PRE-CERT REQD","css class":"cons-
     A                                      tant","visibility":{"fieldName":"98-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"463px')
     A                                  1  7HTML('","cursor column":"28","top":-
     A                                      "150px","cursor row":"3","css class-
     A                                       2":"HI","parent tab panel":"F0092F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCXXXX","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CXXXX","designValue":"[SCXXXX]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none","d-
     A                                      ataLength":"17"},"css class":"outpu-
     A                                      t-field","left":"687px","cursor col-
     A                                      umn":"60","top":"150px","cursor row-
     A                                      ":"3","css class 2":"HI","parent ta-
     A                                      b panel":"F0092F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0092F_SCR01_BtnHiddenSearc-
     A                                      h","value":"btnSearch","top":"150px-
     A                                      ","response":{"fieldName":"btnSearc-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant7","field type":"-
     A                                      output field","value":"Sub:","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"F0-
     A                                      092F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCSUB#","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCSUB#","designValue":"[SCSUB#]"-
     A                                      ,"refField":"SUB#","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"true","curSym":"","units":-
     A                                      "","negNum":"-999.00"},"css class":-
     A                                      "output-field","left":"316px","curs-
     A                                      or column":"7","top":"170px","curso-
     A                                      r row":"4","width":"35px","text ali-
     A                                      gn":"right","css class 2":"HI","par-
     A                                      ent tab panel":"F0092F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      NAME","field type":"output field","-
     A                                      value":{"fieldName":"SCNAME","desig-
     A                                      nValue":"[SCNAME]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"3-
     A                                      7"},"css class":"output-field","lef-
     A                                      t":"358px","cursor column":"13","to-
     A                                      p":"170px","cursor row":"4","css cl-
     A                                      ass 2":"HI","description":"SUB NAME-
     A                                      ","parent tab panel":"F0092F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant8","field type":"output-
     A                                       field","value":"Case#:","css class-
     A                                      ":"constant","left":"624px","cursor-
     A                                       column":"51","top":"170px","cursor-
     A                                       row":"4","parent tab panel":"F0092-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCFND","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CFND","designValue":"[SCFND]","refF-
     A                                      ield":"FND","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"css class":"outpu-
     A                                      t-field","left":"673px","cursor col-
     A                                      umn":"58","top":"170px","cursor row-
     A                                      ":"4","width":"21px","text align":"-
     A                                      right","css class 2":"HI","parent t-
     A                                      ab panel":"F0092F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t9","field type":"output field","va-
     A                                      lue":"-","css class":"constant","le-
     A                                      ft":"701px","cursor column":"62","t-
     A                                      op":"170px","cursor row":"4","css c-
     A                                      lass 2":"HI","parent tab panel":"F0-
     A                                      092F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"SCFY","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCFY","designValue":"[SCFY]","refF-
     A                                      ield":"FYR","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"css class":"outpu-
     A                                      t-field","left":"715px","cursor col-
     A                                      umn":"64","top":"170px","cursor row-
     A                                      ":"4","width":"21px","text align":"-
     A                                      right","css class 2":"HI","parent t-
     A                                      ab panel":"F0092F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t10","field type":"output field","v-
     A                                      alue":"-","css class":"constant","l-
     A                                      eft":"743px","cursor column":"68","-
     A                                      top":"170px","cursor row":"4","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      0092F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCCASE","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCASE","designValue":"[SCCASE]-
     A                                      ","refField":"CASE","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00"},"css class-
     A                                      ":"output-field","left":"757px","cu-
     A                                      rsor column":"70","top":"170px","cu-
     A                                      rsor row":"4","width":"49px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      parent tab panel":"F0092F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1')
     A                                  1  8HTML('140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F00-
     A                                      92F_SCR01_BtnHiddenDiaryItems","val-
     A                                      ue":"btnDiary","top":"175px","respo-
     A                                      nse":{"fieldName":"btnDiary","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant11","field type":"output f-
     A                                      ield","value":"Employer:","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"190px","cursor-
     A                                       row":"5","parent tab panel":"F0092-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCEMP#","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCEMP#","designValue":"[SCEMP#]","r-
     A                                      efField":"EMP#","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00"},"css class":"o-
     A                                      utput-field","left":"351px","cursor-
     A                                       column":"12","top":"190px","cursor-
     A                                       row":"5","width":"63px","text alig-
     A                                      n":"right","css class 2":"HI","pare-
     A                                      nt tab panel":"F0092F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant12","field type":"output field-
     A                                      ","value":"-","css class":"constant-
     A                                      ","left":"421px","cursor column":"2-
     A                                      2","top":"190px","cursor row":"5","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0092F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCDIV","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCDIV","designValue":"[SCDIV-
     A                                      ]","refField":"DIV","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00"},"css class-
     A                                      ":"output-field","left":"435px","cu-
     A                                      rsor column":"24","top":"190px","cu-
     A                                      rsor row":"5","width":"35px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      parent tab panel":"F0092F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCENAM","field type":"output field-
     A                                      ","value":{"fieldName":"SCENAM","de-
     A                                      signValue":"[SCENAM]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"477px","cursor column":-
     A                                      "30","top":"190px","cursor row":"5"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"F0092F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0092F_SCR01_BtnHiddenSystemMess-
     A                                      ages","value":"btnMessage","top":"2-
     A                                      00px","response":{"fieldName":"btnM-
     A                                      essage","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant13","field t-
     A                                      ype":"output field","value":"Social-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"210-
     A                                      px","cursor row":"6","parent tab pa-
     A                                      nel":"F0092F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant14",-
     A                                      "field type":"output field","value"-
     A                                      :"Security","css class":"constant",-
     A                                      "left":"330px","cursor column":"9",-
     A                                      "top":"210px","cursor row":"6","par-
     A                                      ent tab panel":"F0092F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant15","field type":"output fiel-
     A                                      d","value":"#:","css class":"consta-
     A                                      nt","left":"393px","cursor column":-
     A                                      "18","top":"210px","cursor row":"6"-
     A                                      ,"parent tab panel":"F0092F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSS#","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCSS#","de-
     A                                      signValue":"[SCSS#]","refField":"SS-
     A                                      #","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"210px","cursor row":"6","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0092F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant16","fi-
     A                                      eld type":"output field","value":"A-
     A                                      ccident","css class":"constant","le-
     A                                      ft":"484px","cursor column":"31","t-
     A                                      op":"210px","cursor row":"6","paren-
     A                                      t tab panel":"F0092F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant17","field type":"output field"-
     A                                      ,"value":"Date:","css class":"const-
     A                                      ant","left":"547px","cursor column"-
     A                                      :"40","top":"210px","cursor row":"6-
     A                                      ","parent tab panel":"F0092F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCACDT","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCACDT",-
     A                                      "designValue":"[SCACDT]","refField"-
     A                                      :"DT8","dataType":"reference","form-
     A                                      atting":"Number","numSep":')
     A                                  1  9HTML('"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","edtWrd":"-
     A                                      ''  /  /    ''"},"css class":"outpu-
     A                                      t-field","left":"589px","cursor col-
     A                                      umn":"46","top":"210px","cursor row-
     A                                      ":"6","width":"70px","text align":"-
     A                                      right","css class 2":"HI","parent t-
     A                                      ab panel":"F0092F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t18","field type":"output field","v-
     A                                      alue":"MMI","css class":"constant",-
     A                                      "left":"666px","cursor column":"57"-
     A                                      ,"top":"210px","cursor row":"6","pa-
     A                                      rent tab panel":"F0092F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant19","field type":"output fie-
     A                                      ld","value":"Date:","css class":"co-
     A                                      nstant","left":"694px","cursor colu-
     A                                      mn":"61","top":"210px","cursor row"-
     A                                      :"6","parent tab panel":"F0092F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCMMI","field type":"output -
     A                                      field","value":{"fieldName":"SCMMI"-
     A                                      ,"designValue":"[SCMMI]","refField"-
     A                                      :"DT8","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","zeroFill":"tru-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","edtWrd":"''  /  /    ''"-
     A                                      },"css class":"output-field","left"-
     A                                      :"736px","cursor column":"67","top"-
     A                                      :"210px","cursor row":"6","width":"-
     A                                      70px","text align":"right","css cla-
     A                                      ss 2":"HI","parent tab panel":"F009-
     A                                      2F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0092F-
     A                                      _SCR01_BtnHiddenWorkSubmitJob","val-
     A                                      ue":"btnWrksbmjob","top":"225px","r-
     A                                      esponse":{"fieldName":"btnWrkJob","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant20","field type":"out-
     A                                      put field","value":"Claimant","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"230px","cu-
     A                                      rsor row":"7","parent tab panel":"F-
     A                                      0092F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant21","field -
     A                                      type":"output field","value":"Name:-
     A                                      ","css class":"constant","left":"34-
     A                                      4px","cursor column":"11","top":"23-
     A                                      0px","cursor row":"7","parent tab p-
     A                                      anel":"F0092F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCNME","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCCNME","designValue":"-
     A                                      [SCCNME]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none","dataLength":"31"},"css -
     A                                      class":"output-field","left":"386px-
     A                                      ","cursor column":"17","top":"230px-
     A                                      ","cursor row":"7","css class 2":"H-
     A                                      I","description":"CLIENT NAME","par-
     A                                      ent tab panel":"F0092F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant22","field type":"output fiel-
     A                                      d","value":"SCL#:","css class":"con-
     A                                      stant","left":"610px","cursor colum-
     A                                      n":"49","top":"230px","cursor row":-
     A                                      "7","parent tab panel":"F0092F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCSCL#","field type":"output -
     A                                      field","value":{"fieldName":"SCSCL#-
     A                                      ","designValue":"[SCSCL#]","refFiel-
     A                                      d":"SCL#","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"652px","cursor col-
     A                                      umn":"55","top":"230px","cursor row-
     A                                      ":"7","css class 2":"HI","parent ta-
     A                                      b panel":"F0092F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      23","field type":"output field","va-
     A                                      lue":"Provider:","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"250px","cursor row":"8"-
     A                                      ,"parent tab panel":"F0092F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCFEIN","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCFEIN","-
     A                                      designValue":"[SCFEIN]","refField":-
     A                                      "FEIN","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00"},"css class":"output-fie-
     A                                      ld","left":"351px","cursor column":-
     A                                      "12","top":"250px","cursor row":"8"-
     A                                      ,"width":"63px","text align":"right-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F0092F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"constant24",-
     A                                      "field type":"output field","value"-
     A                                      :"-","css class":"constant","left":-
     A                                      "421px","cursor column":"22","top":-
     A                                      "250px","cursor row":"8","css class-
     A                                       2":"HI","parent tab panel":"F0092F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCMOD","field type":"out-
     A                                      put field","value":{"field')
     A                                  1 10HTML('Name":"SCMOD","designValue":"-
     A                                      [SCMOD]","refField":"MOD","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"435p-
     A                                      x","cursor column":"24","top":"250p-
     A                                      x","cursor row":"8","width":"21px",-
     A                                      "text align":"right","css class 2":-
     A                                      "HI","parent tab panel":"F0092F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCPNME","field type":"output-
     A                                       field","value":{"fieldName":"SCPNM-
     A                                      E","designValue":"[SCPNME]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"34"},"css class":"output-fi-
     A                                      eld","left":"477px","cursor column"-
     A                                      :"30","top":"250px","cursor row":"8-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F0092F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"constant25",-
     A                                      "field type":"output field","value"-
     A                                      :"NON-BWC","css class":"constant","-
     A                                      visibility":{"fieldName":"97","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"729px","cursor column-
     A                                      ":"66","top":"250px","cursor row":"-
     A                                      8","css class 2":"HI","parent tab p-
     A                                      anel":"F0092F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0092F_SCR01_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0092F_SCR01_BtnHiddenImageQueue-
     A                                      ","value":"btnImgQue","top":"275px"-
     A                                      ,"response":{"fieldName":"btnImgQue-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant26","field type":"-
     A                                      output field","value":"Type of Bill-
     A                                           :","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"290px","cursor row":"10","parent-
     A                                       tab panel":"F0092F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCBTY-
     A                                      2","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCBTY2","desi-
     A                                      gnValue":"[SCBTY2]","refField":"DS3-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"414px","cursor colum-
     A                                      n":"21","top":"290px","cursor row":-
     A                                      "10","width":"22px","css class 3":"-
     A                                      HI","read only":"true","css class 4-
     A                                      ":"PR-UL","parent tab panel":"F0092-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 5":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0092F_-
     A                                      SCR01_BtnHiddenHelp","value":"btnHe-
     A                                      lp","top":"300px","response":{"fiel-
     A                                      dName":"btnHelp","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant27"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Statement Covers :","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"310px","cursor ro-
     A                                      w":"11","parent tab panel":"F0092F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCDT07","field type":"dat-
     A                                      e field","css class":"input","css c-
     A                                      lass 2":"date-field","value":{"fiel-
     A                                      dName":"SCDT07","designValue":"[SCD-
     A                                      T07]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","numBla-
     A                                      nkFill":"true","edtWrd":"''  /  /  -
     A                                        ''","dateFormat":"m/d/Y"},"left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "310px","cursor row":"11","width":"-
     A                                      71px","text align":"right","error m-
     A                                      essage id":"MCR0500","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"71","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"6 m-
     A                                      essages","error message id 2":"MCR2-
     A                                      403","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      30","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 3":"MCR0572",-
     A                                      "error message file 3":"FSMESG","er-
     A                                      ror message library 3":"*LIBL","err-
     A                                      or condition 3":{"fieldName":"31","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 4":"MCR24')
     A                                  1 11HTML('13","error message file 4":"F-
     A                                      SMESG","error message library 4":"*-
     A                                      LIBL","error condition 4":{"fieldNa-
     A                                      me":"39","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 5":"MCR2-
     A                                      404","error message file 5":"FSMESG-
     A                                      ","error message library 5":"*LIBL"-
     A                                      ,"error condition 5":{"fieldName":"-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 6":"MCR2405",-
     A                                      "error message file 6":"FSMESG","er-
     A                                      ror message library 6":"*LIBL","err-
     A                                      or condition 6":{"fieldName":"27","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"F0092F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant28","field type":"output f-
     A                                      ield","value":"Covers to         :"-
     A                                      ,"css class":"constant","left":"533-
     A                                      px","cursor column":"38","top":"310-
     A                                      px","cursor row":"11","parent tab p-
     A                                      anel":"F0092F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCDT08","fi-
     A                                      eld type":"date field","css class":-
     A                                      "input","css class 2":"date-field",-
     A                                      "value":{"fieldName":"SCDT08","desi-
     A                                      gnValue":"[SCDT08]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","numBlankFill":"true","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"left":"695px","cursor colum-
     A                                      n":"58","top":"310px","cursor row":-
     A                                      "11","width":"71px","text align":"r-
     A                                      ight","error message id":"MCR0500",-
     A                                      "error message file":"FSMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"72","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"6 messages","error messa-
     A                                      ge id 2":"MCR2403","error message f-
     A                                      ile 2":"FSMESG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"30","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       3":"MCR0572","error message file 3-
     A                                      ":"FSMESG","error message library 3-
     A                                      ":"*LIBL","error condition 3":{"fie-
     A                                      ldName":"32","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 4":"-
     A                                      MCR0702","error message file 4":"FS-
     A                                      MESG","error message library 4":"*L-
     A                                      IBL","error condition 4":{"fieldNam-
     A                                      e":"39","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 5":"MCR24-
     A                                      04","error message file 5":"FSMESG"-
     A                                      ,"error message library 5":"*LIBL",-
     A                                      "error condition 5":{"fieldName":"4-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 6":"MCR2405","-
     A                                      error message file 6":"FSMESG","err-
     A                                      or message library 6":"*LIBL","erro-
     A                                      r condition 6":{"fieldName":"61","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"p-
     A                                      arent tab panel":"F0092F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant29","field type":"output fi-
     A                                      eld","value":"Days Covered     :","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"330px"-
     A                                      ,"cursor row":"12","parent tab pane-
     A                                      l":"F0092F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCDYCV","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCDYCV","designValue":-
     A                                      "[SCDYCV]","refField":"A50","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00","nu-
     A                                      mBlankFill":"true"},"left":"414px",-
     A                                      "cursor column":"21","top":"330px",-
     A                                      "cursor row":"12","width":"36px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"F0092F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant30","f-
     A                                      ield type":"output field","value":"-
     A                                      Days Not Covered. :","css class":"c-
     A                                      onstant","left":"533px","cursor col-
     A                                      umn":"38","top":"330px","cursor row-
     A                                      ":"12","parent tab panel":"F0092F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCNOCV","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCNOCV","designValue":"[SCNOCV]","-
     A                                      refField":"A50","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00","numBlankFill":-
     A                                      "true"},"left":"673px","cursor colu-
     A                                      mn":"58","top":"330px","cursor row"-
     A                                      :"12","width":"36px","text align":"-
     A                                      right","parent tab panel":"F0092F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant31","field type":"-
     A                                      output field","value":"Admission Da-
     A                                      te . :","css class":"constant","lef-
     A                                      t":"281px","cursor column"')
     A                                  1 12HTML(':"2","top":"350px","cursor ro-
     A                                      w":"13","parent tab panel":"F0092F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCDT06","field type":"dat-
     A                                      e field","css class":"input","css c-
     A                                      lass 2":"date-field","value":{"fiel-
     A                                      dName":"SCDT06","designValue":"[SCD-
     A                                      T06]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","numBla-
     A                                      nkFill":"true","edtWrd":"''  /  /  -
     A                                        ''","dateFormat":"m/d/Y"},"left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "350px","cursor row":"13","width":"-
     A                                      71px","text align":"right","error m-
     A                                      essage id":"MCR0503","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"73","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"4 m-
     A                                      essages","error message id 2":"MCR0-
     A                                      500","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      63","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 3":"MCR2406",-
     A                                      "error message file 3":"FSMESG","er-
     A                                      ror message library 3":"*LIBL","err-
     A                                      or condition 3":{"fieldName":"62","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 4":"MCR0572","erro-
     A                                      r message file 4":"FSMESG","error m-
     A                                      essage library 4":"*LIBL","error co-
     A                                      ndition 4":{"fieldName":"64","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"F0092F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant32","field type":"output field"-
     A                                      ,"value":"Hour:","css class":"const-
     A                                      ant","left":"533px","cursor column"-
     A                                      :"38","top":"350px","cursor row":"1-
     A                                      3","parent tab panel":"F0092F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCADHR","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCA-
     A                                      DHR","designValue":"[SCADHR]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"4","decPos":"0","numBlankF-
     A                                      ill":"true"},"left":"582px","cursor-
     A                                       column":"45","top":"350px","cursor-
     A                                       row":"13","width":"29px","text ali-
     A                                      gn":"right","error message id":"MCR-
     A                                      0678","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"74","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","descri-
     A                                      ption":"ADMISSION HOUR","parent tab-
     A                                       panel":"F0092F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      3","field type":"output field","val-
     A                                      ue":"Type:","css class":"constant",-
     A                                      "left":"631px","cursor column":"52"-
     A                                      ,"top":"350px","cursor row":"13","p-
     A                                      arent tab panel":"F0092F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCADTY","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCADTY",-
     A                                      "designValue":"[SCADTY]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"673px","cursor-
     A                                       column":"58","top":"350px","cursor-
     A                                       row":"13","width":"8px","error mes-
     A                                      sage id":"MCR0503","error message f-
     A                                      ile":"FSMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"75 and 33","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"3 messages","error message id 2":-
     A                                      "MCR0513","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"75 and N33","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      3":"MCR2387","error message file 3"-
     A                                      :"FSMESG","error message library 3"-
     A                                      :"*LIBL","error condition 3":{"fiel-
     A                                      dName":"65","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F00-
     A                                      92F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant34","field ty-
     A                                      pe":"output field","value":"Source:-
     A                                      ","css class":"constant","left":"69-
     A                                      4px","cursor column":"61","top":"35-
     A                                      0px","cursor row":"13","parent tab -
     A                                      panel":"F0092F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCADSC","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCADSC","designVal-
     A                                      ue":"[SCADSC]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransf')
     A                                  1 13HTML('orm":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"750px","c-
     A                                      ursor column":"69","top":"350px","c-
     A                                      ursor row":"13","width":"8px","erro-
     A                                      r message id":"MCR0503","error mess-
     A                                      age file":"FSMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"76 and 34","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"3 messages","error message i-
     A                                      d 2":"MCR0513","error message file -
     A                                      2":"FSMESG","error message library -
     A                                      2":"*LIBL","error condition 2":{"fi-
     A                                      eldName":"76 and N34","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 3":"MCR2387","error message fi-
     A                                      le 3":"FSMESG","error message libra-
     A                                      ry 3":"*LIBL","error condition 3":{-
     A                                      "fieldName":"11","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"F0092F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant35","fie-
     A                                      ld type":"output field","value":"Di-
     A                                      scharge Hour . :","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"370px","cursor row":"1-
     A                                      4","parent tab panel":"F0092F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCDCHR","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCD-
     A                                      CHR","designValue":"[SCDCHR]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"2","decPos":"0","numBlankF-
     A                                      ill":"true"},"left":"414px","cursor-
     A                                       column":"21","top":"370px","cursor-
     A                                       row":"14","width":"15px","text ali-
     A                                      gn":"right","error message id":"MCR-
     A                                      0678","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"77","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","descri-
     A                                      ption":"ADMISSION HOUR","parent tab-
     A                                       panel":"F0092F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      6","field type":"output field","val-
     A                                      ue":"Patient Status    :","css clas-
     A                                      s":"constant","left":"533px","curso-
     A                                      r column":"38","top":"370px","curso-
     A                                      r row":"14","parent tab panel":"F00-
     A                                      92F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPATS","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCPATS","designValue":"[SCPAT-
     A                                      S]","refField":"CODE","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      673px","cursor column":"58","top":"-
     A                                      370px","cursor row":"14","width":"1-
     A                                      5px","error message id":"MCR0503","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"78 and 35","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"3 messages","error-
     A                                       message id 2":"MCR0513","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"78 and N35","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 3":"MCR2387","error -
     A                                      message file 3":"FSMESG","error mes-
     A                                      sage library 3":"*LIBL","error cond-
     A                                      ition 3":{"fieldName":"13","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"F0092F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt37","field type":"output field","-
     A                                      value":"Occ Code         :","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"390px","curs-
     A                                      or row":"15","parent tab panel":"F0-
     A                                      092F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCOCD1","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCOCD1","designValue":"[SCOC-
     A                                      D1]","refField":"DS15","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "390px","cursor row":"15","width":"-
     A                                      106px","error message id":"MCR0503"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"79 and 36"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"3 messages","err-
     A                                      or message id 2":"MCR0513","error m-
     A                                      essage file 2":"FSMESG","error mess-
     A                                      age library 2":"*LIBL","error condi-
     A                                      tion 2":{"fieldName":"79 and N36","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 3":"MCR2387","erro-
     A                                      r message file 3":"FSMESG"')
     A                                  1 14HTML(',"error message library 3":"*-
     A                                      LIBL","error condition 3":{"fieldNa-
     A                                      me":"14","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"F0092F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant38","field type"-
     A                                      :"output field","value":"Occ Date  -
     A                                              :","css class":"constant","-
     A                                      left":"533px","cursor column":"38",-
     A                                      "top":"390px","cursor row":"15","pa-
     A                                      rent tab panel":"F0092F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CODT1","field type":"date field","c-
     A                                      ss class":"input","css class 2":"da-
     A                                      te-field","value":{"fieldName":"SCO-
     A                                      DT1","designValue":"[SCODT1]","refF-
     A                                      ield":"DT8","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00","numBlankFill":"tr-
     A                                      ue","edtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"left":"673px","cu-
     A                                      rsor column":"58","top":"390px","cu-
     A                                      rsor row":"15","width":"71px","text-
     A                                       align":"right","error message id":-
     A                                      "MCR0500","error message file":"FSM-
     A                                      ESG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"8-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"2 messages","e-
     A                                      rror message id 2":"MCR0572","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"28","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"F0092F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant39","field type":"output field",-
     A                                      "value":"Span Begin Date. :","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"410px","cur-
     A                                      sor row":"16","parent tab panel":"F-
     A                                      0092F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCOSFD","field type-
     A                                      ":"date field","css class":"input",-
     A                                      "css class 2":"date-field","value":-
     A                                      {"fieldName":"SCOSFD","designValue"-
     A                                      :"[SCOSFD]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      numBlankFill":"true","edtWrd":"''  -
     A                                      /  /    ''","dateFormat":"m/d/Y"},"-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"410px","cursor row":"16","wi-
     A                                      dth":"71px","text align":"right","e-
     A                                      rror message id":"MCR0500","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"81","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"4 messages","error message id 2"-
     A                                      :"MCR0572","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"21","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MCR-
     A                                      2384","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "23","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 4":"MCR2409"-
     A                                      ,"error message file 4":"FSMESG","e-
     A                                      rror message library 4":"*LIBL","er-
     A                                      ror condition 4":{"fieldName":"29",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "parent tab panel":"F0092F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant40","field type":"output -
     A                                      field","value":"End Date          :-
     A                                      ","css class":"constant","left":"53-
     A                                      3px","cursor column":"38","top":"41-
     A                                      0px","cursor row":"16","parent tab -
     A                                      panel":"F0092F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCOSTD","f-
     A                                      ield type":"date field","css class"-
     A                                      :"input","css class 2":"date-field"-
     A                                      ,"value":{"fieldName":"SCOSTD","des-
     A                                      ignValue":"[SCOSTD]","refField":"DT-
     A                                      8","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","numBlankFill":"true","edtW-
     A                                      rd":"''  /  /    ''","dateFormat":"-
     A                                      m/d/Y"},"left":"695px","cursor colu-
     A                                      mn":"58","top":"410px","cursor row"-
     A                                      :"16","width":"71px","text align":"-
     A                                      right","error message id":"MCR0500"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"82","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"4 messages","error mess-
     A                                      age id 2":"MCR0572","error message -
     A                                      file 2":"FSMESG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"22","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 3":"MCR2384","error message file -
     A                                      3":"FSMESG","error message library -
     A                                      3":"*LIBL","error conditio')
     A                                  1 15HTML('n 3":{"fieldName":"23","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 4":"MCR2409","error mes-
     A                                      sage file 4":"FSMESG","error messag-
     A                                      e library 4":"*LIBL","error conditi-
     A                                      on 4":{"fieldName":"29","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"F0092F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant4-
     A                                      1","field type":"output field","val-
     A                                      ue":"Type of Service. :","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"430px","cursor -
     A                                      row":"17","parent tab panel":"F0092-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCHTOS","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCHTOS","designValue":"[SCHTOS]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase","dataLength":"2"},"text tran-
     A                                      sform":"uppercase","left":"414px","-
     A                                      cursor column":"21","top":"430px","-
     A                                      cursor row":"17","width":"15px","er-
     A                                      ror message id":"MCR0513","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"38","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR2387","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"15","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"description":"TYPE OF SER-
     A                                      VICE","parent tab panel":"F0092F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant42","field type":"o-
     A                                      utput field","value":"Bill Status  -
     A                                           :","css class":"constant","lef-
     A                                      t":"533px","cursor column":"38","to-
     A                                      p":"430px","cursor row":"17","paren-
     A                                      t tab panel":"F0092F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCTO-
     A                                      B","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCTOB","desig-
     A                                      nValue":"[SCTOB]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase","dataLength"-
     A                                      :"1"},"text transform":"uppercase",-
     A                                      "left":"673px","cursor column":"58"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"8px","error message id":"MCR-
     A                                      0319","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"83","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"MCR2387","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"16","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"descriptio-
     A                                      n":"TYPE OF BILL","parent tab panel-
     A                                      ":"F0092F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant43","fi-
     A                                      eld type":"output field","value":"V-
     A                                      alue Code       :","css class":"con-
     A                                      stant","left":"281px","cursor colum-
     A                                      n":"2","top":"450px","cursor row":"-
     A                                      18","parent tab panel":"F0092F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCVC01","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      VC01","designValue":"[SCVC01]","ref-
     A                                      Field":"DS15 15","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"414px-
     A                                      ","cursor column":"21","top":"450px-
     A                                      ","cursor row":"18","width":"106px"-
     A                                      ,"error message id":"MCR0503","erro-
     A                                      r message file":"FSMESG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"84 and 37","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"3 messages","error mes-
     A                                      sage id 2":"MCR0513","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"84 and N37","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 3":"MCR2387","error mess-
     A                                      age file 3":"FSMESG","error message-
     A                                       library 3":"*LIBL","error conditio-
     A                                      n 3":{"fieldName":"17","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"F0092F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant44-
     A                                      ","field type":"output field","valu-
     A                                      e":"Amount            :","css class-
     A                                      ":"constant","left":"533px","cursor-
     A                                       column":"38","top":"450px","cursor-
     A                                       row":"18","parent tab panel":"F009-
     A                                      2F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCVA01","fiel')
     A                                  1 16HTML('d type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCVA01","design-
     A                                      Value":"[SCVA01]","refField":"A122"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00","numBlankFill":"true"},"left":-
     A                                      "673px","cursor column":"58","top":-
     A                                      "450px","cursor row":"18","width":"-
     A                                      92px","text align":"right","error m-
     A                                      essage id":"MCR0502","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"85","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"F0092F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant45","field type":-
     A                                      "output field","value":"Hospital","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"490px"-
     A                                      ,"cursor row":"20","parent tab pane-
     A                                      l":"F0092F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant46","f-
     A                                      ield type":"output field","value":"-
     A                                      Accomodation","css class":"constant-
     A                                      ","left":"344px","cursor column":"1-
     A                                      1","top":"490px","cursor row":"20",-
     A                                      "parent tab panel":"F0092F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant47","field type":"output -
     A                                      field","value":"Daily","css class":-
     A                                      "constant","left":"435px","cursor c-
     A                                      olumn":"24","top":"490px","cursor r-
     A                                      ow":"20","parent tab panel":"F0092F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"constant48","field type"-
     A                                      :"output field","value":"Rate:","cs-
     A                                      s class":"constant","left":"477px",-
     A                                      "cursor column":"30","top":"490px",-
     A                                      "cursor row":"20","parent tab panel-
     A                                      ":"F0092F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCACRT","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCACRT","designValue":"-
     A                                      [SCACRT]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"999.00","dataLength":"10","decPos-
     A                                      ":"0","numBlankFill":"true"},"left"-
     A                                      :"533px","cursor column":"38","top"-
     A                                      :"490px","cursor row":"20","width":-
     A                                      "71px","text align":"right","error -
     A                                      message id":"MCR0502","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"86","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"1 -
     A                                      message","parent tab panel":"F0092F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant49","field type"-
     A                                      :"output field","value":"Admit Diag-
     A                                       Code:","css class":"constant","lef-
     A                                      t":"652px","cursor column":"55","to-
     A                                      p":"490px","cursor row":"20","paren-
     A                                      t tab panel":"F0092F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCAD-
     A                                      DI","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCADDI","des-
     A                                      ignValue":"[SCADDI]","refField":"DI-
     A                                      A","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"771px","cursor colu-
     A                                      mn":"72","top":"490px","cursor row"-
     A                                      :"20","width":"36px","error message-
     A                                       id":"MCR0686","error message file"-
     A                                      :"FSMESG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"87","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"3 message-
     A                                      s","error message id 2":"MCR2388","-
     A                                      error message file 2":"FSMESG","err-
     A                                      or message library 2":"*LIBL","erro-
     A                                      r condition 2":{"fieldName":"N52 an-
     A                                      d 59","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error message id 3":"MCR2390-
     A                                      ","error message file 3":"FSMESG","-
     A                                      error message library 3":"*LIBL","e-
     A                                      rror condition 3":{"fieldName":"52 -
     A                                      and 59","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"F0092F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant50","field type":-
     A                                      "output field","value":"Proc Code M-
     A                                      ethod :","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"510px","cursor row":"21","paren-
     A                                      t tab panel":"F0092F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPC-
     A                                      DM","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCPCDM","des-
     A                                      ignValue":"[SCPCDM]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"1"},"text transform":"uppercas-
     A                                      e","left":"421px","cursor ')
     A                                  1 17HTML('column":"22","top":"510px","c-
     A                                      ursor row":"21","width":"8px","erro-
     A                                      r message id":"MCR0490","error mess-
     A                                      age file":"FSMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"88","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      2 messages","error message id 2":"M-
     A                                      CR2387","error message file 2":"FSM-
     A                                      ESG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"18","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"description":"PROCEDURE COD-
     A                                      E METHOD","parent tab panel":"F0092-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant51","field type-
     A                                      ":"output field","value":"Principle-
     A                                       Procedure :","css class":"constant-
     A                                      ","left":"456px","cursor column":"2-
     A                                      7","top":"510px","cursor row":"21",-
     A                                      "parent tab panel":"F0092F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SC7A01","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SC7A01-
     A                                      ","designValue":"[SC7A01]","refFiel-
     A                                      d":"DS7","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"617px","curso-
     A                                      r column":"50","top":"510px","curso-
     A                                      r row":"21","width":"50px","error m-
     A                                      essage id":"MCR0687","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"89 and N52","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"4 messages","error message id -
     A                                      2":"MCR2393","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"89 and 52","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 3":"MCR2388","error message file -
     A                                      3":"FSMESG","error message library -
     A                                      3":"*LIBL","error condition 3":{"fi-
     A                                      eldName":"N52 and 53","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 4":"MCR2390","error message fi-
     A                                      le 4":"FSMESG","error message libra-
     A                                      ry 4":"*LIBL","error condition 4":{-
     A                                      "fieldName":"52 and 53","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"F0092F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant5-
     A                                      2","field type":"output field","val-
     A                                      ue":"Date:","css class":"constant",-
     A                                      "left":"687px","cursor column":"60"-
     A                                      ,"top":"510px","cursor row":"21","p-
     A                                      arent tab panel":"F0092F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCDT13","field type":"date field","-
     A                                      css class":"input","css class 2":"d-
     A                                      ate-field","value":{"fieldName":"SC-
     A                                      DT13","designValue":"[SCDT13]","ref-
     A                                      Field":"DT8","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","numBlankFill":"t-
     A                                      rue","edtWrd":"''  /  /    ''","dat-
     A                                      eFormat":"m/d/Y"},"left":"736px","c-
     A                                      ursor column":"67","top":"510px","c-
     A                                      ursor row":"21","width":"71px","tex-
     A                                      t align":"right","error message id"-
     A                                      :"MCR0500","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      41","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"MCR0572","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"66","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"F0092F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant53","field type":"output field"-
     A                                      ,"value":"Other","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"530px","cursor row":"22-
     A                                      ","parent tab panel":"F0092F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant54","field type":"outpu-
     A                                      t field","value":"Procedures:","css-
     A                                       class":"constant","left":"323px","-
     A                                      cursor column":"8","top":"530px","c-
     A                                      ursor row":"22","parent tab panel":-
     A                                      "F0092F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SC7A02","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SC7A02","designValue":"[S-
     A                                      C7A02]","refField":"DS7","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"421px","cursor column":"22","top-
     A                                      ":"530px","cursor row":"22","width"-
     A                                      :"50px","error message id":"MCR0687-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIB')
     A                                  1 18HTML('L","error condition":{"fieldN-
     A                                      ame":"42 and N52","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "4 messages","error message id 2":"-
     A                                      MCR2393","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"42 and 52","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 3"-
     A                                      :"MCR2388","error message file 3":"-
     A                                      FSMESG","error message library 3":"-
     A                                      *LIBL","error condition 3":{"fieldN-
     A                                      ame":"N52 and 54","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       4":"MCR2390","error message file 4-
     A                                      ":"FSMESG","error message library 4-
     A                                      ":"*LIBL","error condition 4":{"fie-
     A                                      ldName":"52 and 54","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"F0092F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCDT14","fiel-
     A                                      d type":"date field","css class":"i-
     A                                      nput","css class 2":"date-field","v-
     A                                      alue":{"fieldName":"SCDT14","design-
     A                                      Value":"[SCDT14]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","numBlankFill":"true","edtWrd"-
     A                                      :"''  /  /    ''","dateFormat":"m/d-
     A                                      /Y"},"left":"477px","cursor column"-
     A                                      :"30","top":"530px","cursor row":"2-
     A                                      2","width":"71px","text align":"rig-
     A                                      ht","error message id":"MCR0500","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"43","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"MCR0572","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"67","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"parent tab panel":-
     A                                      "F0092F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SC7A03","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SC7A03","designValue":"[S-
     A                                      C7A03]","refField":"DS7","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"547px","cursor column":"40","top-
     A                                      ":"530px","cursor row":"22","width"-
     A                                      :"50px","error message id":"MCR0687-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"44 and N5-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"4 messages","e-
     A                                      rror message id 2":"MCR2393","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"44 and 52",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 3":"MCR2388","err-
     A                                      or message file 3":"FSMESG","error -
     A                                      message library 3":"*LIBL","error c-
     A                                      ondition 3":{"fieldName":"N52 and 5-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 4":"MCR2390","-
     A                                      error message file 4":"FSMESG","err-
     A                                      or message library 4":"*LIBL","erro-
     A                                      r condition 4":{"fieldName":"52 and-
     A                                       55","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"F0092F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCDT15","field type":"date f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"date-field","value":{"fieldNa-
     A                                      me":"SCDT15","designValue":"[SCDT15-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","numBlankF-
     A                                      ill":"true","edtWrd":"''  /  /    '-
     A                                      '","dateFormat":"m/d/Y"},"left":"62-
     A                                      5px","cursor column":"48","top":"53-
     A                                      0px","cursor row":"22","width":"71p-
     A                                      x","text align":"right","error mess-
     A                                      age id":"MCR0500","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"45","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"MCR0572-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"68"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"F0092F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SC7A04","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SC7A0-
     A                                      4","designValue":"[SC7A04]","refFie-
     A                                      ld":"DS7","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true"')
     A                                  1 19HTML(',"textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"680px","cursor column":"59","top-
     A                                      ":"530px","cursor row":"22","width"-
     A                                      :"50px","error message id":"MCR0687-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"46 and N5-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"4 messages","e-
     A                                      rror message id 2":"MCR2393","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"46 and 52",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 3":"MCR2388","err-
     A                                      or message file 3":"FSMESG","error -
     A                                      message library 3":"*LIBL","error c-
     A                                      ondition 3":{"fieldName":"N52 and 5-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 4":"MCR2390","-
     A                                      error message file 4":"FSMESG","err-
     A                                      or message library 4":"*LIBL","erro-
     A                                      r condition 4":{"fieldName":"52 and-
     A                                       56","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"F0092F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCDT16","field type":"date f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"date-field","value":{"fieldNa-
     A                                      me":"SCDT16","designValue":"[SCDT16-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","numBlankF-
     A                                      ill":"true","edtWrd":"''  /  /    '-
     A                                      '","dateFormat":"m/d/Y"},"left":"75-
     A                                      8px","cursor column":"67","top":"53-
     A                                      0px","cursor row":"22","width":"71p-
     A                                      x","text align":"right","error mess-
     A                                      age id":"MCR0500","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"47","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"MCR0572-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"69"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"F0092F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SC7A05","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SC7A0-
     A                                      5","designValue":"[SC7A05]","refFie-
     A                                      ld":"DS7","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"421px","curs-
     A                                      or column":"22","top":"550px","curs-
     A                                      or row":"23","width":"50px","error -
     A                                      message id":"MCR0687","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"48 and N52","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"4 messages","error message id-
     A                                       2":"MCR2393","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"48 and 52","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 3":"MCR2388","error message file-
     A                                       3":"FSMESG","error message library-
     A                                       3":"*LIBL","error condition 3":{"f-
     A                                      ieldName":"N52 and 57","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 4":"MCR2390","error message f-
     A                                      ile 4":"FSMESG","error message libr-
     A                                      ary 4":"*LIBL","error condition 4":-
     A                                      {"fieldName":"52 and 57","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"F0092F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCDT17",-
     A                                      "field type":"date field","css clas-
     A                                      s":"input","css class 2":"date-fiel-
     A                                      d","value":{"fieldName":"SCDT17","d-
     A                                      esignValue":"[SCDT17]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","numBlankFill":"true","ed-
     A                                      tWrd":"''  /  /    ''","dateFormat"-
     A                                      :"m/d/Y"},"left":"477px","cursor co-
     A                                      lumn":"30","top":"550px","cursor ro-
     A                                      w":"23","width":"71px","text align"-
     A                                      :"right","error message id":"MCR050-
     A                                      0","error message file":"FSMESG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"49","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"2 messages","error me-
     A                                      ssage id 2":"MCR0572","error messag-
     A                                      e file 2":"FSMESG","error message l-
     A                                      ibrary 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"26","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"parent tab pa-
     A                                      nel":"F0092F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SC7')
     A                                  1 20HTML('A06","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SC7A0-
     A                                      6","designValue":"[SC7A06]","refFie-
     A                                      ld":"DS7","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"547px","curs-
     A                                      or column":"40","top":"550px","curs-
     A                                      or row":"23","width":"50px","error -
     A                                      message id":"MCR0687","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"50 and N52","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"4 messages","error message id-
     A                                       2":"MCR2393","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"50 and 52","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 3":"MCR2388","error message file-
     A                                       3":"FSMESG","error message library-
     A                                       3":"*LIBL","error condition 3":{"f-
     A                                      ieldName":"N52 and 58","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 4":"MCR2390","error message f-
     A                                      ile 4":"FSMESG","error message libr-
     A                                      ary 4":"*LIBL","error condition 4":-
     A                                      {"fieldName":"52 and 58","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"F0092F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCDT18",-
     A                                      "field type":"date field","css clas-
     A                                      s":"input","css class 2":"date-fiel-
     A                                      d","value":{"fieldName":"SCDT18","d-
     A                                      esignValue":"[SCDT18]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","numBlankFill":"true","ed-
     A                                      tWrd":"''  /  /    ''","dateFormat"-
     A                                      :"m/d/Y"},"left":"625px","cursor co-
     A                                      lumn":"48","top":"550px","cursor ro-
     A                                      w":"23","width":"71px","text align"-
     A                                      :"right","error message id":"MCR050-
     A                                      0","error message file":"FSMESG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"51","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"2 messages","error me-
     A                                      ssage id 2":"MCR0572","error messag-
     A                                      e file 2":"FSMESG","error message l-
     A                                      ibrary 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"25","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"parent tab pa-
     A                                      nel":"F0092F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF10","field type-
     A                                      ":"button","value":"Search","shortc-
     A                                      ut key":"F10","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Return","shortcut key":"F1-
     A                                      2","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnHELP-
     A                                      ","field type":"button","shortcut k-
     A                                      ey":"Alt-F1","bypass validation":"t-
     A                                      rue","value":"HELP","response":{"fi-
     A                                      eldName":"*IN10","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"14px","top"-
     A                                      :"249px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCACRT        10S 0H
     A            SCADHR         4S 0H
     A            SCCNME        31A  H
     A            SCDCHR         2S 0H
     A            SCGZIP         3A  H
     A            SCHTOS         2A  H
     A            SCLI92         3S 0H
     A            SCNAME        37A  H
     A            SCPCDM         1A  H
     A            SCPNME        34A  H
     A            SCPS92         3S 0H
     A            SCTOB          1A  H
     A            SCXXXX        17A  H
     A            SC7A01    R        H      REFFLD(DS7)
     A            SC7A02    R        H      REFFLD(DS7)
     A            SC7A03    R        H      REFFLD(DS7)
     A            SC7A04    R        H      REFFLD(DS7)
     A            SC7A05    R        H      REFFLD(DS7)
     A            SC7A06    R        H      REFFLD(DS7)
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCADDI    R        H      REFFLD(DIA)
     A            SCADSC    R        H      REFFLD(FLAG)
     A            SCADTY    R        H      REFFLD(FLAG)
     A            SCAST     R        H      REFFLD(ST)
     A            SCBTY2    R        H      REFFLD(DS3)
     A            SCCASE    R        H      REFFLD(CASE)
     A            SCCNTY    R        H      REFFLD(PREF01/DS40 *LIBL/FSREFP)
     A            SCDIV     R        H      REFFLD(DIV)
     A            SCDT06    R        H      REFFLD(DT8)
     A            SCDT07    R        H      REFFLD(DT8)
     A            SCDT08    R        H      REFFLD(DT8)
     A            SCDT13    R        H      REFFLD(DT8)
     A            SCDT14    R        H      REFFLD(DT8)
     A            SCDT15    R        H      REFFLD(DT8)
     A            SCDT16    R        H      REFFLD(DT8)
     A            SCDT17    R        H      REFFLD(DT8)
     A            SCDT18    R        H      REFFLD(DT8)
     A            SCDYCV    R        H      REFFLD(A50)
     A            SCEMP#    R        H      REFFLD(EMP#)
     A            SCENAM    R        H      REFFLD(NAME)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFY      R        H      REFFLD(FYR)
     A            SCMMI     R        H      REFFLD(DT8)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCNOCV    R        H      REFFLD(A50)
     A            SCOCD1    R        H      REFFLD(DS15)
     A            SCODT1    R        H      REFFLD(DT8)
     A            SCOSFD    R        H      REFFLD(DT8)
     A            SCOSTD    R        H      REFFLD(DT8)
     A            SCPATS    R        H      REFFLD(CODE)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCL#    R        H      REFFLD(SCL#)
     A            SCSS#     R        H      REFFLD(SS#)
     A            SCSUB#    R        H      REFFLD(SUB#)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCVA01    R        H      REFFLD(A122)
     A            SCVC01    R   15   H      REFFLD(DS15)
     A            SCZIP     R        H      REFFLD(ZIP)
