     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 21
     A  22 24 25                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                  1  2HTML('QPUIREC4    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCJRSTC7    MCR0503C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     21RERRMS-
     A                                      GID  5    C6    SCJRSTC7    MCR0504-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     22RERRMSGID  5    C6    SCTSE-
     A                                      TC7    MCR0513C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     24')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN21","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN22","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN24","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN25","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"return cursor-
     A                                       record":{"fieldName":"HREC","dataL-
     A                                      ength":"10","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none"},"return cursor field":-
     A                                      {"fieldName":"HFLD","dataLength":"1-
     A                                      0","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"valid command key":{"fieldName-
     A                                      ":"*IN11","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-23"},"i-
     A                                      tems":[{"id":"HFLD","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"HFLD","design-
     A                                      Value":"[HFLD]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "left":"0px","top":"-30px","css cla-
     A                                      ss":"profound-converted"},{"id":"HR-
     A                                      EC","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"HREC","designValue":"[HREC]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none",-
     A                                      "dataLength":"10"},"left":"0px","to-
     A                                      p":"-30px","css class":"profound-co-
     A                                      nverted"},{"id":"F0125F_SCR01_avKey-
     A                                      s","field type":"output field","val-
     A                                      ue":{"fieldName":"AV_KEYS","dataLen-
     A                                      gth":"1134","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[A-
     A                                      V_KEYS]"},"left":"0px","top":"0px",-
     A                                      "visibility":"hidden"},{"id":"F0125-
     A                                      F_SCR01_action","field type":"html -
     A                                      container","white space":"normal","-
     A                                      left":"0px","top":"10px","width":"2-
     A                                      30px","css class":"action-panel-con-
     A                                      verted","height":"700px","html":"<d-
     A                                      iv class=\"top\"></div><div class=\-
     A                                      "imagetop\"><img src=\"/profoundui/-
     A                                      userdata/images/bar_top.png\" /></d-
     A                                      iv><div class=\"menulinks\"></div><-
     A                                      div class=\"imagebottom\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_b-
     A                                      ottom.png\" /></div><div class=\"bo-
     A                                      ttom\"></div>"},{"field type":"icon-
     A                                       menu button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"32px","z index":"20","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"117-
     A                                      0px","id":"F0125F_SCR01_BtnIconMenu-
     A                                      SystemTools","tool tip":"System Too-
     A                                      ls","icon alignment":"middle left",-
     A                                      "icon width":"16px","icon height":"-
     A                                      24px","icon source":"/profoundui/us-
     A                                      erdata/images/systool/systools.png"-
     A                                      ,"data function":"SystemToolbarSyst-
     A                                      ools","show down arrow":"Yes"},{"fi-
     A                                      eld type":"panel","panel style":"Tr-
     A                                      ansformButtonBar","id":"F0125F_SCR0-
     A                                      1_ButtonBar","top":"35px","left":"1-
     A                                      036px","width":"187px","height":"28-
     A                                      px","css class":"stationary","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1040px-
     A                                      ","id":"F0125F_SCR01_BtnSave","tool-
     A                                       tip":"Save","onclick":"SystemToolb-
     A                                      arSave","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      save.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1066px","id":"F0125F_SCR01_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px')
     A                                  1  4HTML('","id":"F0125F_SCR01_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"F0125F-
     A                                      _SCR01_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1144px","id":"F0125F_SCR0-
     A                                      1_BtnSystemMessages","tool tip":"Sy-
     A                                      stem Messages","onclick":"SystemToo-
     A                                      lbarMessages","background image":{"-
     A                                      fieldName":"MsgIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1196px","id":"F0125F_SCR01_BtnHel-
     A                                      p","tool tip":"Help","onclick":"Sys-
     A                                      temToolbarHelp","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/help.png'')"},{"id":"F0125F-
     A                                      _SCR01_ImgSysToolBottom","field typ-
     A                                      e":"image","image source":"/profoun-
     A                                      dui/userdata/images/systool/butbarb-
     A                                      ot.png","left":"1036px","top":"64px-
     A                                      ","width":"187px","locked in place"-
     A                                      :"true","css class":"stationary","v-
     A                                      isibility":"hidden"},{"id":"F0125F_-
     A                                      SCR01_MainTabPanel","field type":"t-
     A                                      ab panel","tab panel style":"Transf-
     A                                      orm","tab names":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0125F_SCR01_BtnHiddenSave","value-
     A                                      ":"btnSave","top":"100px","response-
     A                                      ":{"fieldName":"btnSave","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"Q1U-
     A                                      SER","field type":"output field","v-
     A                                      alue":{"fieldName":"Q1USER","design-
     A                                      Value":"[Q1USER]","refField":"USER"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class 2":"top-line","parent tab pa-
     A                                      nel":"F0125F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SCCONM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCCONM","designValue":"[-
     A                                      SCCONM]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      14px","cursor column":"21","top":"1-
     A                                      10px","cursor row":"1","css class 2-
     A                                      ":"top-line","css class 3":"HI","de-
     A                                      scription":"COMPANY NAME","parent t-
     A                                      ab panel":"F0125F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t1","field type":"output field","le-
     A                                      ft":"778px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"F0125F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"F0125F_SCR01_fkeyMenu","field-
     A                                       type":"menu","left":"10px","top":"-
     A                                      120px","height":"350px","width":"23-
     A                                      0px","hover background color":"#9AA-
     A                                      A61","hover text color":"#FFFFFF","-
     A                                      border color":"#4C6106","menu optio-
     A                                      n indent":"10px","background color"-
     A                                      :"#758B27","css class":"ac')
     A                                  1  5HTML('tion-menu","css class 2":"sta-
     A                                      tionary","z index":"101"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0125F_SCR01_BtnHidde-
     A                                      nRefresh","value":"btnRefresh","top-
     A                                      ":"125px","response":{"fieldName":"-
     A                                      btnRefresh","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"Q1PGM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"Q1PGM","designValue":"[Q1PGM]-
     A                                      ","refField":"PGM","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      0125F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPRDS","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"414px","-
     A                                      cursor column":"21","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "description":"PROGRAM NAME","paren-
     A                                      t tab panel":"F0125F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant2","field-
     A                                       type":"output field","value":"SCR0-
     A                                      1","css class":"constant","left":"7-
     A                                      99px","cursor column":"76","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F0125F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0125F_SCR01_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0125F_SCR0-
     A                                      1_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0125F_SCR01_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant3","fi-
     A                                      eld type":"output field","value":"T-
     A                                      ype information, press the Enter ke-
     A                                      y.","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"2-
     A                                      10px","cursor row":"6","css class 2-
     A                                      ":"BLU","parent tab panel":"F0125F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0125F_SC-
     A                                      R01_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0125F_SCR01_Btn-
     A                                      HiddenWorkPrinterOutput","value":"b-
     A                                      tnWrkprtout","top":"250px","respons-
     A                                      e":{"fieldName":"btnWrkPrnt","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant4","field type":"output fi-
     A                                      eld","value":"Jurisdiction State:",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"270px-
     A                                      ","cursor row":"9","parent tab pane-
     A                                      l":"F0125F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCJRST","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCJRST","designValue":-
     A                                      "[SCJRST]","refField":"ST","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"435px","cursor column":"24","t-
     A                                      op":"270px","cursor row":"9","width-
     A                                      ":"15px","css class 3":"HI","error -
     A                                      message id":"MCR0503","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"21","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"2 -
     A                                      messages","error message id 2":"MCR-
     A                                      0504","error message file ')
     A                                  1  6HTML('2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"22","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"F0125F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 4":"profou-
     A                                      nd-converted"},{"id":"SCJRSD","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCJRSD","designValue":"[S-
     A                                      CJRSD]","refField":"DS30","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"47-
     A                                      7px","cursor column":"30","top":"27-
     A                                      0px","cursor row":"9","parent tab p-
     A                                      anel":"F0125F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0125F_SCR01_BtnHiddenImageQue-
     A                                      ue","value":"btnImgQue","top":"275p-
     A                                      x","response":{"fieldName":"btnImgQ-
     A                                      ue","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0125F_S-
     A                                      CR01_BtnHiddenHelp","value":"btnHel-
     A                                      p","top":"300px","response":{"field-
     A                                      Name":"btnHelp","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant5","-
     A                                      field type":"output field","value":-
     A                                      "Transaction Set ID:","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"310px","cursor row-
     A                                      ":"11","parent tab panel":"F0125F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCTSET","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCTSET","designValue":"[SCTSET]","-
     A                                      refField":"DS3","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"435px"-
     A                                      ,"cursor column":"24","top":"310px"-
     A                                      ,"cursor row":"11","width":"22px","-
     A                                      set focus":{"fieldName":"25","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"error message id":"MCR0513","erro-
     A                                      r message file":"FSMESG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"24","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","parent tab panel"-
     A                                      :"F0125F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"SCTRDS","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCTRDS","designValue":"[SCTR-
     A                                      DS]","refField":"DS30","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"477px-
     A                                      ","cursor column":"30","top":"310px-
     A                                      ","cursor row":"11","parent tab pan-
     A                                      el":"F0125F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant6","f-
     A                                      ield type":"output field","value":"-
     A                                      Leave transaction set ID blank for -
     A                                      global control values","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"350px","cursor ro-
     A                                      w":"13","parent tab panel":"F0125F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"15-
     A                                      0px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF03","field type":"button","v-
     A                                      alue":"Exit","shortcut key":"F3","l-
     A                                      eft":"14px","top":"183px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF10","fi-
     A                                      eld type":"button","value":"Search"-
     A                                      ,"shortcut key":"F10","left":"14px"-
     A                                      ,"top":"216px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF13","field type":"-
     A                                      button","value":"Change user parms"-
     A                                      ,"shortcut key":"F13","left":"14px"-
     A                                      ,"top":"249px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnHELP","field type":"-
     A                                      button","shortcut key":"Alt-F1","by-
     A                                      pass validation":"true","value":"HE-
     A                                      LP","response":{"fieldName":"*IN10"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"282px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(PGM)
     A            Q1USER    R        H      REFFLD(USER)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCJRSD    R        H      REFFLD(DS30)
     A            SCJRST    R        H      REFFLD(ST)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTRDS    R        H      REFFLD(DS30)
     A            SCTSET    R        H      REFFLD(DS3)
     A          R SCR02
     A  10 11 20
     A  21 22 23
     A  24 25 09                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                  1  2HTML('QPUIREC7    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCCSDTC7    MCR0500C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCMAXTC7    MCR0502-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     21RERRMSGID  5    C6    SCSEI-
     A                                      NC7    MCR0503C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     22RERRMSGID  5 -
     A                                         C5    SCSZPC7    MCR0503C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     23-
     A                                      RERRMSGID  5    C6    SCREINC7    M-
     A                                      CR0503C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     24RERRMSGID  5    C5   -
     A                                       SCRZPC7    MCR0503C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     25')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"return cursor recor-
     A                                      d":{"fieldName":"HREC","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"return cursor field":{"fiel-
     A                                      dName":"HFLD","dataLength":"10","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none"},"v-
     A                                      alid command key":{"fieldName":"*IN-
     A                                      11","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"overlay range":"1-23"},"items":-
     A                                      [{"id":"SCR02_HFLD","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"HFLD","design-
     A                                      Value":"[HFLD]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "left":"0px","top":"-30px","css cla-
     A                                      ss":"profound-converted"},{"id":"SC-
     A                                      R02_HREC","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"HREC","designValue":"[H-
     A                                      REC]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"10"},"left":"0p-
     A                                      x","top":"-30px","css class":"profo-
     A                                      und-converted"},{"id":"F0125F_SCR02-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "F0125F_SCR02_action","field type":-
     A                                      "html container","white space":"nor-
     A                                      mal","left":"0px","top":"10px","wid-
     A                                      th":"230px","css class":"action-pan-
     A                                      el-converted","height":"700px","htm-
     A                                      l":"<div class=\"top\"></div><div c-
     A                                      lass=\"imagetop\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_top.png\"-
     A                                       /></div><div class=\"menulinks\"><-
     A                                      /div><div class=\"imagebottom\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_bottom.png\" /></div><div clas-
     A                                      s=\"bottom\"></div>"},{"field type"-
     A                                      :"icon menu button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"32px","z index":"20","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1170px","id":"F0125F_SCR02_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon alignment":"middle -
     A                                      left","icon width":"16px","icon hei-
     A                                      ght":"24px","icon source":"/profoun-
     A                                      dui/userdata/images/systool/systool-
     A                                      s.png","data function":"SystemToolb-
     A                                      arSystools","show down arrow":"Yes"-
     A                                      },{"field type":"panel","panel styl-
     A                                      e":"TransformButtonBar","id":"F0125-
     A                                      F_SCR02_ButtonBar","top":"35px","le-
     A                                      ft":"1036px","width":"187px","heigh-
     A                                      t":"28px","css class":"stationary",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1040px","id":"F0125F_SCR02_BtnSave"-
     A                                      ,"tool tip":"Save","onclick":"Syste-
     A                                      mToolbarSave","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/save.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1066px","id":"F0125F_SCR02_B-
     A                                      tnRefresh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","backg')
     A                                  1  4HTML('round repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1092px","id":"F0125F_SCR02_Bt-
     A                                      nSearch","tool tip":"Search","oncli-
     A                                      ck":"SystemToolbarSearch","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/search.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1118px","id":"-
     A                                      F0125F_SCR02_BtnDiaryItems","tool t-
     A                                      ip":"Diary/Work Items - IDARTS","on-
     A                                      click":"SystemToolbarDiary","backgr-
     A                                      ound image":{"fieldName":"DryIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1144px","id":"F0125-
     A                                      F_SCR02_BtnSystemMessages","tool ti-
     A                                      p":"System Messages","onclick":"Sys-
     A                                      temToolbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0125F_SCR02_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F0125F_SCR02_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"F-
     A                                      0125F_SCR02_MainTabPanel","field ty-
     A                                      pe":"tab panel","tab panel style":"-
     A                                      Transform","tab names":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"active ta-
     A                                      b":"0","left":"250px","top":"70px",-
     A                                      "width":"970px","height":"657px","z-
     A                                       index":"8","locked in place":"true-
     A                                      ","css class":"tab-panel","css clas-
     A                                      s 2":"stationary"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0125F_SCR02_BtnHiddenSave",-
     A                                      "value":"btnSave","top":"100px","re-
     A                                      sponse":{"fieldName":"btnSave","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"SCR02_Q1USER","field type":"outp-
     A                                      ut field","value":{"fieldName":"Q1U-
     A                                      SER","designValue":"[Q1USER]","refF-
     A                                      ield":"USER","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"281px","cursor -
     A                                      column":"2","top":"110px","cursor r-
     A                                      ow":"1","css class 2":"top-line","p-
     A                                      arent tab panel":"F0125F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCR02_SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","css-
     A                                       class 3":"HI","description":"COMPA-
     A                                      NY NAME","parent tab panel":"F0125F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"constant7","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0125F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F0125F_SCR0-
     A                                      2_fkeyMenu","field type":"')
     A                                  1  5HTML('menu","left":"10px","top":"12-
     A                                      0px","height":"350px","width":"230p-
     A                                      x","hover background color":"#9AAA6-
     A                                      1","hover text color":"#FFFFFF","bo-
     A                                      rder color":"#4C6106","menu option -
     A                                      indent":"10px","background color":"-
     A                                      #758B27","css class":"action-menu",-
     A                                      "css class 2":"stationary","z index-
     A                                      ":"101"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F01-
     A                                      25F_SCR02_BtnHiddenRefresh","value"-
     A                                      :"btnRefresh","top":"125px","respon-
     A                                      se":{"fieldName":"btnRefresh","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCR02_Q1PGM","field type":"output-
     A                                       field","value":{"fieldName":"Q1PGM-
     A                                      ","designValue":"[Q1PGM]","refField-
     A                                      ":"PGM","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"130px","cursor row":"-
     A                                      2","parent tab panel":"F0125F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR02_SCPRDS","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CPRDS","designValue":"[SCPRDS]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"414px","curso-
     A                                      r column":"21","top":"130px","curso-
     A                                      r row":"2","css class 2":"HI","desc-
     A                                      ription":"PROGRAM NAME","parent tab-
     A                                       panel":"F0125F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","visibility":"hid-
     A                                      den","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant8","field type-
     A                                      ":"output field","value":"SCR02","c-
     A                                      ss class":"constant","left":"799px"-
     A                                      ,"cursor column":"76","top":"130px"-
     A                                      ,"cursor row":"2","parent tab panel-
     A                                      ":"F0125F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCMODE","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCMODE","designValue":"[SCM-
     A                                      ODE]","refField":"NM10","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","visibility"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"764px","cursor column":"71","to-
     A                                      p":"150px","cursor row":"3","css cl-
     A                                      ass 2":"HI","description":"ADD/UPDA-
     A                                      TE MODE","parent tab panel":"F0125F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0125F_S-
     A                                      CR02_BtnHiddenSearch","value":"btnS-
     A                                      earch","top":"150px","response":{"f-
     A                                      ieldName":"btnSearch","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt9","field type":"output field","v-
     A                                      alue":"Jurisdiction State  . :","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "F0125F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCJRST","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCJRST","designValue":"-
     A                                      [SCJRST]","refField":"ST","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"44-
     A                                      9px","cursor column":"26","top":"17-
     A                                      0px","cursor row":"4","parent tab p-
     A                                      anel":"F0125F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCR02_SCJRS-
     A                                      D","field type":"output field","val-
     A                                      ue":{"fieldName":"SCJRSD","designVa-
     A                                      lue":"[SCJRSD]","refField":"DS30","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"484px","cursor column":"31","-
     A                                      top":"170px","cursor row":"4","pare-
     A                                      nt tab panel":"F0125F_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0125F_SCR02_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant10","field-
     A                                       type":"output field","value":"Tran-
     A                                      saction Set ID  . :","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"190px","cursor row"-
     A                                      :"5","parent tab panel":"F0125F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCR02_SCTSET","field type":"-
     A                                      output field","value":{"fi')
     A                                  1  6HTML('eldName":"SCTSET","designValu-
     A                                      e":"[SCTSET]","refField":"DS3","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"449px","cursor column":"26","top-
     A                                      ":"190px","cursor row":"5","parent -
     A                                      tab panel":"F0125F_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCTRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCTRDS","des-
     A                                      ignValue":"[SCTRDS]","refField":"DS-
     A                                      30","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"484px","cursor column":"-
     A                                      31","top":"190px","cursor row":"5",-
     A                                      "parent tab panel":"F0125F_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0125F_SCR02_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0125F_SCR02_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant11",-
     A                                      "field type":"output field","value"-
     A                                      :"Type information, press the Enter-
     A                                       key.","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"230px","cursor row":"7","parent t-
     A                                      ab panel":"F0125F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0125F_SCR02_BtnHiddenWork-
     A                                      PrinterOutput","value":"btnWrkprtou-
     A                                      t","top":"250px","response":{"field-
     A                                      Name":"btnWrkPrnt","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant1-
     A                                      2","field type":"output field","val-
     A                                      ue":"Transmission Control","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"270px","curso-
     A                                      r row":"9","css class 2":"UL","pare-
     A                                      nt tab panel":"F0125F_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0125F_SCR02_BtnHidden-
     A                                      ImageQueue","value":"btnImgQue","to-
     A                                      p":"275px","response":{"fieldName":-
     A                                      "btnImgQue","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant13","fie-
     A                                      ld type":"output field","value":"Su-
     A                                      bmit only for bills paid on or afte-
     A                                      r           :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"290px","cursor row":"10",-
     A                                      "parent tab panel":"F0125F_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCCSDT","field type":"date field"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "date-field","value":{"fieldName":"-
     A                                      SCCSDT","designValue":"[SCCSDT]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      dataLength":"8","decPos":"0","numBl-
     A                                      ankFill":"true","edtWrd":"''  /  / -
     A                                         ''","dateFormat":"m/d/Y"},"left"-
     A                                      :"652px","cursor column":"55","top"-
     A                                      :"290px","cursor row":"10","width":-
     A                                      "71px","text align":"right","read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR-UL","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"error message id":"MCR0500-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"20","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"F0125F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 5":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0125F_SCR02_BtnHiddenHelp",-
     A                                      "value":"btnHelp","top":"300px","re-
     A                                      sponse":{"fieldName":"btnH')
     A                                  1  7HTML('elp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant14","fiel-
     A                                      d type":"output field","value":"Max-
     A                                      imum number of transactions per EDI-
     A                                       submission:","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      parent tab panel":"F0125F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCMAXT","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCMAXT"-
     A                                      ,"designValue":"[SCMAXT]","dataType-
     A                                      ":"zoned","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00","dataLeng-
     A                                      th":"5","decPos":"0","numBlankFill"-
     A                                      :"true"},"left":"652px","cursor col-
     A                                      umn":"55","top":"310px","cursor row-
     A                                      ":"11","width":"36px","text align":-
     A                                      "right","read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR-UL",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"error messa-
     A                                      ge id":"MCR0502","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"21","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","parent tab panel":"F0125F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 5":"profound-converted"},{-
     A                                      "id":"constant15","field type":"out-
     A                                      put field","value":"Transmission He-
     A                                      ader Data","css class":"constant","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"370px","cursor row":"14","css-
     A                                       class 2":"UL","parent tab panel":"-
     A                                      F0125F_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant16","field-
     A                                       type":"output field","value":"Send-
     A                                      er ID number  . :","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"390px","cursor row":"-
     A                                      15","parent tab panel":"F0125F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCSEIN","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      SEIN","designValue":"[SCSEIN]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      ,"dataLength":"12"},"text transform-
     A                                      ":"uppercase","left":"449px","curso-
     A                                      r column":"26","top":"390px","curso-
     A                                      r row":"15","width":"85px","css cla-
     A                                      ss 3":"HI","read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 4":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR-U-
     A                                      L","customFalse":""},"error message-
     A                                       id":"MCR0503","error message file"-
     A                                      :"FSMESG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"22","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"1 message-
     A                                      ","parent tab panel":"F0125F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 5":"profound-converted"},{"i-
     A                                      d":"constant17","field type":"outpu-
     A                                      t field","value":"Sender postal cod-
     A                                      e  :","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "410px","cursor row":"16","parent t-
     A                                      ab panel":"F0125F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCSZP",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCSZP","designVa-
     A                                      lue":"[SCSZP]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase","dataLength":"9-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"449px","cursor column":"26","t-
     A                                      op":"410px","cursor row":"16","widt-
     A                                      h":"64px","css class 3":"HI","read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR-UL","customFalse":-
     A                                      ""},"error message id":"MCR0503","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"23","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"1 message","parent tab pan-
     A                                      el":"F0125F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 5":"profou-
     A                                      nd-converted"},{"id":"constant18","-
     A                                      field type":"output field","value":-
     A                                      "Receiver ID number  :","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"4","top":"450px","cursor r-
     A                                      ow":"18","parent tab panel')
     A                                  1  8HTML('":"F0125F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCREIN","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCREIN","designVa-
     A                                      lue":"[SCREIN]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      12"},"text transform":"uppercase","-
     A                                      left":"449px","cursor column":"26",-
     A                                      "top":"450px","cursor row":"18","wi-
     A                                      dth":"85px","css class 3":"HI","rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 4":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR-UL","customFalse-
     A                                      ":""},"error message id":"MCR0503",-
     A                                      "error message file":"FSMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"24","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","parent tab p-
     A                                      anel":"F0125F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 5":"prof-
     A                                      ound-converted"},{"id":"constant19"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Receiver postal code:","css clas-
     A                                      s":"constant","left":"295px","curso-
     A                                      r column":"4","top":"470px","cursor-
     A                                       row":"19","parent tab panel":"F012-
     A                                      5F_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCRZP","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCRZP","designValue":"[SCRZP]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase","dataLength":"9"},"text transf-
     A                                      orm":"uppercase","left":"449px","cu-
     A                                      rsor column":"26","top":"470px","cu-
     A                                      rsor row":"19","width":"64px","css -
     A                                      class 3":"HI","read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 4":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R-UL","customFalse":""},"error mess-
     A                                      age id":"MCR0503","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"25","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"1 mess-
     A                                      age","parent tab panel":"F0125F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 5":"profound-converted"},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF03","field type":"button","valu-
     A                                      e":"Exit","shortcut key":"F3","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF12","field-
     A                                       type":"button","value":"Cancel","s-
     A                                      hortcut key":"F12","left":"14px","t-
     A                                      op":"216px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnHELP","field type":"but-
     A                                      ton","shortcut key":"Alt-F1","bypas-
     A                                      s validation":"true","value":"HELP"-
     A                                      ,"response":{"fieldName":"*IN10","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"le-
     A                                      ft":"14px","top":"249px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCCSDT         8S 0H
     A            SCMAXT         5S 0H
     A            SCREIN        12A  H
     A            SCRZP          9A  H
     A            SCSEIN        12A  H
     A            SCSZP          9A  H
     A            Q1PGM     R        H      REFFLD(PGM)
     A            Q1USER    R        H      REFFLD(USER)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCJRSD    R        H      REFFLD(DS30)
     A            SCJRST    R        H      REFFLD(ST)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTRDS    R        H      REFFLD(DS30)
     A            SCTSET    R        H      REFFLD(DS3)
     A          R SCR837
     A  10 11 21
     A  22 26 27
     A  28 29 30                            CA01(10 'Response Indicator *IN10')
     A  31 32 33
     A  34 35 09                            CA02(11 'Response Indicator *IN11')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                  1  2HTML('QPUIREC8    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C5  -
     A                                        SCLOGC7    MCR0513C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     26RERRMSG-
     A                                      ID  5    C5    SC837C7    MCR0513C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          27RERRMSGID  5    C6    SC837AC-
     A                                      7    MCR0513C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     28RERRMSGID  5   -
     A                                       C6    SCPDNYC7    MC40447C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     34R-
     A                                      ERRMSGID  5    C6    SCPDNYC7    MC-
     A                                      R0571C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     35RERRMSGID  5    C6    -
     A                                      SCDR01C7    MCR0513C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     30RERRMSGI-
     A                                      D  5    C6    SCDR02C7    MCR0513C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          32')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR837","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"set off":{"fieldName":"*IN21","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 2":{"fieldName":"*IN22","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 3":{"fieldName":"*IN26","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 4-
     A                                      ":{"fieldName":"*IN27","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 5":{-
     A                                      "fieldName":"*IN28","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 6":{"fi-
     A                                      eldName":"*IN29","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 7":{"field-
     A                                      Name":"*IN30","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 8":{"fieldNam-
     A                                      e":"*IN31","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"set off 9":{"fieldName":-
     A                                      "*IN32","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 10":{"fieldName":"*-
     A                                      IN33","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 11":{"fieldName":"*IN-
     A                                      34","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 12":{"fieldName":"*IN35-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"return cursor record":{"fieldName-
     A                                      ":"HREC","dataLength":"10","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none"},"return-
     A                                       cursor field":{"fieldName":"HFLD",-
     A                                      "dataLength":"10","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"valid command k-
     A                                      ey":{"fieldName":"*IN11","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"overlay ra-
     A                                      nge":"1-23"},"items":[{"id":"SCR837-
     A                                      _HFLD","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"HFLD","designValue":"[HFLD-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"10"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SCR837_HREC","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      HREC","designValue":"[HREC]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"10"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"F0125F_SCR837_avKeys","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"AV_KEYS","dataLength":-
     A                                      "1134","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[AV_KEY-
     A                                      S]"},"left":"0px","top":"0px","visi-
     A                                      bility":"hidden"},{"id":"F0125F_SCR-
     A                                      837_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"F0125F_SCR837_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"F0125F_SCR837_-
     A                                      ButtonBar","top":"35px","left":"103-
     A                                      6px","width":"187px","height":"28px-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1040px",-
     A                                      "id":"F0125F_SCR837_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type"')
     A                                  1  4HTML(':"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1066px","id":"F0125F-
     A                                      _SCR837_BtnRefresh","tool tip":"Ref-
     A                                      resh","onclick":"SystemToolbarRefre-
     A                                      sh","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/refr-
     A                                      esh.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1092px","id":"F0125F_SCR837_BtnSear-
     A                                      ch","tool tip":"Search","onclick":"-
     A                                      SystemToolbarSearch","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/search.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1118px","id":"F0125-
     A                                      F_SCR837_BtnDiaryItems","tool tip":-
     A                                      "Diary/Work Items - IDARTS","onclic-
     A                                      k":"SystemToolbarDiary","background-
     A                                       image":{"fieldName":"DryIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1144px","id":"F0125F_SC-
     A                                      R837_BtnSystemMessages","tool tip":-
     A                                      "System Messages","onclick":"System-
     A                                      ToolbarMessages","background image"-
     A                                      :{"fieldName":"MsgIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1196px","id":"F0125F_SCR837_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"F0-
     A                                      125F_SCR837_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"F0-
     A                                      125F_SCR837_MainTabPanel","field ty-
     A                                      pe":"tab panel","tab panel style":"-
     A                                      Transform","tab names":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"active ta-
     A                                      b":"0","left":"250px","top":"70px",-
     A                                      "width":"970px","height":"657px","z-
     A                                       index":"8","locked in place":"true-
     A                                      ","css class":"tab-panel","css clas-
     A                                      s 2":"stationary"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0125F_SCR837_BtnHiddenSave"-
     A                                      ,"value":"btnSave","top":"100px","r-
     A                                      esponse":{"fieldName":"btnSave","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCR837_Q1USER","field type":"ou-
     A                                      tput field","value":{"fieldName":"Q-
     A                                      1USER","designValue":"[Q1USER]","re-
     A                                      fField":"USER","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class 2":"top-line",-
     A                                      "parent tab panel":"F0125F_SCR837_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCR837_SCCONM","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      CONM","designValue":"[SCCONM]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"f')
     A                                  1  5HTML('alse","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                       2":"top-line","css class 3":"HI","-
     A                                      description":"COMPANY NAME","parent-
     A                                       tab panel":"F0125F_SCR837_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant20","field type":"output field"-
     A                                      ,"left":"778px","cursor column":"73-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class":"top-line","value":"js: c-
     A                                      urrentDate()","css class 2":"output-
     A                                      -field","parent tab panel":"F0125F_-
     A                                      SCR837_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"F0125F_SCR837_fkeyMenu",-
     A                                      "field type":"menu","left":"10px","-
     A                                      top":"120px","height":"350px","widt-
     A                                      h":"230px","hover background color"-
     A                                      :"#9AAA61","hover text color":"#FFF-
     A                                      FFF","border color":"#4C6106","menu-
     A                                       option indent":"10px","background -
     A                                      color":"#758B27","css class":"actio-
     A                                      n-menu","css class 2":"stationary",-
     A                                      "z index":"101"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0125F_SCR837_BtnHiddenRefresh-
     A                                      ","value":"btnRefresh","top":"125px-
     A                                      ","response":{"fieldName":"btnRefre-
     A                                      sh","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCR837_Q1PGM","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"Q1PGM","designValue":"[Q1PGM]"-
     A                                      ,"refField":"PGM","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"281px","cu-
     A                                      rsor column":"2","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"F0-
     A                                      125F_SCR837_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR837_SCPRDS","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCPRDS","designValue":"[-
     A                                      SCPRDS]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      14px","cursor column":"21","top":"1-
     A                                      30px","cursor row":"2","css class 2-
     A                                      ":"HI","description":"PROGRAM NAME"-
     A                                      ,"parent tab panel":"F0125F_SCR837_-
     A                                      MainTabPanel","parent tab":"0","vis-
     A                                      ibility":"hidden","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      1","field type":"output field","val-
     A                                      ue":"SCR837","css class":"constant"-
     A                                      ,"left":"792px","cursor column":"75-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F0125F_SCR837_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR837_SCMODE","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCMO-
     A                                      DE","designValue":"[SCMODE]","refFi-
     A                                      eld":"NM10","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","visibility":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"764px","-
     A                                      cursor column":"71","top":"150px","-
     A                                      cursor row":"3","css class 2":"HI",-
     A                                      "description":"ADD/UPDATE MODE","pa-
     A                                      rent tab panel":"F0125F_SCR837_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0125F_SCR837_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant22","fie-
     A                                      ld type":"output field","value":"Ju-
     A                                      risdiction State  . :","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"170px","cursor ro-
     A                                      w":"4","parent tab panel":"F0125F_S-
     A                                      CR837_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR837_SCJRST","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCJRST","designValue":"[SCJRST-
     A                                      ]","refField":"ST","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"449px","c-
     A                                      ursor column":"26","top":"170px","c-
     A                                      ursor row":"4","parent tab panel":"-
     A                                      F0125F_SCR837_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR837_SCJRSD","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCJRSD","designValue":-
     A                                      "[SCJRSD]","refField":"DS30","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "484px","cursor column":"31","top":-
     A                                      "170px","cursor row":"4","parent ta-
     A                                      b panel":"F0125F_SCR837_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"fie')
     A                                  1  6HTML('ld type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0125F_SCR8-
     A                                      37_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt23","field type":"output field","-
     A                                      value":"Transaction Set ID  . :","c-
     A                                      ss class":"constant","left":"281px"-
     A                                      ,"cursor column":"2","top":"190px",-
     A                                      "cursor row":"5","parent tab panel"-
     A                                      :"F0125F_SCR837_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR837_SCTSET",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCTSET","designValue-
     A                                      ":"[SCTSET]","refField":"DS3","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"449px","cursor column":"26","top"-
     A                                      :"190px","cursor row":"5","parent t-
     A                                      ab panel":"F0125F_SCR837_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR837-
     A                                      _SCTRDS","field type":"output field-
     A                                      ","value":{"fieldName":"SCTRDS","de-
     A                                      signValue":"[SCTRDS]","refField":"D-
     A                                      S30","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"484px","cursor column":-
     A                                      "31","top":"190px","cursor row":"5"-
     A                                      ,"parent tab panel":"F0125F_SCR837_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0125F_SCR837_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0125F_SCR837_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","response":{"fie-
     A                                      ldName":"btnWrkJob","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      24","field type":"output field","va-
     A                                      lue":"Type information, press the E-
     A                                      nter key.","css class":"constant","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"230px","cursor row":"7","pare-
     A                                      nt tab panel":"F0125F_SCR837_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0125F_SCR837_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant25","field type":"output field-
     A                                      ","value":"Transmission Header Data-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"270-
     A                                      px","cursor row":"9","css class 2":-
     A                                      "UL","parent tab panel":"F0125F_SCR-
     A                                      837_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0125F_SCR8-
     A                                      37_BtnHiddenImageQueue","value":"bt-
     A                                      nImgQue","top":"275px","response":{-
     A                                      "fieldName":"btnImgQue","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant26","field type":"output field"-
     A                                      ,"value":"Trigger for 837 log creat-
     A                                      ion:","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "290px","cursor row":"10","parent t-
     A                                      ab panel":"F0125F_SCR837_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCLOG"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCLOG","designV-
     A                                      alue":"[SCLOG]","refField":"FLAG","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase"},"text transform":"upperca-
     A                                      se","left":"505px","cursor column":-
     A                                      "34","top":"290px","cursor row":"10-
     A                                      ","width":"8px","css class 3":"HI",-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 4":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR-UL","customF-
     A                                      alse":""},"error message id":"MCR05-
     A                                      13","error message file":"FSMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"26","da-
     A                                      taType":"expression","form')
     A                                  1  7HTML('atting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"F0125F_SC-
     A                                      R837_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 5":"profound-converted"-
     A                                      },{"id":"SCLOGD","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCL-
     A                                      OGD","designValue":"[SCLOGD]","refF-
     A                                      ield":"DS30","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"519px","cursor -
     A                                      column":"36","top":"290px","cursor -
     A                                      row":"10","parent tab panel":"F0125-
     A                                      F_SCR837_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0125F-
     A                                      _SCR837_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant2-
     A                                      7","field type":"output field","val-
     A                                      ue":"837 file format             :"-
     A                                      ,"css class":"constant","left":"295-
     A                                      px","cursor column":"4","top":"310p-
     A                                      x","cursor row":"11","parent tab pa-
     A                                      nel":"F0125F_SCR837_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SC837","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SC837","designValue"-
     A                                      :"[SC837]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"505px","cursor column":"34",-
     A                                      "top":"310px","cursor row":"11","wi-
     A                                      dth":"8px","set focus":{"fieldName"-
     A                                      :"21","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 3":"HI","re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 4":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR-UL","customFals-
     A                                      e":""},"error message id":"MCR0513"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"27","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","parent tab -
     A                                      panel":"F0125F_SCR837_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 5":"pr-
     A                                      ofound-converted"},{"id":"SC837D","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SC837D","designValue"-
     A                                      :"[SC837D]","refField":"DS30","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"519px","cursor column":"36","top"-
     A                                      :"310px","cursor row":"11","parent -
     A                                      tab panel":"F0125F_SCR837_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant28","field type":"output field",-
     A                                      "value":"837/824 ack file format   -
     A                                        :","css class":"constant","left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      330px","cursor row":"12","parent ta-
     A                                      b panel":"F0125F_SCR837_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SC837A"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SC837A","design-
     A                                      Value":"[SC837A]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"505px","cursor column-
     A                                      ":"34","top":"330px","cursor row":"-
     A                                      12","width":"8px","set focus":{"fie-
     A                                      ldName":"22","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 3":"-
     A                                      HI","read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 4":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR-UL","cus-
     A                                      tomFalse":""},"error message id":"M-
     A                                      CR0513","error message file":"FSMES-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"28"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","pare-
     A                                      nt tab panel":"F0125F_SCR837_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       5":"profound-converted"},{"id":"SC-
     A                                      834D","field type":"output field","-
     A                                      value":{"fieldName":"SC834D","desig-
     A                                      nValue":"[SC834D]","refField":"DS30-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"519px","cursor column":"36-
     A                                      ","top":"330px","cursor row":"12","-
     A                                      parent tab panel":"F0125F_SCR837_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converte')
     A                                  1  8HTML('d"},{"id":"constant29","field-
     A                                       type":"output field","value":"Proc-
     A                                      ess denied bills (Y/) . :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"350px","curso-
     A                                      r row":"13","parent tab panel":"F01-
     A                                      25F_SCR837_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCPDNY","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCPDNY","designValue":"[SCPD-
     A                                      NY]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "505px","cursor column":"34","top":-
     A                                      "350px","cursor row":"13","width":"-
     A                                      8px","set focus":{"fieldName":"33",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 4":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR--
     A                                      UL","customFalse":""},"error messag-
     A                                      e id":"MC40447","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"34","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0571",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"35","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"F0125F_SCR837_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 5":"profound-converted"},{"id"-
     A                                      :"constant30","field type":"output -
     A                                      field","value":"DARTS Remark Codes"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"390p-
     A                                      x","cursor row":"15","css class 2":-
     A                                      "UL","parent tab panel":"F0125F_SCR-
     A                                      837_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant31","field type":"o-
     A                                      utput field","value":"For extract e-
     A                                      rror           :","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"410px","cursor row":"1-
     A                                      6","parent tab panel":"F0125F_SCR83-
     A                                      7_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCDR01","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      DR01","designValue":"[SCDR01]","ref-
     A                                      Field":"RMCD","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"505px","-
     A                                      cursor column":"34","top":"410px","-
     A                                      cursor row":"16","width":"36px","se-
     A                                      t focus":{"fieldName":"29","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR-UL","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"error message id":"M-
     A                                      CR0513","error message file":"FSMES-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"30"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","pare-
     A                                      nt tab panel":"F0125F_SCR837_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       5":"profound-converted"},{"id":"SC-
     A                                      D01D","field type":"output field","-
     A                                      value":{"fieldName":"SCD01D","desig-
     A                                      nValue":"[SCD01D]","refField":"DS40-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"547px","cursor column":"40-
     A                                      ","top":"410px","cursor row":"16","-
     A                                      parent tab panel":"F0125F_SCR837_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant32","field type":"output -
     A                                      field","value":"For acknowledgment -
     A                                      error  . :","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"430px","cursor row":"17","pa-
     A                                      rent tab panel":"F0125F_SCR837_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCDR02","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCDR02",-
     A                                      "designValue":"[SCDR02]","refField"-
     A                                      :"RMCD","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"505px')
     A                                  1  9HTML('","cursor column":"34","top":-
     A                                      "430px","cursor row":"17","width":"-
     A                                      36px","set focus":{"fieldName":"31"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR-UL",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"error messa-
     A                                      ge id":"MCR0513","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"32","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","parent tab panel":"F0125F_SCR8-
     A                                      37_MainTabPanel","parent tab":"0","-
     A                                      css class 5":"profound-converted"},-
     A                                      {"id":"SCD02D","field type":"output-
     A                                       field","value":{"fieldName":"SCD02-
     A                                      D","designValue":"[SCD02D]","refFie-
     A                                      ld":"DS40","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"547px","cursor co-
     A                                      lumn":"40","top":"430px","cursor ro-
     A                                      w":"17","parent tab panel":"F0125F_-
     A                                      SCR837_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF10","f-
     A                                      ield type":"button","value":"Search-
     A                                      ","shortcut key":"F10","left":"14px-
     A                                      ","top":"216px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF12","field type":-
     A                                      "button","value":"Cancel","shortcut-
     A                                       key":"F12","left":"14px","top":"24-
     A                                      9px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnHELP","field type":"button","s-
     A                                      hortcut key":"Alt-F1","bypass valid-
     A                                      ation":"true","value":"HELP","respo-
     A                                      nse":{"fieldName":"*IN10","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"282px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(PGM)
     A            Q1USER    R        H      REFFLD(USER)
     A            SC834D    R        H      REFFLD(DS30)
     A            SC837     R        H      REFFLD(FLAG)
     A            SC837A    R        H      REFFLD(FLAG)
     A            SC837D    R        H      REFFLD(DS30)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCD01D    R        H      REFFLD(DS40)
     A            SCD02D    R        H      REFFLD(DS40)
     A            SCDR01    R        H      REFFLD(RMCD)
     A            SCDR02    R        H      REFFLD(RMCD)
     A            SCJRSD    R        H      REFFLD(DS30)
     A            SCJRST    R        H      REFFLD(ST)
     A            SCLOG     R        H      REFFLD(FLAG)
     A            SCLOGD    R        H      REFFLD(DS30)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCPDNY    R        H      REFFLD(FLAG)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTRDS    R        H      REFFLD(DS30)
     A            SCTSET    R        H      REFFLD(DS3)
