     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDATA        70A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCENDT    R        H      REFFLD(DT8)
     A            SCSTAT    R        H      REFFLD(STAT)
     A            SCSTDT    R        H      REFFLD(DT8)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 22
     A  23 24 25                            CA01(01 'Response Indicator *IN01')
     A  26 27 28
     A  29 91 92
     A  93 94 95                            CA02(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    8 RSFLSIZ    1    C1    9 1   -
     A                                       RSFLNXTCHG 0    E1    3     086   -
     A                                       ROVERLAY   0     RROWS      2    C-
     A                                      1    1C2    21 RSFLMSGID  4    C7  -
     A                                        CPD6A81C7    QCPFMSGC5    *LIBLC0-
     A                                          E1    3     92RSFLMSGID  4    C-
     A                                      7    CPD6A7CC7    QCPFMSGC5    *LIB-
     A                                      LC0    E1    3     93RERRMSGID  5  -
     A                                        C6    SCCONMC7    CPF5203C7    QC-
     A                                      PFMSGC5    *LIBLC0    E1    3     9-
     A                                      1RERRMSGID  5    C6    SCCONMC7    -
     A                                      CPF5204C7    QCPFMSGC5    *LIBLC0  -
     A                                        E1    3     94')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A81","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"92","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"CPD6A7C","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-21"},"items":[{"id"-
     A                                      :"SCPST6","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"26","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST6","designValue":"[SCPST6]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SCPST8","field type":"ou-
     A                                      tput field","visibility":{"fieldNam-
     A                                      e":"28","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"value":{"fieldN-
     A                                      ame":"SCPST8","designValue":"[SCPST-
     A                                      8]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne","dataLength":"1"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SCPST3","field -
     A                                      type":"output field","visibility":{-
     A                                      "fieldName":"23","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"value"-
     A                                      :{"fieldName":"SCPST3","designValue-
     A                                      ":"[SCPST3]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"1"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCPST5-
     A                                      ","field type":"output field","visi-
     A                                      bility":{"fieldName":"25","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":{"fieldName":"SCPST5","de-
     A                                      signValue":"[SCPST5]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "1"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"SCPST9","field type":"output fie-
     A                                      ld","visibility":{"fieldName":"29",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":{"fieldName":"SC-
     A                                      PST9","designValue":"[SCPST9]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"1"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"SCOPL2","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SCOPL2","desi-
     A                                      gnValue":"[SCOPL2]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"7-
     A                                      6"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"SCPST1","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"21","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST1","designValue":"[SCPST1]","refF-
     A                                      ield":"DS5","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"left":"0px","top-
     A                                      ":"-30px","css class":"profound-con-
     A                                      verted"},{"id":"SCPST2","field type-
     A                                      ":"output field","visibility":{"fie-
     A                                      ldName":"22","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"value":{"f-
     A                                      ieldName":"SCPST2","designValue":"[-
     A                                      SCPST2]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"none","dataLength":"1"},"left":"-
     A                                      0px","top":"-30px","css class":"pro-
     A                                      found-converted"},{"id":"SCRRN1","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      SCRRN1","designValue":"[SCRRN1]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"4","decPos":"0"},"left":-
     A                                      "0px","top":"-30px","width":"28px",-
     A                                      "text align":"right","css class":"p-
     A                                      rofound-converted"},{"id":"SCPST4",-
     A                                      "field type":"output field","visibi-
     A                                      lity":{"fieldName":"24","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "value":{"fieldName":"SCPST4","desi-
     A                                      gnValue":"[SCPST4]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      "},"left":"0px","top":"-30')
     A                                  1  4HTML('px","css class":"profound-con-
     A                                      verted"},{"id":"SCPST7","field type-
     A                                      ":"output field","visibility":{"fie-
     A                                      ldName":"27","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"value":{"f-
     A                                      ieldName":"SCPST7","designValue":"[-
     A                                      SCPST7]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"none","dataLength":"1"},"left":"-
     A                                      0px","top":"-30px","css class":"pro-
     A                                      found-converted"},{"id":"SFLMOD","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      SFLMOD","designValue":"[SFLMOD]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none","d-
     A                                      ataLength":"1"},"left":"0px","top":-
     A                                      "-30px","css class":"profound-conve-
     A                                      rted"},{"id":"F0282F_SCR01C_avKeys"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"AV_KEYS","dataLengt-
     A                                      h":"1134","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[AV_-
     A                                      KEYS]"},"left":"0px","top":"0px","v-
     A                                      isibility":"hidden"},{"id":"F0282F_-
     A                                      SCR01C_action","field type":"html c-
     A                                      ontainer","white space":"normal","l-
     A                                      eft":"0px","top":"10px","width":"23-
     A                                      0px","css class":"action-panel-conv-
     A                                      erted","height":"700px","html":"<di-
     A                                      v class=\"top\"></div><div class=\"-
     A                                      imagetop\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_top.png\" /></di-
     A                                      v><div class=\"menulinks\"></div><d-
     A                                      iv class=\"imagebottom\"><img src=\-
     A                                      "/profoundui/userdata/images/bar_bo-
     A                                      ttom.png\" /></div><div class=\"bot-
     A                                      tom\"></div>"},{"field type":"icon -
     A                                      menu button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"32px","z index":"20","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1170-
     A                                      px","id":"F0282F_SCR01C_BtnIconMenu-
     A                                      SystemTools","tool tip":"System Too-
     A                                      ls","icon alignment":"middle left",-
     A                                      "icon width":"16px","icon height":"-
     A                                      24px","icon source":"/profoundui/us-
     A                                      erdata/images/systool/systools.png"-
     A                                      ,"data function":"SystemToolbarSyst-
     A                                      ools","show down arrow":"Yes"},{"fi-
     A                                      eld type":"panel","panel style":"Tr-
     A                                      ansformButtonBar","id":"F0282F_SCR0-
     A                                      1C_ButtonBar","top":"35px","left":"-
     A                                      1036px","width":"187px","height":"2-
     A                                      8px","css class":"stationary","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true"},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1040p-
     A                                      x","id":"F0282F_SCR01C_BtnSave","to-
     A                                      ol tip":"Save","onclick":"SystemToo-
     A                                      lbarSave","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/save.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1066px","id":"F0282F_SCR01C_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"F0282F_SCR01C_BtnSearch","tool ti-
     A                                      p":"Search","onclick":"SystemToolba-
     A                                      rSearch","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /search.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1118px","id":"F0282F_SCR01C_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFF')
     A                                  1  5HTML('F","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1144px","id":"F0282F-
     A                                      _SCR01C_BtnSystemMessages","tool ti-
     A                                      p":"System Messages","onclick":"Sys-
     A                                      temToolbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0282F_SCR01C-
     A                                      _BtnHelp","tool tip":"Help","onclic-
     A                                      k":"SystemToolbarHelp","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/help.png'')"},{"id":-
     A                                      "F0282F_SCR01C_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F0282F_SCR01C_MainTabPanel","field-
     A                                       type":"tab panel","tab panel style-
     A                                      ":"Transform","tab names":{"fieldNa-
     A                                      me":"SCPRDS","designValue":"[SCPRDS-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0282F_SCR01C_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant1","field type":"out-
     A                                      put field","left":"281px","cursor c-
     A                                      olumn":"2","top":"110px","cursor ro-
     A                                      w":"1","css class":"top-line","valu-
     A                                      e":"js: currentUser()","css class 2-
     A                                      ":"output-field","parent tab panel"-
     A                                      :"F0282F_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","error-
     A                                       message id":"CPF5203","error messa-
     A                                      ge file":"QCPFMSG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      2 messages","error message id 2":"C-
     A                                      PF5204","error message file 2":"QCP-
     A                                      FMSG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"94","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"F0282F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"constant2","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0282F_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"F0282F_SCR-
     A                                      01C_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0282F_SCR01C_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"Q1PGM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"Q1PGM","designValue":"[-
     A                                      Q1PGM]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"10"},"css cl-
     A                                      ass":"output-field","left":"281px",-
     A                                      "cursor column":"2","top":')
     A                                  1  6HTML('"130px","cursor row":"2","par-
     A                                      ent tab panel":"F0282F_SCR01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0282F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","visibility":"hidden",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant6","field type":"ou-
     A                                      tput field","value":"SCR01","css cl-
     A                                      ass":"constant","left":"799px","cur-
     A                                      sor column":"76","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"F0-
     A                                      282F_SCR01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCMODE","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCMODE","designValue":"[SCMODE]-
     A                                      ","refField":"PGM","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"764px","c-
     A                                      ursor column":"71","top":"150px","c-
     A                                      ursor row":"3","css class 2":"HI","-
     A                                      parent tab panel":"F0282F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0282F_SCR01C_Btn-
     A                                      HiddenSearch","value":"btnSearch","-
     A                                      top":"150px","response":{"fieldName-
     A                                      ":"btnSearch","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"SCL1HD","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCL1HD","designValue":"[SC-
     A                                      L1HD]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"78"},"css cla-
     A                                      ss":"output-field","left":"281px","-
     A                                      cursor column":"2","top":"170px","c-
     A                                      ursor row":"4","parent tab panel":"-
     A                                      F0282F_SCR01C_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0282F_SCR01C_BtnHiddenDiaryItems","-
     A                                      value":"btnDiary","top":"175px","re-
     A                                      sponse":{"fieldName":"btnDiary","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCL2HD","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCL2HD",-
     A                                      "designValue":"[SCL2HD]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"78"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"190px","cursor row":"5","p-
     A                                      arent tab panel":"F0282F_SCR01C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F0282F_SCR01C_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0282F_SCR01C_BtnHiddenW-
     A                                      orkSubmitJob","value":"btnWrksbmjob-
     A                                      ","top":"225px","response":{"fieldN-
     A                                      ame":"btnWrkJob","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant3",-
     A                                      "field type":"output field","value"-
     A                                      :"Provider FEIN/Mod:","css class":"-
     A                                      constant","left":"288px","cursor co-
     A                                      lumn":"3","top":"230px","cursor row-
     A                                      ":"7","parent tab panel":"F0282F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCFEIN","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCF-
     A                                      EIN","designValue":"[SCFEIN]","refF-
     A                                      ield":"FEIN","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"421px","cursor co-
     A                                      lumn":"22","top":"230px","cursor ro-
     A                                      w":"7","width":"63px","text align":-
     A                                      "right","css class 2":"HI","parent -
     A                                      tab panel":"F0282F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCMOD-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCMOD","designValu-
     A                                      e":"[SCMOD]","refField":"MOD","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"')
     A                                  1  7HTML('999.00"},"css class":"output--
     A                                      field","left":"498px","cursor colum-
     A                                      n":"33","top":"230px","cursor row":-
     A                                      "7","width":"21px","text align":"ri-
     A                                      ght","css class 2":"HI","parent tab-
     A                                       panel":"F0282F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      4","field type":"output field","val-
     A                                      ue":"or Name:","css class":"constan-
     A                                      t","left":"358px","cursor column":"-
     A                                      13","top":"250px","cursor row":"8",-
     A                                      "parent tab panel":"F0282F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCNAME","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCNAME","-
     A                                      designValue":"[SCNAME]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"421px","cursor column-
     A                                      ":"22","top":"250px","cursor row":"-
     A                                      8","css class 2":"HI","parent tab p-
     A                                      anel":"F0282F_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"SCAREA","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCAREA","designValue":-
     A                                      "[SCAREA]","dataType":"zoned","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","zeroFill":"tru-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","dataLength":"3","decPos"-
     A                                      :"0","edtWrd":"''0(   )''"},"css cl-
     A                                      ass":"output-field","left":"715px",-
     A                                      "cursor column":"64","top":"250px",-
     A                                      "cursor row":"8","width":"35px","te-
     A                                      xt align":"right","css class 2":"HI-
     A                                      ","parent tab panel":"F0282F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCPHNA","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPHNA"-
     A                                      ,"designValue":"[SCPHNA]","dataType-
     A                                      ":"zoned","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"true","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","dataLengt-
     A                                      h":"3","decPos":"0","edtWrd":"''0  -
     A                                       ''"},"css class":"output-field","l-
     A                                      eft":"757px","cursor column":"70","-
     A                                      top":"250px","cursor row":"8","widt-
     A                                      h":"21px","text align":"right","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F0282F_SCR01C_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant5","field-
     A                                       type":"output field","value":"-","-
     A                                      css class":"constant","left":"785px-
     A                                      ","cursor column":"74","top":"250px-
     A                                      ","cursor row":"8","css class 2":"H-
     A                                      I","parent tab panel":"F0282F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCPHNB","field type":"output -
     A                                      field","value":{"fieldName":"SCPHNB-
     A                                      ","designValue":"[SCPHNB]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"4","decPos":"0","edtWrd":"''0 -
     A                                         ''"},"css class":"output-field",-
     A                                      "left":"799px","cursor column":"76"-
     A                                      ,"top":"250px","cursor row":"8","wi-
     A                                      dth":"28px","text align":"right","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F0282F_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0282F_SCR01C_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0282F_SCR01C_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"275px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant7","field type":"out-
     A                                      put field","value":"Type options, p-
     A                                      ress Enter.","css class":"constant"-
     A                                      ,"left":"288px","cursor column":"3"-
     A                                      ,"top":"290px","cursor row":"10","c-
     A                                      ss class 2":"BLU","parent tab panel-
     A                                      ":"F0282F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0282F_SCR01C_BtnHiddenHelp","val-
     A                                      ue":"btnHelp","top":"300px","respon-
     A                                      se":{"fieldName":"btnHelp","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"S-
     A                                      COPL1","field type":"output field",-
     A                                      "value":{"fieldName":"SCOPL1","desi-
     A                                      gnValue":"[SCOPL1]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      76"},"css class":"output-field","le-
     A                                      ft":"288px","cursor column":"3","to-
     A                                      p":"310px","cursor row":"11","css c-
     A                                      lass 2":"BLU","parent tab ')
     A                                  1  8HTML('panel":"F0282F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"SCH-
     A                                      DL1","field type":"output field","v-
     A                                      alue":{"fieldName":"SCHDL1","design-
     A                                      Value":"[SCHDL1]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"78-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"350px","cursor row":"13","css cla-
     A                                      ss 2":"HI","parent tab panel":"F028-
     A                                      2F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","css class 4":"subfile-headin-
     A                                      g"},{"id":"SCR01S","field type":"gr-
     A                                      id","number of columns":"2","record-
     A                                       format name":"SCR01S","subfile nex-
     A                                      t changed":{"fieldName":"08","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"display subfile":{"fieldName":"04-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"display control record":{-
     A                                      "fieldName":"N03","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"clear sub-
     A                                      file":{"fieldName":"03","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"sub-
     A                                      file size":"9","place cursor":"true-
     A                                      ","header height":"20","row height"-
     A                                      :"20","css class":"subfilegrid","cs-
     A                                      s class 2":"profound-converted","pa-
     A                                      rent tab panel":"F0282F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","subfile-
     A                                       end":{"fieldName":"95","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"pag-
     A                                      e down response":{"fieldName":"*IN0-
     A                                      1","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"page up response":{"fieldName":"-
     A                                      *IN02","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"show paging controls":"true"-
     A                                      ,"scrollbar":"none","number of rows-
     A                                      ":"9","top":"350px","left":"276px",-
     A                                      "column widths":"35,525","return mo-
     A                                      de":{"fieldName":"SFLMOD","dataLeng-
     A                                      th":"1","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none"},"subfile record number":{"-
     A                                      fieldName":"SCRRN1","designValue":"-
     A                                      [SCRRN1]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"4","decPos":-
     A                                      "0"}},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF03","field type":"button"-
     A                                      ,"value":"F3","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF05","f-
     A                                      ield type":"button","value":"F5","s-
     A                                      hortcut key":"F5","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF06","field type":"butt-
     A                                      on","value":"F6","shortcut key":"F6-
     A                                      ","left":"14px","top":"249px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF11"-
     A                                      ,"field type":"button","value":"F11-
     A                                      ","shortcut key":"F11","left":"14px-
     A                                      ","top":"282px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF12","field type":-
     A                                      "button","value":"Cancel","shortcut-
     A                                       key":"F12","left":"14px","top":"31-
     A                                      5px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF17","field type":"button","v-
     A                                      alue":"F17","shortcut key":"F17","l-
     A                                      eft":"14px","top":"348px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF23","fi-
     A                                      eld type":"button","value":"F23","s-
     A                                      hortcut key":"F23","left":"14px","t-
     A                                      op":"381px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF24","field type":"but-
     A                                      ton","value":"F24","shortcut key":"-
     A                                      F24","left":"14px","top":"414px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"SCDBR-
     A                                      R","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"SCDBRR","designValue":"[SCDBRR-
     A                                      ]","dataType":"zoned","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"true","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","dataLength":"9","decPos":"0"},"l-
     A                                      eft":"-58px","top":"-399px","width"-
     A                                      :"63px","text align":"right","css c-
     A                                      lass":"profound-converted","grid":"-
     A                                      SCR01S","column":"0"},{"id":"SCENDT-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"SCENDT","designValue":"[SCENDT]-
     A                                      ","refField":"DT8","dataTy')
     A                                  1  9HTML('pe":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"true","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      "},"left":"-51px","top":"-399px","w-
     A                                      idth":"56px","text align":"right","-
     A                                      css class":"profound-converted","gr-
     A                                      id":"SCR01S","column":"0"},{"id":"S-
     A                                      CSTDT","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"SCSTDT","designValue":"[SC-
     A                                      STDT]","refField":"DT8","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00"},"left":-
     A                                      "-51px","top":"-399px","width":"56p-
     A                                      x","text align":"right","css class"-
     A                                      :"profound-converted","grid":"SCR01-
     A                                      S","column":"0"},{"id":"SCSTAT","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      CSTAT","designValue":"[SCSTAT]","re-
     A                                      fField":"STAT","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"left":"-45px"-
     A                                      ,"top":"-399px","css class":"profou-
     A                                      nd-converted","grid":"SCR01S","colu-
     A                                      mn":"0"},{"id":"SCSEL","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCSEL","designValue":"[SCSEL-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","dataLength":"2"},"text tra-
     A                                      nsform":"uppercase","left":"5px","c-
     A                                      ursor column":"2","top":"1px","curs-
     A                                      or row":"14","width":"15px","set fo-
     A                                      cus":{"fieldName":"07","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 3":{"fieldName":"05","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"RI","customFalse":""},-
     A                                      "description":"Selection Field","cs-
     A                                      s class 4":"profound-converted","gr-
     A                                      id":"SCR01S","column":"0"},{"id":"S-
     A                                      CDATA","field type":"output field",-
     A                                      "value":{"fieldName":"SCDATA","desi-
     A                                      gnValue":"[SCDATA]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      70"},"css class":"output-field","le-
     A                                      ft":"5px","cursor column":"7","top"-
     A                                      :"1px","cursor row":"14","css class-
     A                                       2":"profound-converted","grid":"SC-
     A                                      R01S","column":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCAREA         3S 0H
     A            SCHDL1        78A  H
     A            SCL1HD        78A  H
     A            SCL2HD        78A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPHNA         3S 0H
     A            SCPHNB         4S 0H
     A            SCPST2         1A  H
     A            SCPST3         1A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPST1    R        H      REFFLD(DS5)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      3-23"},"items":[{"id":"SCFKL2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"F0282F_SCR01_avKeys","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"AV_KEYS","dataLength"-
     A                                      :"1134","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[AV_KE-
     A                                      YS]"},"left":"0px","top":"0px","vis-
     A                                      ibility":"hidden"},{"id":"F0282F_SC-
     A                                      R01_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"F0282F_SCR01_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon alignment":"middle left","ico-
     A                                      n width":"16px","icon height":"24px-
     A                                      ","icon source":"/profoundui/userda-
     A                                      ta/images/systool/systools.png","da-
     A                                      ta function":"SystemToolbarSystools-
     A                                      ","show down arrow":"Yes"},{"field -
     A                                      type":"panel","panel style":"Transf-
     A                                      ormButtonBar","id":"F0282F_SCR01_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F0282F_SCR01_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F0282F_SCR01_BtnRefresh"-
     A                                      ,"tool tip":"Refresh","onclick":"Sy-
     A                                      stemToolbarRefresh","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/refresh.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1092px","id":"F0282-
     A                                      F_SCR01_BtnSearch","tool tip":"Sear-
     A                                      ch","onclick":"SystemToolbarSearch"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/search.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1118-
     A                                      px","id":"F0282F_SCR01_BtnDiaryItem-
     A                                      s","tool tip":"Diary/Work Items - I-
     A                                      DARTS","onclick":"SystemToolbarDiar-
     A                                      y","background image":{"fieldName":-
     A                                      "DryIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden')
     A                                  1  4HTML('","locked in place":"true","l-
     A                                      eft":"1144px","id":"F0282F_SCR01_Bt-
     A                                      nSystemMessages","tool tip":"System-
     A                                       Messages","onclick":"SystemToolbar-
     A                                      Messages","background image":{"fiel-
     A                                      dName":"MsgIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      96px","id":"F0282F_SCR01_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/help.png'')"},{"id":"F0282F_SCR-
     A                                      01_ImgSysToolBottom","field type":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/systool/butbarbot.p-
     A                                      ng","left":"1036px","top":"64px","w-
     A                                      idth":"187px","locked in place":"tr-
     A                                      ue","css class":"stationary","visib-
     A                                      ility":"hidden"},{"id":"F0282F_SCR0-
     A                                      1_MainTabPanel","field type":"tab p-
     A                                      anel","tab panel style":"Transform"-
     A                                      ,"tab names":"Tab 1","active tab":"-
     A                                      0","left":"250px","top":"70px","wid-
     A                                      th":"970px","height":"657px","z ind-
     A                                      ex":"8","locked in place":"true","c-
     A                                      ss class":"tab-panel","css class 2"-
     A                                      :"stationary"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0282F_SCR01_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"F-
     A                                      0282F_SCR01_fkeyMenu","field type":-
     A                                      "menu","left":"10px","top":"120px",-
     A                                      "height":"350px","width":"230px","h-
     A                                      over background color":"#9AAA61","h-
     A                                      over text color":"#FFFFFF","border -
     A                                      color":"#4C6106","menu option inden-
     A                                      t":"10px","background color":"#758B-
     A                                      27","css class":"action-menu","css -
     A                                      class 2":"stationary","z index":"10-
     A                                      1"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0282F_S-
     A                                      CR01_BtnHiddenRefresh","value":"btn-
     A                                      Refresh","top":"125px","response":{-
     A                                      "fieldName":"btnRefresh","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0282F_SCR01_BtnHidden-
     A                                      Search","value":"btnSearch","top":"-
     A                                      150px","response":{"fieldName":"btn-
     A                                      Search","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F028-
     A                                      2F_SCR01_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0282F_SCR01_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0282F_SCR01_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0282F_SCR01_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0282F_SCR01_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","c')
     A                                  1  5HTML('ss class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0282F_SCR01_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"SC-
     A                                      FKL1","field type":"output field","-
     A                                      value":{"fieldName":"SCFKL1","desig-
     A                                      nValue":"[SCFKL1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"78-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"550px","cursor row":"23",-
     A                                      "css class":"BLU","parent tab panel-
     A                                      ":"F0282F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnPAGEDOWN","field type":"button","-
     A                                      value":"Page Down","shortcut key":"-
     A                                      PageDown","response":{"fieldName":"-
     A                                      *IN01","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnP-
     A                                      AGEUP","field type":"button","value-
     A                                      ":"Page Up","shortcut key":"PageUp"-
     A                                      ,"response":{"fieldName":"*IN02","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"le-
     A                                      ft":"14px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        70A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    14 RSFLSIZ    1    C2    15 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       21 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-21"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"F0282F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"F0282F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"F0282F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      F0282F_SCR02C_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"F0282F_SCR02C_B-
     A                                      tnSave","tool tip":"Save","onclick"-
     A                                      :"SystemToolbarSave","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/save.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1066px","id":"F0282F_-
     A                                      SCR02C_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"F0282F_SCR02C_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"F0282F-
     A                                      _SCR02C_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","bord')
     A                                  1  4HTML('er bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1144px","-
     A                                      id":"F0282F_SCR02C_BtnSystemMessage-
     A                                      s","tool tip":"System Messages","on-
     A                                      click":"SystemToolbarMessages","bac-
     A                                      kground image":{"fieldName":"MsgIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1196px","id":"F0-
     A                                      282F_SCR02C_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"F0282F_SCR02C_ImgSysToo-
     A                                      lBottom","field type":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/systool/butbarbot.png","left":"-
     A                                      1036px","top":"64px","width":"187px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"F0282F_SCR02C_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRD2","designValu-
     A                                      e":"[SCPRD2]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0282F_SCR02C_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant8","field-
     A                                       type":"output field","left":"281px-
     A                                      ","cursor column":"2","top":"110px"-
     A                                      ,"cursor row":"1","css class":"top--
     A                                      line","value":"js: currentUser()","-
     A                                      css class 2":"output-field","parent-
     A                                       tab panel":"F0282F_SCR02C_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCR0-
     A                                      2C_SCCONM","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCCONM","-
     A                                      designValue":"[SCCONM]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"414px","cursor column-
     A                                      ":"21","top":"110px","cursor row":"-
     A                                      1","css class 2":"top-line","css cl-
     A                                      ass 3":"HI","parent tab panel":"F02-
     A                                      82F_SCR02C_MainTabPanel","parent ta-
     A                                      b":"0","css class 4":"profound-conv-
     A                                      erted"},{"id":"constant9","field ty-
     A                                      pe":"output field","left":"778px","-
     A                                      cursor column":"73","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"F0282F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"F0282F-
     A                                      _SCR02C_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0282F_SCR02-
     A                                      C_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"SCR02C-
     A                                      _Q1PGM","field type":"output field"-
     A                                      ,"value":{"fieldName":"Q1PGM","desi-
     A                                      gnValue":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"F0282F_SCR02C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCPRD-
     A                                      2","field type":"output field","val-
     A                                      ue":{"fieldName":"SCPRD2","designVa-
     A                                      lue":"[SCPRD2]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"130px","cursor row":"2","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      0282F_SCR02C_MainTabPanel"')
     A                                  1  5HTML(',"parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant10","field type":"output field-
     A                                      ","value":"SCR02","css class":"cons-
     A                                      tant","left":"799px","cursor column-
     A                                      ":"76","top":"130px","cursor row":"-
     A                                      2","parent tab panel":"F0282F_SCR02-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0282F_SCR02C-
     A                                      _BtnHiddenSearch","value":"btnSearc-
     A                                      h","top":"150px","response":{"field-
     A                                      Name":"btnSearch","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant11-
     A                                      ","field type":"output field","valu-
     A                                      e":"Press Enter to confirm your cho-
     A                                      ices for 4=Delete.","css class":"co-
     A                                      nstant","left":"281px","cursor colu-
     A                                      mn":"2","top":"170px","cursor row":-
     A                                      "4","css class 2":"BLU","parent tab-
     A                                       panel":"F0282F_SCR02C_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0282F_SCR02C_BtnHiddenDiar-
     A                                      yItems","value":"btnDiary","top":"1-
     A                                      75px","response":{"fieldName":"btnD-
     A                                      iary","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant12","field typ-
     A                                      e":"output field","value":"Press F1-
     A                                      2 to return to change your choices.-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"190-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "BLU","parent tab panel":"F0282F_SC-
     A                                      R02C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0282F_SCR-
     A                                      02C_BtnHiddenSystemMessages","value-
     A                                      ":"btnMessage","top":"200px","respo-
     A                                      nse":{"fieldName":"btnMessage","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0282F_SCR02C_Bt-
     A                                      nHiddenWorkSubmitJob","value":"btnW-
     A                                      rksbmjob","top":"225px","response":-
     A                                      {"fieldName":"btnWrkJob","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"SCR-
     A                                      02C_SCHDL1","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCHDL1",-
     A                                      "designValue":"[SCHDL1]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"78"},"left":"281px","cursor col-
     A                                      umn":"2","top":"230px","cursor row"-
     A                                      :"7","css class":"HI","parent tab p-
     A                                      anel":"F0282F_SCR02C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted","css class 3":"sub-
     A                                      file-heading"},{"id":"SCR02S","fiel-
     A                                      d type":"grid","number of columns":-
     A                                      "2","record format name":"SCR02S","-
     A                                      subfile next changed":"true","displ-
     A                                      ay subfile":{"fieldName":"14","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"display control record":{"fieldN-
     A                                      ame":"N13","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"clear subfile":{-
     A                                      "fieldName":"13","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"subfile si-
     A                                      ze":"15","header height":"20","row -
     A                                      height":"20","css class":"subfilegr-
     A                                      id","css class 2":"profound-convert-
     A                                      ed","parent tab panel":"F0282F_SCR0-
     A                                      2C_MainTabPanel","parent tab":"0","-
     A                                      subfile end":{"fieldName":"N15","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"page down response":{"fieldNam-
     A                                      e":"*IN01","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"page up response":{"fiel-
     A                                      dName":"*IN02","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"show paging controls-
     A                                      ":"true","scrollbar":"none","number-
     A                                       of rows":"15","top":"230px","left"-
     A                                      :"276px","column widths":"35,525","-
     A                                      subfile record number":{"fieldName"-
     A                                      :"SCRRN2","designValue":"[SCRRN2]",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      dataLength":"4","decPos":"0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0282F_SCR02C_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75')
     A                                  1  6HTML('px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      282F_SCR02C_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"302px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0282F_SCR02C_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"327px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","value":"Cancel","shortcut ke-
     A                                      y":"F12","left":"14px","top":"183px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"S-
     A                                      CR02S_SCDBRR","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"SCDBRR","designValu-
     A                                      e":"[SCDBRR]","dataType":"zoned","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","dataLength":"9","decP-
     A                                      os":"0"},"left":"-58px","top":"-279-
     A                                      px","width":"63px","text align":"ri-
     A                                      ght","css class":"profound-converte-
     A                                      d","grid":"SCR02S","column":"0"},{"-
     A                                      id":"SCSF1R","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SCSF1R","designValue-
     A                                      ":"[SCSF1R]","dataType":"zoned","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"t-
     A                                      rue","curSym":"","units":"","negNum-
     A                                      ":"-999.00","dataLength":"4","decPo-
     A                                      s":"0"},"left":"-23px","top":"-279p-
     A                                      x","width":"28px","text align":"rig-
     A                                      ht","css class":"profound-converted-
     A                                      ","grid":"SCR02S","column":"0"},{"i-
     A                                      d":"SCR02S_SCSEL","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      SEL","designValue":"[SCSEL]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"2"},"css class":"output-fi-
     A                                      eld","left":"5px","cursor column":"-
     A                                      2","top":"1px","cursor row":"8","de-
     A                                      scription":"Selection Field","css c-
     A                                      lass 2":"profound-converted","grid"-
     A                                      :"SCR02S","column":"0"},{"id":"SCR0-
     A                                      2S_SCDATA","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCDATA","-
     A                                      designValue":"[SCDATA]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"70"},"css class":"output-field"-
     A                                      ,"left":"5px","cursor column":"7","-
     A                                      top":"1px","cursor row":"8","css cl-
     A                                      ass 2":"profound-converted","grid":-
     A                                      "SCR02S","column":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"F0282F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"F0282F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      F0282F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon a-
     A                                      lignment":"middle left","icon width-
     A                                      ":"16px","icon height":"24px","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"F0282F_SCR02_ButtonBar-
     A                                      ","top":"35px","left":"1036px","wid-
     A                                      th":"187px","height":"28px","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den","locked in place":"true"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1040px","id":"F02-
     A                                      82F_SCR02_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1066px","i-
     A                                      d":"F0282F_SCR02_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"F0282F_SCR02-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"F0282F_SCR02_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"F0-
     A                                      282F_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting"')
     A                                  1  4HTML(':"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"F0282F_SCR02_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"F0282F_SCR02_ImgS-
     A                                      ysToolBottom","field type":"image",-
     A                                      "image source":"/profoundui/userdat-
     A                                      a/images/systool/butbarbot.png","le-
     A                                      ft":"1036px","top":"64px","width":"-
     A                                      187px","locked in place":"true","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden"},{"id":"F0282F_SCR02_MainT-
     A                                      abPanel","field type":"tab panel","-
     A                                      tab panel style":"Transform","tab n-
     A                                      ames":"Tab 1","active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F028-
     A                                      2F_SCR02_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"F0282F_S-
     A                                      CR02_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0282F_SCR02_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0282F_SCR02_BtnHiddenSearch"-
     A                                      ,"value":"btnSearch","top":"150px",-
     A                                      "response":{"fieldName":"btnSearch"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0282F_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0282F_SCR02_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0282F_SCR02_BtnHiddenWorkSubmitJ-
     A                                      ob","value":"btnWrksbmjob","top":"2-
     A                                      25px","response":{"fieldName":"btnW-
     A                                      rkJob","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0282-
     A                                      F_SCR02_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"fieldName":"btnWrkP-
     A                                      rnt","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0282F_-
     A                                      SCR02_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0282F_SCR02_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px"')
     A                                  1  5HTML(',"top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnPAGEDOWN","fie-
     A                                      ld type":"button","value":"Page Dow-
     A                                      n","shortcut key":"PageDown","respo-
     A                                      nse":{"fieldName":"*IN01","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"14-
     A                                      px","top":"183px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnPAGEUP","field ty-
     A                                      pe":"button","value":"Page Up","sho-
     A                                      rtcut key":"PageUp","response":{"fi-
     A                                      eldName":"*IN02","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02 57
     A  58                                  CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC5    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 RERR-
     A                                      MSGID  5    C6    SSSTDTC7    MCR05-
     A                                      00C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     57RERRMSGID  5    C6    SSE-
     A                                      NDTC7    MCR0500C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     57RERRMSGID  -
     A                                      5    C6    SSSTATC7    MC40001C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       58')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"constant13","field type":"out-
     A                                      put field","left":"29px","cursor co-
     A                                      lumn":"2","top":"65px","cursor row"-
     A                                      :"1","value":"js: currentUser()","c-
     A                                      ss class":"output-field","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRD3","field type":"output field","-
     A                                      value":{"fieldName":"SCPRD3","desig-
     A                                      nValue":"[SCPRD3]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"127px","cursor column":"16-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant14"-
     A                                      ,"field type":"output field","value-
     A                                      ":"SCR03","css class":"constant","l-
     A                                      eft":"477px","cursor column":"66","-
     A                                      top":"65px","cursor row":"1","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant15","field type":"output -
     A                                      field","value":"Type choices, press-
     A                                       Enter.","css class":"constant","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"105px","cursor row":"3","css cla-
     A                                      ss 2":"BLU","css class 3":"profound-
     A                                      -converted"},{"id":"constant16","fi-
     A                                      eld type":"output field","value":"R-
     A                                      ange of dates . . . . . . ","css cl-
     A                                      ass":"constant","left":"43px","curs-
     A                                      or column":"4","top":"145px","curso-
     A                                      r row":"5","css class 2":"profound--
     A                                      converted"},{"id":"SSSTDT","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SSSTDT","designValue":"[-
     A                                      SSSTDT]","refField":"DT8","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00"},"le-
     A                                      ft":"239px","cursor column":"32","t-
     A                                      op":"145px","cursor row":"5","width-
     A                                      ":"57px","css class 3":"UL","error -
     A                                      message id":"MCR0500","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"57","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"1 -
     A                                      message","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant17","field-
     A                                       type":"output field","value":"-","-
     A                                      css class":"constant","left":"309px-
     A                                      ","cursor column":"42","top":"145px-
     A                                      ","cursor row":"5","css class 2":"p-
     A                                      rofound-converted"},{"id":"SSENDT",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SSENDT","designV-
     A                                      alue":"[SSENDT]","refField":"DT8","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00"},"left":"323px","cursor column"-
     A                                      :"44","top":"145px","cursor row":"5-
     A                                      ","width":"57px","css class 3":"UL"-
     A                                      ,"error message id":"MCR0500","erro-
     A                                      r message file":"FSMESG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"57","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","css class 4":"pro-
     A                                      found-converted"},{"id":"constant18-
     A                                      ","field type":"output field","valu-
     A                                      e":"Status . . . . . . . . . .","cs-
     A                                      s class":"constant","left":"43px","-
     A                                      cursor column":"4","top":"185px","c-
     A                                      ursor row":"7","css class 2":"profo-
     A                                      und-converted"},{"id":"SSSTAT","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SSSTAT","designValue-
     A                                      ":"[SSSTAT]","refField":"STAT","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"239px","cursor column":"32-
     A                                      ","top":"185px","cursor row":"7","w-
     A                                      idth":"8px","css class 3":"UL","err-
     A                                      or message id":"MC40001","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"58","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","css class 4":"profound-
     A                                      -converted"},{"id":"constant19","fi-
     A                                      eld type":"output field","value":"A-
     A                                      =Active","css class":"constant","le-
     A                                      ft":"267px","cursor column":"36","t-
     A                                      op":"185px","cursor row":"7","css c-
     A                                      lass 2":"BLU","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant20","-
     A                                      field type":"output field","value":-
     A                                      "I=Inactive","css class":"constant"-
     A                                      ,"left":"267px","cursor column":"36-
     A                                      ","top":"205px","cursor row":"8","c-
     A                                      ss class 2":"BLU","css class 3":"pr-
     A                                      ofound-converted"},{"id":"')
     A                                  1  4HTML('btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"290px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF12","field type":"button","value"-
     A                                      :"Cancel","shortcut key":"F12","lef-
     A                                      t":"104px","top":"290px","width":"8-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnPAGEDOWN","-
     A                                      field type":"button","value":"Page -
     A                                      Down","shortcut key":"PageDown","re-
     A                                      sponse":{"fieldName":"*IN01","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"left":-
     A                                      "194px","top":"290px","width":"80px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","visibili-
     A                                      ty":"hidden","cursor":"default"},{"-
     A                                      id":"btnPAGEUP","field type":"butto-
     A                                      n","value":"Page Up","shortcut key"-
     A                                      :"PageUp","response":{"fieldName":"-
     A                                      *IN02","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"284px","top":"290px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","visibility":"hidden","cursor":-
     A                                      "default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SSENDT    R        H      REFFLD(DT8)
     A            SSSTAT    R        H      REFFLD(STAT)
     A            SSSTDT    R        H      REFFLD(DT8)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"F0282F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"F0282F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"F0282F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"F0282F_MSGSFLC-
     A                                      _ButtonBar","top":"35px","left":"10-
     A                                      36px","width":"187px","height":"28p-
     A                                      x","css class":"stationary","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1040px"-
     A                                      ,"id":"F0282F_MSGSFLC_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1066px","id":"F0282F_MSGSFLC_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"F0282F_MSGSFLC_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"F0282F_MSGSFLC_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"F0282F_MSGSFLC_BtnS-
     A                                      ystemMessages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType"')
     A                                  1  4HTML(':"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"F0282F_MSG-
     A                                      SFLC_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"F0282F_MSGSFLC_ImgSysToolBotto-
     A                                      m","field type":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/butbarbot.png","left":"1036px-
     A                                      ","top":"64px","width":"187px","loc-
     A                                      ked in place":"true","css class":"s-
     A                                      tationary","visibility":"hidden"},{-
     A                                      "id":"F0282F_MSGSFLC_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":"Ta-
     A                                      b 1","active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0282F_MSGSFL-
     A                                      C_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"F0282F_MSGSFLC_-
     A                                      fkeyMenu","field type":"menu","left-
     A                                      ":"10px","top":"120px","height":"35-
     A                                      0px","width":"230px","hover backgro-
     A                                      und color":"#9AAA61","hover text co-
     A                                      lor":"#FFFFFF","border color":"#4C6-
     A                                      106","menu option indent":"10px","b-
     A                                      ackground color":"#758B27","css cla-
     A                                      ss":"action-menu","css class 2":"st-
     A                                      ationary","z index":"101"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0282F_MSGSFLC_BtnHi-
     A                                      ddenRefresh","value":"btnRefresh","-
     A                                      top":"125px","response":{"fieldName-
     A                                      ":"btnRefresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0282F_MSGSFLC_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0282F_MSGSF-
     A                                      LC_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0282F_MSGSFLC_BtnHiddenS-
     A                                      ystemMessages","value":"btnMessage"-
     A                                      ,"top":"200px","response":{"fieldNa-
     A                                      me":"btnMessage","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0282F_MSGSFLC_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0282F_MSGSFLC_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0282F_MSGSFLC_BtnHiddenImageQueue"-
     A                                      ,"value":"btnImgQue","top":"275px",-
     A                                      "response":{"fieldName":"btnImgQue"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0282F_MSGS-
     A                                      FLC_BtnHiddenHelp","value":"btnHelp-
     A                                      ","top":"300px","response":{"fieldN-
     A                                      ame":"btnHelp","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"MSGSFL","fiel-
     A                                      d type":"grid","number of ')
     A                                  1  5HTML('columns":"1","record format n-
     A                                      ame":"MSGSFL","display subfile":"tr-
     A                                      ue","display control record":"true"-
     A                                      ,"subfile size":"5","initialize sub-
     A                                      file":"true","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","parent tab p-
     A                                      anel":"F0282F_MSGSFLC_MainTabPanel"-
     A                                      ,"parent tab":"0","subfile end":{"f-
     A                                      ieldName":"N10","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"number of r-
     A                                      ows":"1","has header":"false","subf-
     A                                      ile program message queue":{"fieldN-
     A                                      ame":"Q1PGM","dataLength":"10","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"su-
     A                                      bfile control program message queue-
     A                                      ":{"fieldName":"Q1PGM","dataLength"-
     A                                      :"10","trimLeading":"false","trimTr-
     A                                      ailing":"true","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"subfile message key":{"fiel-
     A                                      dName":"MSGKEY","dataLength":"4","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      top":"570px","left":"269px","column-
     A                                       widths":"595"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnPAGEDOWN","field -
     A                                      type":"button","value":"Page Down",-
     A                                      "shortcut key":"PageDown","response-
     A                                      ":{"fieldName":"*IN01","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnPAGEUP","field type"-
     A                                      :"button","value":"Page Up","shortc-
     A                                      ut key":"PageUp","response":{"field-
     A                                      Name":"*IN02","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
