     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  07 08 68
     A  88 74 73
     A  71 05     QPUI000001     1A  O  2  2
     A            ISBERR         1A  H
     A            SCBERR         1A  H
     A            SCBLST         3A  H
     A            SCCHRG        14A  H
     A            SCCNTL        20A  H
     A            SCDATA        74A  H
     A            SCDBRR         9S 0H
     A            SCIDOC        12A  H
     A            SCPAID        14A  H
     A            SCSEL          2A  H
     A            SCACDT    R        H      REFFLD(DS10)
     A            SCAST     R        H      REFFLD(ST)
     A            SCAUTH    R        H      REFFLD(FLAG)
     A            SCBTYP    R        H      REFFLD(BTYP)
     A            SCCASE    R        H      REFFLD(CASE)
     A            SCCERT    R        H      REFFLD(CERT)
     A            SCCRPE    R        H      REFFLD(FLAG)
     A            SCEOB#    R        H      REFFLD(EOB#)
     A            SCEXT     R        H      REFFLD(EXT)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFRD     R        H      REFFLD(DT)
     A            SCFRDT    R        H      REFFLD(DS10)
     A            SCFSN     R        H      REFFLD(FSN)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCLSN     R        H      REFFLD(LSN)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCNAME    R        H      REFFLD(DS20)
     A            SCPNAM    R        H      REFFLD(DS10)
     A            SCRCN     R        H      REFFLD(RCN)
     A            SCSS#     R        H      REFFLD(SS#)
     A            SCSUB#    R        H      REFFLD(SUB#)
     A            SCSYS     R        H      REFFLD(SYS)
     A            SCTODT    R        H      REFFLD(DS10)
     A            SHACDT    R        H      REFFLD(DT8)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 12 21
     A  22 23 24                            CA01(01 'Response Indicator *IN01')
     A  25 26 27
     A  28 29 45
     A  71 72 73                            CA02(02 'Response Indicator *IN02')
     A  74 75 76
     A  77 82 84
     A  85 86 87                            CA03
     A  88 91 92
     A  93 94 95
     A  06                                  CA04
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    4 RSFLSIZ    1    C2    30 1  -
     A                                        RSFLNXTCHG 0    E1    3     0831 -
     A                                        ROVERLAY   0     RROWS      2    -
     A                                      C1    1C2    19 RSFLMSGID  4    C7 -
     A                                         CPD6A81C7    QCPFMSGC5    *LIBLC-
     A                                      0    E1    3     92RSFLMSGID  4    -
     A                                      C7    CPD6A7CC7    QCPFMSGC5    *LI-
     A                                      BLC0    E1    3     93RSFLMSGID  4 -
     A                                         C7    MC40104C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     71RSFLMSGID  -
     A                                      4    C7    MC40135C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     82RSFLMSGID-
     A                                        4    C7    MC40158C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     73RSFLMSG-
     A                                      ID  4    C7    MC40162C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     74RSFLM-
     A                                      SGID  4    C7    MC40054C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     85RSF-
     A                                      LMSGID  4    C7    MC40055C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     86R-
     A                                      SFLMSGID  4    C7    MCR0395C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     8-
     A                                      8RSFLMSGID  4    C7    MC40218C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       87RSFLMSGID  4    C7    MC40400C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         84RSFLMSGID  4    C7    MC40406C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           75RSFLMSGID  4    C7    MC4018-
     A                                      4C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     76RSFLMSGID  4    C7    MC40-
     A                                      185C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     77RSFLMSGID  4    C7    MC-
     A                                      40438C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     72RSFLMSGID  4    C7    -
     A                                      WC32374C6    WMESGGC5    *LIBLC0   -
     A                                       E1    3     45RSFLMSGID  4    C7  -
     A                                        MCR0712C6    FSMESGC5    *LIBLC0 -
     A                                         FERRCLMLCK RERRMSGID  5    C6   -
     A                                       SCCONMC7    CPF5203C7    QCPFMSGC5-
     A                                          *LIBLC0    E1    3     91RERRMS-
     A                                      GID  5    C6    SCCONMC7    CPF5204-
     A                                      C7    QCPFMSGC5    *LIBLC0    E1   -
     A                                       3     94FSCPST1    INPUTONLY 0    -
     A                                       FSCPST4    INPUTONLY 0     FSCPST6-
     A                                          INPUTONLY 0     FSCPST2    INPU-
     A                                      TONLY 0     FSCPST5    INPUTONLY 0 -
     A                                          FSCPST3    INPUTONLY 0     FSCP-
     A                                      STB    INPUTONLY 0     FSCPSTC    I-
     A                                      NPUTONLY 0     FSCPSTA    INPUTONLY-
     A                                       0     FSCPSTF    INPUTONLY 0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error messages":-
     A                                      "17 messages","overlay range":"1-19-
     A                                      ","error message id":"CPD6A81","err-
     A                                      or message file":"QCPFMSG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"92","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error enhan-
     A                                      ced mode":"0","error message id 2":-
     A                                      "CPD6A7C","error message file 2":"Q-
     A                                      CPFMSG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"93","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode 2":"-
     A                                      0","error message id 3":"MC40104","-
     A                                      error message file 3":"FSMESG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"71","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode 3":"0","error me-
     A                                      ssage id 4":"MC40135","error messag-
     A                                      e file 4":"FSMESG","error message l-
     A                                      ibrary 4":"*LIBL","error condition -
     A                                      4":{"fieldName":"82","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error enhance-
     A                                      d mode 4":"0","error message id 5":-
     A                                      "MC40158","error message file 5":"F-
     A                                      SMESG","error message library 5":"*-
     A                                      LIBL","error condition 5":{"fieldNa-
     A                                      me":"73","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode 5":"0-
     A                                      ","error message id 6":"MC40162","e-
     A                                      rror message file 6":"FSMESG","erro-
     A                                      r message library 6":"*LIBL","error-
     A                                       condition 6":{"fieldName":"74","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror enhanced mode 6":"0","error mes-
     A                                      sage id 7":"MC40054","error message-
     A                                       file 7":"FSMESG","error message li-
     A                                      brary 7":"*LIBL","error condition 7-
     A                                      ":{"fieldName":"85","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode 7":"0","error message id 8":"-
     A                                      MC40055","error message file 8":"FS-
     A                                      MESG","error message library 8":"*L-
     A                                      IBL","error condition 8":{"fieldNam-
     A                                      e":"86","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode 8":"0"-
     A                                      ,"error message id 9":"MCR0395","er-
     A                                      ror message file 9":"FSMESG","error-
     A                                       message library 9":"*LIBL","error -
     A                                      condition 9":{"fieldName":"88","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or enhanced mode 9":"0","error mess-
     A                                      age id 10":"MC40218","error message-
     A                                       file 10":"FSMESG","error message l-
     A                                      ibrary 10":"*LIBL","e')
     A                                  1  2HTML('rror condition 10":{"fieldNam-
     A                                      e":"87","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode 10":"0-
     A                                      ","error message id 11":"MC40400","-
     A                                      error message file 11":"FSMESG","er-
     A                                      ror message library 11":"*LIBL","er-
     A                                      ror condition 11":{"fieldName":"84"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode 11":"0","erro-
     A                                      r message id 12":"MC40406","error m-
     A                                      essage file 12":"FSMESG","error mes-
     A                                      sage library 12":"*LIBL","error con-
     A                                      dition 12":{"fieldName":"75","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       enhanced mode 12":"0","error messa-
     A                                      ge id 13":"MC40184","error message -
     A                                      file 13":"FSMESG","error message li-
     A                                      brary 13":"*LIBL","error condition -
     A                                      13":{"fieldName":"76","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode 13":"0","error message id 1-
     A                                      4":"MC40185","error message file 14-
     A                                      ":"FSMESG","error message library 1-
     A                                      4":"*LIBL","error condition 14":{"f-
     A                                      ieldName":"77","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                       14":"0","error message id 15":"MC4-
     A                                      0438","error message file 15":"FSME-
     A                                      SG","error message library 15":"*LI-
     A                                      BL","error condition 15":{"fieldNam-
     A                                      e":"72","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode 15":"0-
     A                                      ","error message id 16":"WC32374","-
     A                                      error message file 16":"WMESGG","er-
     A                                      ror message library 16":"*LIBL","er-
     A                                      ror condition 16":{"fieldName":"45"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode 16":"0","erro-
     A                                      r message id 17":"MCR0712","error m-
     A                                      essage file 17":"FSMESG","error mes-
     A                                      sage library 17":"*LIBL","error con-
     A                                      dition 17":{"fieldName":"ErrClmLck"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode 17":"0"},"items"-
     A                                      :[{"id":"SCPST9","field type":"outp-
     A                                      ut field","visibility":{"fieldName"-
     A                                      :"29","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":{"fieldNam-
     A                                      e":"SCPST9","designValue":"[SCPST9]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"1"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"SFLMOD","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"SFLMOD"-
     A                                      ,"designValue":"[SFLMOD]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"1"},"left":"0px"')
     A                                  1  2HTML(',"top":"-10px","css class":"p-
     A                                      rofound-converted"},{"id":"SCRRN1",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"SCRRN1","designValue":"[SCRRN1]",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      dataLength":"4","decPos":"0"},"left-
     A                                      ":"0px","top":"-30px","width":"28px-
     A                                      ","text align":"right","css class":-
     A                                      "profound-converted"},{"id":"SCPST7-
     A                                      ","field type":"output field","visi-
     A                                      bility":{"fieldName":"27","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":{"fieldName":"SCPST7","de-
     A                                      signValue":"[SCPST7]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "1"},"left":"0px","top":"-15px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"SCPST8","field type":"output fie-
     A                                      ld","visibility":{"fieldName":"28",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":{"fieldName":"SC-
     A                                      PST8","designValue":"[SCPST8]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"1"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"F0350F_SCR01C_avKeys","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"AV_KEYS","dataLength"-
     A                                      :"1134","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[AV_KE-
     A                                      YS]"},"left":"0px","top":"0px","vis-
     A                                      ibility":"hidden"},{"id":"F0350F_SC-
     A                                      R01C_action","field type":"html con-
     A                                      tainer","white space":"normal","lef-
     A                                      t":"0px","top":"10px","width":"230p-
     A                                      x","css class":"action-panel-conver-
     A                                      ted","height":"700px","html":"<div -
     A                                      class=\"top\"></div><div class=\"im-
     A                                      agetop\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_top.png\" /></div>-
     A                                      <div class=\"menulinks\"></div><div-
     A                                       class=\"imagebottom\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_bott-
     A                                      om.png\" /></div><div class=\"botto-
     A                                      m\"></div>"},{"field type":"icon me-
     A                                      nu button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"32px","z index":"20","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1170px-
     A                                      ","id":"F0350F_SCR01C_BtnIconMenuSy-
     A                                      stemTools","tool tip":"System Tools-
     A                                      ","icon source":"/profoundui/userda-
     A                                      ta/images/systool/systools.png","da-
     A                                      ta function":"SystemToolbarSystools-
     A                                      ","show down arrow":"Yes"},{"field -
     A                                      type":"panel","panel style":"Transf-
     A                                      ormButtonBar","id":"F0350F_SCR01C_B-
     A                                      uttonBar","top":"35px')
     A                                  1  2HTML('","left":"1036px","width":"18-
     A                                      7px","height":"28px","css class":"s-
     A                                      tationary","visibility":"hidden","l-
     A                                      ocked in place":"true"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1040px","id":"F0350F_SCR-
     A                                      01C_BtnSave","tool tip":"Save","onc-
     A                                      lick":"SystemToolbarSave","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/save.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1066px","id":"F0-
     A                                      350F_SCR01C_BtnRefresh","tool tip":-
     A                                      "Refresh","onclick":"SystemToolbarR-
     A                                      efresh","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      refresh.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1092px","id":"F0350F_SCR01C_Btn-
     A                                      Search","tool tip":"Search","onclic-
     A                                      k":"SystemToolbarSearch","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/search.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1118px","id":"F-
     A                                      0350F_SCR01C_BtnDiaryItems","tool t-
     A                                      ip":"Diary/Work Items - IDARTS","on-
     A                                      click":"SystemToolbarDiary","backgr-
     A                                      ound image":{"fieldName":"DryIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"n')
     A                                  1  2HTML('one","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"F0350F_SCR01C_BtnSys-
     A                                      temMessages","tool tip":"System Mes-
     A                                      sages","onclick":"SystemToolbarMess-
     A                                      ages","background image":{"fieldNam-
     A                                      e":"MsgIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"F0350F_SCR01C_BtnHelp","too-
     A                                      l tip":"Help","onclick":"SystemTool-
     A                                      barHelp","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /help.png'')"},{"id":"F0350F_SCR01C-
     A                                      _ImgSysToolBottom","field type":"im-
     A                                      age","image source":"/profoundui/us-
     A                                      erdata/images/systool/butbarbot.png-
     A                                      ","left":"1036px","top":"64px","wid-
     A                                      th":"187px","locked in place":"true-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden"},{"id":"F0350F_SCR01C-
     A                                      _MainTabPanel","field type":"tab pa-
     A                                      nel","tab panel style":"Transform",-
     A                                      "tab names":{"fieldName":"SCPRDS","-
     A                                      designValue":"[SCPRDS]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F035-
     A                                      0F_SCR01C_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t5","field type":"output field","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass":"top-line","value":"js: curren-
     A                                      tUser()","css class 2":"output-fiel-
     A                                      d","parent tab panel":"F0350F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css')
     A                                  1  2HTML(' class":"output-field","left"-
     A                                      :"414px","cursor column":"21","top"-
     A                                      :"110px","cursor row":"1","css clas-
     A                                      s 2":"top-line","css class 3":"HI",-
     A                                      "error message id":"CPF5203","error-
     A                                       message file":"QCPFMSG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"91","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"2 messages","error message id-
     A                                       2":"CPF5204","error message file 2-
     A                                      ":"QCPFMSG","error message library -
     A                                      2":"*LIBL","error condition 2":{"fi-
     A                                      eldName":"94","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"parent tab panel":"F-
     A                                      0350F_SCR01C_MainTabPanel","parent -
     A                                      tab":"0","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant6","field -
     A                                      type":"output field","left":"778px"-
     A                                      ,"cursor column":"73","top":"110px"-
     A                                      ,"cursor row":"1","css class":"top--
     A                                      line","value":"js: currentDate()","-
     A                                      css class 2":"output-field","parent-
     A                                       tab panel":"F0350F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"F035-
     A                                      0F_SCR01C_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0350F_SCR-
     A                                      01C_BtnHiddenRefresh","value":"btnR-
     A                                      efresh","top":"125px","response":{"-
     A                                      fieldName":"btnRefresh","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"Q1PG-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"Q1PGM","designVal-
     A                                      ue":"[Q1PGM]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"10"},"-
     A                                      css class":"output-field","left":"2-
     A                                      81px","cursor column":"2","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"F0350F_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCPRDS","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCPRDS","designValue":-
     A                                      "[SCPRDS]","refField":"NAME","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "130px","cursor row":"2","css class-
     A                                       2":"HI","parent tab panel":"F0350F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","visibility":"hidden","css clas-
     A                                      s 3":"profound-conver')
     A                                  1  2HTML('ted"},{"id":"constant7","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      01","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F0350F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0350F_SCR01C_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant8","field type":-
     A                                      "output field","value":"Position to-
     A                                       . . .","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"170px","cursor row":"4","parent -
     A                                      tab panel":"F0350F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant12","field type":"output field",-
     A                                      "value":"EOMB#:","css class":"const-
     A                                      ant","visibility":{"fieldName":"24"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"407px","cursor -
     A                                      column":"20","top":"170px","cursor -
     A                                      row":"4","parent tab panel":"F0350F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant11","field type-
     A                                      ":"output field","value":"Social Se-
     A                                      curity #:","css class":"constant","-
     A                                      visibility":{"fieldName":"23","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"407px","cursor column-
     A                                      ":"20","top":"170px","cursor row":"-
     A                                      4","parent tab panel":"F0350F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant13","field type":"out-
     A                                      put field","value":"Control Number:-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"25","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"407px","cursor column":"20","t-
     A                                      op":"170px","cursor row":"4","paren-
     A                                      t tab panel":"F0350F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant14","field type":"output field-
     A                                      ","value":"Image Doc ID:","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"26","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"407px"-
     A                                      ,"cursor column":"20","top":"170px"-
     A                                      ,"cursor row":"4","parent tab panel-
     A                                      ":"F0350F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant9","fi-
     A                                      eld type":"output field","value":"L-
     A                                      ast:","css class":"constant","visib-
     A                                      ility":{"fieldName":"21","dataType"-
     A                                      :"expression","format')
     A                                  1  2HTML('ting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"407px"-
     A                                      ,"cursor column":"20","top":"170px"-
     A                                      ,"cursor row":"4","parent tab panel-
     A                                      ":"F0350F_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant10","f-
     A                                      ield type":"output field","value":"-
     A                                      Provider FEIN:","css class":"consta-
     A                                      nt","visibility":{"fieldName":"22",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"407px","cursor c-
     A                                      olumn":"20","top":"170px","cursor r-
     A                                      ow":"4","parent tab panel":"F0350F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPST1","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","input only":"true"-
     A                                      ,"value":{"fieldName":"SCPST1","des-
     A                                      ignValue":"[SCPST1]","refField":"LS-
     A                                      N","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true"},"visibility":{-
     A                                      "fieldName":"21","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "449px","cursor column":"26","top":-
     A                                      "170px","cursor row":"4","set focus-
     A                                      ":{"fieldName":"N06","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"parent-
     A                                       tab panel":"F0350F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted","width":"211-
     A                                      px"},{"id":"SCPST4","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","input only":"true-
     A                                      ","value":{"fieldName":"SCPST4","da-
     A                                      taLength":"9","numSep":"false","zer-
     A                                      oBalance":"false","numBlankFill":"t-
     A                                      rue","zeroFill":"false","curSym":""-
     A                                      ,"dataType":"char","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":""-
     A                                      ,"designValue":"[SCPST4]"},"text tr-
     A                                      ansform":"uppercase","visibility":{-
     A                                      "fieldName":"24","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "456px","cursor column":"27","top":-
     A                                      "170px","cursor row":"4","width":"6-
     A                                      4px","text align":"right","set focu-
     A                                      s":{"fieldName":"N06","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"paren-
     A                                      t tab panel":"F0350F_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"SCP-
     A                                      ST6","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","input only":"true","value":{"fie-
     A                                      ldName":"SCPST6","designValue":"[SC-
     A                                      PST6]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase","dataLength":"12"},"tex-
     A                                      t transform":"uppercase","visibilit-
     A                                      y":{"fieldName":"26","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"505px","cursor c')
     A                                  1  2HTML('olumn":"34","top":"170px","cu-
     A                                      rsor row":"4","width":"85px","set f-
     A                                      ocus":{"fieldName":"N06","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"pa-
     A                                      rent tab panel":"F0350F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCPST2","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","input only":"true","value":{"-
     A                                      fieldName":"SCPST2","designValue":"-
     A                                      [SCPST2]","refField":"FEI2","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","v-
     A                                      isibility":{"fieldName":"22","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"512px","cursor column"-
     A                                      :"35","top":"170px","cursor row":"4-
     A                                      ","set focus":{"fieldName":"N06","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"parent tab panel":"F0350F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted",-
     A                                      "width":"64px"},{"id":"SCPST5","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","input -
     A                                      only":"true","value":{"fieldName":"-
     A                                      SCPST5","designValue":"[SCPST5]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"13"},"text transfo-
     A                                      rm":"uppercase","visibility":{"fiel-
     A                                      dName":"25","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"519p-
     A                                      x","cursor column":"36","top":"170p-
     A                                      x","cursor row":"4","width":"92px",-
     A                                      "set focus":{"fieldName":"N06","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"parent tab panel":"F0350F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCPST3","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","input only":"true","val-
     A                                      ue":{"fieldName":"SCPST3","designVa-
     A                                      lue":"[SCPST3]","refField":"SS#","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","visibility":{"fieldName":"23","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"540px","cursor co-
     A                                      lumn":"39","top":"170px","cursor ro-
     A                                      w":"4","set focus":{"fieldName":"N0-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"parent tab panel":"F0350-
     A                                      F_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted","width":"64px"},{"id":"constan-
     A                                      t15","field type":"output field","v-
     A                                      alue":"Mod:","css cla')
     A                                  1  2HTML('ss":"constant","visibility":{-
     A                                      "fieldName":"22","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "590px","cursor column":"46","top":-
     A                                      "175px","cursor row":"4","parent ta-
     A                                      b panel":"F0350F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t16","field type":"output field","v-
     A                                      alue":"DOI:","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"23","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"617px","cursor colu-
     A                                      mn":"50","top":"170px","cursor row"-
     A                                      :"4","parent tab panel":"F0350F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCPSTB","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","input only":"true","v-
     A                                      alue":{"fieldName":"SCPSTB","design-
     A                                      Value":"[SCPSTB]","refField":"MOD",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"22"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"624px","cursor -
     A                                      column":"51","top":"170px","cursor -
     A                                      row":"4","parent tab panel":"F0350F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed","width":"22px"},{"id":"SCPSTC",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","in-
     A                                      put only":"true","value":{"fieldNam-
     A                                      e":"SCPSTC","designValue":"[SCPSTC]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase","dataLength":"8"},"text tran-
     A                                      sform":"uppercase","visibility":{"f-
     A                                      ieldName":"23","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"6-
     A                                      52px","cursor column":"55","top":"1-
     A                                      70px","cursor row":"4","width":"57p-
     A                                      x","parent tab panel":"F0350F_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant17","field type":"out-
     A                                      put field","value":"First:","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"21","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"673p-
     A                                      x","cursor column":"58","top":"170p-
     A                                      x","cursor row":"4","parent tab pan-
     A                                      el":"F0350F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCPSTA","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","input -
     A                                      only":"true","value":{"fieldName":"-
     A                                      SCPSTA","designValue":"[SCPSTA]","r-
     A                                      efField":"FSN","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTraili')
     A                                  1  2HTML('ng":"true"},"visibility":{"fi-
     A                                      eldName":"21","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"72-
     A                                      2px","cursor column":"65","top":"17-
     A                                      0px","cursor row":"4","parent tab p-
     A                                      anel":"F0350F_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted","width":"106px"},{-
     A                                      "id":"constant18","field type":"out-
     A                                      put field","value":"From Date:","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"21","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      673px","cursor column":"58","top":"-
     A                                      190px","cursor row":"5","parent tab-
     A                                       panel":"F0350F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPSTF",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","in-
     A                                      put only":"true","value":{"fieldNam-
     A                                      e":"SCPSTF","designValue":"[SCPSTF]-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","dataLength":"8","decPos":"0","n-
     A                                      umBlankFill":"true"},"visibility":{-
     A                                      "fieldName":"21","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "750px","cursor column":"69","top":-
     A                                      "190px","cursor row":"5","width":"5-
     A                                      7px","text align":"right","parent t-
     A                                      ab panel":"F0350F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0350F_SCR01C_BtnHiddenSy-
     A                                      stemMessages","value":"btnMessage",-
     A                                      "top":"200px","response":{"fieldNam-
     A                                      e":"btnMessage","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant19",-
     A                                      "field type":"output field","value"-
     A                                      :"Type options, press Enter.","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"210px","cu-
     A                                      rsor row":"6","css class 2":"BLU","-
     A                                      parent tab panel":"F0350F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0350F_SCR01C_Btn-
     A                                      HiddenWorkSubmitJob","value":"btnWr-
     A                                      ksbmjob","top":"225px","response":{-
     A                                      "fieldName":"btnWrkJob","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0350F_SC')
     A                                  1  2HTML('R01C_BtnHiddenDiaryItems","va-
     A                                      lue":"btnDiary","top":"175px","resp-
     A                                      onse":{"fieldName":"btnDiary","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCOPL1","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCOPL1","d-
     A                                      esignValue":"[SCOPL1]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"76"},"css class":"output-field",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"230px","cursor row":"7","css-
     A                                       class 2":"BLU","parent tab panel":-
     A                                      "F0350F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"SCOPL2","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCOPL2","designValue":"[SCOP-
     A                                      L2]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"76"},"css class-
     A                                      ":"output-field","left":"295px","cu-
     A                                      rsor column":"4","top":"250px","cur-
     A                                      sor row":"8","css class 2":"BLU","p-
     A                                      arent tab panel":"F0350F_SCR01C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F0350F_SCR01C_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0350F_SCR01C_BtnHi-
     A                                      ddenImageQueue","value":"btnImgQue"-
     A                                      ,"top":"275px","response":{"fieldNa-
     A                                      me":"btnImgQue","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"LblBilImpErr-
     A                                      1","field type":"output field","css-
     A                                       class":"label","value":"Bill","tex-
     A                                      t align":"left","left":"850px","top-
     A                                      ":"290px","width":"35px","css class-
     A                                       2":"profound-converted","css class-
     A                                       3":"subfile-heading","css class 4"-
     A                                      :"HI","visibility":{"fieldName":"is-
     A                                      BErr","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"}},{"id":"SCR01S_expand-
     A                                      er","field type":"image","image sou-
     A                                      rce":"/profoundui/proddata/images/i-
     A                                      cons/collapseall.gif","shortcut key-
     A                                      ":"F15","cursor":"pointer","tool ti-
     A                                      p":"Collapse All","onclick":"getObj-
     A                                      (\"SCR01S\").grid.toggle(this)","z -
     A                                      index":"25","top":"295px","left":"2-
     A                                      57px"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cu')
     A                                  1  2HTML('rsor":"default","visibility":-
     A                                      "hidden","id":"F0350F_SCR01C_BtnHid-
     A                                      denHelp","value":"btnHelp","top":"3-
     A                                      00px","response":{"fieldName":"btnH-
     A                                      elp","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"LblBilImpErr2","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Import ","left":"850p-
     A                                      x","top":"302px","width":"45px","pa-
     A                                      rent tab panel":"F0350F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","text al-
     A                                      ign":"left","css class 2":"profound-
     A                                      -converted","css class 3":"subfile--
     A                                      heading","css class 4":"HI","visibi-
     A                                      lity":{"fieldName":"isBErr","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      },{"id":"SCHDL1","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCH-
     A                                      DL1","designValue":"[SCHDL1]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"78"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"310px","cursor row":"-
     A                                      11","css class 2":"HI","parent tab -
     A                                      panel":"F0350F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted","css class 4":"su-
     A                                      bfile-heading"},{"id":"LblBilImpErr-
     A                                      3","field type":"output field","css-
     A                                       class":"label","value":"Error","le-
     A                                      ft":"850px","top":"315px","width":"-
     A                                      35px","parent tab panel":"F0350F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"text align":"left","css class 2":-
     A                                      "profound-converted","css class 3":-
     A                                      "subfile-heading","css class 4":"HI-
     A                                      ","visibility":{"fieldName":"isBErr-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"}},{"id":"SCR01S","field ty-
     A                                      pe":"grid","number of columns":"1",-
     A                                      "record format name":"SCR01S","subf-
     A                                      ile next changed":{"fieldName":"08"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"display subfile":{"fieldNa-
     A                                      me":"04","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"display control re-
     A                                      cord":{"fieldName":"N03","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cl-
     A                                      ear subfile":{"fieldName":"03","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"subfile size":"30","expanded":{-
     A                                      "fieldName":"N12","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"collapsed-
     A                                      ":{"fieldName":"12","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"place c-
     A                                      ursor":"true","header height":"40",-
     A                                      "row height":"40","css class":"subf-
     A                                      ilegrid","css class 2":"profound-co-
     A                                      nverted","parent tab')
     A                                  1  2HTML(' panel":"F0350F_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","subfile e-
     A                                      nd":{"fieldName":"95","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"page -
     A                                      down response":{"fieldName":"*IN01"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "page up response":{"fieldName":"*I-
     A                                      N02","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"show paging controls":"true","-
     A                                      scrollbar":"none","number of rows":-
     A                                      "5","fold multiple":"2","single row-
     A                                       zoom":"true","top":"290px","left":-
     A                                      "255px","column widths":"643","retu-
     A                                      rn mode":{"fieldName":"SFLMOD","dat-
     A                                      aLength":"1","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none"},"subfile record numbe-
     A                                      r":{"fieldName":"SCRRN1","designVal-
     A                                      ue":"[SCRRN1]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00","dataLength":"4","dec-
     A                                      Pos":"0"},"height":"200px","width":-
     A                                      "644px"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"150px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF05","field type":"butt-
     A                                      on","value":"F5","shortcut key":"F5-
     A                                      ","left":"14px","top":"216px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"SCHDLA",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCHDLA","designValue-
     A                                      ":"[SCHDLA]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none","dataLength":"16"},"c-
     A                                      ss class":"output-field","left":"64-
     A                                      5px","cursor column":"54","top":"29-
     A                                      0px","cursor row":"10","css class 2-
     A                                      ":"HI","parent tab panel":"F0350F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      ","css class 4":"subfile-heading"},-
     A                                      {"id":"btnCF06","field type":"butto-
     A                                      n","value":"F6","shortcut key":"F6"-
     A                                      ,"left":"14px","top":"249px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF09",-
     A                                      "field type":"button","value":"F9",-
     A                                      "shortcut key":"F9","left":"14px","-
     A                                      top":"282px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","value":"F3","shortcut key":"-
     A                                      F3","left":"14px","top":"183px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","value":"C-
     A                                      ancel","shortcut key"')
     A                                  1  2HTML(':"F12","left":"14px","top":"3-
     A                                      48px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF15","field type":"button","-
     A                                      visibility":"hidden","value":"F15",-
     A                                      "shortcut key":"F15","left":"14px",-
     A                                      "top":"381px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF17","field type":"b-
     A                                      utton","value":"F17","shortcut key"-
     A                                      :"F17","left":"14px","top":"414px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF23","field type":"button","value"-
     A                                      :"F23","shortcut key":"F23","left":-
     A                                      "14px","top":"447px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF24","field t-
     A                                      ype":"button","value":"F24","shortc-
     A                                      ut key":"F24","left":"14px","top":"-
     A                                      480px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF11","field type":"button",-
     A                                      "value":"F11","shortcut key":"F11",-
     A                                      "left":"14px","top":"315px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"SCSEL","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCSEL","designValue-
     A                                      ":"[SCSEL]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"2"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"25px","cursor column":"2","top":"-
     A                                      1px","cursor row":"12","width":"15p-
     A                                      x","description":"Selection Field",-
     A                                      "set focus":{"fieldName":"07","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 3":{"fieldName":"or 87-
     A                                       or 88 or 74 or 73 or 71 or 05","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"RI","customFalse"-
     A                                      :""},"css class 4":"profound-conver-
     A                                      ted","grid":"SCR01S","column":"0"},-
     A                                      {"id":"SCCERT","field type":"output-
     A                                       field","visibility":"hidden","valu-
     A                                      e":{"fieldName":"SCCERT","designVal-
     A                                      ue":"[SCCERT]","refField":"CERT","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"left":"-256px","top":"-359px",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR01S","column":"0"},{"id":"-
     A                                      SCBTYP","field type":"output field"-
     A                                      ,"visibility":"hidden","value":{"fi-
     A                                      eldName":"SCBTYP","designValue":"[S-
     A                                      CBTYP]","refField":"BTYP","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none"},"le-
     A                                      ft":"-256px","top":"-')
     A                                  1  2HTML('359px","css class":"profound--
     A                                      converted","grid":"SCR01S","column"-
     A                                      :"0"},{"id":"SCSYS","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SCSYS","desig-
     A                                      nValue":"[SCSYS]","refField":"SYS",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one"},"left":"-256px","top":"-359px-
     A                                      ","css class":"profound-converted",-
     A                                      "grid":"SCR01S","column":"0"},{"id"-
     A                                      :"SCCHRG","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCCHRG","designValue":"-
     A                                      [SCCHRG]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none","dataLength":"14"},"left"-
     A                                      :"-256px","top":"-359px","css class-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      1S","column":"0"},{"id":"SCDBRR","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      SCDBRR","designValue":"[SCDBRR]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"9","decPos":"0"},"left":-
     A                                      "-256px","top":"-359px","width":"63-
     A                                      px","text align":"right","css class-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      1S","column":"0"},{"id":"SCFSN","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      CFSN","designValue":"[SCFSN]","refF-
     A                                      ield":"FSN","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"left":"-256px","-
     A                                      top":"-359px","css class":"profound-
     A                                      -converted","grid":"SCR01S","column-
     A                                      ":"0"},{"id":"SCLSN","field type":"-
     A                                      output field","visibility":"hidden"-
     A                                      ,"value":{"fieldName":"SCLSN","desi-
     A                                      gnValue":"[SCLSN]","refField":"LSN"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"left":"-256px","top":"-359p-
     A                                      x","css class":"profound-converted"-
     A                                      ,"grid":"SCR01S","column":"0"},{"id-
     A                                      ":"SHACDT","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"SHACDT","designValue":-
     A                                      "[SHACDT]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      left":"-256px","top":"-359px","css -
     A                                      class":"profound-converted","grid":-
     A                                      "SCR01S","column":"0"},{"id":"SCIDO-
     A                                      C","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"SCIDOC","designValue":"[SCIDOC-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"12"},"left":"-256p-
     A                                      x","top":"-359px","css class":"prof-
     A                                      ound-converted","grid')
     A                                  1  2HTML('":"SCR01S","column":"0"},{"id-
     A                                      ":"SCFRDT","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"SCFRDT","designValue":-
     A                                      "[SCFRDT]","refField":"DS10","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none"},-
     A                                      "left":"-256px","top":"-359px","css-
     A                                       class":"profound-converted","grid"-
     A                                      :"SCR01S","column":"0"},{"id":"SCFR-
     A                                      D","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"SCFRD","designValue":"[SCFRD]"-
     A                                      ,"refField":"DT","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none"},"left":"-256-
     A                                      px","top":"-359px","css class":"pro-
     A                                      found-converted","grid":"SCR01S","c-
     A                                      olumn":"0"},{"id":"SCPAID","field t-
     A                                      ype":"output field","visibility":"h-
     A                                      idden","value":{"fieldName":"SCPAID-
     A                                      ","designValue":"[SCPAID]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none","dataLen-
     A                                      gth":"14"},"left":"-256px","top":"--
     A                                      359px","css class":"profound-conver-
     A                                      ted","grid":"SCR01S","column":"0"},-
     A                                      {"id":"SCSS#","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"SCSS#","designValue-
     A                                      ":"[SCSS#]","refField":"SS#","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none"},-
     A                                      "left":"-256px","top":"-359px","css-
     A                                       class":"profound-converted","grid"-
     A                                      :"SCR01S","column":"0"},{"id":"SCEO-
     A                                      B#","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"SCEOB#","designValue":"[SCEOB-
     A                                      #]","refField":"EOB#","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none"},"left":-
     A                                      "-256px","top":"-359px","css class"-
     A                                      :"profound-converted","grid":"SCR01-
     A                                      S","column":"0"},{"id":"SCBLST","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      CBLST","designValue":"[SCBLST]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none","da-
     A                                      taLength":"3"},"left":"-256px","top-
     A                                      ":"-359px","css class":"profound-co-
     A                                      nverted","grid":"SCR01S","column":"-
     A                                      0"},{"id":"SCCRPE","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"SCCRPE","desig-
     A                                      nValue":"[SCCRPE]","refField":"FLAG-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"left":"-256px","top":"-359-
     A                                      px","css class":"profound-converted-
     A                                      ","grid":"SCR01S","column":"0"},{"i-
     A                                      d":"SCACDT","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCACDT"')
     A                                  1  2HTML(',"designValue":"[SCACDT]","re-
     A                                      fField":"DS10","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"left":"-256px-
     A                                      ","top":"-359px","css class":"profo-
     A                                      und-converted","grid":"SCR01S","col-
     A                                      umn":"0"},{"id":"SCPNAM","field typ-
     A                                      e":"output field","visibility":"hid-
     A                                      den","value":{"fieldName":"SCPNAM",-
     A                                      "designValue":"[SCPNAM]","refField"-
     A                                      :"DS10","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none"},"left":"-256px","top"-
     A                                      :"-359px","css class":"profound-con-
     A                                      verted","grid":"SCR01S","column":"0-
     A                                      "},{"id":"SCFEIN","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"SCFEIN","design-
     A                                      Value":"[SCFEIN]","refField":"FEIN"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"left":"-256px","top":"-359p-
     A                                      x","css class":"profound-converted"-
     A                                      ,"grid":"SCR01S","column":"0"},{"id-
     A                                      ":"SCRCN","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCRCN","designValue":"[-
     A                                      SCRCN]","refField":"RCN","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none"},"lef-
     A                                      t":"-256px","top":"-359px","css cla-
     A                                      ss":"profound-converted","grid":"SC-
     A                                      R01S","column":"0"},{"id":"SCAST","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "SCAST","designValue":"[SCAST]","re-
     A                                      fField":"ST","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"left":"-256px",-
     A                                      "top":"-359px","css class":"profoun-
     A                                      d-converted","grid":"SCR01S","colum-
     A                                      n":"0"},{"id":"SCMOD","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"SCMOD","des-
     A                                      ignValue":"[SCMOD]","refField":"MOD-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"left":"-256px","top":"-359-
     A                                      px","css class":"profound-converted-
     A                                      ","grid":"SCR01S","column":"0"},{"i-
     A                                      d":"SCNAME","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCNAME","designValue"-
     A                                      :"[SCNAME]","refField":"DS20","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none"}-
     A                                      ,"left":"-256px","top":"-359px","cs-
     A                                      s class":"profound-converted","grid-
     A                                      ":"SCR01S","column":"0"},{"id":"SCC-
     A                                      NTL","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"SCCNTL","designValue":"[SCCN-
     A                                      TL]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","tex')
     A                                  1  2HTML('tTransform":"none","dataLengt-
     A                                      h":"20"},"left":"-256px","top":"-35-
     A                                      9px","css class":"profound-converte-
     A                                      d","grid":"SCR01S","column":"0"},{"-
     A                                      id":"SCAUTH","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SCAUTH","designValue-
     A                                      ":"[SCAUTH]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      },"left":"-256px","top":"-359px","c-
     A                                      ss class":"profound-converted","gri-
     A                                      d":"SCR01S","column":"0"},{"id":"SC-
     A                                      EXT","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"SCEXT","designValue":"[SCEXT-
     A                                      ]","refField":"EXT","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none"},"left":"--
     A                                      256px","top":"-359px","css class":"-
     A                                      profound-converted","grid":"SCR01S"-
     A                                      ,"column":"0"},{"id":"SCTODT","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"SCT-
     A                                      ODT","designValue":"[SCTODT]","refF-
     A                                      ield":"DS10","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"left":"-256px",-
     A                                      "top":"-359px","css class":"profoun-
     A                                      d-converted","grid":"SCR01S","colum-
     A                                      n":"0"},{"id":"SCDATA","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCDATA","designValue":"[SCDATA]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      ","dataLength":"74"},"css class":"o-
     A                                      utput-field","left":"53px","cursor -
     A                                      column":"6","top":"1px","cursor row-
     A                                      ":"12","css class 2":{"fieldName":"-
     A                                      68","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"RED","cust-
     A                                      omFalse":""},"css class 3":"profoun-
     A                                      d-converted","grid":"SCR01S","colum-
     A                                      n":"0"},{"id":"CbxBilImpError","fie-
     A                                      ld type":"checkbox","css class":"ou-
     A                                      tput-field","value":{"fieldName":"s-
     A                                      cBErr","dataLength":"1","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scBErr]"},"text align":"-
     A                                      left","checked value":"Y","left":"6-
     A                                      05px","top":"0px","width":"35px","l-
     A                                      ocked in place":"false","css class -
     A                                      2":"checkbox","disabled":"true","vi-
     A                                      sibility":{"fieldName":"isBErr","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"grid":"SCR01S","column":"0"},-
     A                                      {"id":"constant1","field type":"out-
     A                                      put field","value":"Case#:","css cl-
     A                                      ass":"constant","left":"88px","curs-
     A                                      or column":"11","top":"21px","curso-
     A                                      r row":"13","css class 2":"profound-
     A                                      -converted","grid":"S')
     A                                  1  2HTML('CR01S","column":"0"},{"id":"S-
     A                                      CSUB#","field type":"output field",-
     A                                      "value":{"fieldName":"SCSUB#","desi-
     A                                      gnValue":"[SCSUB#]","refField":"SUB-
     A                                      #","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"151px","cursor column":"2-
     A                                      0","top":"21px","cursor row":"13","-
     A                                      css class 2":"profound-converted","-
     A                                      grid":"SCR01S","column":"0"},{"id":-
     A                                      "constant2","field type":"output fi-
     A                                      eld","value":"-","css class":"const-
     A                                      ant","left":"193px","cursor column"-
     A                                      :"26","top":"21px","cursor row":"13-
     A                                      ","css class 2":"profound-converted-
     A                                      ","grid":"SCR01S","column":"0"},{"i-
     A                                      d":"SCFND","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCFND","d-
     A                                      esignValue":"[SCFND]","refField":"F-
     A                                      ND","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"207px","cursor column":"-
     A                                      28","top":"21px","cursor row":"13",-
     A                                      "css class 2":"profound-converted",-
     A                                      "grid":"SCR01S","column":"0"},{"id"-
     A                                      :"constant3","field type":"output f-
     A                                      ield","value":"-","css class":"cons-
     A                                      tant","left":"235px","cursor column-
     A                                      ":"32","top":"21px","cursor row":"1-
     A                                      3","css class 2":"profound-converte-
     A                                      d","grid":"SCR01S","column":"0"},{"-
     A                                      id":"SCFYR","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCFYR","-
     A                                      designValue":"[SCFYR]","refField":"-
     A                                      FYR","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"249px","cursor column":-
     A                                      "34","top":"21px","cursor row":"13"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"grid":"SCR01S","column":"0"},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"-","css class":"con-
     A                                      stant","left":"277px","cursor colum-
     A                                      n":"38","top":"21px","cursor row":"-
     A                                      13","css class 2":"profound-convert-
     A                                      ed","grid":"SCR01S","column":"0"},{-
     A                                      "id":"SCCASE","field type":"output -
     A                                      field","value":{"fieldName":"SCCASE-
     A                                      ","designValue":"[SCCASE]","refFiel-
     A                                      d":"CASE","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"291px","cursor col-
     A                                      umn":"40","top":"21px","cursor row"-
     A                                      :"13","css class 2":"profound-conve-
     A                                      rted","grid":"SCR01S","column":"0"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            ERRCLMLCK      1A  H
     A            ISBERR         1A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCHDLA        16A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST4         9A  H
     A            SCPST5        13A  H
     A            SCPST6        12A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCPSTC         8A  H
     A            SCPSTF         8S 0H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPST1    R        H      REFFLD(LSN)
     A            SCPST2    R        H      REFFLD(FEI2)
     A            SCPST3    R        H      REFFLD(SS#)
     A            SCPSTA    R        H      REFFLD(FSN)
     A            SCPSTB    R        H      REFFLD(MOD)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    22C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      2-23"},"items":[{"id":"F0350F_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "F0350F_SCR01_action","field type":-
     A                                      "html container","white space":"nor-
     A                                      mal","left":"0px","top":"10px","wid-
     A                                      th":"230px","css class":"action-pan-
     A                                      el-converted","height":"700px","htm-
     A                                      l":"<div class=\"top\"></div><div c-
     A                                      lass=\"imagetop\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_top.png\"-
     A                                       /></div><div class=\"menulinks\"><-
     A                                      /div><div class=\"imagebottom\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_bottom.png\" /></div><div clas-
     A                                      s=\"bottom\"></div>"},{"field type"-
     A                                      :"icon menu button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"32px","z index":"20","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1170px","id":"F0350F_SCR01_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon source":"/profoundu-
     A                                      i/userdata/images/systool/systools.-
     A                                      png","data function":"SystemToolbar-
     A                                      Systools","show down arrow":"Yes"},-
     A                                      {"field type":"panel","panel style"-
     A                                      :"TransformButtonBar","id":"F0350F_-
     A                                      SCR01_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"F0350F_SCR01_BtnSave","-
     A                                      tool tip":"Save","onclick":"SystemT-
     A                                      oolbarSave","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/save.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1066px","id":"F0')
     A                                  1  2HTML('350F_SCR01_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"F0350F_SCR01-
     A                                      _BtnSearch","tool tip":"Search","on-
     A                                      click":"SystemToolbarSearch","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/search.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1118px","id-
     A                                      ":"F0350F_SCR01_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"F0-
     A                                      350F_SCR01_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"F0350F_SCR-
     A                                      01_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/help.png'')"},{"id-
     A                                      ":"F0350F_SCR01_ImgSy')
     A                                  1  2HTML('sToolBottom","field type":"im-
     A                                      age","image source":"/profoundui/us-
     A                                      erdata/images/systool/butbarbot.png-
     A                                      ","left":"1036px","top":"64px","wid-
     A                                      th":"187px","locked in place":"true-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden"},{"id":"F0350F_SCR01_-
     A                                      MainTabPanel","field type":"tab pan-
     A                                      el","tab panel style":"Transform","-
     A                                      tab names":"Tab 1","active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0350F_SCR01_BtnHiddenSave","value-
     A                                      ":"btnSave","top":"100px","response-
     A                                      ":{"fieldName":"btnSave","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"F03-
     A                                      50F_SCR01_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0350F_SCR-
     A                                      01_BtnHiddenRefresh","value":"btnRe-
     A                                      fresh","top":"125px","response":{"f-
     A                                      ieldName":"btnRefresh","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0350F_SCR01_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0350F-
     A                                      _SCR01_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0350F_SCR01_BtnHidde-
     A                                      nSystemMessages","value":"btnMessag-
     A                                      e","top":"200px","response":{"field-
     A                                      Name":"btnMessage","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"')
     A                                  1  2HTML('field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0350F_S-
     A                                      CR01_BtnHiddenWorkSubmitJob","value-
     A                                      ":"btnWrksbmjob","top":"225px","res-
     A                                      ponse":{"fieldName":"btnWrkJob","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0350F_SCR01_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0350F_SCR01_BtnH-
     A                                      iddenImageQueue","value":"btnImgQue-
     A                                      ","top":"275px","response":{"fieldN-
     A                                      ame":"btnImgQue","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0350F_SCR01_BtnHiddenHelp","v-
     A                                      alue":"btnHelp","top":"300px","resp-
     A                                      onse":{"fieldName":"btnHelp","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCFKL1","field type":"output field-
     A                                      ","value":{"fieldName":"SCFKL1","de-
     A                                      signValue":"[SCFKL1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "78"},"left":"281px","cursor column-
     A                                      ":"2","top":"530px","cursor row":"2-
     A                                      2","css class":"BLU","parent tab pa-
     A                                      nel":"F0350F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCFKL2","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"281px","curs-
     A                                      or column":"2","top":"550px","curso-
     A                                      r row":"23","css class":"BLU","pare-
     A                                      nt tab panel":"F0350F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","visibility-
     A                                      ":"hidden","css class 2":"profound--
     A                                      converted"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnPAGEDOWN","field type-
     A                                      ":"button","value":"Page Down","sho-
     A                                      rtcut key":"PageDown"')
     A                                  1  2HTML(',"response":{"fieldName":"*IN-
     A                                      01","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnPAGE-
     A                                      UP","field type":"button","value":"-
     A                                      Page Up","shortcut key":"PageUp","r-
     A                                      esponse":{"fieldName":"*IN02","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"left"-
     A                                      :"14px","top":"216px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI000001     1A  O  2  2
     A            SCDATA        74A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    10 RSFLSIZ    1    C2    11 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       17 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-17"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"F0350F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"F0350F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"F0350F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"F0-
     A                                      350F_SCR02C_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"F0350F_SCR02C_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui')
     A                                  1  2HTML('/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F0350F_SCR02C_BtnRefresh-
     A                                      ","tool tip":"Refresh","onclick":"S-
     A                                      ystemToolbarRefresh","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/refresh.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1092px","id":"F035-
     A                                      0F_SCR02C_BtnSearch","tool tip":"Se-
     A                                      arch","onclick":"SystemToolbarSearc-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/searc-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      18px","id":"F0350F_SCR02C_BtnDiaryI-
     A                                      tems","tool tip":"Diary/Work Items -
     A                                      - IDARTS","onclick":"SystemToolbarD-
     A                                      iary","background image":{"fieldNam-
     A                                      e":"DryIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1144px-
     A                                      ","id":"F0350F_SCR02C_BtnSystemMess-
     A                                      ages","tool tip":"System Messages",-
     A                                      "onclick":"SystemToolbarMessages","-
     A                                      background image":{"fieldName":"Msg-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","back')
     A                                  1  2HTML('ground repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"F0350F_SCR02C_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F0350F_SCR02C_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      F0350F_SCR02C_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRD2","designValue":"[SCPRD2]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0350F_SCR02C_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant20","field type":"out-
     A                                      put field","left":"281px","cursor c-
     A                                      olumn":"2","top":"110px","cursor ro-
     A                                      w":"1","css class":"top-line","valu-
     A                                      e":"js: currentUser()","css class 2-
     A                                      ":"output-field","parent tab panel"-
     A                                      :"F0350F_SCR02C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCR02C_SCCONM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCCONM","designValue-
     A                                      ":"[SCCONM]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss 2":"top-line","css class 3":"HI"-
     A                                      ,"parent tab panel":"F0350F_SCR02C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"constant21","field type":"outpu-
     A                                      t field","left":"778px","cursor col-
     A                                      umn":"73","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentDate()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "F0350F_SCR02C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"F0350F_SCR02C_fk-
     A                                      eyMenu","field type":')
     A                                  1  2HTML('"menu","left":"10px","top":"1-
     A                                      20px","height":"350px","width":"230-
     A                                      px","hover background color":"#9AAA-
     A                                      61","hover text color":"#FFFFFF","b-
     A                                      order color":"#4C6106","menu option-
     A                                       indent":"10px","background color":-
     A                                      "#758B27","css class":"action-menu"-
     A                                      ,"css class 2":"stationary","z inde-
     A                                      x":"101"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      350F_SCR02C_BtnHiddenRefresh","valu-
     A                                      e":"btnRefresh","top":"125px","resp-
     A                                      onse":{"fieldName":"btnRefresh","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCR02C_Q1PGM","field type":"out-
     A                                      put field","value":{"fieldName":"Q1-
     A                                      PGM","designValue":"[Q1PGM]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"10"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"F0350F_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCPRD2","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPRD2"-
     A                                      ,"designValue":"[SCPRD2]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"130px","cursor row"-
     A                                      :"2","css class 2":"HI","parent tab-
     A                                       panel":"F0350F_SCR02C_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      22","field type":"output field","va-
     A                                      lue":"SCR02","css class":"constant"-
     A                                      ,"left":"799px","cursor column":"76-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F0350F_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant23","field type":"output f-
     A                                      ield","value":"F0350F-SCR02-JWALK T-
     A                                      AG","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      50px","cursor row":"3","visibility"-
     A                                      :"hidden","parent tab panel":"F0350-
     A                                      F_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0350F-
     A                                      _SCR02C_BtnHiddenSearch","value":"b-
     A                                      tnSearch","top":"150px","response":-
     A                                      {"fieldName":"btnSearch","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant24","field type":"output field-
     A                                      ","value":"Press Enter to confirm y-
     A                                      our choices for 4=Delete.","css cla-
     A                                      ss":"constant","left"')
     A                                  1  2HTML(':"281px","cursor column":"2",-
     A                                      "top":"170px","cursor row":"4","css-
     A                                       class 2":"BLU","parent tab panel":-
     A                                      "F0350F_SCR02C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0350F_SCR02C_BtnHiddenDiaryItems",-
     A                                      "value":"btnDiary","top":"175px","r-
     A                                      esponse":{"fieldName":"btnDiary","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant25","field type":"outp-
     A                                      ut field","value":"Press F12 to ret-
     A                                      urn to change your choices.","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"190px","cur-
     A                                      sor row":"5","css class 2":"BLU","p-
     A                                      arent tab panel":"F0350F_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F0350F_SCR02C_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0350F_SCR02C_BtnHiddenW-
     A                                      orkSubmitJob","value":"btnWrksbmjob-
     A                                      ","top":"225px","response":{"fieldN-
     A                                      ame":"btnWrkJob","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"SCR02C_SCHD-
     A                                      L1","field type":"output field","va-
     A                                      lue":{"fieldName":"SCHDL1","designV-
     A                                      alue":"[SCHDL1]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none","dataLength":"78"}-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"230px","cursor row":"7","cs-
     A                                      s class":"HI","parent tab panel":"F-
     A                                      0350F_SCR02C_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted","css class 3":"subfile-hea-
     A                                      ding"},{"id":"SCR02S","field type":-
     A                                      "grid","number of columns":"2","rec-
     A                                      ord format name":"SCR02S","subfile -
     A                                      next changed":"true","display subfi-
     A                                      le":{"fieldName":"14","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"displ-
     A                                      ay control record":{"fieldName":"N1-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"clear subfile":{"fieldNa-
     A                                      me":"13","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"subfile size":"11"-
     A                                      ,"header height":"20","row height":-
     A                                      "20","css class":"sub')
     A                                  1  2HTML('filegrid","css class 2":"prof-
     A                                      ound-converted","parent tab panel":-
     A                                      "F0350F_SCR02C_MainTabPanel","paren-
     A                                      t tab":"0","subfile end":{"fieldNam-
     A                                      e":"N15","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"page down response-
     A                                      ":{"fieldName":"*IN01","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"page up resp-
     A                                      onse":{"fieldName":"*IN02","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"show pag-
     A                                      ing controls":"true","scrollbar":"n-
     A                                      one","number of rows":"11","top":"2-
     A                                      30px","left":"276px","column widths-
     A                                      ":"28,553","subfile record number":-
     A                                      {"fieldName":"SCRRN2","designValue"-
     A                                      :"[SCRRN2]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"4","decPos-
     A                                      ":"0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F035-
     A                                      0F_SCR02C_BtnHiddenWorkPrinterOutpu-
     A                                      t","value":"btnWrkprtout","top":"25-
     A                                      0px","response":{"fieldName":"btnWr-
     A                                      kPrnt","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0350-
     A                                      F_SCR02C_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"302px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0350F_SCR02C_Btn-
     A                                      HiddenHelp","value":"btnHelp","top"-
     A                                      :"327px","response":{"fieldName":"b-
     A                                      tnHelp","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"btnSubmit","field ty-
     A                                      pe":"button","value":"Enter","short-
     A                                      cut key":"Enter","left":"14px","top-
     A                                      ":"150px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field type":"butto-
     A                                      n","value":"Cancel","shortcut key":-
     A                                      "F12","left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"SCR0-
     A                                      2S_SCDBRR","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"SCDBRR","designValue":-
     A                                      "[SCDBRR]","dataType":"zoned","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","zeroFill":"tru-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","dataLength')
     A                                  1  2HTML('":"9","decPos":"0"},"left":"--
     A                                      58px","top":"-279px","width":"63px"-
     A                                      ,"text align":"right","css class":"-
     A                                      profound-converted","grid":"SCR02S"-
     A                                      ,"column":"0"},{"id":"SCSF1R","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"SCS-
     A                                      F1R","designValue":"[SCSF1R]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"true","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"4","decPos":"0"},"left":"-2-
     A                                      3px","top":"-279px","width":"28px",-
     A                                      "text align":"right","css class":"p-
     A                                      rofound-converted","grid":"SCR02S",-
     A                                      "column":"0"},{"id":"SCR02S_SCSEL",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCSEL","designValue"-
     A                                      :"[SCSEL]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"2"},"css -
     A                                      class":"output-field","left":"5px",-
     A                                      "cursor column":"2","top":"1px","cu-
     A                                      rsor row":"8","description":"Select-
     A                                      ion Field","css class 2":"profound--
     A                                      converted","grid":"SCR02S","column"-
     A                                      :"0"},{"id":"SCR02S_SCDATA","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCDATA","designValue":"[SCD-
     A                                      ATA]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none","dataLength":"74"},"css clas-
     A                                      s":"output-field","left":"5px","cur-
     A                                      sor column":"6","top":"1px","cursor-
     A                                       row":"8","css class 2":"profound-c-
     A                                      onverted","grid":"SCR02S","column":-
     A                                      "1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"F0350F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"F0350F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      F0350F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/systools.png","data functi-
     A                                      on":"SystemToolbarSystools","show d-
     A                                      own arrow":"Yes"},{"field type":"pa-
     A                                      nel","panel style":"TransformButton-
     A                                      Bar","id":"F0350F_SCR02_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"F0350-
     A                                      F_SCR02_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"F0350F_SCR02_BtnRef')
     A                                  1  2HTML('resh","tool tip":"Refresh","o-
     A                                      nclick":"SystemToolbarRefresh","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/refresh.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1092px",-
     A                                      "id":"F0350F_SCR02_BtnSearch","tool-
     A                                       tip":"Search","onclick":"SystemToo-
     A                                      lbarSearch","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/search.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1118px","id":"F0350F_SCR02_B-
     A                                      tnDiaryItems","tool tip":"Diary/Wor-
     A                                      k Items - IDARTS","onclick":"System-
     A                                      ToolbarDiary","background image":{"-
     A                                      fieldName":"DryIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1144px","id":"F0350F_SCR02_BtnSys-
     A                                      temMessages","tool tip":"System Mes-
     A                                      sages","onclick":"SystemToolbarMess-
     A                                      ages","background image":{"fieldNam-
     A                                      e":"MsgIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"F0350F_SCR02_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"F0350F_SCR02_I-
     A                                      mgSysToolBottom","fie')
     A                                  1  2HTML('ld type":"image","image sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/butbarbot.png","left":"1036px"-
     A                                      ,"top":"64px","width":"187px","lock-
     A                                      ed in place":"true","css class":"st-
     A                                      ationary","visibility":"hidden"},{"-
     A                                      id":"F0350F_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":"Tab 1-
     A                                      ","active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0350F_SCR02_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"F0350F_SCR02_fkeyMen-
     A                                      u","field type":"menu","left":"10px-
     A                                      ","top":"120px","height":"350px","w-
     A                                      idth":"230px","hover background col-
     A                                      or":"#9AAA61","hover text color":"#-
     A                                      FFFFFF","border color":"#4C6106","m-
     A                                      enu option indent":"10px","backgrou-
     A                                      nd color":"#758B27","css class":"ac-
     A                                      tion-menu","css class 2":"stationar-
     A                                      y","z index":"101"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0350F_SCR02_BtnHiddenRefre-
     A                                      sh","value":"btnRefresh","top":"125-
     A                                      px","response":{"fieldName":"btnRef-
     A                                      resh","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0350F-
     A                                      _SCR02_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0350F_SCR02_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F03-
     A                                      50F_SCR02_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"butt')
     A                                  1  2HTML('on","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0350F_SCR02_BtnHiddenWor-
     A                                      kSubmitJob","value":"btnWrksbmjob",-
     A                                      "top":"225px","response":{"fieldNam-
     A                                      e":"btnWrkJob","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0350F_SCR02_BtnHiddenWorkPrinte-
     A                                      rOutput","value":"btnWrkprtout","to-
     A                                      p":"250px","response":{"fieldName":-
     A                                      "btnWrkPrnt","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0350F_SCR02_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"275px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0350F_SCR02-
     A                                      _BtnHiddenHelp","value":"btnHelp","-
     A                                      top":"300px","response":{"fieldName-
     A                                      ":"btnHelp","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnPAGEDOWN","field type-
     A                                      ":"button","value":"Page Down","sho-
     A                                      rtcut key":"PageDown","response":{"-
     A                                      fieldName":"*IN01","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"left":"14px","to-
     A                                      p":"183px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnPAGEUP","field type":"bu-
     A                                      tton","value":"Page Up","shortcut k-
     A                                      ey":"PageUp","response":{"fieldName-
     A                                      ":"*IN02","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"left":"14px","top":"216px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  16 17 18
     A  19 50 51
     A  52 71 72                            CA01
     A  73 74 75
     A  76 77 78
     A  79 80 81                            CA02
     A  82 83 84
     A  88 89                               CA03
     A                                  1  2HTML('QPUIREC35   ROVERLAY   0     -
     A                                      RWINDOW    0     REMSG      2    C2-
     A                                      1   DrpPBSubsetSubscriberFMSSSSUB# -
     A                                       FERSSSUB#  REMSGID    5    C21   D-
     A                                      rpPBSubsetSubscriberC7    MC40084C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          71REMSGID    5    C21   DrpPBSu-
     A                                      bsetSubscriberC7    MCR2383C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     75-
     A                                      REMSG      2    C16   DrpPBSubsetGr-
     A                                      oupFMSSSFND   FERSSFND   REMSGID   -
     A                                       5    C16   DrpPBSubsetGroupC7    M-
     A                                      C40085C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     72REMSGID    5    C16  -
     A                                       DrpPBSubsetGroupC7    MC40136C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       76REMSGID    5    C16   DrpPBSubse-
     A                                      tGroupC7    MC40100C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     82REMSG   -
     A                                         2    C15   TxbPBSubsetYearFMSSSF-
     A                                      YR   FERSSFYR   REMSGID    5    C15-
     A                                         TxbPBSubsetYearC7    MC40086C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        73REMSGID    5    C15   TxbPBSubs-
     A                                      etYearC7    MC40101C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     77REMSG   -
     A                                         2    C15   TxbPBSubsetCaseFMSSSC-
     A                                      ASE  FERSSCASE  REMSGID    5    C15-
     A                                         TxbPBSubsetCaseC7    MC40101C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        77REMSG      2    C15   TxbPBSubs-
     A                                      etFEINFMSSSFEIN  FERSSFEIN  REMSGID-
     A                                          5    C15   TxbPBSubsetFEINC7   -
     A                                       MC40087C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     74REMSGID    5    C15-
     A                                         TxbPBSubsetFEINC7    MCR0902C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        78REMSG      2    C14   TxbPBSubs-
     A                                      etModFMSSSMOD   FERSSMOD   REMSGID -
     A                                         5    C14   TxbPBSubsetModC7    M-
     A                                      CR0902C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     78REMSG      2    C16  -
     A                                       TxbPBSubsetEOMB#FMSSSEOB#  FERSSEO-
     A                                      B#  REMSG      2    C19   TxbPBSubs-
     A                                      etPreCert#FMSSSCERT  FERSSCERT  REM-
     A                                      SG      2    C17   DateFromDtServic-
     A                                      eFMSSSFRDT  FERSSFRDT  REMSGID    5-
     A                                          C17   DateFromDtServiceC7    MC-
     A                                      R0500C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     79REMSGID    5    C17   -
     A                                      DateFromDtServiceC7    MC40140C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       84REMSG      2    C15   DateToDtSe-
     A                                      rviceFMSSSTODT  FERSSTODT  REMSGID -
     A                                         5    C15   DateToDtServiceC7    -
     A                                      MCR0500C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     83REMSGID    5    C15 -
     A                                        DateToDtServiceC7    MC40140C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       84REMSG      2    C21   DrpPBSubse-
     A                                      tBillStatusFMSSSBLST  FERSSBLST  RE-
     A                                      MSGID    5    C21   DrpPBSubsetBill-
     A                                      StatusC7    MCR0907C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     80REMSG   -
     A                                         2    C19   DrpPBSubsetBillTypeFM-
     A                                      SSSBILTYPFERSSBILTYPREMSGID    5   -
     A                                       C19   DrpPBSubsetBillTypeC7    MCR-
     A                                      0907C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     89REMSG      2    C22   T-
     A                                      xbPBSubsetInitialUserFMSSSIUSR  FER-
     A                                      SSIUSR  REMSGID    5    C22   TxbPB-
     A                                      SubsetInitialUserC7    MC')
     A                                  1  2HTML('QPUI40103C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     81REMSG      2-
     A                                          C21   TxbPBSubsetDocumentIDFMSS-
     A                                      SIDOC  FERSSIDOC  REMSG      2    C-
     A                                      21   TxbPBSubsetDocumentIDC44   No -
     A                                      bill is associated with this docume-
     A                                      nt id.E1    3     88')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","show as window":"true",-
     A                                      "overlay":"true","description":"Pro-
     A                                      vider Bill Subset screen"},"items":-
     A                                      [{"id":"PnlPBSubset","field type":"-
     A                                      panel","panel style":"Transform Dia-
     A                                      log","text align":"left","left":"50-
     A                                      px","top":"25px","height":"410px","-
     A                                      width":"534px","value":"Provider Bi-
     A                                      lls Subset","css class":"panel"},{"-
     A                                      id":"LblPBSSSubscriber","field type-
     A                                      ":"output field","value":"Subscribe-
     A                                      r","css class":"label","left":"65px-
     A                                      ","top":"100px","width":"65px"},{"i-
     A                                      d":"LblPBSSGroup","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"Group","left":"310px","top":"1-
     A                                      00px","width":"40px"},{"id":"DrpPBS-
     A                                      ubsetSubscriber","field type":"sele-
     A                                      ct box","css class":"dropdown","val-
     A                                      ue":{"fieldName":"SSSub#","refField-
     A                                      ":"SUB#","numSep":"false","zeroBala-
     A                                      nce":"false","numBlankFill":"false"-
     A                                      ,"zeroFill":"false","noExtraSpaces"-
     A                                      :"false","curSym":"","dataType":"re-
     A                                      ference","formatting":"Number","neg-
     A                                      Num":"-999.00","units":"","designVa-
     A                                      lue":"[SSSub#]"},"error messages":"-
     A                                      3 messages","left":"65px","top":"11-
     A                                      5px","width":"215px","css class 2":-
     A                                      "input","choices database file":"FM-
     A                                      SMP","choice options field":"SMSUB#-
     A                                       || '' - '' ||  SMNAME","choice val-
     A                                      ues field":"SMSUB#","choices select-
     A                                      ion criteria":"SMSTAT = ''A''","ord-
     A                                      er by":"SMSUB#","blank option":"tru-
     A                                      e","text align":"left","read only":-
     A                                      {"fieldName":"50 or 51","customTrue-
     A                                      ":"","customFalse":"","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message":{"fieldName":"msSSSub#","-
     A                                      dataLength":"100","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"error con-
     A                                      dition":{"fieldName":"erSSSub#","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       enhanced mode":"1","error message -
     A                                      id 2":"MC40084","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"71","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error enhanced mode 2-
     A                                      ":"1","error message id 3":"MCR2383-
     A                                      ","error message file 3":"FSMESG","-
     A                                      error message library 3":"*LIBL","e-
     A                                      rror condition 3":{"fieldName":"75"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error enhanced mode 3":"1","css cla-
     A                                      ss 3":{"fieldName":"50 or 51","cust-
     A                                      omTrue":"PR","customFalse":"","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      "},"css class 4":{"fi')
     A                                  1  2HTML('eldName":"N50 and N51","custo-
     A                                      mTrue":"UL","customFalse":"","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      },"text transform":"uppercase"},{"i-
     A                                      d":"DrpPBSubsetGroup","field type":-
     A                                      "select box","css class":"dropdown"-
     A                                      ,"value":{"fieldName":"SSFND","refF-
     A                                      ield":"FND","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      negNum":"-999.00","units":"","desig-
     A                                      nValue":"[SSFND]"},"text align":"le-
     A                                      ft","error messages":"4 messages","-
     A                                      choices database file":"FMFNP","cho-
     A                                      ice options field":"FNFND || '' - '-
     A                                      ' ||  FNNAME","choice values field"-
     A                                      :"FNFND","choices selection criteri-
     A                                      a":"FNSTAT = ''A''","blank option":-
     A                                      "true","order by":"FNFND","left":"3-
     A                                      10px","top":"115px","width":"230px"-
     A                                      ,"css class 2":"input","text transf-
     A                                      orm":"uppercase","read only":{"fiel-
     A                                      dName":"50 or 52","customTrue":"","-
     A                                      customFalse":"","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"error messa-
     A                                      ge":{"fieldName":"msSSFND","dataLen-
     A                                      gth":"100","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"},"error condition"-
     A                                      :{"fieldName":"erSSFND","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error enhance-
     A                                      d mode":"1","error message id 2":"M-
     A                                      C40085","error message file 2":"FSM-
     A                                      ESG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"72","customTrue":"","customFalse-
     A                                      ":"","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode 2":"1","e-
     A                                      rror message id 3":"MC40136","error-
     A                                       message file 3":"FSMESG","error me-
     A                                      ssage library 3":"*LIBL","error con-
     A                                      dition 3":{"fieldName":"76","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error en-
     A                                      hanced mode 3":"1","error message i-
     A                                      d 4":"MC40100","error message file -
     A                                      4":"FSMESG","error message library -
     A                                      4":"*LIBL","error condition 4":{"fi-
     A                                      eldName":"82","customTrue":"","cust-
     A                                      omFalse":"","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error enhanced mode 4"-
     A                                      :"1","css class 3":{"fieldName":"50-
     A                                       or 52","customTrue":"PR","customFa-
     A                                      lse":"","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values"},"css class 4":{"fie-
     A                                      ldName":"N50 and N52","customTrue":-
     A                                      "UL","customFalse":"","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values"}},{"id-
     A                                      ":"LblPBSSYearCase","')
     A                                  1  2HTML('field type":"output field","c-
     A                                      ss class":"label","value":"Year - C-
     A                                      ase","left":"65px","top":"140px","w-
     A                                      idth":"75px","locked in place":"fal-
     A                                      se"},{"id":"LblPBSSFEINMod","field -
     A                                      type":"output field","css class":"l-
     A                                      abel","value":"FEIN - Mod","left":"-
     A                                      310px","top":"140px","width":"70px"-
     A                                      },{"id":"TxbPBSubsetYear","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      value":{"fieldName":"SSFYR","refFie-
     A                                      ld":"FYR","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","noExtraSpaces-
     A                                      ":"false","curSym":"","dataType":"r-
     A                                      eference","formatting":"Number","ne-
     A                                      gNum":"999.00","units":"","designVa-
     A                                      lue":"[SSFYR]"},"text align":"right-
     A                                      ","error messages":"3 messages","le-
     A                                      ft":"65px","top":"155px","width":"2-
     A                                      1px","css class 2":"textbox","text -
     A                                      transform":"uppercase","read only":-
     A                                      {"fieldName":"50","customTrue":"","-
     A                                      customFalse":"","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"error messa-
     A                                      ge":{"fieldName":"msSSFYr","dataLen-
     A                                      gth":"10","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"},"error condition":-
     A                                      {"fieldName":"erSSFYr","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode":"1","error message id 2":"MC-
     A                                      40086","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"73","customTrue":"","customFalse"-
     A                                      :"","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error enhanced mode 2":"1","er-
     A                                      ror message id 3":"MC40101","error -
     A                                      message file 3":"FSMESG","error mes-
     A                                      sage library 3":"*LIBL","error cond-
     A                                      ition 3":{"fieldName":"77","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error enh-
     A                                      anced mode 3":"1","css class 3":{"f-
     A                                      ieldName":"50","customTrue":"PR","c-
     A                                      ustomFalse":"","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values"},"css class 4-
     A                                      ":{"fieldName":"N50","customTrue":"-
     A                                      UL","customFalse":"","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values"}},{"id"-
     A                                      :"LblHyphen1","field type":"output -
     A                                      field","css class":"constant","valu-
     A                                      e":"-","cursor row":"7","cursor col-
     A                                      umn":"35","left":"95px","top":"155p-
     A                                      x","width":"5px","css class 2":"pro-
     A                                      found-converted"},{"id":"TxbPBSubse-
     A                                      tCase","field type":"textbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"SSCase","refField":"CASE","numSep-
     A                                      ":"false","zeroBalance":"false","nu-
     A                                      mBlankFill":"false","zeroFill":"fal-
     A                                      se","noExtraSpaces":"')
     A                                  1  2HTML('false","curSym":"","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "negNum":"-999.00","units":"","desi-
     A                                      gnValue":"[SSCase]"},"text align":"-
     A                                      right","error messages":"2 messages-
     A                                      ","left":"105px","top":"155px","wid-
     A                                      th":"45px","css class 2":"textbox",-
     A                                      "text transform":"uppercase","read -
     A                                      only":{"fieldName":"50","customTrue-
     A                                      ":"","customFalse":"","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message":{"fieldName":"msSSCase","-
     A                                      dataLength":"100","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"error con-
     A                                      dition":{"fieldName":"erSSCase","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       enhanced mode":"1","error message -
     A                                      id 2":"MC40101","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"77","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error enhanced mode 2-
     A                                      ":"1","css class 3":{"fieldName":"5-
     A                                      0","customTrue":"PR","customFalse":-
     A                                      "","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values"},"css class 4":{"fieldNam-
     A                                      e":"N50","customTrue":"UL","customF-
     A                                      alse":"","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values"}},{"id":"BtnPBSubse-
     A                                      tYrCaseSearch","field type":"button-
     A                                      ","css class":"button","description-
     A                                      ":"Claim number to search","respons-
     A                                      e":{"fieldName":"srchClm","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"background -
     A                                      color":"transparent","background im-
     A                                      age":"url(''/profoundui/proddata/im-
     A                                      ages/icons/view.png'')","background-
     A                                       repeat":"no-repeat","left":"160px"-
     A                                      ,"top":"155px","height":"20","width-
     A                                      ":"23px","z index":"13","border bot-
     A                                      tom width":"0px","border left width-
     A                                      ":"0px","border right width":"0px",-
     A                                      "border top width":"0px","cursor":"-
     A                                      default","disabled":{"fieldName":"5-
     A                                      0","customTrue":"","customFalse":""-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"visibility":{"fieldName":"-
     A                                      50","customTrue":"","customFalse":"-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"hidden-
     A                                       / visible"}},{"id":"TxbPBSubsetFEI-
     A                                      N","field type":"textbox","css clas-
     A                                      s":"input","value":{"fieldName":"SS-
     A                                      FEIN","refField":"FEIN","numSep":"f-
     A                                      alse","zeroBalance":"false","numBla-
     A                                      nkFill":"false","zeroFill":"false",-
     A                                      "noExtraSpaces":"false","curSym":""-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","negNum":"')
     A                                  1  2HTML('-999.00","units":"","designVa-
     A                                      lue":"[SSFEIN]"},"text align":"righ-
     A                                      t","error messages":"3 messages","l-
     A                                      eft":"310px","top":"155px","width":-
     A                                      "65px","css class 2":"textbox","tex-
     A                                      t transform":"uppercase","read only-
     A                                      ":{"fieldName":"19","customTrue":""-
     A                                      ,"customFalse":"","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       3":{"fieldName":"N19","customTrue"-
     A                                      :"UL","customFalse":"","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values"},"css-
     A                                       class 4":{"fieldName":"19","custom-
     A                                      True":"PR","customFalse":"","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values"}-
     A                                      ,"error message":{"fieldName":"msSS-
     A                                      FEIN","dataLength":"100","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"er-
     A                                      ror condition":{"fieldName":"erSSFE-
     A                                      IN","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode":"1","error m-
     A                                      essage id 2":"MC40087","error messa-
     A                                      ge file 2":"FSMESG","error message -
     A                                      library 2":"*LIBL","error condition-
     A                                       2":{"fieldName":"74","customTrue":-
     A                                      "","customFalse":"","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode 2":"1","error message id 3":"-
     A                                      MCR0902","error message file 3":"FS-
     A                                      MESG","error message library 3":"*L-
     A                                      IBL","error condition 3":{"fieldNam-
     A                                      e":"78","customTrue":"","customFals-
     A                                      e":"","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode 3":"1"},-
     A                                      {"id":"LblHyphen1_copy","field type-
     A                                      ":"output field","css class":"const-
     A                                      ant","value":"-","cursor row":"7","-
     A                                      cursor column":"35","left":"385px",-
     A                                      "top":"155px","width":"5px","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "TxbPBSubsetMod","field type":"text-
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"SSMod","refField":"MOD"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","noExtraSpaces":"false"-
     A                                      ,"curSym":"","dataType":"reference"-
     A                                      ,"formatting":"Number","negNum":"-9-
     A                                      99.00","units":"","designValue":"[S-
     A                                      SMod]"},"text align":"right","error-
     A                                       messages":"2 messages","left":"395-
     A                                      px","top":"155px","width":"25px","c-
     A                                      ss class 2":"textbox","text transfo-
     A                                      rm":"uppercase","read only":{"field-
     A                                      Name":"19","customTrue":"","customF-
     A                                      alse":"","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error message":{"f-
     A                                      ieldName":"msSSMod","dataLength":"1-
     A                                      00","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","d')
     A                                  1  2HTML('ataType":"char","formatting":-
     A                                      "Text","textTransform":"none"},"err-
     A                                      or condition":{"fieldName":"erSSMod-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error enhanced mode":"1","error mes-
     A                                      sage id 2":"MCR0902","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"78","customTrue":""-
     A                                      ,"customFalse":"","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode 2":"1","css class 3":{"fieldNam-
     A                                      e":"N19","customTrue":"UL","customF-
     A                                      alse":"","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values"},"css class 4":{"fi-
     A                                      eldName":"19","customTrue":"PR","cu-
     A                                      stomFalse":"","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values"}},{"id":"BtnPB-
     A                                      SubsetFEINModSearch","field type":"-
     A                                      button","css class":"button","descr-
     A                                      iption":"FEIN Mod to search","respo-
     A                                      nse":{"fieldName":"srchProv","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"backgrou-
     A                                      nd color":"transparent","background-
     A                                       image":"url(''/profoundui/proddata-
     A                                      /images/icons/view.png'')","backgro-
     A                                      und repeat":"no-repeat","left":"430-
     A                                      px","top":"155px","height":"20","wi-
     A                                      dth":"23px","z index":"13","border -
     A                                      bottom width":"0px","border left wi-
     A                                      dth":"0px","border right width":"0p-
     A                                      x","border top width":"0px","cursor-
     A                                      ":"default"},{"id":"outPBSubsetName-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SSName","refField"-
     A                                      :"DS20","trimLeading":"false","trim-
     A                                      Trailing":"false","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "reference","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [SSName]"},"css class":"output-fiel-
     A                                      d","left":"65px","cursor column":"4-
     A                                      7","top":"175px","cursor row":"7","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"outPBSubsetProvName","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SSPdNm","refField":"DS20","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"referenc-
     A                                      e","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[SSPdNm]"-
     A                                      },"css class":"output-field","left"-
     A                                      :"310px","cursor column":"47","top"-
     A                                      :"175px","cursor row":"8","css clas-
     A                                      s 2":"profound-converted"},{"id":"L-
     A                                      blPBSSEOMB#","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      EOMB#","left":"65px","top":"200px",-
     A                                      "width":"50px"},{"id":"LblPBSSPreCe-
     A                                      rt#","field type":"output field","c-
     A                                      ss class":"label","value":"Pre-Cert-
     A                                      #","left":"310px","top":"200px","wi-
     A                                      dth":"65px"},{"id":"TxbPBSubsetEOMB-
     A                                      #","field type":"text')
     A                                  1  2HTML('box","css class":"input","val-
     A                                      ue":{"fieldName":"SSEOB#","refField-
     A                                      ":"EOB#","numSep":"false","zeroBala-
     A                                      nce":"false","numBlankFill":"false"-
     A                                      ,"zeroFill":"false","noExtraSpaces"-
     A                                      :"false","curSym":"","dataType":"re-
     A                                      ference","formatting":"Number","neg-
     A                                      Num":"-999.00","units":"","designVa-
     A                                      lue":"[SSEOB#]"},"text align":"righ-
     A                                      t","error messages":"1 message","le-
     A                                      ft":"65px","top":"215px","width":"6-
     A                                      5px","css class 2":"textbox","css c-
     A                                      lass 3":{"fieldName":"N16","customT-
     A                                      rue":"UL","customFalse":"","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values"},-
     A                                      "css class 4":{"fieldName":"16","cu-
     A                                      stomTrue":"PR","customFalse":"","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es"},"read only":{"fieldName":"16",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message":{"fieldName":"-
     A                                      msSSEOB#","dataLength":"100","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      ,"error condition":{"fieldName":"er-
     A                                      SSEOB#","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode":"1","tex-
     A                                      t transform":"uppercase"},{"id":"Tx-
     A                                      bPBSubsetPreCert#","field type":"te-
     A                                      xtbox","css class":"input","value":-
     A                                      {"fieldName":"SSCert","refField":"C-
     A                                      ERT","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"ref-
     A                                      erence","formatting":"Text","textTr-
     A                                      ansform":"uppercase","designValue":-
     A                                      "[SSCert]"},"read only":{"fieldName-
     A                                      ":"17","customTrue":"","customFalse-
     A                                      ":"","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error messages":"1 mes-
     A                                      sage","left":"310px","top":"215px",-
     A                                      "width":"65px","css class 2":"textb-
     A                                      ox","css class 3":{"fieldName":"N17-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values"},"css class 4":{"fieldName-
     A                                      ":"17","customTrue":"PR","customFal-
     A                                      se":"","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values"},"text transform":"up-
     A                                      percase","error message":{"fieldNam-
     A                                      e":"msSSCert","dataLength":"100","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"},"error condition":{"fieldName"-
     A                                      :"erSSCert","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode":"1"}-
     A                                      ,{"id":"LblPBSSDateSe')
     A                                  1  2HTML('rviceFrom","field type":"outp-
     A                                      ut field","css class":"label","valu-
     A                                      e":"From Date of Service","left":"6-
     A                                      5px","top":"240px","width":"125px"}-
     A                                      ,{"id":"LblPBSSDateServiceTo","fiel-
     A                                      d type":"output field","css class":-
     A                                      "label","value":"To Date of Service-
     A                                      ","left":"310px","top":"240px","wid-
     A                                      th":"110px"},{"id":"DateFromDtServi-
     A                                      ce","field type":"date field","css -
     A                                      class":"input","css class 2":"date--
     A                                      field","value":{"fieldName":"SSFrDt-
     A                                      ","refField":"DT8","numSep":"false"-
     A                                      ,"zeroBalance":"false","numBlankFil-
     A                                      l":"false","zeroFill":"false","noEx-
     A                                      traSpaces":"false","edtWrd":"''  / -
     A                                       /    ''","curSym":"","dataType":"r-
     A                                      eference","formatting":"Number","ne-
     A                                      gNum":"-999.00","units":"","designV-
     A                                      alue":"[SSFrDt]"},"text transform":-
     A                                      "uppercase","left":"65px","cursor c-
     A                                      olumn":"31","top":"255px","cursor r-
     A                                      ow":"13","width":"100px","css class-
     A                                       3":{"fieldName":"N18","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"18","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 4":{"fieldName":"18","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"error messages":"3 messages","c-
     A                                      ss class 5":"profound-converted","e-
     A                                      rror message":{"fieldName":"msSSFrD-
     A                                      t","dataLength":"100","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"},"error-
     A                                       condition":{"fieldName":"erSSFrDt"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode":"1","error mess-
     A                                      age id 2":"MCR0500","error message -
     A                                      file 2":"FSMESG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"79","customTrue":"",-
     A                                      "customFalse":"","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de 2":"1","error message id 3":"MC4-
     A                                      0140","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "84","customTrue":"","customFalse":-
     A                                      "","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error enhanced mode 3":"1"},{"i-
     A                                      d":"DateToDtService","field type":"-
     A                                      date field","css class":"input","va-
     A                                      lue":{"fieldName":"SSToDt","refFiel-
     A                                      d":"DT8","numSep":"false","zeroBala-
     A                                      nce":"false","numBlankFill":"false"-
     A                                      ,"zeroFill":"false","noExtraSpaces"-
     A                                      :"false","edtWrd":"''  /  /    ''",-
     A                                      "curSym":"","dataType":"reference",-
     A                                      "formatting":"Number","negNum":"-99-
     A                                      9.00","units":"","des')
     A                                  1  2HTML('ignValue":"[SSToDt]"},"text t-
     A                                      ransform":"uppercase","read only":{-
     A                                      "fieldName":"18","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"cursor row-
     A                                      ":"13","cursor column":"31","error -
     A                                      messages":"3 messages","left":"310p-
     A                                      x","top":"255px","width":"100px","c-
     A                                      ss class 2":"date-field","css class-
     A                                       3":{"fieldName":"N18","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"css-
     A                                       class 4":{"fieldName":"18","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":"profound-converted"-
     A                                      ,"error message":{"fieldName":"msSS-
     A                                      ToDt","dataLength":"100","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"er-
     A                                      ror condition":{"fieldName":"erSSTo-
     A                                      Dt","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode":"1","error m-
     A                                      essage id 2":"MCR0500","error messa-
     A                                      ge file 2":"FSMESG","error message -
     A                                      library 2":"*LIBL","error condition-
     A                                       2":{"fieldName":"83","customTrue":-
     A                                      "","customFalse":"","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode 2":"1","error message id 3":"-
     A                                      MC40140","error message file 3":"FS-
     A                                      MESG","error message library 3":"*L-
     A                                      IBL","error condition 3":{"fieldNam-
     A                                      e":"84","customTrue":"","customFals-
     A                                      e":"","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode 3":"1"},-
     A                                      {"id":"LblPBSSBillStatus","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"Bill Status","left":"6-
     A                                      5px","top":"280px","width":"65px","-
     A                                      locked in place":"false"},{"id":"Lb-
     A                                      lPBSSBillType","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Bill Type","left":"310px","top":"-
     A                                      280px","width":"55px","locked in pl-
     A                                      ace":"false"},{"id":"DrpPBSubsetBil-
     A                                      lStatus","field type":"select box",-
     A                                      "css class":"dropdown","value":{"fi-
     A                                      eldName":"SSBLST","refField":"FLAG"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"referen-
     A                                      ce","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SS-
     A                                      BLST]"},"error messages":"2 message-
     A                                      s","choices database file":"FTGTP",-
     A                                      "choice options field":"TRIM(GTKEY)-
     A                                       || '' - '' || TRIM(GTDESC)","choic-
     A                                      e values field":"GTKEY","choices se-
     A                                      lection criteria":"GTTBID = ''BLST'-
     A                                      ' and GTSTAT <> ''I'' and GTKEY <> -
     A                                      ''X''","blank option":"true","left"-
     A                                      :"65px","top":"295px","width":"175p-
     A                                      x","css class 2":"inp')
     A                                  1  2HTML('ut","text transform":"upperca-
     A                                      se","error message":{"fieldName":"m-
     A                                      sSSBLST","dataLength":"100","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "error condition":{"fieldName":"erS-
     A                                      SBLST","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error enhanced mode":"1","erro-
     A                                      r message id 2":"MCR0907","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"80","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error enhan-
     A                                      ced mode 2":"1","order by":"GTKEY"}-
     A                                      ,{"id":"DrpPBSubsetBillType","field-
     A                                       type":"select box","css class":"dr-
     A                                      opdown","value":{"fieldName":"SSBTY-
     A                                      P","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"uppercase","des-
     A                                      ignValue":"[SSBTYP]"},"text transfo-
     A                                      rm":"uppercase","error messages":"2-
     A                                       messages","choices database file":-
     A                                      "FTGTP","choice options field":"TRI-
     A                                      M(GTKEY) || '' - '' || TRIM(GTDESC)-
     A                                      ","choice values field":"GTKEY","ch-
     A                                      oices selection criteria":"GTTBID =-
     A                                       ''BTYP'' and GTSTAT <> ''I''","bla-
     A                                      nk option":"true","left":"310px","t-
     A                                      op":"295px","width":"165px","css cl-
     A                                      ass 2":"input","error message":{"fi-
     A                                      eldName":"msSSBilTyp","dataLength":-
     A                                      "100","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"},"error condition":{"fi-
     A                                      eldName":"erSSBilTyp","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error enhanced -
     A                                      mode":"1","error message id 2":"MCR-
     A                                      0907","error message file 2":"FSMES-
     A                                      G","error message library 2":"*LIBL-
     A                                      ","error condition 2":{"fieldName":-
     A                                      "89","customTrue":"","customFalse":-
     A                                      "","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error enhanced mode 2":"1","ord-
     A                                      er by":"GTKEY"},{"id":"LblPBSSIniti-
     A                                      alUser","field type":"output field"-
     A                                      ,"css class":"label","value":"Initi-
     A                                      al User","left":"65px","top":"320px-
     A                                      ","width":"70px"},{"id":"LblPBSSDoc-
     A                                      ID","field type":"output field","cs-
     A                                      s class":"label","value":"Document -
     A                                      ID","left":"310px","top":"320px","w-
     A                                      idth":"85px"},{"id":"TxbPBSubsetIni-
     A                                      tialUser","field type":"textbox","c-
     A                                      ss class":"input","value":{"fieldNa-
     A                                      me":"SSIUsr","refField":"USER","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType"')
     A                                  1  2HTML(':"reference","formatting":"Te-
     A                                      xt","textTransform":"uppercase","de-
     A                                      signValue":"[SSIUsr]"},"error messa-
     A                                      ges":"2 messages","left":"65px","to-
     A                                      p":"335px","width":"65px","css clas-
     A                                      s 2":"textbox","text transform":"up-
     A                                      percase","error message":{"fieldNam-
     A                                      e":"msSSIUsr","dataLength":"100","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"},"error condition":{"fieldName"-
     A                                      :"erSSIUsr","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode":"1",-
     A                                      "error message id 2":"MC40103","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"81","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      enhanced mode 2":"1"},{"id":"BtnPBS-
     A                                      ubsetInitUserSearch","field type":"-
     A                                      button","css class":"button","descr-
     A                                      iption":"Initial User to search","r-
     A                                      esponse":{"fieldName":"srchIUsr","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"back-
     A                                      ground color":"transparent","backgr-
     A                                      ound image":"url(''/profoundui/prod-
     A                                      data/images/icons/view.png'')","bac-
     A                                      kground repeat":"no-repeat","left":-
     A                                      "140px","top":"335px","height":"20"-
     A                                      ,"width":"23px","z index":"13","bor-
     A                                      der bottom width":"0px","border lef-
     A                                      t width":"0px","border right width"-
     A                                      :"0px","border top width":"0px","cu-
     A                                      rsor":"default"},{"id":"TxbPBSubset-
     A                                      DocumentID","field type":"textbox",-
     A                                      "css class":"input","value":{"field-
     A                                      Name":"SSIDoc","dataLength":"12","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"up-
     A                                      percase","designValue":"[SSIDoc]"},-
     A                                      "text transform":"uppercase","error-
     A                                       messages":"2 messages","left":"310-
     A                                      px","top":"335px","width":"85px","c-
     A                                      ss class 2":"textbox","error messag-
     A                                      e":{"fieldName":"msSSIDoc","dataLen-
     A                                      gth":"100","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"},"error condition"-
     A                                      :{"fieldName":"erSSIDoc","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode":"1","error message 2":"No -
     A                                      bill is associated with this docume-
     A                                      nt id.","error condition 2":{"field-
     A                                      Name":"88","customTrue":"","customF-
     A                                      alse":"","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode 2":"1-
     A                                      "},{"id":"OutPBSubset')
     A                                  1  2HTML('InitUsrNm","field type":"outp-
     A                                      ut field","css class":"output-field-
     A                                      ","value":{"fieldName":"SSUSNM","de-
     A                                      signValue":"[SSUSNM]","refField":"D-
     A                                      S20","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"cursor row":"17","curs-
     A                                      or column":"47","left":"65px","top"-
     A                                      :"355px","css class 2":"profound-co-
     A                                      nverted"},{"id":"btnCF12","field ty-
     A                                      pe":"button","value":"Cancel","shor-
     A                                      tcut key":"F12","left":"320px","top-
     A                                      ":"390px","width":"80px","height":"-
     A                                      23px","css class":"button","cursor"-
     A                                      :"default"},{"id":"btnApply","field-
     A                                       type":"button","value":"Apply","sh-
     A                                      ortcut key":"Enter","left":"440px",-
     A                                      "top":"390px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"HREC",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"HREC","designValue":"[HREC]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"10"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"HdgPBSubserScrSubsetPr-
     A                                      ovBills","field type":"output field-
     A                                      ","css class":"output-field","value-
     A                                      ":{"fieldName":"SCPRD3","designValu-
     A                                      e":"[SCPRD3]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"cursor row":"1","cursor column-
     A                                      ":"16","left":"60px","top":"60px","-
     A                                      css class 2":"heading","heading typ-
     A                                      e":"Section Header","width":"140px"-
     A                                      ,"text align":"left"}]}')
     A            ERSSBILTYP     1A  H
     A            ERSSBLST       1A  H
     A            ERSSCASE       1A  H
     A            ERSSCERT       1A  H
     A            ERSSEOB#       1A  H
     A            ERSSFEIN       1A  H
     A            ERSSFND        1A  H
     A            ERSSFRDT       1A  H
     A            ERSSFYR        1A  H
     A            ERSSIDOC       1A  H
     A            ERSSIUSR       1A  H
     A            ERSSMOD        1A  H
     A            ERSSSUB#       1A  H
     A            ERSSTODT       1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSSSBILTYP   100A  H
     A            MSSSBLST     100A  H
     A            MSSSCASE     100A  H
     A            MSSSCERT     100A  H
     A            MSSSEOB#     100A  H
     A            MSSSFEIN     100A  H
     A            MSSSFND      100A  H
     A            MSSSFRDT     100A  H
     A            MSSSFYR       10A  H
     A            MSSSIDOC     100A  H
     A            MSSSIUSR     100A  H
     A            MSSSMOD      100A  H
     A            MSSSSUB#     100A  H
     A            MSSSTODT     100A  H
     A            SRCHCLM        1A  H
     A            SRCHIUSR       1A  H
     A            SRCHPROV       1A  H
     A            SSBTYP         1A  H
     A            SSIDOC        12A  H
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SSBLST    R        H      REFFLD(FLAG)
     A            SSCASE    R        H      REFFLD(CASE)
     A            SSCERT    R        H      REFFLD(CERT)
     A            SSEOB#    R        H      REFFLD(EOB#)
     A            SSFEIN    R        H      REFFLD(FEIN)
     A            SSFND     R        H      REFFLD(FND)
     A            SSFRDT    R        H      REFFLD(DT8)
     A            SSFYR     R        H      REFFLD(FYR)
     A            SSIUSR    R        H      REFFLD(USER)
     A            SSMOD     R        H      REFFLD(MOD)
     A            SSNAME    R        H      REFFLD(DS20)
     A            SSPDNM    R        H      REFFLD(DS20)
     A            SSSUB#    R        H      REFFLD(SUB#)
     A            SSTODT    R        H      REFFLD(DT8)
     A            SSUSNM    R        H      REFFLD(DS20)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI000001     1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"F0350F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"F0350F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"F0350F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"F0350F_MSGSFLC_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"F0350F_MSGSFLC_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"F0350F_')
     A                                  1  2HTML('MSGSFLC_BtnRefresh","tool tip-
     A                                      ":"Refresh","onclick":"SystemToolba-
     A                                      rRefresh","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/refresh.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1092px","id":"F0350F_MSGSFLC_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"F0350F_MSGSFLC_BtnDiaryItems","to-
     A                                      ol tip":"Diary/Work Items - IDARTS"-
     A                                      ,"onclick":"SystemToolbarDiary","ba-
     A                                      ckground image":{"fieldName":"DryIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1144px","id":"F-
     A                                      0350F_MSGSFLC_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1196px","id":"F0350F_-
     A                                      MSGSFLC_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemToolbarHelp","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/help.png'')"}-
     A                                      ,{"id":"F0350F_MSGSFL')
     A                                  1  2HTML('C_ImgSysToolBottom","field ty-
     A                                      pe":"image","image source":"/profou-
     A                                      ndui/userdata/images/systool/butbar-
     A                                      bot.png","left":"1036px","top":"64p-
     A                                      x","width":"187px","locked in place-
     A                                      ":"true","css class":"stationary","-
     A                                      visibility":"hidden"},{"id":"F0350F-
     A                                      _MSGSFLC_MainTabPanel","field type"-
     A                                      :"tab panel","tab panel style":"Tra-
     A                                      nsform","tab names":"Tab 1","active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0350F_MSGSFLC_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"F0350F_MSGSFLC_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0350F_MSGSFLC_BtnHiddenRefresh"-
     A                                      ,"value":"btnRefresh","top":"125px"-
     A                                      ,"response":{"fieldName":"btnRefres-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0350F_MS-
     A                                      GSFLC_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0350F_MSGSFLC_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      350F_MSGSFLC_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","in')
     A                                  1  2HTML('dFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0350F_MSGSFLC_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","response":{"fie-
     A                                      ldName":"btnWrkJob","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0350F_MSGSFLC_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0350F_MSGSFLC_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F03-
     A                                      50F_MSGSFLC_BtnHiddenHelp","value":-
     A                                      "btnHelp","top":"300px","response":-
     A                                      {"fieldName":"btnHelp","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"MSGSF-
     A                                      L","field type":"grid","number of c-
     A                                      olumns":"1","record format name":"M-
     A                                      SGSFL","display subfile":"true","di-
     A                                      splay control record":"true","subfi-
     A                                      le size":"5","initialize subfile":"-
     A                                      true","row height":"20","css class"-
     A                                      :"subfilegrid","css class 2":"profo-
     A                                      und-converted","parent tab panel":"-
     A                                      F0350F_MSGSFLC_MainTabPanel","paren-
     A                                      t tab":"0","subfile end":{"fieldNam-
     A                                      e":"N10","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"number of rows":"1-
     A                                      ","has header":"false","subfile pro-
     A                                      gram message queue":{"fieldName":"Q-
     A                                      1PGM","dataLength":"10","trimLeadin-
     A                                      g":"false","trimTrailing":"true","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"subfile c-
     A                                      ontrol program message queue":{"fie-
     A                                      ldName":"Q1PGM","dataLength":"10","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "subfile message key":{"fieldName":-
     A                                      "MSGKEY","dataLength":"4","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"},"top":"5-
     A                                      70px","left":"269px","column widths-
     A                                      ":"595"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value"')
     A                                  1  2HTML(':"Enter","shortcut key":"Ente-
     A                                      r","left":"14px","top":"150px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnPAGE-
     A                                      DOWN","field type":"button","value"-
     A                                      :"Page Down","shortcut key":"PageDo-
     A                                      wn","response":{"fieldName":"*IN01"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnPAGEUP"-
     A                                      ,"field type":"button","value":"Pag-
     A                                      e Up","shortcut key":"PageUp","resp-
     A                                      onse":{"fieldName":"*IN02","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A          R SCR04
     A  01 02 69                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    17 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR04","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-17"},"items":[{"-
     A                                      id":"F0350F_SCR04_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"F0350F_SCR04_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"F-
     A                                      0350F_SCR04_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/systools.png","data functio-
     A                                      n":"SystemToolbarSystools","show do-
     A                                      wn arrow":"Yes"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"F0350F_SCR04_ButtonBar","-
     A                                      top":"35px","left":"1036px","width"-
     A                                      :"187px","height":"28px","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      ","locked in place":"true"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1040px","id":"F0350F-
     A                                      _SCR04_BtnSave","tool tip":"Save","-
     A                                      onclick":"SystemToolbarSave","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/save.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "F0350F_SCR04_BtnRefr')
     A                                  1  2HTML('esh","tool tip":"Refresh","on-
     A                                      click":"SystemToolbarRefresh","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/refresh.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1092px","-
     A                                      id":"F0350F_SCR04_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"F0350F_SCR04_Bt-
     A                                      nDiaryItems","tool tip":"Diary/Work-
     A                                       Items - IDARTS","onclick":"SystemT-
     A                                      oolbarDiary","background image":{"f-
     A                                      ieldName":"DryIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1144px","id":"F0350F_SCR04_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1196px"-
     A                                      ,"id":"F0350F_SCR04_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"F0350F_SCR04_Im-
     A                                      gSysToolBottom","fiel')
     A                                  1  2HTML('d type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"F0350F_SCR04_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":{"field-
     A                                      Name":"SCPRDS","designValue":"[SCPR-
     A                                      DS]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"acti-
     A                                      ve tab":"0","left":"250px","top":"7-
     A                                      0px","width":"970px","height":"657p-
     A                                      x","z index":"8","locked in place":-
     A                                      "true","css class":"tab-panel","css-
     A                                       class 2":"stationary"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0350F_SCR04_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant41","field type":"o-
     A                                      utput field","left":"281px","cursor-
     A                                       column":"2","top":"110px","cursor -
     A                                      row":"1","css class":"top-line","va-
     A                                      lue":"js: currentUser()","css class-
     A                                       2":"output-field","parent tab pane-
     A                                      l":"F0350F_SCR04_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCR04_SCCONM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCCONM","designValue-
     A                                      ":"[SCCONM]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss 2":"top-line","css class 3":"HI"-
     A                                      ,"parent tab panel":"F0350F_SCR04_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"constant42","field type":"output-
     A                                       field","left":"778px","cursor colu-
     A                                      mn":"73","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentDate()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      F0350F_SCR04_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"F0350F_SCR04_fkeyM-
     A                                      enu","field type":"menu","left":"10-
     A                                      px","top":"120px","height":"350px",-
     A                                      "width":"230px","hover background c-
     A                                      olor":"#9AAA61","hover text color":-
     A                                      "#FFFFFF","border color":"#4C6106",-
     A                                      "menu option indent":"10px","backgr-
     A                                      ound color":"#758B27","css class":"-
     A                                      action-menu","css class 2":"station-
     A                                      ary","z index":"101"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","vis')
     A                                  1  2HTML('ibility":"hidden","id":"F0350-
     A                                      F_SCR04_BtnHiddenRefresh","value":"-
     A                                      btnRefresh","top":"125px","response-
     A                                      ":{"fieldName":"btnRefresh","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      SCR04_Q1PGM","field type":"output f-
     A                                      ield","value":{"fieldName":"Q1PGM",-
     A                                      "designValue":"[Q1PGM]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"css class":"output-field"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"F0350F_SCR04_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR04_SCPRDS","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPRDS"-
     A                                      ,"designValue":"[SCPRDS]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"130px","cursor row"-
     A                                      :"2","css class 2":"HI","parent tab-
     A                                       panel":"F0350F_SCR04_MainTabPanel"-
     A                                      ,"parent tab":"0","visibility":"hid-
     A                                      den","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant43","field typ-
     A                                      e":"output field","value":"SCR04","-
     A                                      css class":"constant","left":"799px-
     A                                      ","cursor column":"76","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"F0350F_SCR04_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0350F_SCR04_BtnHiddenSearch","va-
     A                                      lue":"btnSearch","top":"150px","res-
     A                                      ponse":{"fieldName":"btnSearch","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"SCHD1","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCHD1","d-
     A                                      esignValue":"[SCHD1]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"78"},"css class":"output-field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"170px","cursor row":"4","pare-
     A                                      nt tab panel":"F0350F_SCR04_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0350F_SCR04_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCHD2","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCHD2","designVal')
     A                                  1  2HTML('ue":"[SCHD2]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      78"},"css class":"output-field","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"190px","cursor row":"5","parent-
     A                                       tab panel":"F0350F_SCR04_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0350F_SCR04_BtnHiddenSy-
     A                                      stemMessages","value":"btnMessage",-
     A                                      "top":"200px","response":{"fieldNam-
     A                                      e":"btnMessage","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"SCHD3","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCHD3","designValue":"[SC-
     A                                      HD3]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none","dataLength":"78"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"210px","cu-
     A                                      rsor row":"6","parent tab panel":"F-
     A                                      0350F_SCR04_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F03-
     A                                      50F_SCR04_BtnHiddenWorkSubmitJob","-
     A                                      value":"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant44","field type":"-
     A                                      output field","value":"EOMB#:","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"230px","c-
     A                                      ursor row":"7","parent tab panel":"-
     A                                      F0350F_SCR04_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCR04_SCEOB#","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCEOB#","designValue":"[-
     A                                      SCEOB#]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00","dataLength":"9","decPos":-
     A                                      "0"},"css class":"output-field","le-
     A                                      ft":"330px","cursor column":"9","to-
     A                                      p":"230px","cursor row":"7","width"-
     A                                      :"63px","text align":"right","paren-
     A                                      t tab panel":"F0350F_SCR04_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant45","field type":"output field"-
     A                                      ,"value":"SpCd:","css class":"const-
     A                                      ant","left":"449px","cursor column"-
     A                                      :"26","top":"230px","cursor row":"7-
     A                                      ","parent tab panel":"F0350F_SCR04_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCSPCD","field type":"output fi-
     A                                      eld","value":{"fieldN')
     A                                  1  2HTML('ame":"SCSPCD","designValue":"-
     A                                      [SCSPCD]","refField":"SPEC","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      491px","cursor column":"32","top":"-
     A                                      230px","cursor row":"7","parent tab-
     A                                       panel":"F0350F_SCR04_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant4-
     A                                      6","field type":"output field","val-
     A                                      ue":"Svc Zip Code:","css class":"co-
     A                                      nstant","left":"561px","cursor colu-
     A                                      mn":"42","top":"230px","cursor row"-
     A                                      :"7","parent tab panel":"F0350F_SCR-
     A                                      04_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCSVZP","field type":"output-
     A                                       field","value":{"fieldName":"SCSVZ-
     A                                      P","designValue":"[SCSVZP]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00","dataLen-
     A                                      gth":"5","decPos":"0"},"css class":-
     A                                      "output-field","left":"659px","curs-
     A                                      or column":"56","top":"230px","curs-
     A                                      or row":"7","width":"35px","text al-
     A                                      ign":"right","parent tab panel":"F0-
     A                                      350F_SCR04_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant47","field t-
     A                                      ype":"output field","value":"Ntwk:"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"69","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"750px","cursor column":"69","to-
     A                                      p":"230px","cursor row":"7","parent-
     A                                       tab panel":"F0350F_SCR04_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCNWC-
     A                                      D","field type":"output field","val-
     A                                      ue":{"fieldName":"SCNWCD","designVa-
     A                                      lue":"[SCNWCD]","refField":"NWCD","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","v-
     A                                      isibility":{"fieldName":"69","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"792px","cursor column"-
     A                                      :"75","top":"230px","cursor row":"7-
     A                                      ","parent tab panel":"F0350F_SCR04_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0350F_SCR04_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"defau')
     A                                  1  2HTML('lt","visibility":"hidden","id-
     A                                      ":"F0350F_SCR04_BtnHiddenImageQueue-
     A                                      ","value":"btnImgQue","top":"275px"-
     A                                      ,"response":{"fieldName":"btnImgQue-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant48","field type":"-
     A                                      output field","value":"This EOMB wa-
     A                                      s pended due to the following fatal-
     A                                       error in ClaimCheck.","css class":-
     A                                      "constant","left":"323px","cursor c-
     A                                      olumn":"8","top":"290px","cursor ro-
     A                                      w":"10","css class 2":"BLU","parent-
     A                                       tab panel":"F0350F_SCR04_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0350F_SCR04_BtnHiddenHe-
     A                                      lp","value":"btnHelp","top":"300px"-
     A                                      ,"response":{"fieldName":"btnHelp",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"SCREAS","field type":"output-
     A                                       field","value":{"fieldName":"SCREA-
     A                                      S","designValue":"[SCREAS]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"60"},"css class":"output-fi-
     A                                      eld","left":"323px","cursor column"-
     A                                      :"8","top":"310px","cursor row":"11-
     A                                      ","css class 2":"WHT","parent tab p-
     A                                      anel":"F0350F_SCR04_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant49"-
     A                                      ,"field type":"output field","value-
     A                                      ":"You will not be able to unpend t-
     A                                      his EOMB at this time.","css class"-
     A                                      :"constant","left":"323px","cursor -
     A                                      column":"8","top":"350px","cursor r-
     A                                      ow":"13","css class 2":"BLU","paren-
     A                                      t tab panel":"F0350F_SCR04_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant50","field type":"output field"-
     A                                      ,"value":"Contact your IT departmen-
     A                                      t immediately with this information-
     A                                      .","css class":"constant","left":"3-
     A                                      23px","cursor column":"8","top":"39-
     A                                      0px","cursor row":"15","css class 2-
     A                                      ":"BLU","parent tab panel":"F0350F_-
     A                                      SCR04_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant51","field type":-
     A                                      "output field","value":"Press","css-
     A                                       class":"constant","left":"323px","-
     A                                      cursor column":"8","top":"430px","c-
     A                                      ursor row":"17","css class 2":"BLU"-
     A                                      ,"parent tab panel":"F0350F_SCR04_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant52","field type":"output-
     A                                       field","value":"Enter","css class"-
     A                                      :"constant","left":"365px","cursor -
     A                                      column":"14","top":"430px","cursor -
     A                                      row":"17","css class 2":"WHT","pare-
     A                                      nt tab panel":"F0350F_SCR04_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converte')
     A                                  1  2HTML('d"},{"id":"constant53","field-
     A                                       type":"output field","value":"to r-
     A                                      eturn.","css class":"constant","lef-
     A                                      t":"407px","cursor column":"20","to-
     A                                      p":"430px","cursor row":"17","css c-
     A                                      lass 2":"BLU","parent tab panel":"F-
     A                                      0350F_SCR04_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"150px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnPAGEDOWN","field type":"-
     A                                      button","value":"Page Down","shortc-
     A                                      ut key":"PageDown","response":{"fie-
     A                                      ldName":"*IN01","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"14px","top":-
     A                                      "183px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnPAGEUP","field type":"butto-
     A                                      n","value":"Page Up","shortcut key"-
     A                                      :"PageUp","response":{"fieldName":"-
     A                                      *IN02","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"14px","top":"216px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCREAS        60A  H
     A            SCSVZP         5S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A          R WDWERR2
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    2C1    7 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDWERR2","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","show as window":"true","window t-
     A                                      op":"8","window left":"3","overlay -
     A                                      range":"2-7"},"items":[{"id":"WDWER-
     A                                      R2","field type":"panel","panel sty-
     A                                      le":"Transform Dialog","text align"-
     A                                      :"center","left":"5px","top":"5px",-
     A                                      "height":"290px","width":"534px","z-
     A                                       index":"8","locked in place":"true-
     A                                      "},{"id":"constant56","field type":-
     A                                      "output field","value":"This EOB wa-
     A                                      s previously processed through Code-
     A                                      Review and cannot be","css class":"-
     A                                      constant","left":"29px","cursor col-
     A                                      umn":"2","top":"85px","cursor row":-
     A                                      "2","css class 2":"WHT","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant57","field type":"output field-
     A                                      ","value":"processed through ClaimC-
     A                                      heck in its current state.  To proc-
     A                                      ess this","css class":"constant","l-
     A                                      eft":"29px","cursor column":"2","to-
     A                                      p":"105px","cursor row":"3","css cl-
     A                                      ass 2":"WHT","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant58","f-
     A                                      ield type":"output field","value":"-
     A                                      EOB through ClaimCheck you must re--
     A                                      key the bill using the original","c-
     A                                      ss class":"constant","left":"29px",-
     A                                      "cursor column":"2","top":"125px","-
     A                                      cursor row":"4","css class 2":"WHT"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant59","field type":"-
     A                                      output field","value":"bill from th-
     A                                      e provider.","css class":"constant"-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"145px","cursor row":"5","css-
     A                                       class 2":"WHT","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant60"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Press Enter to return.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"185px","cursor-
     A                                       row":"7","css class 2":"WHT","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"btnSubmit","field type":"button"-
     A                                      ,"value":"Enter","shortcut key":"En-
     A                                      ter","left":"14px","top":"250px","w-
     A                                      idth":"80px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnPAG-
     A                                      EDOWN","field type":"button","value-
     A                                      ":"Page Down","shortcut key":"PageD-
     A                                      own","response":{"fieldName":"*IN01-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"left":"104px","top":"250px","widt-
     A                                      h":"80px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      visibility":"hidden","cursor":"defa-
     A                                      ult"},{"id":"btnPAGEUP","field type-
     A                                      ":"button","value":"Page Up","short-
     A                                      cut key":"PageUp","response":{"fiel-
     A                                      dName":"*IN02","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"194px","top":-
     A                                      "250px","width":"80px')
     A                                  1  2HTML('","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","vi-
     A                                      sibility":"hidden","cursor":"defaul-
     A                                      t"}]}')
