     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  04 05 06
     A  07 15 24
     A  25 28 29                            CA01(04 'Response Indicator *IN04')
     A  30 51 91
     A  92 93 94
     A  95 03 09                            CA02(05 'Response Indicator *IN05')
     A  43 96 14
     A  31 32 33
     A  34 35 36                            CA03(06 'Response Indicator *IN06')
     A  37 38 39
     A  40 46 44
     A  47 48 49                            CA04(07 'Response Indicator *IN07')
     A  50 55 56
     A  58 59 65
     A  68 69 70                            CA05(15 'Response Indicator *IN15')
     A  71 72 73
     A  74 75 76
     A  77 78 79                            CA06(24 'Response Indicator *IN24')
     A  80 81 82
     A  83 84 85
     A  86 87 88                            CA07(25 'Response Indicator *IN25')
     A  89 16                               CA08(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                      SETOF(92 'Response Indicator *IN92')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                      SETOF(94 'Response Indicator *IN94')
     A                                      SETOF(95 'Response Indicator *IN95')
     A                                  1  2HTML('QPUIREC51   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCCSCDC7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      CSCDC7    MCR2383C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     72RERRMSGID -
     A                                       5    C6    SCCSCDC7    MC40167C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        65RERRMSGID  5    C5    SCPOSC7  -
     A                                        MCR0503C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     76RERRMSGID  5    C5-
     A                                          SCPOSC7    MCR2383C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     77RERRM-
     A                                      SGID  5    C5    SCPOSC7    MCR2387-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     25RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR0556C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     73RERRMSGID  5 -
     A                                         C6    SCFDATC7    MCR0500C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     7-
     A                                      4RERRMSGID  5    C6    SCFDATC7    -
     A                                      MC40056C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     75RERRMSGID  5    C6  -
     A                                        SCFDATC7    MCR0466C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     85RERRMS-
     A                                      GID  5    C6    SCFDATC7    MC40157-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     86RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR2397C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     30RERRMSGID  5 -
     A                                         C6    SCFDATC7    MCR0676C6    F-
     A                                      SMESGC5    *LIBLC0    E1    12   N3-
     A                                      7 38 39 40RERRMSGID  5    C6    SCT-
     A                                      DATC7    MCR0500C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     07RERRMSGID  -
     A                                      5    C6    SCTDATC7    MC40307C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       28RERRMSGID  5    C6    SCTDATC7  -
     A                                        MCR2397C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     29RERRMSGID  5    C6-
     A                                          SCRVCDC7    MCR2387C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     87RERR-
     A                                      MSGID  5    C6    SCRVCDC7    MC404-
     A                                      44C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     91RERRMSGID  5    C6    SCR-
     A                                      VCDC7    MC40544C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     92RERRMSGID  -
     A                                      5    C6    SCRVCDC7    MC40545C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       93RERRMSGID  5    C6    SCRVCDC7  -
     A                                        MC40547C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     95RERRMSGID  5    C6-
     A                                          SCHCPCC7    MCR0503C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     78RERR-
     A                                      MSGID  5    C6    SCHCPCC7    MCR23-
     A                                      87C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     89RERRMSGID  5    C6    SCH-
     A                                      CPCC7    MC40546C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     94RERRMSGID  -
     A                                      5    C6    SCHCPCC7    MC40547C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       95RERRMSGID  5    C6    SCHCPCC7  -
     A                                        MC40549C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     51RERRMSGID  5    C6-
     A                                          SCPMODC7    MCR2434C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     15RERR-
     A                                      MSGID  5    C6    SCMOD2C7    MCR24-
     A                                      34C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     88RERRMSGID  5    C6    SCC-
     A                                      DDSC7    MCR0503C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     79R')
     A                                  1  2HTML('QPUIERRMSGID  5    C6    SCCD-
     A                                      DSC7    MCR0676C6    FSMESGC5    *L-
     A                                      IBLC0    E1    12    37N38N39N40RER-
     A                                      RMSGID  5    C6    SCUNTSC7    MCR0-
     A                                      676C6    FSMESGC5    *LIBLC0    E1 -
     A                                         12   N37 38N39N40RERRMSGID  5   -
     A                                       C6    SCCHRGC7    MCR0556C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     80R-
     A                                      ERRMSGID  5    C6    SCCHRGC7    MC-
     A                                      40116C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     58RERRMSGID  5    C6    -
     A                                      SCCHRGC7    MCR0676C6    FSMESGC5  -
     A                                        *LIBLC0    E1    12   N37N38 39N4-
     A                                      0RERRMSGID  5    C6    SCCHRGC7    -
     A                                      MC40011C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     04RERRMSGID  5    C6  -
     A                                        SCPAIDC7    MC40116C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     58RERRMS-
     A                                      GID  5    C6    SCPAIDC7    MCR0676-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      12   N37N38N39 40RERRMSGID  5    C5-
     A                                          SCMRAC7    MC40116C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     58RERRM-
     A                                      SGID  5    C5    SCMRAC7    MCR0676-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      12    37 38N39N40RERRMSGID  5    C6-
     A                                          SCNTWKC7    MC40116C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     58RERR-
     A                                      MSGID  5    C6    SCNTWKC7    MCR06-
     A                                      76C6    FSMESGC5    *LIBLC0    E1  -
     A                                        12   N37 38 39N40RERRMSGID  5    -
     A                                      C6    SCOTHRC7    MC40116C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     58RE-
     A                                      RRMSGID  5    C6    SCOTHRC7    MCR-
     A                                      0676C6    FSMESGC5    *LIBLC0    E1-
     A                                          12   N37N38 39 40RERRMSGID  5  -
     A                                        C6    SCOT1CC7    MC40072C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     81-
     A                                      RERRMSGID  5    C6    SCOT1CC7    M-
     A                                      CR0513C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     82RERRMSGID  5    C6   -
     A                                       SCOTH2C7    MC40116C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     58RERRMSG-
     A                                      ID  5    C6    SCOTH2C7    MCR0676C-
     A                                      6    FSMESGC5    *LIBLC0    E1    1-
     A                                      2    37N38N39 40RERRMSGID  5    C6 -
     A                                         SCOT2CC7    MC40072C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     83RERRM-
     A                                      SGID  5    C6    SCOT2CC7    MCR051-
     A                                      3C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     84')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","set off":{"fieldN-
     A                                      ame":"*IN04","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 2":{"fieldName-
     A                                      ":"*IN05","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 3":{"fieldName":"-
     A                                      *IN06","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 4":{"fieldName":"*IN-
     A                                      07","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 5":{"fieldName":"*IN15"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 6":{"fieldName":"*IN30","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 7":{"fieldName":"*IN24","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 8":{"fieldName":"*IN28","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      9":{"fieldName":"*IN29","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 10"-
     A                                      :{"fieldName":"*IN91","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 11":{-
     A                                      "fieldName":"*IN25","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 12":{"f-
     A                                      ieldName":"*IN92","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 13":{"fie-
     A                                      ldName":"*IN93","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 14":{"field-
     A                                      Name":"*IN94","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 15":{"fieldNa-
     A                                      me":"*IN95","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 16":{"fieldName-
     A                                      ":"*IN51","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"return cursor record":{"f-
     A                                      ieldName":"HREC","dataLength":"10",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none"}-
     A                                      ,"return cursor field":{"fieldName"-
     A                                      :"HFLD","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"overlay-
     A                                       range":"1-24"},"items":[{"id":"HFL-
     A                                      D","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"HFLD","designValue":"[HFLD]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"10"},"left":"0px","top-
     A                                      ":"-30px","css class"')
     A                                  1  2HTML(':"profound-converted"},{"id":-
     A                                      "HREC","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"HREC","designValue":"[HREC-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"10"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"F0363FME_SCR01_-
     A                                      avKeys","field type":"output field"-
     A                                      ,"value":{"fieldName":"AV_KEYS","da-
     A                                      taLength":"1134","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[AV_KEYS]"},"left":"0px","top":"-
     A                                      0px","visibility":"hidden"},{"id":"-
     A                                      F0363FME_SCR01_action","field type"-
     A                                      :"html container","white space":"no-
     A                                      rmal","left":"0px","top":"10px","wi-
     A                                      dth":"230px","css class":"action-pa-
     A                                      nel-converted","height":"700px","ht-
     A                                      ml":"<div class=\"top\"></div><div -
     A                                      class=\"imagetop\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_top.png\-
     A                                      " /></div><div class=\"menulinks\">-
     A                                      </div><div class=\"imagebottom\"><i-
     A                                      mg src=\"/profoundui/userdata/image-
     A                                      s/bar_bottom.png\" /></div><div cla-
     A                                      ss=\"bottom\"></div>"},{"field type-
     A                                      ":"icon menu button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"32px","z index":"20",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1170px","id":"F0363FME_SCR01_Bt-
     A                                      nIconMenuSystemTools","tool tip":"S-
     A                                      ystem Tools","icon source":"/profou-
     A                                      ndui/userdata/images/systool/systoo-
     A                                      ls.png","data function":"SystemTool-
     A                                      barSystools","show down arrow":"Yes-
     A                                      "},{"field type":"panel","panel sty-
     A                                      le":"TransformButtonBar","id":"F036-
     A                                      3FME_SCR01_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"F0363FME_SCR01_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"def')
     A                                  1  2HTML('ault","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F0363FME_SCR01_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F03-
     A                                      63FME_SCR01_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"F0363FME_SCR01_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F0363FME_SCR01_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"F0363FME_SCR01_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background im')
     A                                  1  2HTML('age":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"F0363FME_SCR01_ImgSysToolBotto-
     A                                      m","field type":"image","image sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/butbarbot.png","left":"1036px-
     A                                      ","top":"64px","width":"187px","loc-
     A                                      ked in place":"true","css class":"s-
     A                                      tationary","visibility":"hidden"},{-
     A                                      "id":"F0363FME_SCR01_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":{"f-
     A                                      ieldName":"SCPRDS","designValue":"[-
     A                                      SCPRDS]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      active tab":"0","left":"250px","top-
     A                                      ":"70px","width":"970px","height":"-
     A                                      657px","z index":"8","locked in pla-
     A                                      ce":"true","css class":"tab-panel",-
     A                                      "css class 2":"stationary"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0363FME_SCR01_BtnH-
     A                                      iddenSave","value":"btnSave","top":-
     A                                      "100px","response":{"fieldName":"bt-
     A                                      nSave","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant1","field typ-
     A                                      e":"output field","left":"281px","c-
     A                                      ursor column":"2","top":"110px","cu-
     A                                      rsor row":"1","css class":"top-line-
     A                                      ","value":"js: currentUser()","css -
     A                                      class 2":"output-field","parent tab-
     A                                       panel":"F0363FME_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","css class 3":"HI-
     A                                      ","parent tab panel":"F0363FME_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 4":"profound-converted"},{-
     A                                      "id":"constant2","field type":"outp-
     A                                      ut field","left":"778px","cursor co-
     A                                      lumn":"73","top":"110px","cursor ro-
     A                                      w":"1","css class":"top-line","valu-
     A                                      e":"js: currentDate()","css class 2-
     A                                      ":"output-field","parent tab panel"-
     A                                      :"F0363FME_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"F0363FME_SCR01-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left')
     A                                  1  2HTML('":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0363FME_SCR01_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"Q1PGM","field type":"output-
     A                                       field","value":{"fieldName":"Q1PGM-
     A                                      ","designValue":"[Q1PGM]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"10"},"css class":"output-fiel-
     A                                      d","left":"281px","cursor column":"-
     A                                      2","top":"130px","cursor row":"2","-
     A                                      parent tab panel":"F0363FME_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCAST","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCAST","de-
     A                                      signValue":"[SCAST]","refField":"ST-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"358px","cursor column":"13-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F0363FME_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCZIPA","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCZIPA","designValue":"[SC-
     A                                      ZIPA]","refField":"ZIPA","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"379-
     A                                      px","cursor column":"16","top":"130-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "HI","parent tab panel":"F0363FME_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCPRDS","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCP-
     A                                      RDS","designValue":"[SCPRDS]","refF-
     A                                      ield":"NAME","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"414px","cursor -
     A                                      column":"21","top":"130px","cursor -
     A                                      row":"2","css class 2":"HI","parent-
     A                                       tab panel":"F0363FME_SCR01_MainTab-
     A                                      Panel","parent tab":"0","visibility-
     A                                      ":"hidden","css class 3":"profound--
     A                                      converted"},{"id":"constant4","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      01","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F0363FME_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t3","field type":"output field","va-
     A                                      lue":"SCR01","css class":"constant"-
     A                                      ,"left":"799px","cursor column":"76-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F03')
     A                                  1  2HTML('63FME_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCMODE","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCMODE","designValue":"[S-
     A                                      CMODE]","refField":"PGM","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"764-
     A                                      px","cursor column":"71","top":"150-
     A                                      px","cursor row":"3","css class 2":-
     A                                      "HI","parent tab panel":"F0363FME_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0363FME_S-
     A                                      CR01_BtnHiddenSearch","value":"btnS-
     A                                      earch","top":"150px","response":{"f-
     A                                      ieldName":"btnSearch","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"SCHD1"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCHD1","designValue-
     A                                      ":"[SCHD1]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"78"},"cs-
     A                                      s class":"output-field","left":"281-
     A                                      px","cursor column":"2","top":"170p-
     A                                      x","cursor row":"4","parent tab pan-
     A                                      el":"F0363FME_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0363FME_SCR01_BtnHiddenDiaryI-
     A                                      tems","value":"btnDiary","top":"175-
     A                                      px","response":{"fieldName":"btnDia-
     A                                      ry","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCHD2","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      HD2","designValue":"[SCHD2]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"78"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"190px","cursor row":"5-
     A                                      ","parent tab panel":"F0363FME_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0363FME_SCR0-
     A                                      1_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCHD3","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCHD3","desi-
     A                                      gnValue":"[SCHD3]","dataType":"char-
     A                                      ","formatting":"Text"')
     A                                  1  2HTML(',"trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"74"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"210px","curs-
     A                                      or row":"6","parent tab panel":"F03-
     A                                      63FME_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCZIPB","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCZIPB","designValue":"[SCZIPB]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"3"},"css class":"o-
     A                                      utput-field","left":"806px","cursor-
     A                                       column":"77","top":"210px","cursor-
     A                                       row":"6","parent tab panel":"F0363-
     A                                      FME_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0363-
     A                                      FME_SCR01_BtnHiddenWorkSubmitJob","-
     A                                      value":"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant5","field type":"o-
     A                                      utput field","value":"EOMB#:","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"230px","cu-
     A                                      rsor row":"7","parent tab panel":"F-
     A                                      0363FME_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCEOB#","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCEOB#","designValue":"[SCEOB-
     A                                      #]","refField":"EOB#","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00"},"css cla-
     A                                      ss":"output-field","left":"330px","-
     A                                      cursor column":"9","top":"230px","c-
     A                                      ursor row":"7","width":"63px","text-
     A                                       align":"right","parent tab panel":-
     A                                      "F0363FME_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant6","fie-
     A                                      ld type":"output field","value":"Li-
     A                                      ne#:","css class":"constant","left"-
     A                                      :"400px","cursor column":"19","top"-
     A                                      :"230px","cursor row":"7","parent t-
     A                                      ab panel":"F0363FME_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCLIN-
     A                                      #","field type":"output field","val-
     A                                      ue":{"fieldName":"SCLIN#","designVa-
     A                                      lue":"[SCLIN#]","refField":"A90","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      "},"css class":"output-field","left-
     A                                      ":"449px","cursor column":"26","top-
     A                                      ":"230px","cursor row":"7","width":-
     A                                      "63px","text align":"right","parent-
     A                                       tab panel":"F0363FME_SCR01_MainTab-
     A                                      Panel","parent tab":"')
     A                                  1  2HTML('0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant7","field -
     A                                      type":"output field","value":"Seq#:-
     A                                      ","css class":"constant","left":"51-
     A                                      9px","cursor column":"36","top":"23-
     A                                      0px","cursor row":"7","parent tab p-
     A                                      anel":"F0363FME_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSEQ#","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCSEQ#","designValue"-
     A                                      :"[SCSEQ#]","refField":"SEQ#","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      561px","cursor column":"42","top":"-
     A                                      230px","cursor row":"7","width":"35-
     A                                      px","text align":"right","parent ta-
     A                                      b panel":"F0363FME_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt8","field type":"output field","v-
     A                                      alue":"Ntwk:","css class":"constant-
     A                                      ","visibility":{"fieldName":"68","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"603px","cursor col-
     A                                      umn":"48","top":"230px","cursor row-
     A                                      ":"7","parent tab panel":"F0363FME_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCNWCD","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      NWCD","designValue":"[SCNWCD]","ref-
     A                                      Field":"NWCD","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"68","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"645px",-
     A                                      "cursor column":"54","top":"230px",-
     A                                      "cursor row":"7","parent tab panel"-
     A                                      :"F0363FME_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant9","fi-
     A                                      eld type":"output field","value":"T-
     A                                      ot chrg:","css class":"constant","l-
     A                                      eft":"687px","cursor column":"60","-
     A                                      top":"230px","cursor row":"7","pare-
     A                                      nt tab panel":"F0363FME_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CTOTC","field type":"output field",-
     A                                      "value":{"fieldName":"SCTOTC","desi-
     A                                      gnValue":"[SCTOTC]","refField":"A92-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"757px","cursor column":"70",-
     A                                      "top":"230px","cursor row":"7","wid-
     A                                      th":"77px","text align":"right","pa-
     A                                      rent tab panel":"F0363FME_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant10","field type":"output f-
     A                                      ield","value":"SELECT')
     A                                  1  2HTML('ED NETWORK CONTRACT IS A MANU-
     A                                      AL FEE SCHEDULE","css class":"const-
     A                                      ant","visibility":{"fieldName":"03"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"281px","cursor -
     A                                      column":"2","top":"250px","cursor r-
     A                                      ow":"8","css class 2":"HI","parent -
     A                                      tab panel":"F0363FME_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0363FME_SCR01_BtnHidde-
     A                                      nWorkPrinterOutput","value":"btnWrk-
     A                                      prtout","top":"250px","response":{"-
     A                                      fieldName":"btnWrkPrnt","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant11","field type":"output field"-
     A                                      ,"value":"Adjudication code     :",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"270px-
     A                                      ","cursor row":"9","parent tab pane-
     A                                      l":"F0363FME_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCCSCD","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCCSCD","designValue-
     A                                      ":"[SCCSCD]","refField":"CODE3","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"449px","cursor column":"2-
     A                                      6","top":"270px","cursor row":"9","-
     A                                      width":"22px","css class 3":{"field-
     A                                      Name":"N09 and N46","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"46 or 44 or 09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      46 or 44 or 09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      5":{"fieldName":"N46","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"set -
     A                                      focus":{"fieldName":"31","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"71","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"3 messages","error message id 2":-
     A                                      "MCR2383","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"72","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messa')
     A                                  1  2HTML('ge id 3":"MC40167","error mes-
     A                                      sage file 3":"FSMESG","error messag-
     A                                      e library 3":"*LIBL","error conditi-
     A                                      on 3":{"fieldName":"65","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"F0363FME_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"SCCSDS"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCSDS","designValu-
     A                                      e":"[SCCSDS]","refField":"DS25","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"485px","cursor column":"30","to-
     A                                      p":"270px","cursor row":"9","css cl-
     A                                      ass 2":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"p-
     A                                      arent tab panel":"F0363FME_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant13","field type":"output -
     A                                      field","value":"EOB Code Needed","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"14","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "673px","cursor column":"58","top":-
     A                                      "270px","cursor row":"9","css class-
     A                                       2":{"fieldName":"14","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"RI","customFalse":""},"pare-
     A                                      nt tab panel":"F0363FME_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant12","field type":"output fie-
     A                                      ld","value":"EOB/Notes attached","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"69","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "673px","cursor column":"58","top":-
     A                                      "270px","cursor row":"9","css class-
     A                                       2":{"fieldName":"69","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"RI","customFalse":""},"pare-
     A                                      nt tab panel":"F0363FME_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0363FME_SCR01_BtnHi-
     A                                      ddenImageQueue","value":"btnImgQue"-
     A                                      ,"top":"275px","response":{"fieldNa-
     A                                      me":"btnImgQue","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant14",-
     A                                      "field type":"output field","value"-
     A                                      :"Place of Service      :","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"290px","curso-
     A                                      r row":"10","parent tab panel":"F03-
     A                                      63FME_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2"')
     A                                  1  2HTML(':"profound-converted"},{"id":-
     A                                      "SCPOS","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCPOS","-
     A                                      designValue":"[SCPOS]","dataType":"-
     A                                      zoned","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00","dataLength"-
     A                                      :"2","decPos":"0"},"left":"449px","-
     A                                      cursor column":"26","top":"290px","-
     A                                      cursor row":"10","width":"15px","cs-
     A                                      s class 3":{"fieldName":"N09 and N4-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"46 or 09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 4":{"-
     A                                      fieldName":"46 or 09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"css -
     A                                      class 5":{"fieldName":"N46","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"set focus":{"fieldName":"32","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"error message id":"MCR0503","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"76","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"3 messages","error message -
     A                                      id 2":"MCR2383","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"77","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 3"-
     A                                      :"MCR2387","error message file 3":"-
     A                                      FSMESG","error message library 3":"-
     A                                      *LIBL","error condition 3":{"fieldN-
     A                                      ame":"25","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"F0363-
     A                                      FME_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"SCPODS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCPODS","designValue":"[SCPODS]",-
     A                                      "refField":"DS30","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"480px","cu-
     A                                      rsor column":"29","top":"290px","cu-
     A                                      rsor row":"10","css class 2":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F0363FME_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"b')
     A                                  1  2HTML('utton","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0363FME_S-
     A                                      CR01_BtnHiddenHelp","value":"btnHel-
     A                                      p","top":"300px","response":{"field-
     A                                      Name":"btnHelp","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant15",-
     A                                      "field type":"output field","value"-
     A                                      :"From Date of Service  :","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"310px","curso-
     A                                      r row":"11","parent tab panel":"F03-
     A                                      63FME_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCFDAT","field type-
     A                                      ":"date field","css class":"input",-
     A                                      "css class 2":"date-field","value":-
     A                                      {"fieldName":"SCFDAT","designValue"-
     A                                      :"[SCFDAT]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      edtWrd":"''  /  /    ''","dateForma-
     A                                      t":"m/d/Y"},"left":"449px","cursor -
     A                                      column":"26","top":"310px","cursor -
     A                                      row":"11","width":"71px","css class-
     A                                       3":{"fieldName":"N09 and N46","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"46 or-
     A                                       09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"46 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 5-
     A                                      ":{"fieldName":"N46","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"33","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"MCR0556","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"73","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "7 messages","error message id 2":"-
     A                                      MCR0500","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"74","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 3":"MC400-
     A                                      56","error message file 3":"FSMESG"-
     A                                      ,"error message library 3":"*LIBL",-
     A                                      "error condition 3":{"fieldName":"7-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 4":"MCR0466","-
     A                                      error message file 4":"FSMESG","err-
     A                                      or message library 4":"*LIBL","erro-
     A                                      r condition 4":{"fieldName":"85","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror message id 5":"MC40157","error-
     A                                       message file 5":"FSM')
     A                                  1  2HTML('ESG","error message library 5-
     A                                      ":"*LIBL","error condition 5":{"fie-
     A                                      ldName":"86","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 6":"-
     A                                      MCR2397","error message file 6":"FS-
     A                                      MESG","error message library 6":"*L-
     A                                      IBL","error condition 6":{"fieldNam-
     A                                      e":"30","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 7":"MCR06-
     A                                      76","error message file 7":"FSMESG"-
     A                                      ,"error message library 7":"*LIBL",-
     A                                      "error condition 7":{"fieldName":"N-
     A                                      37 and 38 and 39 and 40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"F0363FME_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt16","field type":"output field","-
     A                                      value":"To Date of Service       :"-
     A                                      ,"css class":"constant","left":"560-
     A                                      px","cursor column":"40","top":"310-
     A                                      px","cursor row":"11","parent tab p-
     A                                      anel":"F0363FME_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCTDAT","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCTDAT","de-
     A                                      signValue":"[SCTDAT]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","edtWrd":"''  /  /    ''",-
     A                                      "dateFormat":"m/d/Y"},"left":"758px-
     A                                      ","cursor column":"67","top":"310px-
     A                                      ","cursor row":"11","width":"71px",-
     A                                      "css class 3":{"fieldName":"N09 and-
     A                                       N46","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"46 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 4"-
     A                                      :{"fieldName":"46 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"e-
     A                                      rror message id":"MCR0500","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"07","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"3 messages","error message id 2"-
     A                                      :"MC40307","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"28","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MCR-
     A                                      2397","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "29","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"description":"To Date of Serv-
     A                                      ice","parent tab pane')
     A                                  1  2HTML('l":"F0363FME_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt17","field type":"output field","-
     A                                      value":"Revenue code          :","c-
     A                                      ss class":"constant","left":"281px"-
     A                                      ,"cursor column":"2","top":"330px",-
     A                                      "cursor row":"12","parent tab panel-
     A                                      ":"F0363FME_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted","width":"160px"},{"id-
     A                                      ":"SCRVCD","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCRVC-
     A                                      D","designValue":"[SCRVCD]","refFie-
     A                                      ld":"RVCD","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00"},"left":"449px","cu-
     A                                      rsor column":"26","top":"330px","cu-
     A                                      rsor row":"12","width":"25px","css -
     A                                      class 3":{"fieldName":"N09 and N46"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      46 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"46 or 09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"N46","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      set focus":{"fieldName":"34","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"error message id":"MCR2387","erro-
     A                                      r message file":"FSMESG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"87","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"5 messages","error message id-
     A                                       2":"MC40444","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"91","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 3":"-
     A                                      MC40544","error message file 3":"FS-
     A                                      MESG","error message library 3":"*L-
     A                                      IBL","error condition 3":{"fieldNam-
     A                                      e":"92","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 4":"MC405-
     A                                      45","error message file 4":"FSMESG"-
     A                                      ,"error message library 4":"*LIBL",-
     A                                      "error condition 4":{"fieldName":"9-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 5":"MC40547","-
     A                                      error message file 5":"FSMESG","err-
     A                                      or message library 5":"*LIBL","erro-
     A                                      r condition 5":{"fieldName":"95","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"p-
     A                                      arent tab panel":"F03')
     A                                  1  2HTML('63FME_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"constant19","-
     A                                      field type":"output field","value":-
     A                                      "Date Entered             :","css c-
     A                                      lass":"constant","left":"560px","cu-
     A                                      rsor column":"40","top":"330px","cu-
     A                                      rsor row":"12","parent tab panel":"-
     A                                      F0363FME_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted","width":"185px"},{"id":"-
     A                                      SCEDAT","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCEDAT","des-
     A                                      ignValue":"[SCEDAT]","refField":"DT-
     A                                      8","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","edtWrd":"''  /  /    ''"},"c-
     A                                      ss class":"output-field","left":"76-
     A                                      0px","cursor column":"67","top":"33-
     A                                      0px","cursor row":"12","width":"70p-
     A                                      x","text align":"right","css class -
     A                                      2":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"paren-
     A                                      t tab panel":"F0363FME_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant20","field type":"output fiel-
     A                                      d","value":"HCPCS/CPT4/DRG-Mod 1 & -
     A                                      2","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"35-
     A                                      0px","cursor row":"13","parent tab -
     A                                      panel":"F0363FME_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted","width":"170px"}-
     A                                      ,{"id":"SCHCPC","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCHCPC","designValue":"[SCHCPC]","r-
     A                                      efField":"CPT4","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"463px"-
     A                                      ,"cursor column":"28","top":"350px"-
     A                                      ,"cursor row":"13","width":"36px","-
     A                                      css class 3":{"fieldName":"N09 and -
     A                                      N46","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"46 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 4":-
     A                                      {"fieldName":"46 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 5":{"fieldName":"N46 and N1-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"35","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"MC-
     A                                      R0503","error message file":"FSMESG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fi')
     A                                  1  2HTML('eldName":"78","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"5 messages","error message id 2"-
     A                                      :"MCR2387","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"89","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MC4-
     A                                      0546","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "94","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 4":"MC40547"-
     A                                      ,"error message file 4":"FSMESG","e-
     A                                      rror message library 4":"*LIBL","er-
     A                                      ror condition 4":{"fieldName":"95",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 5":"MC40549","err-
     A                                      or message file 5":"FSMESG","error -
     A                                      message library 5":"*LIBL","error c-
     A                                      ondition 5":{"fieldName":"51","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"pare-
     A                                      nt tab panel":"F0363FME_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant22","field type":"output fie-
     A                                      ld","value":"-","css class":"consta-
     A                                      nt","left":"505px","cursor column":-
     A                                      "34","top":"350px","cursor row":"13-
     A                                      ","parent tab panel":"F0363FME_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPMOD","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      PMOD","designValue":"[SCPMOD]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      ,"dataLength":"2"},"text transform"-
     A                                      :"uppercase","left":"519px","cursor-
     A                                       column":"36","top":"350px","cursor-
     A                                       row":"13","width":"15px","css clas-
     A                                      s 3":{"fieldName":"N09 and N46","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"46 o-
     A                                      r 09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 4":{"fieldN-
     A                                      ame":"46 or 09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"05","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"MCR2434","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"15","dataType":"expre-
     A                                      ssion","formatting":"')
     A                                  1  2HTML('Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","de-
     A                                      scription":"Procedure Code Modifier-
     A                                      ","parent tab panel":"F0363FME_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant23","field type":"out-
     A                                      put field","value":"-","css class":-
     A                                      "constant","left":"540px","cursor c-
     A                                      olumn":"39","top":"350px","cursor r-
     A                                      ow":"13","parent tab panel":"F0363F-
     A                                      ME_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCMOD2","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCMOD2","designValue":"[SCMOD2-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","dataLength":"2"},"text tra-
     A                                      nsform":"uppercase","left":"554px",-
     A                                      "cursor column":"41","top":"350px",-
     A                                      "cursor row":"13","width":"15px","c-
     A                                      ss class 3":{"fieldName":"N09 and N-
     A                                      46","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"46 or 09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 4":{-
     A                                      "fieldName":"46 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"set focus":{"fieldName":"24","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"error message id":"MCR2434","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"88","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"1 message","description":"P-
     A                                      rocedure Code Modifier","parent tab-
     A                                       panel":"F0363FME_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t24","field type":"output field","v-
     A                                      alue":"Description           :","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"370px","-
     A                                      cursor row":"14","parent tab panel"-
     A                                      :"F0363FME_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCCDDS","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCCDDS","designValue":-
     A                                      "[SCCDDS]","refField":"DS25","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"449px","cursor column":"26",-
     A                                      "top":"370px","cursor')
     A                                  1  2HTML(' row":"14","width":"176px","c-
     A                                      ss class 3":{"fieldName":"N09 and N-
     A                                      46","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"46 or 09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 4":{-
     A                                      "fieldName":"46 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"set-
     A                                       focus":{"fieldName":"06","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"MCR0503","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"79","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0676","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"37 and N38 and N39 and N40","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"F0363FME_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 5":"profound-converted"},{"id-
     A                                      ":"constant25","field type":"output-
     A                                       field","value":"Service units     -
     A                                          :","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"390px","cursor row":"15","parent -
     A                                      tab panel":"F0363FME_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCUN-
     A                                      TS","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCUNTS","des-
     A                                      ignValue":"[SCUNTS]","dataType":"zo-
     A                                      ned","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00","dataLength":"-
     A                                      3","decPos":"0","numBlankFill":"tru-
     A                                      e"},"left":"449px","cursor column":-
     A                                      "26","top":"390px","cursor row":"15-
     A                                      ","width":"22px","text align":"righ-
     A                                      t","css class 3":{"fieldName":"N09 -
     A                                      and N46","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"46 or 09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       4":{"fieldName":"46 or 09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"set focus":{"fieldName":"36"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error messag')
     A                                  1  2HTML('e id":"MCR0676","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"N37 and 38 and N39 and N-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","p-
     A                                      arent tab panel":"F0363FME_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant26","field type":"output -
     A                                      field","value":"Total charges      -
     A                                         :","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "410px","cursor row":"16","parent t-
     A                                      ab panel":"F0363FME_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCCHR-
     A                                      G","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCCHRG","desi-
     A                                      gnValue":"[SCCHRG]","refField":"A92-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00"},"left":"449px","cursor colum-
     A                                      n":"26","top":"410px","cursor row":-
     A                                      "16","width":"78px","css class 3":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 4":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"c-
     A                                      ss class 5":"HI","error message id"-
     A                                      :"MCR0556","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      80","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"4 messages","-
     A                                      error message id 2":"MC40116","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"58","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 3":"MCR0676","error mes-
     A                                      sage file 3":"FSMESG","error messag-
     A                                      e library 3":"*LIBL","error conditi-
     A                                      on 3":{"fieldName":"N37 and N38 and-
     A                                       39 and N40","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 4":"-
     A                                      MC40011","error message file 4":"FS-
     A                                      MESG","error message library 4":"*L-
     A                                      IBL","error condition 4":{"fieldNam-
     A                                      e":"04","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"F0363FM-
     A                                      E_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant27","field type-
     A                                      ":"output field","value":"Payment  -
     A                                                      :","css class":"con-
     A                                      stant","left":"561px"')
     A                                  1  2HTML(',"cursor column":"42","top":"-
     A                                      410px","cursor row":"16","parent ta-
     A                                      b panel":"F0363FME_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPAID-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCPAID","desig-
     A                                      nValue":"[SCPAID]","refField":"A92"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"left":"750px","cursor column-
     A                                      ":"69","top":"410px","cursor row":"-
     A                                      16","width":"78px","css class 3":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 4":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"error message id":"MC40116","err-
     A                                      or message file":"FSMESG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"58","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"2 messages","error message i-
     A                                      d 2":"MCR0676","error message file -
     A                                      2":"FSMESG","error message library -
     A                                      2":"*LIBL","error condition 2":{"fi-
     A                                      eldName":"N37 and N38 and N39 and 4-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"parent tab panel":"F0363FME_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"SCHMR1","field type":"output-
     A                                       field","value":{"fieldName":"SCHMR-
     A                                      1","designValue":"[SCHMR1]","refFie-
     A                                      ld":"DS10","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"281px","cursor co-
     A                                      lumn":"2","top":"430px","cursor row-
     A                                      ":"17","parent tab panel":"F0363FME-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"constant28","field type"-
     A                                      :"output field","value":"amount    -
     A                                          :","css class":"constant","left-
     A                                      ":"358px","cursor column":"13","top-
     A                                      ":"430px","cursor row":"17","parent-
     A                                       tab panel":"F0363FME_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCM-
     A                                      RA","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCMRA","desi-
     A                                      gnValue":"[SCMRA]","refField":"A92"-
     A                                      ,"dataType":"referenc')
     A                                  1  2HTML('e","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00"},"left":"4-
     A                                      70px","cursor column":"29","top":"4-
     A                                      30px","cursor row":"17","width":"78-
     A                                      px","css class 3":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"set focus":{-
     A                                      "fieldName":"55","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"MC40116","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"58","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"MCR0676-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"37 -
     A                                      and 38 and N39 and N40","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"F0363FME_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"SCHNTW"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCHNTW","designValu-
     A                                      e":"[SCHNTW]","refField":"DS10","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","vis-
     A                                      ibility":{"fieldName":"47","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"561px","cursor column":"-
     A                                      42","top":"430px","cursor row":"17"-
     A                                      ,"parent tab panel":"F0363FME_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant29","field type":"outp-
     A                                      ut field","value":"amount        :"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"47","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"638px","cursor column":"53","to-
     A                                      p":"430px","cursor row":"17","paren-
     A                                      t tab panel":"F0363FME_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      NTWK","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCNTWK","d-
     A                                      esignValue":"[SCNTWK]","refField":"-
     A                                      A92","dataType":"refe')
     A                                  1  2HTML('rence","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00"},"visi-
     A                                      bility":{"fieldName":"47","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"750px","cursor column":"6-
     A                                      9","top":"430px","cursor row":"17",-
     A                                      "width":"78px","css class 3":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"e-
     A                                      rror message id":"MC40116","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"58","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0676","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"N37 and 38 and 39 and N40","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"p-
     A                                      arent tab panel":"F0363FME_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"SCHO11","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCHO11","d-
     A                                      esignValue":"[SCHO11]","refField":"-
     A                                      DS10","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"450px","cursor row":"18-
     A                                      ","parent tab panel":"F0363FME_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant30","field type":"out-
     A                                      put field","value":"amount        :-
     A                                      ","css class":"constant","left":"35-
     A                                      8px","cursor column":"13","top":"45-
     A                                      0px","cursor row":"18","parent tab -
     A                                      panel":"F0363FME_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCOTHR",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCOTHR","designV-
     A                                      alue":"[SCOTHR]","refField":"A92","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"left":"470px","cursor column":-
     A                                      "29","top":"450px","cursor row":"18-
     A                                      ","width":"78px","css')
     A                                  1  2HTML(' class 3":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 4":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"error message -
     A                                      id":"MC40116","error message file":-
     A                                      "FSMESG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"58","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"2 messages-
     A                                      ","error message id 2":"MCR0676","e-
     A                                      rror message file 2":"FSMESG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"N37 and-
     A                                       N38 and 39 and 40","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"F0363FME_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"SCHO12","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCHO12","designValue":"-
     A                                      [SCHO12]","refField":"DS10","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      561px","cursor column":"42","top":"-
     A                                      450px","cursor row":"18","parent ta-
     A                                      b panel":"F0363FME_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt31","field type":"output field","-
     A                                      value":"type code     :","css class-
     A                                      ":"constant","left":"638px","cursor-
     A                                       column":"53","top":"450px","cursor-
     A                                       row":"18","parent tab panel":"F036-
     A                                      3FME_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCOT1C","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCOT1C","designValue":"[SCOT-
     A                                      1C]","refField":"CODE3","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"750px","cursor column":"69","top"-
     A                                      :"450px","cursor row":"18","width":-
     A                                      "22px","css class 3":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indica')
     A                                  1  2HTML('tor","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "48","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"MC4-
     A                                      0072","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"81","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"MCR0513","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"82","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"F0363FME_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"SCHO21"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCHO21","designValu-
     A                                      e":"[SCHO21]","refField":"DS10","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"470px","cursor row":"19","parent-
     A                                       tab panel":"F0363FME_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant32","field type":"output field-
     A                                      ","value":"amount        :","css cl-
     A                                      ass":"constant","left":"358px","cur-
     A                                      sor column":"13","top":"470px","cur-
     A                                      sor row":"19","parent tab panel":"F-
     A                                      0363FME_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCOTH2","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCOTH2","designValue":"[S-
     A                                      COTH2]","refField":"A92","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00"},"left-
     A                                      ":"470px","cursor column":"29","top-
     A                                      ":"470px","cursor row":"19","width"-
     A                                      :"78px","css class 3":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 4":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 5":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"set focu-
     A                                      s":{"fieldName":"49",')
     A                                  1  2HTML('"dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"MC-
     A                                      40116","error message file":"FSMESG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"58",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"MCR0676","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"37 and N38 and-
     A                                       N39 and 40","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"parent tab panel":"F0-
     A                                      363FME_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"SCHO22","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCHO22","designValue":"[SCHO22-
     A                                      ]","refField":"DS10","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"561px",-
     A                                      "cursor column":"42","top":"470px",-
     A                                      "cursor row":"19","parent tab panel-
     A                                      ":"F0363FME_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant33","-
     A                                      field type":"output field","value":-
     A                                      "type code     :","css class":"cons-
     A                                      tant","left":"638px","cursor column-
     A                                      ":"53","top":"470px","cursor row":"-
     A                                      19","parent tab panel":"F0363FME_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCOT2C","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCOT2C","designValue":"[SCOT2C]","r-
     A                                      efField":"CODE3","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"750px-
     A                                      ","cursor column":"69","top":"470px-
     A                                      ","cursor row":"19","width":"22px",-
     A                                      "css class 3":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"css class 5":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"50","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"error message -
     A                                      id":"MC40072","error message file":-
     A                                      "FSMESG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"83","dataType":"ex')
     A                                  1  2HTML('pression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"2 messages","error messag-
     A                                      e id 2":"MCR0513","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"84","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"F0363FME_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"id":"constant35","f-
     A                                      ield type":"output field","value":"-
     A                                      Rule                     :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"56","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"280p-
     A                                      x","cursor column":"65","top":"490p-
     A                                      x","cursor row":"21","parent tab pa-
     A                                      nel":"F0363FME_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted","width":"150px"},{-
     A                                      "id":"SCRULE","field type":"output -
     A                                      field","value":{"fieldName":"SCRULE-
     A                                      ","designValue":"[SCRULE]","refFiel-
     A                                      d":"A90","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","visibility":{"fieldName":"56-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"470px","cursor-
     A                                       column":"71","top":"490px","cursor-
     A                                       row":"21","width":"63px","text ali-
     A                                      gn":"left","parent tab panel":"F036-
     A                                      3FME_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant40","field t-
     A                                      ype":"output field","value":" ","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"09 and 43 and 96","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"281px","cursor column-
     A                                      ":"2","top":"530px","cursor row":"2-
     A                                      2","css class 2":"BLU","parent tab -
     A                                      panel":"F0363FME_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      39","field type":"output field","va-
     A                                      lue":" ","css class":"constant","vi-
     A                                      sibility":{"fieldName":"09 and 43 a-
     A                                      nd N96","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"281px","-
     A                                      cursor column":"2","top":"530px","c-
     A                                      ursor row":"22","css class 2":"BLU"-
     A                                      ,"parent tab panel":"F0363FME_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant38","field type":"outp-
     A                                      ut field","value":" ","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"N09 and N43","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      81px","cursor column":"2","top":"53-
     A                                      0px","cursor row":"22","css class 2-
     A                                      ":"BLU","parent tab p')
     A                                  1  2HTML('anel":"F0363FME_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant37","field type":"output field-
     A                                      ","value":" ","css class":"constant-
     A                                      ","visibility":{"fieldName":"N09 an-
     A                                      d 43 and 96","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"281-
     A                                      px","cursor column":"2","top":"530p-
     A                                      x","cursor row":"22","css class 2":-
     A                                      "BLU","parent tab panel":"F0363FME_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant36","field type":-
     A                                      "output field","value":" ","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"N09 and 43 and N96","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"530px","cursor row":"22",-
     A                                      "css class 2":"BLU","parent tab pan-
     A                                      el":"F0363FME_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant41"-
     A                                      ,"field type":"output field","value-
     A                                      ":" ","css class":"constant","visib-
     A                                      ility":{"fieldName":"N09 and 43 and-
     A                                       N96","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"281px","cu-
     A                                      rsor column":"2","top":"550px","cur-
     A                                      sor row":"23","css class 2":"BLU","-
     A                                      parent tab panel":"F0363FME_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant43","field type":"output-
     A                                       field","value":" ","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      N09 and N43","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"281-
     A                                      px","cursor column":"2","top":"550p-
     A                                      x","cursor row":"23","css class 2":-
     A                                      "BLU","parent tab panel":"F0363FME_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant44","field type":-
     A                                      "output field","value":" ","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"09 and N43","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"550px","cursor row":"23","css cla-
     A                                      ss 2":"BLU","parent tab panel":"F03-
     A                                      63FME_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant42","field -
     A                                      type":"output field","value":" ","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"N09 and 43 and 96","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"281px","cursor colu-
     A                                      mn":"2","top":"550px","cursor row":-
     A                                      "23","css class 2":"BLU","parent ta-
     A                                      b panel":"F0363FME_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt45","field type":"o')
     A                                  1  2HTML('utput field","value":"       -
     A                                            ","css class":"constant","vis-
     A                                      ibility":{"fieldName":"70","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"570px","cursor row":"24",-
     A                                      "parent tab panel":"F0363FME_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"150px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F01","field type":"button","visibil-
     A                                      ity":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "value":"Repeat","shortcut key":"F1-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF02"-
     A                                      ,"field type":"button","visibility"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"val-
     A                                      ue":"Process","shortcut key":"F2","-
     A                                      left":"14px","top":"216px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF05","f-
     A                                      ield type":"button","visibility":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"value"-
     A                                      :"Refresh","shortcut key":"F5","lef-
     A                                      t":"14px","top":"249px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF07","fiel-
     A                                      d type":"button","visibility":{"fie-
     A                                      ldName":"N09 and 43 and N96 or N09 -
     A                                      and 43 and 96 or N09 and N43 or 09 -
     A                                      and 43 and N96 or 09 and 43 and 96 -
     A                                      or 09 and N43","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"value":"-
     A                                      Header Info","shortcut key":"F7","l-
     A                                      eft":"14px","top":"282px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF09","fi-
     A                                      eld type":"button","visibility":{"f-
     A                                      ieldName":"43 and N96","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      value":"Code info","shortcut key":"-
     A                                      F9","left":"14px","top":"315px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      0","field type":"button","visibilit-
     A                                      y":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"v-
     A                                      alue":"Search","shortcut key":"F10"-
     A                                      ,"left":"14px","top":"348px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arr')
     A                                  1  2HTML('ange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF11","field type":"b-
     A                                      utton","visibility":{"fieldName":"4-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"EOB/Notes","-
     A                                      shortcut key":"F11","left":"14px","-
     A                                      top":"381px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","visibility":{"fieldName":"09-
     A                                       and 43 and N96 or 09 and 43 and 96-
     A                                       or N09 and 43 and N96 or N09 and 4-
     A                                      3 and 96 or N09 and N43 or 09 and N-
     A                                      43","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"414px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF14","field type":"butt-
     A                                      on","visibility":{"fieldName":"09 a-
     A                                      nd 43 and N96 or 09 and 43 and 96 o-
     A                                      r N09 and 43 and N96 or N09 and 43 -
     A                                      and 96 or N09 and N43 or 09 and N43-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"value":"DART","shortc-
     A                                      ut key":"F14","left":"14px","top":"-
     A                                      447px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF15","field type":"button",-
     A                                      "visibility":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"value":"Display lines","sh-
     A                                      ortcut key":"F15","left":"14px","to-
     A                                      p":"480px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"constant42_copy","field typ-
     A                                      e":"output field","css class":"cons-
     A                                      tant","value":"EOB codes:","cursor -
     A                                      row":"21","cursor column":"37","lef-
     A                                      t":"280px","top":"510px","css class-
     A                                       2":"profound-converted","visibilit-
     A                                      y":{"fieldName":"59 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"parent tab panel":"F0363FME_SCR-
     A                                      01_MainTabPanel","parent tab":"0"},-
     A                                      {"id":"SCEOB1","field type":"output-
     A                                       field","css class":"output-field",-
     A                                      "value":{"fieldName":"SCEOB1","trim-
     A                                      Leading":"true","trimTrailing":"fal-
     A                                      se","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"reference","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      uppercase","designValue":"[SCEOB1]"-
     A                                      ,"refField":"CODE3","keywords":[]},-
     A                                      "cursor row":"21","cursor column":"-
     A                                      48","left":"360px","top":"510px","w-
     A                                      idth":"46PX","css class 2":"profoun-
     A                                      d-converted","visibility":{"fieldNa-
     A                                      me":"59 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"parent t-
     A                                      ab panel":"F0363FME_SCR01_MainTabPa-
     A                                      nel","parent tab":"0"')
     A                                  1  2HTML('},{"id":"SCEOB2","field type"-
     A                                      :"output field","css class":"output-
     A                                      -field","value":{"fieldName":"SCEOB-
     A                                      2","trimLeading":"true","trimTraili-
     A                                      ng":"false","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"refer-
     A                                      ence","formatting":"Text","textTran-
     A                                      sform":"uppercase","designValue":"[-
     A                                      SCEOB2]","refField":"CODE3","keywor-
     A                                      ds":[]},"cursor row":"21","cursor c-
     A                                      olumn":"52","left":"410px","top":"5-
     A                                      10px","width":"46PX","css class 2":-
     A                                      "profound-converted","visibility":{-
     A                                      "fieldName":"59 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      parent tab panel":"F0363FME_SCR01_M-
     A                                      ainTabPanel","parent tab":"0"},{"id-
     A                                      ":"SCEOB3","field type":"output fie-
     A                                      ld","css class":"output-field","val-
     A                                      ue":{"fieldName":"SCEOB3","trimLead-
     A                                      ing":"true","trimTrailing":"false",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"reference","forma-
     A                                      tting":"Text","textTransform":"uppe-
     A                                      rcase","designValue":"[SCEOB3]","re-
     A                                      fField":"CODE3","keywords":[]},"cur-
     A                                      sor row":"21","cursor column":"56",-
     A                                      "left":"460px","top":"510px","width-
     A                                      ":"46PX","css class 2":"profound-co-
     A                                      nverted","visibility":{"fieldName":-
     A                                      "59 or 09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"parent tab p-
     A                                      anel":"F0363FME_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0"},{"id":"SCEOB4","-
     A                                      field type":"output field","css cla-
     A                                      ss":"output-field","value":{"fieldN-
     A                                      ame":"SCEOB4","trimLeading":"true",-
     A                                      "trimTrailing":"false","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","textTransform":"uppercase","desi-
     A                                      gnValue":"[SCEOB4]","refField":"COD-
     A                                      E3","keywords":[]},"cursor row":"21-
     A                                      ","cursor column":"60","left":"510p-
     A                                      x","top":"510px","width":"46PX","cs-
     A                                      s class 2":"profound-converted","vi-
     A                                      sibility":{"fieldName":"59 or 09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"parent tab panel":"F0363-
     A                                      FME_SCR01_MainTabPanel","parent tab-
     A                                      ":"0"},{"id":"SCEOB5","field type":-
     A                                      "output field","css class":"output--
     A                                      field","value":{"fieldName":"SCEOB5-
     A                                      ","dataLength":"6","trimLeading":"t-
     A                                      rue","trimTrailing":"false","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"uppercase","desi-
     A                                      gnValue":"[SCEOB5]"},"cursor row":"-
     A                                      21","cursor column":"60","left":"56-
     A                                      0px","top":"510px","width":"46PX","-
     A                                      css class 2":"profound-converted","-
     A                                      visibility":{"fieldName":"59 or 09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"parent tab panel":"F03-
     A                                      63FME_SCR01_MainTabPanel","parent t-
     A                                      ab":"0"},{"id":"SCEOB6","field type-
     A                                      ":"output field","css')
     A                                  1  2HTML(' class":"output-field","value-
     A                                      ":{"fieldName":"SCEOB6","dataLength-
     A                                      ":"6","trimLeading":"true","trimTra-
     A                                      iling":"false","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SC-
     A                                      EOB6]"},"cursor row":"21","cursor c-
     A                                      olumn":"60","left":"610px","top":"5-
     A                                      10px","width":"46PX","css class 2":-
     A                                      "profound-converted","visibility":{-
     A                                      "fieldName":"59 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      parent tab panel":"F0363FME_SCR01_M-
     A                                      ainTabPanel","parent tab":"0"},{"id-
     A                                      ":"SCEOB7","field type":"output fie-
     A                                      ld","css class":"output-field","val-
     A                                      ue":{"fieldName":"SCEOB7","dataLeng-
     A                                      th":"6","trimLeading":"true","trimT-
     A                                      railing":"false","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"uppercase","designValue":"[-
     A                                      SCEOB7]"},"cursor row":"21","cursor-
     A                                       column":"60","left":"660px","top":-
     A                                      "510px","width":"46PX","css class 2-
     A                                      ":"profound-converted","visibility"-
     A                                      :{"fieldName":"59 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"parent tab panel":"F0363FME_SCR01-
     A                                      _MainTabPanel","parent tab":"0"},{"-
     A                                      id":"SCEOB8","field type":"output f-
     A                                      ield","css class":"output-field","v-
     A                                      alue":{"fieldName":"SCEOB8","dataLe-
     A                                      ngth":"6","trimLeading":"true","tri-
     A                                      mTrailing":"false","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"uppercase","designValue":-
     A                                      "[SCEOB8]"},"cursor row":"21","curs-
     A                                      or column":"60","left":"710px","top-
     A                                      ":"510px","width":"46PX","css class-
     A                                       2":"profound-converted","visibilit-
     A                                      y":{"fieldName":"59 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"parent tab panel":"F0363FME_SCR-
     A                                      01_MainTabPanel","parent tab":"0"},-
     A                                      {"id":"SCEOB9","field type":"output-
     A                                       field","css class":"output-field",-
     A                                      "value":{"fieldName":"SCEOB9","data-
     A                                      Length":"6","trimLeading":"true","t-
     A                                      rimTrailing":"false","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"uppercase","designValue-
     A                                      ":"[SCEOB9]"},"cursor row":"21","cu-
     A                                      rsor column":"60","left":"760px","t-
     A                                      op":"510px","width":"46PX","css cla-
     A                                      ss 2":"profound-converted","visibil-
     A                                      ity":{"fieldName":"59 or 09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"parent tab panel":"F0363FME_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      },{"id":"SCEOB10","field type":"out-
     A                                      put field","css class":"output-fiel-
     A                                      d","value":{"fieldName":"SCEOB10","-
     A                                      dataLength":"6","trimLeading":"true-
     A                                      ","trimTrailing":"fal')
     A                                  1  2HTML('se","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "uppercase","designValue":"[SCEOB10-
     A                                      ]"},"cursor row":"21","cursor colum-
     A                                      n":"60","left":"810px","top":"510px-
     A                                      ","width":"46PX","css class 2":"pro-
     A                                      found-converted","visibility":{"fie-
     A                                      ldName":"59 or 09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"pare-
     A                                      nt tab panel":"F0363FME_SCR01_MainT-
     A                                      abPanel","parent tab":"0"},{"id":"S-
     A                                      CEOB11","field type":"output field"-
     A                                      ,"css class":"output-field","value"-
     A                                      :{"fieldName":"SCEOB11","dataLength-
     A                                      ":"6","trimLeading":"true","trimTra-
     A                                      iling":"false","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SC-
     A                                      EOB11]"},"cursor row":"21","cursor -
     A                                      column":"60","left":"860px","top":"-
     A                                      510px","width":"46PX","css class 2"-
     A                                      :"profound-converted","visibility":-
     A                                      {"fieldName":"59 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "parent tab panel":"F0363FME_SCR01_-
     A                                      MainTabPanel","parent tab":"0"},{"i-
     A                                      d":"SCEOB12","field type":"output f-
     A                                      ield","css class":"output-field","v-
     A                                      alue":{"fieldName":"SCEOB12","dataL-
     A                                      ength":"6","trimLeading":"true","tr-
     A                                      imTrailing":"false","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"uppercase","designValue"-
     A                                      :"[SCEOB12]"},"cursor row":"21","cu-
     A                                      rsor column":"60","left":"910px","t-
     A                                      op":"510px","width":"46PX","css cla-
     A                                      ss 2":"profound-converted","visibil-
     A                                      ity":{"fieldName":"59 or 09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"parent tab panel":"F0363FME_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB10        6A  H
     A            SCEOB11        6A  H
     A            SCEOB12        6A  H
     A            SCEOB5         6A  H
     A            SCEOB6         6A  H
     A            SCEOB7         6A  H
     A            SCEOB8         6A  H
     A            SCEOB9         6A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         74A  H
     A            SCMOD2         2A  H
     A            SCPMOD         2A  H
     A            SCPOS          2S 0H
     A            SCUNTS         3S 0H
     A            SCZIPB         3A  H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCDDS    R        H      REFFLD(DS25)
     A            SCCHRG    R        H      REFFLD(A92)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCSCD    R        H      REFFLD(CODE3)
     A            SCCSDS    R        H      REFFLD(DS25)
     A            SCEDAT    R        H      REFFLD(DT8)
     A            SCEOB#    R        H      REFFLD(EOB#)
     A            SCEOB1    R        H      REFFLD(CODE3)
     A            SCEOB2    R        H      REFFLD(CODE3)
     A            SCEOB3    R        H      REFFLD(CODE3)
     A            SCEOB4    R        H      REFFLD(CODE3)
     A            SCFDAT    R        H      REFFLD(DT8)
     A            SCHCPC    R        H      REFFLD(CPT4)
     A            SCHMR1    R        H      REFFLD(DS10)
     A            SCHNTW    R        H      REFFLD(DS10)
     A            SCHO11    R        H      REFFLD(DS10)
     A            SCHO12    R        H      REFFLD(DS10)
     A            SCHO21    R        H      REFFLD(DS10)
     A            SCHO22    R        H      REFFLD(DS10)
     A            SCLIN#    R        H      REFFLD(A90)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A92)
     A            SCNTWK    R        H      REFFLD(A92)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOT1C    R        H      REFFLD(CODE3)
     A            SCOT2C    R        H      REFFLD(CODE3)
     A            SCOTH2    R        H      REFFLD(A92)
     A            SCOTHR    R        H      REFFLD(A92)
     A            SCPAID    R        H      REFFLD(A92)
     A            SCPODS    R        H      REFFLD(DS30)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRULE    R        H      REFFLD(A90)
     A            SCRVCD    R        H      REFFLD(RVCD)
     A            SCSEQ#    R        H      REFFLD(SEQ#)
     A            SCTDAT    R        H      REFFLD(DT8)
     A            SCTOTC    R        H      REFFLD(A92)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C5    SCEDIC7    MCR05-
     A                                      03C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     17RERRMSGID  5    C5    SCE-
     A                                      DIC7    MCR0999C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     18')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN1-
     A                                      7","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-10"},"items":[{"i-
     A                                      d":"SCR02_HREC","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HREC","designValu-
     A                                      e":"[HREC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCR02","field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      m Dialog","text align":"center","le-
     A                                      ft":"5px","top":"5px","height":"370-
     A                                      px","width":"324px","z index":"8","-
     A                                      locked in place":"true"},{"id":"con-
     A                                      stant46","field type":"output field-
     A                                      ","value":"****** ERROR ******","cs-
     A                                      s class":"constant","left":"85px","-
     A                                      cursor column":"10","top":"65px","c-
     A                                      ursor row":"1","css class 2":"profo-
     A                                      und-converted"},{"id":"constant47",-
     A                                      "field type":"output field","value"-
     A                                      :"You have marked the data submissi-
     A                                      on","css class":"constant","left":"-
     A                                      29px","cursor column":"2","top":"85-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt48","field type":"output field","-
     A                                      value":"flag.  The Date of Service -
     A                                      is a","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      105px","cursor row":"3","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant49","field type":"output field-
     A                                      ","value":"future date and disquali-
     A                                      fies this","css class":"constant","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"125px","cursor row":"4","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant50","field')
     A                                  1  2HTML(' type":"output field","value"-
     A                                      :"claim for data submission.  Pleas-
     A                                      e","css class":"constant","left":"2-
     A                                      9px","cursor column":"2","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt51","field type":"output field","-
     A                                      value":"correct the flag.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant52","fiel-
     A                                      d type":"output field","value":"Eli-
     A                                      gible for Data Submission:","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"205px","curso-
     A                                      r row":"8","css class 2":"profound--
     A                                      converted"},{"id":"SCEDI","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCEDI","designValue":"[SC-
     A                                      EDI]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"239px","cursor column":"32","top"-
     A                                      :"205px","cursor row":"8","width":"-
     A                                      8px","css class 3":"HI","set focus"-
     A                                      :{"fieldName":"17 or 18","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"17","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0999","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"18","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"css class 4":"profound-co-
     A                                      nverted"},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"330px","width":"80px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF12","field type":"butt-
     A                                      on","value":"Cancel","shortcut key"-
     A                                      :"F12","left":"104px","top":"330px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCEDI     R        H      REFFLD(FLAG)
     A          R SCR03
     A  08 10 11
     A  12 13 21
     A  22 23 25                            CA01(08 'Response Indicator *IN08')
     A  26 27 19
     A  20                                  CA02(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(12 'Response Indicator *IN12')
     A                                      SETOF(13 'Response Indicator *IN13')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC26   RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C6    SCCRDTC7    MC40-
     A                                      144C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     19 26RERRMSGID  5    C6   -
     A                                       SCCRDTC7    MCR0500C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     19 21RERR-
     A                                      MSGID  5    C6    SCCRDTC7    MCR05-
     A                                      56C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     19 10RERRMSGID  5    C6    -
     A                                      SCCRDTC7    MC40056C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     19 22RERRM-
     A                                      SGID  5    C6    SCCRDTC7    MC4014-
     A                                      5C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     19 23RERRMSGID  5    C6    S-
     A                                      CCRDTC7    MCR2397C6    FSMESGC5   -
     A                                       *LIBLC0    E1    6     19 25RERRMS-
     A                                      GID  5    C6    SCRRDTC7    MC40144-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      6     20 26RERRMSGID  5    C6    SC-
     A                                      RRDTC7    MCR0500C6    FSMESGC5    -
     A                                      *LIBLC0    E1    6     20 21RERRMSG-
     A                                      ID  5    C6    SCRRDTC7    MCR0556C-
     A                                      6    FSMESGC5    *LIBLC0    E1    6-
     A                                           20 10RERRMSGID  5    C6    SCR-
     A                                      RDTC7    MC40056C6    FSMESGC5    *-
     A                                      LIBLC0    E1    6     20 22RERRMSGI-
     A                                      D  5    C6    SCRRDTC7    MC40145C6-
     A                                          FSMESGC5    *LIBLC0    E1    6 -
     A                                          20 23RERRMSGID  5    C6    SCRR-
     A                                      DTC7    MCR2397C6    FSMESGC5    *L-
     A                                      IBLC0    E1    6     20 25RERRMSGID-
     A                                        5    C6    SCCSDTC7    MCR0500C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         19 21RERRMSGID  5    C6    SCCSD-
     A                                      TC7    MC40202C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     19 08RERRMSGID -
     A                                       5    C6    SCCSDTC7    MC40056C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        19 13RERRMSGID  5    C6    SCCSDT-
     A                                      C7    MC40145C6    FSMESGC5    *LIB-
     A                                      LC0    E1    6     19 12RERRMSGID  -
     A                                      5    C6    SCCSDTC7    MCR2397C6   -
     A                                       FSMESGC5    *LIBLC0    E1    6    -
     A                                       19 11RERRMSGID  5    C6    SCCSDTC-
     A                                      7    MCR0500C6    FSMESGC5    *LIBL-
     A                                      C0    E1    6     19 27RERRMSGID  5-
     A                                          C6    SCRSDTC7    MCR0500C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      20 21RERRMSGID  5    C6    SCRSDTC7-
     A                                          MC40202C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     20 08RERRMSGID  5 -
     A                                         C6    SCRSDTC7    MC40056C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     2-
     A                                      0 13RERRMSGID  5    C6    SCRSDTC7 -
     A                                         MC40145C6    FSMESGC5    *LIBLC0-
     A                                          E1    6     20 12RERRMSGID  5  -
     A                                        C6    SCRSDTC7    MCR2397C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     20-
     A                                       11RERRMSGID  5    C6    SCRSDTC7  -
     A                                        MCR0500C6    FSMESGC5    *LIBLC0 -
     A                                         E1    6     20 27')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN0-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN10",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 3":{"fieldName":"*IN11","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 4":{"fieldName":"*IN12","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 5":{"fieldName":"*IN13","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 6-
     A                                      ":{"fieldName":"*IN21","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 7":{-
     A                                      "fieldName":"*IN22","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 8":{"fi-
     A                                      eldName":"*IN23","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 9":{"field-
     A                                      Name":"*IN25","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 10":{"fieldNa-
     A                                      me":"*IN26","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 11":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-10"},"i-
     A                                      tems":[{"id":"SCR03_HREC","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"HREC","-
     A                                      designValue":"[HREC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCR03_HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR03"-
     A                                      ,"field type":"panel","panel style"-
     A                                      :"Transform Dialog","text align":"c-
     A                                      enter","left":"5px","top":"5px","he-
     A                                      ight":"370px","width"')
     A                                  1  2HTML(':"370px","z index":"9"},{"id"-
     A                                      :"constant53","field type":"output -
     A                                      field","value":"****** ERROR ******-
     A                                      ","css class":"constant","left":"85-
     A                                      px","cursor column":"10","top":"65p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t58","field type":"output field","v-
     A                                      alue":"Date Recon rcvd/sent must be-
     A                                       greater","css class":"constant","v-
     A                                      isibility":{"fieldName":"20","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"29px","cursor column":-
     A                                      "2","top":"85px","cursor row":"2","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant54","field type":"ou-
     A                                      tput field","value":"Date Bill rcvd-
     A                                      /sent must be greater","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"19","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"29px","cu-
     A                                      rsor column":"2","top":"85px","curs-
     A                                      or row":"2","css class 2":"profound-
     A                                      -converted"},{"id":"constant59","fi-
     A                                      eld type":"output field","value":"t-
     A                                      han or equal to \"To date of Servic-
     A                                      e\".","css class":"constant","visib-
     A                                      ility":{"fieldName":"20","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"105px","cursor row":"3","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant55","field type":"outpu-
     A                                      t field","value":"than or equal to -
     A                                      \"To date of Service\".","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"19","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"29px","-
     A                                      cursor column":"2","top":"105px","c-
     A                                      ursor row":"3","css class 2":"profo-
     A                                      und-converted"},{"id":"constant60",-
     A                                      "field type":"output field","value"-
     A                                      :"Date recon rcvd by carrier: ","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"20","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      29px","cursor column":"2","top":"14-
     A                                      5px","cursor row":"5","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant56","field type":"output field",-
     A                                      "value":"Date bill rcvd by carrier:-
     A                                       ","css class":"constant","visibili-
     A                                      ty":{"fieldName":"19","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"29px","cursor column":"2","to-
     A                                      p":"145px","cursor row":"5","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCCRDT","field type":"date field",-
     A                                      "css class":"input","css class 2":"-
     A                                      date-field","value":{"fieldName":"S-
     A                                      CCRDT","designValue":"[SCCRDT]","re-
     A                                      fField":"DT8","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"-999.00","e')
     A                                  1  2HTML('dtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"visibility":{"fie-
     A                                      ldName":"19","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"225-
     A                                      px","cursor column":"30","top":"145-
     A                                      px","cursor row":"5","width":"71px"-
     A                                      ,"css class 3":{"fieldName":"19","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"error message id":"MC40144",-
     A                                      "error message file":"FSMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"19 and 26",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"6 messages","erro-
     A                                      r message id 2":"MCR0500","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"19 and 21","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 3":"MCR0556","error -
     A                                      message file 3":"FSMESG","error mes-
     A                                      sage library 3":"*LIBL","error cond-
     A                                      ition 3":{"fieldName":"19 and 10","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 4":"MC40056","erro-
     A                                      r message file 4":"FSMESG","error m-
     A                                      essage library 4":"*LIBL","error co-
     A                                      ndition 4":{"fieldName":"19 and 22"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 5":"MC40145","er-
     A                                      ror message file 5":"FSMESG","error-
     A                                       message library 5":"*LIBL","error -
     A                                      condition 5":{"fieldName":"19 and 2-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 6":"MCR2397","-
     A                                      error message file 6":"FSMESG","err-
     A                                      or message library 6":"*LIBL","erro-
     A                                      r condition 6":{"fieldName":"19 and-
     A                                       25","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"css class 4":"profound-conver-
     A                                      ted"},{"id":"SCRRDT","field type":"-
     A                                      date field","css class":"input","cs-
     A                                      s class 2":"date-field","value":{"f-
     A                                      ieldName":"SCRRDT","designValue":"[-
     A                                      SCRRDT]","refField":"DT8","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","edt-
     A                                      Wrd":"''  /  /    ''","dateFormat":-
     A                                      "m/d/Y"},"visibility":{"fieldName":-
     A                                      "20","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"254px","cur-
     A                                      sor column":"31","top":"145px","cur-
     A                                      sor row":"5","width":"71px","css cl-
     A                                      ass 3":{"fieldName":"20","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"e-
     A                                      rror message id":"MC40144","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","e')
     A                                  1  2HTML('rror condition":{"fieldName":-
     A                                      "20 and 26","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"6 mes-
     A                                      sages","error message id 2":"MCR050-
     A                                      0","error message file 2":"FSMESG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"20-
     A                                       and 21","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 3":"MCR0-
     A                                      556","error message file 3":"FSMESG-
     A                                      ","error message library 3":"*LIBL"-
     A                                      ,"error condition 3":{"fieldName":"-
     A                                      20 and 10","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 4":"MC-
     A                                      40056","error message file 4":"FSME-
     A                                      SG","error message library 4":"*LIB-
     A                                      L","error condition 4":{"fieldName"-
     A                                      :"20 and 22","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 5":"-
     A                                      MC40145","error message file 5":"FS-
     A                                      MESG","error message library 5":"*L-
     A                                      IBL","error condition 5":{"fieldNam-
     A                                      e":"20 and 23","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 6"-
     A                                      :"MCR2397","error message file 6":"-
     A                                      FSMESG","error message library 6":"-
     A                                      *LIBL","error condition 6":{"fieldN-
     A                                      ame":"20 and 25","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"css class 4":"pro-
     A                                      found-converted"},{"id":"constant57-
     A                                      ","field type":"output field","valu-
     A                                      e":"Date bill sent to carrier: ","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"19","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "29px","cursor column":"2","top":"1-
     A                                      85px","cursor row":"7","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant61","field type":"output field"-
     A                                      ,"value":"Date recon sent to carrie-
     A                                      r:","css class":"constant","visibil-
     A                                      ity":{"fieldName":"20","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"185px","cursor row":"7","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCCSDT","field type":"date field"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "date-field","value":{"fieldName":"-
     A                                      SCCSDT","designValue":"[SCCSDT]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","edtWrd":"''  /-
     A                                        /    ''","dateFormat":"m/d/Y"},"v-
     A                                      isibility":{"fieldName":"19","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"225px","cursor column"-
     A                                      :"30","top":"185px","cursor row":"7-
     A                                      ","width":"71px","css class 3":{"fi-
     A                                      eldName":"19","dataType":"expressio-
     A                                      n","formatting":"Indi')
     A                                  1  2HTML('cator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"error message id":"MCR0500"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"19 and 21"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"6 messages","err-
     A                                      or message id 2":"MC40202","error m-
     A                                      essage file 2":"FSMESG","error mess-
     A                                      age library 2":"*LIBL","error condi-
     A                                      tion 2":{"fieldName":"19 and 08","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror message id 3":"MC40056","error-
     A                                       message file 3":"FSMESG","error me-
     A                                      ssage library 3":"*LIBL","error con-
     A                                      dition 3":{"fieldName":"19 and 13",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 4":"MC40145","err-
     A                                      or message file 4":"FSMESG","error -
     A                                      message library 4":"*LIBL","error c-
     A                                      ondition 4":{"fieldName":"19 and 12-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 5":"MCR2397","e-
     A                                      rror message file 5":"FSMESG","erro-
     A                                      r message library 5":"*LIBL","error-
     A                                       condition 5":{"fieldName":"19 and -
     A                                      11","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 6":"MCR0500",-
     A                                      "error message file 6":"FSMESG","er-
     A                                      ror message library 6":"*LIBL","err-
     A                                      or condition 6":{"fieldName":"19 an-
     A                                      d 27","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"css class 4":"profound-conve-
     A                                      rted"},{"id":"SCRSDT","field type":-
     A                                      "date field","css class":"input","c-
     A                                      ss class 2":"date-field","value":{"-
     A                                      fieldName":"SCRSDT","designValue":"-
     A                                      [SCRSDT]","refField":"DT8","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''","dateFormat"-
     A                                      :"m/d/Y"},"visibility":{"fieldName"-
     A                                      :"20","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"254px","cu-
     A                                      rsor column":"31","top":"185px","cu-
     A                                      rsor row":"7","width":"71px","css c-
     A                                      lass 3":{"fieldName":"20","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      error message id":"MCR0500","error -
     A                                      message file":"FSMESG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"20 and 21","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"6 messages","error messa-
     A                                      ge id 2":"MC40202","error message f-
     A                                      ile 2":"FSMESG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"20 and 08","dataType"-
     A                                      :"expression","format')
     A                                  1  2HTML('ting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MC4-
     A                                      0056","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "20 and 13","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error message id 4":"M-
     A                                      C40145","error message file 4":"FSM-
     A                                      ESG","error message library 4":"*LI-
     A                                      BL","error condition 4":{"fieldName-
     A                                      ":"20 and 12","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error message id 5":-
     A                                      "MCR2397","error message file 5":"F-
     A                                      SMESG","error message library 5":"*-
     A                                      LIBL","error condition 5":{"fieldNa-
     A                                      me":"20 and 11","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 6-
     A                                      ":"MCR0500","error message file 6":-
     A                                      "FSMESG","error message library 6":-
     A                                      "*LIBL","error condition 6":{"field-
     A                                      Name":"20 and 27","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"css class 4":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"330px","width":"80px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF12","field ty-
     A                                      pe":"button","value":"Cancel","shor-
     A                                      tcut key":"F12","left":"104px","top-
     A                                      ":"330px","width":"80px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCCRDT    R        H      REFFLD(DT8)
     A            SCCSDT    R        H      REFFLD(DT8)
     A            SCRRDT    R        H      REFFLD(DT8)
     A            SCRSDT    R        H      REFFLD(DT8)
     A          R WDW01
     A  44 46 71
     A  72 73 76
     A  77 79 45                            CA01(44 'Response Indicator *IN44')
     A  57 61 62
     A  63 64 65
     A  67 41 97                            CA02(46 'Response Indicator *IN46')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                  1  2HTML('QPUIREC27   ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    17 RERRMSGID  5    C5   -
     A                                       SCPCFC7    MCR1758C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     71RERRMSGI-
     A                                      D  5    C5    SCPCFC7    MCR0759C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         73RERRMSGID  5    C5    SCAPCC7 -
     A                                         MCR1758C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     71RERRMSGID  5    C-
     A                                      5    SCAPCC7    MCR0759C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     62RERR-
     A                                      MSGID  5    C5    SCRVUC7    MCR175-
     A                                      8C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     71RERRMSGID  5    C5    SCRV-
     A                                      UC7    MCR0759C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     72RERRMSGID  5 -
     A                                         C5    SCRCFC7    MCR1758C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     44-
     A                                      RERRMSGID  5    C5    SCRCFC7    MC-
     A                                      R0759C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     46RERRMSGID  5    C5    -
     A                                      SCSCFC7    MCR1758C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     71RERRMSGID-
     A                                        5    C5    SCSCFC7    MCR0759C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        72RERRMSGID  5    C5    SCLABC7  -
     A                                        MCR1758C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     71RERRMSGID  5    C5-
     A                                          SCLABC7    MCR0759C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     72RERRM-
     A                                      SGID  5    C5    SCIMPC7    MCR1758-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     71RERRMSGID  5    C5    SCIMP-
     A                                      C7    MCR0759C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     61RERRMSGID  5  -
     A                                        C5    SCDRIC7    MCR1758C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     71R-
     A                                      ERRMSGID  5    C5    SCDRIC7    MCR-
     A                                      0759C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     45RERRMSGID  5    C5    S-
     A                                      CPPSC7    MCR1758C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     71RERRMSGID -
     A                                       5    C5    SCPPSC7    MCR0759C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       63RERRMSGID  5    C5    SCDRGC7   -
     A                                       MCR1758C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     71RERRMSGID  5    C5 -
     A                                         SCDRGC7    MCR0759C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     64RERRMS-
     A                                      GID  5    C5    SCPPIC7    MCR1758C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           71RERRMSGID  5    C5    SCPPIC-
     A                                      7    MCR0759C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     65RERRMSGID  5   -
     A                                       C5    SCSNFC7    MCR1758C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     71RE-
     A                                      RRMSGID  5    C5    SCSNFC7    MCR0-
     A                                      759C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     77')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"2","window left":"3","overlay":"-
     A                                      true","set off":{"fieldName":"*IN71-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 2":{"fieldName":"*IN72","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 3":{"fieldName":"*IN73","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 4":{"fieldName":"*IN44","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       5":{"fieldName":"*IN46","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 6"-
     A                                      :{"fieldName":"*IN76","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 7":{"-
     A                                      fieldName":"*IN77","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 8":{"fie-
     A                                      ldName":"*IN79","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"overlay range":"1-1-
     A                                      7"},"items":[{"id":"WDW01","field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rm Dialog","text align":"center","l-
     A                                      eft":"5px","top":"5px","height":"53-
     A                                      0px","width":"534px","z index":"8",-
     A                                      "locked in place":"true"},{"id":"SC-
     A                                      PGM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPGM","designV-
     A                                      alue":"[SCPGM]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "29px","cursor column":"2","top":"6-
     A                                      5px","cursor row":"1","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant62","field type":"output field",-
     A                                      "value":"Service Code selection","c-
     A                                      ss class":"constant","left":"183px"-
     A                                      ,"cursor column":"24","top":"65px",-
     A                                      "cursor row":"1","css class 2":"HI"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant63","field type":"-
     A                                      output field","value":"WDW01","css -
     A                                      class":"constant","left":"463px","c-
     A                                      ursor column":"64","top":"65px","cu-
     A                                      rsor row":"1","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant64","-
     A                                      field type":"output field","value":-
     A                                      "Type option, press Enter.","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"105px","curso-
     A                                      r row":"3","css class 2":"BLU","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant65","field type":"outpu-
     A                                      t field","value":"1=Select","css cl-
     A                                      ass":"constant","left":"43px","curs-
     A                                      or column":"4","top":"125px","curso-
     A                                      r row":"4","css class 2":"BLU","css-
     A                                       class 3":"profound-c')
     A                                  1  2HTML('onverted"},{"id":"constant66"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Procedure code file  :","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPCF","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCPCF","designValue":"[SCP-
     A                                      CF]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","left":"190px-
     A                                      ","cursor column":"25","top":"165px-
     A                                      ","cursor row":"6","width":"8px","e-
     A                                      rror message id":"MCR1758","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"71","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0759","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"73","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"css class 3":"profound-c-
     A                                      onverted"},{"id":"constant68","fiel-
     A                                      d type":"output field","value":"Med-
     A                                      icare APC file    :","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "67 and 41","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"29px-
     A                                      ","cursor column":"2","top":"185px"-
     A                                      ,"cursor row":"7","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCAPC","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCAPC","designValu-
     A                                      e":"[SCAPC]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"visibility":{"fieldName":"67 and -
     A                                      41","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"190px","curs-
     A                                      or column":"25","top":"185px","curs-
     A                                      or row":"7","width":"8px","error me-
     A                                      ssage id":"MCR1758","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"71","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"2 me-
     A                                      ssages","error message id 2":"MCR07-
     A                                      59","error message file 2":"FSMESG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{"fieldName":"6-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"css class 3":"profound-converte-
     A                                      d"},{"id":"constant70","field type"-
     A                                      :"output field","value":"Medicare R-
     A                                      VU table   :","css class":"constant-
     A                                      ","visibility":{"fieldName":"57","d-
     A                                      ataType":"expression"')
     A                                  1  2HTML(',"formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      205px","cursor row":"8","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant69","field type":"output field-
     A                                      ","value":"R & C file           :",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"67","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "205px","cursor row":"8","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      RVU","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCRVU","des-
     A                                      ignValue":"[SCRVU]","refField":"FLA-
     A                                      G","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","visibility":{"fieldName":"-
     A                                      57","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"190px","curs-
     A                                      or column":"25","top":"205px","curs-
     A                                      or row":"8","width":"8px","error me-
     A                                      ssage id":"MCR1758","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"71","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"2 me-
     A                                      ssages","error message id 2":"MCR07-
     A                                      59","error message file 2":"FSMESG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{"fieldName":"7-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"css class 3":"profound-converte-
     A                                      d"},{"id":"SCRCF","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCRCF","designValue":"[SCRCF]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","visibility":{-
     A                                      "fieldName":"67","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "190px","cursor column":"25","top":-
     A                                      "205px","cursor row":"8","width":"8-
     A                                      px","error message id":"MCR1758","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"44","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"MCR0759","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"css class 3":"prof-
     A                                      ound-converted"},{"id":"constant71"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Service code file    :","css cla-
     A                                      ss":"constant","visib')
     A                                  1  2HTML('ility":{"fieldName":"N57","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"29px","cursor colum-
     A                                      n":"2","top":"225px","cursor row":"-
     A                                      9","css class 2":"profound-converte-
     A                                      d"},{"id":"SCSCF","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCSCF","designValue":"[SCSCF]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","visibility":{-
     A                                      "fieldName":"N57","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"190px","cursor column":"25","top"-
     A                                      :"225px","cursor row":"9","width":"-
     A                                      8px","error message id":"MCR1758","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"71","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"2 messages","error messag-
     A                                      e id 2":"MCR0759","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"72","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"css class 3":"pro-
     A                                      found-converted"},{"id":"constant73-
     A                                      ","field type":"output field","valu-
     A                                      e":"Medicare Lab FS      :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"57","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"29px-
     A                                      ","cursor column":"2","top":"245px"-
     A                                      ,"cursor row":"10","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      72","field type":"output field","va-
     A                                      lue":"OPPS Prov Spec file  :","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"67","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"29-
     A                                      px","cursor column":"2","top":"245p-
     A                                      x","cursor row":"10","css class 2":-
     A                                      "profound-converted"},{"id":"SCLAB"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCLAB","designV-
     A                                      alue":"[SCLAB]","refField":"FLAG","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase"},"text transform":"upperca-
     A                                      se","visibility":{"fieldName":"57",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"190px","cursor c-
     A                                      olumn":"25","top":"245px","cursor r-
     A                                      ow":"10","width":"8px","error messa-
     A                                      ge id":"MCR1758","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"71","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error mess')
     A                                  1  2HTML('ages":"2 messages","error mes-
     A                                      sage id 2":"MCR0759","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"72","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"css class 3":"-
     A                                      profound-converted"},{"id":"SCIMP",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCIMP","designVa-
     A                                      lue":"[SCIMP]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","visibility":{"fieldName":"67","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"190px","cursor co-
     A                                      lumn":"25","top":"245px","cursor ro-
     A                                      w":"10","width":"8px","error messag-
     A                                      e id":"MCR1758","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"71","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0759",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"61","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant67","field type":"ou-
     A                                      tput field","value":"DRG Informatio-
     A                                      n   :","css class":"constant","visi-
     A                                      bility":{"fieldName":"97","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"29px","cursor column":"2"-
     A                                      ,"top":"265px","cursor row":"11","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCDRI","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCD-
     A                                      RI","designValue":"[SCDRI]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"1"},"text transform":"u-
     A                                      ppercase","visibility":{"fieldName"-
     A                                      :"97","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"190px","cu-
     A                                      rsor column":"25","top":"265px","cu-
     A                                      rsor row":"11","width":"8px","error-
     A                                       message id":"MCR1758","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"71","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"MC-
     A                                      R0759","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"45","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"css class 3":"profound-conve-
     A                                      rted"},{"id":"constan')
     A                                  1  2HTML('t74","field type":"output fie-
     A                                      ld","value":"IPPS Prov. Spec. File:-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"67","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"285px","cursor row":"12","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCPPS","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCPPS","-
     A                                      designValue":"[SCPPS]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"1"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"67"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"190px","cursor -
     A                                      column":"25","top":"285px","cursor -
     A                                      row":"12","width":"8px","error mess-
     A                                      age id":"MCR1758","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"71","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"MCR0759-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"63"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant75","field type":"-
     A                                      output field","value":"IPPS MS-DRG'-
     A                                      's        :","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"67","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"29px","cursor colum-
     A                                      n":"2","top":"305px","cursor row":"-
     A                                      13","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCDRG","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCDRG","designValue":"[SCDRG]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"1"},"text transfo-
     A                                      rm":"uppercase","visibility":{"fiel-
     A                                      dName":"67","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"190p-
     A                                      x","cursor column":"25","top":"305p-
     A                                      x","cursor row":"13","width":"8px",-
     A                                      "error message id":"MCR1758","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"71","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0759","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"64","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"css clas')
     A                                  1  2HTML('s 3":"profound-converted"},{"-
     A                                      id":"constant76","field type":"outp-
     A                                      ut field","value":"IPPS Payment inf-
     A                                      o    :","css class":"constant","vis-
     A                                      ibility":{"fieldName":"67","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"29px","cursor column":"2-
     A                                      ","top":"325px","cursor row":"14","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCPPI","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      PPI","designValue":"[SCPPI]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"1"},"text transform":"-
     A                                      uppercase","visibility":{"fieldName-
     A                                      ":"67","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"190px","c-
     A                                      ursor column":"25","top":"325px","c-
     A                                      ursor row":"14","width":"8px","erro-
     A                                      r message id":"MCR1758","error mess-
     A                                      age file":"FSMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"71","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      2 messages","error message id 2":"M-
     A                                      CR0759","error message file 2":"FSM-
     A                                      ESG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"65","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"css class 3":"profound-conv-
     A                                      erted"},{"id":"constant77","field t-
     A                                      ype":"output field","value":"SNF Pa-
     A                                      yment info     :","css class":"cons-
     A                                      tant","visibility":{"fieldName":"79-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"29px","cursor -
     A                                      column":"2","top":"345px","cursor r-
     A                                      ow":"15","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSNF","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCSNF","designValue":"[SCSN-
     A                                      F]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"1"},"text tr-
     A                                      ansform":"uppercase","visibility":{-
     A                                      "fieldName":"79","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "190px","cursor column":"25","top":-
     A                                      "345px","cursor row":"15","width":"-
     A                                      8px","error message id":"MCR1758","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"71","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"2 messages","error messag-
     A                                      e id 2":"MCR0759","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"77","dataType":"expres-
     A                                      sion","formatting":"I')
     A                                  1  2HTML('ndicator","indFormat":"1 / 0"-
     A                                      },"css class 3":"profound-converted-
     A                                      "},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"49-
     A                                      0px","width":"80px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF12","field type":"button","va-
     A                                      lue":"Cancel  ","shortcut key":"F12-
     A                                      ","left":"104px","top":"490px","wid-
     A                                      th":"80px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"}]}')
     A            SCDRG          1A  H
     A            SCDRI          1A  H
     A            SCPCF          1A  H
     A            SCPGM         10A  H
     A            SCPPI          1A  H
     A            SCPPS          1A  H
     A            SCSNF          1A  H
     A            SCAPC     R        H      REFFLD(FLAG)
     A            SCIMP     R        H      REFFLD(FLAG)
     A            SCLAB     R        H      REFFLD(FLAG)
     A            SCRCF     R        H      REFFLD(FLAG)
     A            SCRVU     R        H      REFFLD(FLAG)
     A            SCSCF     R        H      REFFLD(FLAG)
     A          R WDW02
     A  52 53 54
     A  51 96 71                            CA01(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                  1  2HTML('QPUIREC19   ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    16 RERRMSGID  5    C5   -
     A                                       SCIRFC7    MCR1758C6    FSMESGC5  -
     A                                        *LIBLC0    E1    12    71 52N53N5-
     A                                      4RERRMSGID  5    C5    SCIRFC7    M-
     A                                      CR0759C6    FSMESGC5    *LIBLC0    -
     A                                      E1    12    71N52N53 54RERRMSGID  5-
     A                                          C6    SCIPRVC7    MCR1758C6    -
     A                                      FSMESGC5    *LIBLC0    E1    12    -
     A                                      71 52N53N54RERRMSGID  5    C6    SC-
     A                                      IPRVC7    MCR0759C6    FSMESGC5    -
     A                                      *LIBLC0    E1    12    71 52 53N54R-
     A                                      ERRMSGID  5    C6    SCASCFC7    MC-
     A                                      R1758C6    FSMESGC5    *LIBLC0    E-
     A                                      1    9     52N53N54RERRMSGID  5    -
     A                                      C6    SCASCFC7    MCR0759C6    FSME-
     A                                      SGC5    *LIBLC0    E1    9    N52N5-
     A                                      3 54RERRMSGID  5    C6    SCAPCFC7 -
     A                                         MCR1758C6    FSMESGC5    *LIBLC0-
     A                                          E1    9     52N53N54RERRMSGID  -
     A                                      5    C6    SCAPCFC7    MCR0759C6   -
     A                                       FSMESGC5    *LIBLC0    E1    9    -
     A                                      N52N53 54RERRMSGID  5    C6    SCOP-
     A                                      PFC7    MCR1758C6    FSMESGC5    *L-
     A                                      IBLC0    E1    9     52N53N54RERRMS-
     A                                      GID  5    C6    SCOPPFC7    MCR0759-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      9     52 53N54RERRMSGID  5    C6   -
     A                                       SCASPFC7    MCR1758C6    FSMESGC5 -
     A                                         *LIBLC0    E1    9     52N53N54R-
     A                                      ERRMSGID  5    C6    SCASPFC7    MC-
     A                                      R0759C6    FSMESGC5    *LIBLC0    E-
     A                                      1    9     52 53N54RERRMSGID  5    -
     A                                      C6    SCPFPFC7    MCR1758C6    FSME-
     A                                      SGC5    *LIBLC0    E1    9    N52 5-
     A                                      3N54RERRMSGID  5    C6    SCPFPFC7 -
     A                                         MCR0759C6    FSMESGC5    *LIBLC0-
     A                                          E1    9    N52 53 54RERRMSGID  -
     A                                      5    C6    SCIPYFC7    MCR1758C6   -
     A                                       FSMESGC5    *LIBLC0    E1    9    -
     A                                      N52 53N54RERRMSGID  5    C6    SCIP-
     A                                      YFC7    MCR0759C6    FSMESGC5    *L-
     A                                      IBLC0    E1    9     52N53 54')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"2","window left":"3","overlay":"-
     A                                      true","set off":{"fieldName":"*IN52-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 2":{"fieldName":"*IN53","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 3":{"fieldName":"*IN54","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"over-
     A                                      lay range":"1-16"},"items":[{"id":"-
     A                                      WDW02","field type":"panel","panel -
     A                                      style":"Transform Dialog","text ali-
     A                                      gn":"center","left":"5px","top":"5p-
     A                                      x","height":"530px","width":"534px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue"},{"id":"WDW02_SCPGM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPGM","designValue":"[SCPGM]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"10"},"css class":"-
     A                                      output-field","left":"29px","cursor-
     A                                       column":"2","top":"65px","cursor r-
     A                                      ow":"1","css class 2":"profound-con-
     A                                      verted"},{"id":"constant78","field -
     A                                      type":"output field","value":"Servi-
     A                                      ce Code selection","css class":"con-
     A                                      stant","left":"183px","cursor colum-
     A                                      n":"24","top":"65px","cursor row":"-
     A                                      1","css class 2":"HI","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant79","field type":"output field",-
     A                                      "value":"WDW02","css class":"consta-
     A                                      nt","left":"463px","cursor column":-
     A                                      "64","top":"65px","cursor row":"1",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant80","field type":"o-
     A                                      utput field","value":"Type option, -
     A                                      press Enter.","css class":"constant-
     A                                      ","left":"29px","cursor column":"2"-
     A                                      ,"top":"105px","cursor row":"3","cs-
     A                                      s class 2":"BLU","css class 3":"pro-
     A                                      found-converted"},{"id":"constant81-
     A                                      ","field type":"output field","valu-
     A                                      e":"1=Select","css class":"constant-
     A                                      ","left":"43px","cursor column":"4"-
     A                                      ,"top":"125px","cursor row":"4","cs-
     A                                      s class 2":"BLU","css class 3":"pro-
     A                                      found-converted"},{"id":"constant90-
     A                                      ","field type":"output field","valu-
     A                                      e":"Inpatient Rehab Facility Info :-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"71","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"165px","cursor row":"6","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant82","field type":"output fi-
     A                                      eld","value":"Outpatient","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"51 and N96","dataType":"expre-
     A                                      ssion","formatting":"')
     A                                  1  2HTML('Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"29px","cursor-
     A                                       column":"2","top":"165px","cursor -
     A                                      row":"6","css class 2":"UL","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCIRF","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCIRF","-
     A                                      designValue":"[SCIRF]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","visibility":{"fieldName-
     A                                      ":"71","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"253px","c-
     A                                      ursor column":"34","top":"165px","c-
     A                                      ursor row":"6","width":"8px","error-
     A                                       message id":"MCR1758","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"71 and 52 and N53 and N-
     A                                      54","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"MCR0759","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"71 and N52-
     A                                       and N53 and 54","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"css class 3":"pro-
     A                                      found-converted"},{"id":"constant91-
     A                                      ","field type":"output field","valu-
     A                                      e":"Provider Specific File        :-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"71","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"185px","cursor row":"7","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCIPRV","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCIPRV",-
     A                                      "designValue":"[SCIPRV]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","visibility":{"fieldNa-
     A                                      me":"71","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"253px",-
     A                                      "cursor column":"34","top":"185px",-
     A                                      "cursor row":"7","width":"8px","err-
     A                                      or message id":"MCR1758","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"71 and 52 and N53 and-
     A                                       N54","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"MCR0759","er-
     A                                      ror message file 2":"FSMESG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"71 and 5-
     A                                      2 and 53 and N54","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"css class 3":"pr-
     A                                      ofound-converted"},{"')
     A                                  1  2HTML('id":"constant83","field type"-
     A                                      :"output field","value":"APC file  -
     A                                                 :","css class":"constant-
     A                                      ","visibility":{"fieldName":"51 and-
     A                                       N96","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"29px","cur-
     A                                      sor column":"2","top":"205px","curs-
     A                                      or row":"8","css class 2":"profound-
     A                                      -converted"},{"id":"constant88","fi-
     A                                      eld type":"output field","value":"A-
     A                                      SC file             :","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"96","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"29px","cu-
     A                                      rsor column":"2","top":"205px","cur-
     A                                      sor row":"8","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCASCF","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCASCF","designValue":-
     A                                      "[SCASCF]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      visibility":{"fieldName":"96","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"190px","cursor column-
     A                                      ":"25","top":"205px","cursor row":"-
     A                                      8","width":"8px","error message id"-
     A                                      :"MCR1758","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      52 and N53 and N54","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0759","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"N52 and N53 and 54","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CAPCF","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCAPCF","-
     A                                      designValue":"[SCAPCF]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","visibility":{"fieldNam-
     A                                      e":"51 and N96","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      190px","cursor column":"25","top":"-
     A                                      205px","cursor row":"8","width":"8p-
     A                                      x","error message id":"MCR1758","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"52 and N53 and-
     A                                       N54","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"MCR0759","er-
     A                                      ror message file 2":"FSMESG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldN')
     A                                  1  2HTML('ame":"N52 and N53 and 54","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant89","field type":"outp-
     A                                      ut field","value":"ASC Payment Info-
     A                                           :","css class":"constant","vis-
     A                                      ibility":{"fieldName":"96","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"29px","cursor column":"2-
     A                                      ","top":"225px","cursor row":"9","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant84","field type":"out-
     A                                      put field","value":"OPPS Prov Spec -
     A                                      file  :","css class":"constant","vi-
     A                                      sibility":{"fieldName":"51 and N96"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"29px","cursor c-
     A                                      olumn":"2","top":"225px","cursor ro-
     A                                      w":"9","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCOPPF","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCOPPF","designValue":"[SCOP-
     A                                      PF]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","visibi-
     A                                      lity":{"fieldName":"51 and N96","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"190px","cursor colu-
     A                                      mn":"25","top":"225px","cursor row"-
     A                                      :"9","width":"8px","error message i-
     A                                      d":"MCR1758","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"52 and N53 and N54","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0759","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"52 and 53 and N54","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCASPF","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCASPF",-
     A                                      "designValue":"[SCASPF]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","visibility":{"fieldNa-
     A                                      me":"96","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"190px",-
     A                                      "cursor column":"25","top":"225px",-
     A                                      "cursor row":"9","width":"8px","err-
     A                                      or message id":"MCR1758","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"52 and N53 and N54","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 me')
     A                                  1  2HTML('ssages","error message id 2":-
     A                                      "MCR0759","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"52 and 53 and N54","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant85","field type":"output field-
     A                                      ","value":"Inpatient","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"N51 and N96 and N71","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"245px","cursor row":"10","css -
     A                                      class 2":"UL","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant86","-
     A                                      field type":"output field","value":-
     A                                      "IPPS Prov Spec file  :","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N51 and N96 and N71","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"29px","cursor column":"2"-
     A                                      ,"top":"285px","cursor row":"12","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPFPF","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      PFPF","designValue":"[SCPFPF]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","visibility":{"f-
     A                                      ieldName":"N51 and N96 and N71","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"190px","cursor colu-
     A                                      mn":"25","top":"285px","cursor row"-
     A                                      :"12","width":"8px","error message -
     A                                      id":"MCR1758","error message file":-
     A                                      "FSMESG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"N52 and 53 and N54","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"2 messages","error message id-
     A                                       2":"MCR0759","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"N52 and 53 and 54","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant87","field type":"output f-
     A                                      ield","value":"IPPS Payment info   -
     A                                       :","css class":"constant","visibil-
     A                                      ity":{"fieldName":"N51 and N96 and -
     A                                      N71","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"29px","curs-
     A                                      or column":"2","top":"305px","curso-
     A                                      r row":"13","css class 2":"profound-
     A                                      -converted"},{"id":"SCIPYF","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCIPYF","designValue":"-
     A                                      [SCIPYF]","refField":"FLAG","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false')
     A                                  1  2HTML('","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","visibility":{"fi-
     A                                      eldName":"N51 and N96 and N71","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"190px","cursor colum-
     A                                      n":"25","top":"305px","cursor row":-
     A                                      "13","width":"8px","error message i-
     A                                      d":"MCR1758","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"N52 and 53 and N54","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0759","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"52 and N53 and 54","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"490px","widt-
     A                                      h":"80px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF12",-
     A                                      "field type":"button","value":"Canc-
     A                                      el  ","shortcut key":"F12","left":"-
     A                                      104px","top":"490px","width":"80px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"}]}')
     A            SCPGM         10A  H
     A            SCAPCF    R        H      REFFLD(FLAG)
     A            SCASCF    R        H      REFFLD(FLAG)
     A            SCASPF    R        H      REFFLD(FLAG)
     A            SCIPRV    R        H      REFFLD(FLAG)
     A            SCIPYF    R        H      REFFLD(FLAG)
     A            SCIRF     R        H      REFFLD(FLAG)
     A            SCOPPF    R        H      REFFLD(FLAG)
     A            SCPFPF    R        H      REFFLD(FLAG)
