     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  05 06 07
     A  15 25 30
     A  57 88 91                            CA01(05 'Response Indicator *IN05')
     A  95 09 43
     A  14 31 32
     A  33 34 35                            CA02(06 'Response Indicator *IN06')
     A  36 37 38
     A  39 40 44
     A  46 47 48                            CA03(07 'Response Indicator *IN07')
     A  49 50 52
     A  55 56 58
     A  59 65 68                            CA04(15 'Response Indicator *IN15')
     A  69 70 71
     A  72 73 74
     A  75 76 77                            CA05(25 'Response Indicator *IN25')
     A  78 79 80
     A  81 82 83
     A  84 85 86                            CA06(30 'Response Indicator *IN30')
     A  87 89                               CA07(57 'Response Indicator *IN57')
     A                                      SETOF(88 'Response Indicator *IN88')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                      SETOF(95 'Response Indicator *IN95')
     A                                  1  2HTML('QPUIREC44   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCCSCDC7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      CSCDC7    MCR2383C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     72RERRMSGID -
     A                                       5    C6    SCCSCDC7    MC40167C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        65RERRMSGID  5    C5    SCPOSC7  -
     A                                        MCR0503C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     76RERRMSGID  5    C5-
     A                                          SCPOSC7    MCR2383C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     77RERRM-
     A                                      SGID  5    C5    SCPOSC7    MCR2387-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     25RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR0556C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     73RERRMSGID  5 -
     A                                         C6    SCFDATC7    MCR0500C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     7-
     A                                      4RERRMSGID  5    C6    SCFDATC7    -
     A                                      MC40056C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     75RERRMSGID  5    C6  -
     A                                        SCFDATC7    MCR0466C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     85RERRMS-
     A                                      GID  5    C6    SCFDATC7    MCR2397-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     30RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR0676C6    FSMESGC5    *LI-
     A                                      BLC0    E1    12   N37 38 39 40RERR-
     A                                      MSGID  5    C6    SCTDATC7    MCR05-
     A                                      00C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     07RERRMSGID  5    C6    SCT-
     A                                      DATC7    MC40307C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     88RERRMSGID  -
     A                                      5    C6    SCTDATC7    MCR2397C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       95RERRMSGID  5    C6    SCRVCDC7  -
     A                                        MCR2387C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     87RERRMSGID  5    C6-
     A                                          SCRVCDC7    MC40310C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     57RERR-
     A                                      MSGID  5    C6    SCRVCDC7    MC403-
     A                                      27C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     86RERRMSGID  5    C6    SCH-
     A                                      CPCC7    MC40309C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     78RERRMSGID  -
     A                                      5    C6    SCHCPCC7    MCR2387C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       89RERRMSGID  5    C6    SCHCPCC7  -
     A                                        MC40312C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     79RERRMSGID  5    C6-
     A                                          SCHCPCC7    MC40546C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     91RERR-
     A                                      MSGID  5    C6    SCPMODC7    MCR24-
     A                                      34C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     15RERRMSGID  5    C6    SCC-
     A                                      DDSC7    MCR0676C6    FSMESGC5    *-
     A                                      LIBLC0    E1    12    37N38N39N40RE-
     A                                      RRMSGID  5    C6    SCUNTSC7    MCR-
     A                                      0676C6    FSMESGC5    *LIBLC0    E1-
     A                                          12   N37 38N39N40RERRMSGID  5  -
     A                                        C6    SCCHRGC7    MCR0556C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     80-
     A                                      RERRMSGID  5    C6    SCCHRGC7    M-
     A                                      C40116C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     58RERRMSGID  5    C6   -
     A                                       SCCHRGC7    MCR0676C6    FSMESGC5 -
     A                                         *LIBLC0    E1    12   N37N38 39N-
     A                                      40RERRMSGID  5    C6    SCPAIDC7   -
     A                                       MC40116C6    FSMESGC5')
     A                                  1  2HTML('QPUI    *LIBLC0    E1    3   -
     A                                        58RERRMSGID  5    C6    SCPAIDC7 -
     A                                         MCR0676C6    FSMESGC5    *LIBLC0-
     A                                          E1    12   N37N38N39 40RERRMSGI-
     A                                      D  5    C5    SCMRAC7    MC40116C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         58RERRMSGID  5    C5    SCMRAC7 -
     A                                         MCR0676C6    FSMESGC5    *LIBLC0-
     A                                          E1    12    37 38N39N40RERRMSGI-
     A                                      D  5    C6    SCNTWKC7    MC40116C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          58RERRMSGID  5    C6    SCNTWKC-
     A                                      7    MCR0676C6    FSMESGC5    *LIBL-
     A                                      C0    E1    12   N37 38 39N40RERRMS-
     A                                      GID  5    C6    SCOTHRC7    MC40116-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     58RERRMSGID  5    C6    SCOTH-
     A                                      RC7    MCR0676C6    FSMESGC5    *LI-
     A                                      BLC0    E1    12   N37N38 39 40RERR-
     A                                      MSGID  5    C6    SCOT1CC7    MC400-
     A                                      72C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     81RERRMSGID  5    C6    SCO-
     A                                      T1CC7    MCR0513C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     82RERRMSGID  -
     A                                      5    C6    SCOTH2C7    MC40116C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       58RERRMSGID  5    C6    SCOTH2C7  -
     A                                        MCR0676C6    FSMESGC5    *LIBLC0 -
     A                                         E1    12    37N38N39 40RERRMSGID-
     A                                        5    C6    SCOT2CC7    MC40072C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         83RERRMSGID  5    C6    SCOT2CC7-
     A                                          MCR0513C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     84')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","set off":{"fieldN-
     A                                      ame":"*IN05","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 2":{"fieldName-
     A                                      ":"*IN06","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 3":{"fieldName":"-
     A                                      *IN07","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 4":{"fieldName":"*IN-
     A                                      15","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 5":{"fieldName":"*IN30"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 6":{"fieldName":"*IN57","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 7":{"fieldName":"*IN91","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 8":{"fieldName":"*IN95","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      9":{"fieldName":"*IN88","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 10"-
     A                                      :{"fieldName":"*IN25","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"return cursor-
     A                                       record":{"fieldName":"HREC","dataL-
     A                                      ength":"10","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none"},"return cursor field":-
     A                                      {"fieldName":"HFLD","dataLength":"1-
     A                                      0","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"overlay range":"1-24"},"items"-
     A                                      :[{"id":"HFLD","field type":"output-
     A                                       field","visibility":"hidden","valu-
     A                                      e":{"fieldName":"HFLD","designValue-
     A                                      ":"[HFLD]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none","dataLength":"10"},"left-
     A                                      ":"0px","top":"-30px","css class":"-
     A                                      profound-converted"},{"id":"HREC","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "HREC","designValue":"[HREC]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"10"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"F0363FPA_SCR01_avKeys",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"AV_KEYS","dataLength-
     A                                      ":"1134","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[AV_K-
     A                                      EYS]"},"left":"0px","')
     A                                  1  2HTML('top":"0px","visibility":"hidd-
     A                                      en"},{"id":"F0363FPA_SCR01_action",-
     A                                      "field type":"html container","whit-
     A                                      e space":"normal","left":"0px","top-
     A                                      ":"10px","width":"230px","css class-
     A                                      ":"action-panel-converted","height"-
     A                                      :"700px","html":"<div class=\"top\"-
     A                                      ></div><div class=\"imagetop\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_top.png\" /></div><div class=\"-
     A                                      menulinks\"></div><div class=\"imag-
     A                                      ebottom\"><img src=\"/profoundui/us-
     A                                      erdata/images/bar_bottom.png\" /></-
     A                                      div><div class=\"bottom\"></div>"},-
     A                                      {"field type":"icon menu button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"32px","z -
     A                                      index":"20","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1170px","id":"F0363-
     A                                      FPA_SCR01_BtnIconMenuSystemTools","-
     A                                      tool tip":"System Tools","icon sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/systools.png","data function"-
     A                                      :"SystemToolbarSystools","show down-
     A                                       arrow":"Yes"},{"field type":"panel-
     A                                      ","panel style":"TransformButtonBar-
     A                                      ","id":"F0363FPA_SCR01_ButtonBar","-
     A                                      top":"35px","left":"1036px","width"-
     A                                      :"187px","height":"28px","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      ","locked in place":"true"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1040px","id":"F0363F-
     A                                      PA_SCR01_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"F0363FPA_SCR01_BtnRefresh","tool-
     A                                       tip":"Refresh","onclick":"SystemTo-
     A                                      olbarRefresh","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/refresh.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1092px","id":"F0363FPA_SC-
     A                                      R01_BtnSearch","tool')
     A                                  1  2HTML(' tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"F0363FPA-
     A                                      _SCR01_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1144px","id":"F0363FPA_SC-
     A                                      R01_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"F0363FPA_SCR01_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"F0-
     A                                      363FPA_SCR01_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"F-
     A                                      0363FPA_SCR01_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250p')
     A                                  1  2HTML('x","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0363F-
     A                                      PA_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      1","field type":"output field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"F0363FPA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","css-
     A                                       class 3":"HI","parent tab panel":"-
     A                                      F0363FPA_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant2","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"F0363FPA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"F-
     A                                      0363FPA_SCR01_fkeyMenu","field type-
     A                                      ":"menu","left":"10px","top":"120px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0363F-
     A                                      PA_SCR01_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "Q1PGM","field type":"output field"-
     A                                      ,"value":{"fieldName":"Q1PGM","desi-
     A                                      gnValue":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row')
     A                                  1  2HTML('":"2","parent tab panel":"F03-
     A                                      63FPA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCAST","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCAST","designValue":"[SCAST]","-
     A                                      refField":"ST","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"358px","curso-
     A                                      r column":"13","top":"130px","curso-
     A                                      r row":"2","css class 2":"HI","pare-
     A                                      nt tab panel":"F0363FPA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CZIPA","field type":"output field",-
     A                                      "value":{"fieldName":"SCZIPA","desi-
     A                                      gnValue":"[SCZIPA]","refField":"ZIP-
     A                                      A","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"379px","cursor column":"1-
     A                                      6","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0363FPA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCPRDS","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"41-
     A                                      4px","cursor column":"21","top":"13-
     A                                      0px","cursor row":"2","css class 2"-
     A                                      :"HI","parent tab panel":"F0363FPA_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","visibility":"hidden","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant4","field type":"output field"-
     A                                      ,"value":"SCR01","css class":"const-
     A                                      ant","left":"799px","cursor column"-
     A                                      :"76","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"F0363FPA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant3","field type":"outp-
     A                                      ut field","value":"SCR01","css clas-
     A                                      s":"constant","left":"799px","curso-
     A                                      r column":"76","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"F036-
     A                                      3FPA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCMODE","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCMODE","designValue":"[SCMODE]"-
     A                                      ,"refField":"PGM","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"764px","cu-
     A                                      rsor column":"71","top":"150px","cu-
     A                                      rsor row":"3","css class 2":"HI","p-
     A                                      arent tab panel":"F0363FPA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","')
     A                                  1  2HTML('css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0363FPA_SCR01_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"SCHD1","field type":"output -
     A                                      field","value":{"fieldName":"SCHD1"-
     A                                      ,"designValue":"[SCHD1]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"78"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"F0363FPA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0363FPA_SCR01_Bt-
     A                                      nHiddenDiaryItems","value":"btnDiar-
     A                                      y","top":"175px","response":{"field-
     A                                      Name":"btnDiary","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"SCHD2","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCHD2","designValue":"[S-
     A                                      CHD2]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"78"},"css cla-
     A                                      ss":"output-field","left":"281px","-
     A                                      cursor column":"2","top":"190px","c-
     A                                      ursor row":"5","parent tab panel":"-
     A                                      F0363FPA_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0363FPA_SCR01_BtnHiddenSystemMessa-
     A                                      ges","value":"btnMessage","top":"20-
     A                                      0px","response":{"fieldName":"btnMe-
     A                                      ssage","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"SCHD3","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCHD3","designValue":"[SCHD3]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none","d-
     A                                      ataLength":"74"},"css class":"outpu-
     A                                      t-field","left":"281px","cursor col-
     A                                      umn":"2","top":"210px","cursor row"-
     A                                      :"6","parent tab panel":"F0363FPA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCZIPB","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCZ-
     A                                      IPB","designValue":"[SCZIPB]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"3"},"css class":"output-f-
     A                                      ield","left":"806px","cursor column-
     A                                      ":"77","top":"210px","cursor row":"-
     A                                      6","parent tab panel"')
     A                                  1  2HTML(':"F0363FPA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0363FPA_SCR01_BtnHiddenWor-
     A                                      kSubmitJob","value":"btnWrksbmjob",-
     A                                      "top":"225px","response":{"fieldNam-
     A                                      e":"btnWrkJob","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant5","f-
     A                                      ield type":"output field","value":"-
     A                                      EOMB#:","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"230px","cursor row":"7","parent -
     A                                      tab panel":"F0363FPA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCEO-
     A                                      B#","field type":"output field","va-
     A                                      lue":{"fieldName":"SCEOB#","designV-
     A                                      alue":"[SCEOB#]","refField":"EOB#",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00"},"css class":"output-field","le-
     A                                      ft":"330px","cursor column":"9","to-
     A                                      p":"230px","cursor row":"7","width"-
     A                                      :"63px","text align":"right","paren-
     A                                      t tab panel":"F0363FPA_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant6","field type":"output field-
     A                                      ","value":"Line#:","css class":"con-
     A                                      stant","left":"400px","cursor colum-
     A                                      n":"19","top":"230px","cursor row":-
     A                                      "7","parent tab panel":"F0363FPA_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCLIN#","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCLI-
     A                                      N#","designValue":"[SCLIN#]","refFi-
     A                                      eld":"A90","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"449px","cursor colu-
     A                                      mn":"26","top":"230px","cursor row"-
     A                                      :"7","width":"63px","text align":"r-
     A                                      ight","parent tab panel":"F0363FPA_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant7","field type":"-
     A                                      output field","value":"Seq#:","css -
     A                                      class":"constant","left":"519px","c-
     A                                      ursor column":"36","top":"230px","c-
     A                                      ursor row":"7","parent tab panel":"-
     A                                      F0363FPA_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCSEQ#","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCSEQ#","designValue":"[SCSE-
     A                                      Q#]","refField":"SEQ#","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00"},"css cl-
     A                                      ass":"output-field","left":"561px",-
     A                                      "cursor column":"42",')
     A                                  1  2HTML('"top":"230px","cursor row":"7-
     A                                      ","width":"35px","text align":"righ-
     A                                      t","parent tab panel":"F0363FPA_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant8","field type":"out-
     A                                      put field","value":"Ntwk:","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"68","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"603px-
     A                                      ","cursor column":"48","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"F0363FPA_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCNWCD","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCNWCD","designValue":"[-
     A                                      SCNWCD]","refField":"NWCD","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","visibili-
     A                                      ty":{"fieldName":"68","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"645px","cursor column":"54","-
     A                                      top":"230px","cursor row":"7","pare-
     A                                      nt tab panel":"F0363FPA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant9","field type":"output fiel-
     A                                      d","value":"Tot chrg:","css class":-
     A                                      "constant","left":"687px","cursor c-
     A                                      olumn":"60","top":"230px","cursor r-
     A                                      ow":"7","parent tab panel":"F0363FP-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCTOTC","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCTOTC","designValue":"[SCTOTC]","r-
     A                                      efField":"A92","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"-999.00"},"css class":"ou-
     A                                      tput-field","left":"757px","cursor -
     A                                      column":"70","top":"230px","cursor -
     A                                      row":"7","width":"77px","text align-
     A                                      ":"right","parent tab panel":"F0363-
     A                                      FPA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant10","field ty-
     A                                      pe":"output field","value":"PROVIDE-
     A                                      R HAS A MANUAL FEE SCHEDULE CAP","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"44","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      250px","cursor row":"8","css class -
     A                                      2":"HI","parent tab panel":"F0363FP-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0363FP-
     A                                      A_SCR01_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"field')
     A                                  1  2HTML('Name":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant11","field type":"output field-
     A                                      ","value":"Adjudication code     :"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"270p-
     A                                      x","cursor row":"9","parent tab pan-
     A                                      el":"F0363FPA_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCSCD","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCCSCD","designValu-
     A                                      e":"[SCCSCD]","refField":"CODE3","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase"},"text transform":"uppercas-
     A                                      e","left":"449px","cursor column":"-
     A                                      26","top":"270px","cursor row":"9",-
     A                                      "width":"22px","css class 3":{"fiel-
     A                                      dName":"N09 and N46","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"46 or 44 or 09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "46 or 44 or 09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"css class-
     A                                       5":{"fieldName":"N46","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"set-
     A                                       focus":{"fieldName":"31","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"MCR0503","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"71","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"3 messages","error message id 2"-
     A                                      :"MCR2383","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"72","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MC4-
     A                                      0167","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "65","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"F0363FPA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"SCCSDS","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      SDS","designValue":"[SCCSDS]","refF-
     A                                      ield":"DS25","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"477px","cursor -
     A                                      column":"30","top":"270px","cursor -
     A                                      row":"9","css class 2')
     A                                  1  2HTML('":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      parent tab panel":"F0363FPA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant13","field type":"output-
     A                                       field","value":"EOB Code Needed","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"14","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"673px","cursor column":"58","top"-
     A                                      :"270px","cursor row":"9","css clas-
     A                                      s 2":{"fieldName":"14","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"RI","customFalse":""},"par-
     A                                      ent tab panel":"F0363FPA_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant12","field type":"output fi-
     A                                      eld","value":"EOB/Notes attached","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"69","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"673px","cursor column":"58","top"-
     A                                      :"270px","cursor row":"9","css clas-
     A                                      s 2":{"fieldName":"69","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"RI","customFalse":""},"par-
     A                                      ent tab panel":"F0363FPA_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0363FPA_SCR01_BtnH-
     A                                      iddenImageQueue","value":"btnImgQue-
     A                                      ","top":"275px","response":{"fieldN-
     A                                      ame":"btnImgQue","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant14"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Place of Service      :","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"290px","curs-
     A                                      or row":"10","parent tab panel":"F0-
     A                                      363FPA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPOS","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCPOS","designValue":"[SCPO-
     A                                      S]","dataType":"zoned","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","dataLength":"2","decPos":"0"},-
     A                                      "left":"449px","cursor column":"26"-
     A                                      ,"top":"290px","cursor row":"10","w-
     A                                      idth":"15px","css class 3":{"fieldN-
     A                                      ame":"N09 and N46","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"46 or 09","dataTy-
     A                                      pe":"expression","for')
     A                                  1  2HTML('matting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 4":{-
     A                                      "fieldName":"46 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 5":{"fieldName":"N46","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"set focus":{"fieldName":"32","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"MCR0503","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"76","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"3 messages","error message-
     A                                       id 2":"MCR2383","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"77","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 3-
     A                                      ":"MCR2387","error message file 3":-
     A                                      "FSMESG","error message library 3":-
     A                                      "*LIBL","error condition 3":{"field-
     A                                      Name":"25","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab panel":"F036-
     A                                      3FPA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"SCPODS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPODS","designValue":"[SCPODS]"-
     A                                      ,"refField":"DS30","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"470px","c-
     A                                      ursor column":"29","top":"290px","c-
     A                                      ursor row":"10","css class 2":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"parent tab pa-
     A                                      nel":"F0363FPA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0363FPA_SCR01_BtnHiddenHelp"-
     A                                      ,"value":"btnHelp","top":"300px","r-
     A                                      esponse":{"fieldName":"btnHelp","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant15","field type":"outpu-
     A                                      t field","value":"From Date of Serv-
     A                                      ice  :","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"310px","cursor row":"11","parent-
     A                                       tab panel":"F0363FPA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCF-
     A                                      DAT","field type":"date field","css-
     A                                       class":"input","css class 2":"date-
     A                                      -field","value":{"fieldName":"SCFDA-
     A                                      T","designValue":"[SC')
     A                                  1  2HTML('FDAT]","refField":"DT8","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "edtWrd":"''  /  /    ''","dateForm-
     A                                      at":"m/d/Y"},"left":"449px","cursor-
     A                                       column":"26","top":"310px","cursor-
     A                                       row":"11","width":"71px","css clas-
     A                                      s 3":{"fieldName":"N09 and N46","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"46 o-
     A                                      r 09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 4":{"fieldN-
     A                                      ame":"46 or 09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      5":{"fieldName":"N46","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"set -
     A                                      focus":{"fieldName":"33","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0556","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"73","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"6 messages","error message id 2":-
     A                                      "MCR0500","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"74","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 3":"MC40-
     A                                      056","error message file 3":"FSMESG-
     A                                      ","error message library 3":"*LIBL"-
     A                                      ,"error condition 3":{"fieldName":"-
     A                                      75","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 4":"MCR0466",-
     A                                      "error message file 4":"FSMESG","er-
     A                                      ror message library 4":"*LIBL","err-
     A                                      or condition 4":{"fieldName":"85","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 5":"MCR2397","erro-
     A                                      r message file 5":"FSMESG","error m-
     A                                      essage library 5":"*LIBL","error co-
     A                                      ndition 5":{"fieldName":"30","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 6":"MCR0676","error mes-
     A                                      sage file 6":"FSMESG","error messag-
     A                                      e library 6":"*LIBL","error conditi-
     A                                      on 6":{"fieldName":"N37 and 38 and -
     A                                      39 and 40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab panel":"F036-
     A                                      3FPA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"constant16","field t-
     A                                      ype":"output field","value":"To Dat-
     A                                      e of Service       :","css class":"-
     A                                      constant","left":"561px","cursor co-
     A                                      lumn":"42","top":"310')
     A                                  1  2HTML('px","cursor row":"11","parent-
     A                                       tab panel":"F0363FPA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCT-
     A                                      DAT","field type":"date field","css-
     A                                       class":"input","css class 2":"date-
     A                                      -field","value":{"fieldName":"SCTDA-
     A                                      T","designValue":"[SCTDAT]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00","edtWrd":"''  /  /  -
     A                                        ''","dateFormat":"m/d/Y"},"left":-
     A                                      "772px","cursor column":"69","top":-
     A                                      "310px","cursor row":"11","width":"-
     A                                      71px","css class 3":{"fieldName":"N-
     A                                      09 and N46","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"46 or 09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 4":{"fieldName":"46 or 09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"error message id":"MCR0500","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"07","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"3 messages","error message-
     A                                       id 2":"MC40307","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"88","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 3-
     A                                      ":"MCR2397","error message file 3":-
     A                                      "FSMESG","error message library 3":-
     A                                      "*LIBL","error condition 3":{"field-
     A                                      Name":"95","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab panel":"F036-
     A                                      3FPA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted"},{"id":"constant17","field t-
     A                                      ype":"output field","value":"Revenu-
     A                                      e code          :","css class":"con-
     A                                      stant","left":"281px","cursor colum-
     A                                      n":"2","top":"330px","cursor row":"-
     A                                      12","parent tab panel":"F0363FPA_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCRVCD","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCRVCD","designValue":"[SCRVCD]","r-
     A                                      efField":"RVCD","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00"},"left":"449px-
     A                                      ","cursor column":"26","top":"330px-
     A                                      ","cursor row":"12","width":"22px",-
     A                                      "css class 3":{"fieldName":"N09 and-
     A                                       N46","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customT')
     A                                  1  2HTML('rue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"46 or 09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      46 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"css class 5":{"f-
     A                                      ieldName":"N46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"set focus"-
     A                                      :{"fieldName":"34","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"MCR2387","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"87","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"3 me-
     A                                      ssages","error message id 2":"MC403-
     A                                      10","error message file 2":"FSMESG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{"fieldName":"5-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 3":"MC40327","-
     A                                      error message file 3":"FSMESG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"86","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"p-
     A                                      arent tab panel":"F0363FPA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant18","field type":"output -
     A                                      field","value":"Service code:","css-
     A                                       class":"constant","left":"561px","-
     A                                      cursor column":"42","top":"330px","-
     A                                      cursor row":"12","parent tab panel"-
     A                                      :"F0363FPA_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCSVCD","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCSVCD","designValue":-
     A                                      "[SCSVCD]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase","dataLength":"25"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"659px","cursor column":"56","top"-
     A                                      :"330px","cursor row":"12","width":-
     A                                      "176px","css class 3":{"fieldName":-
     A                                      "N09 and N46","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"46 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 4":{"fieldName":"46 or 09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"set focus":{"fieldName":"52"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 5":{"fieldName":-
     A                                      "N46","dataType":"exp')
     A                                  1  2HTML('ression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      parent tab panel":"F0363FPA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant19","field type":"output-
     A                                       field","value":"HCPCS/CPT4 Mod    -
     A                                          :","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"350px","cursor row":"13","parent -
     A                                      tab panel":"F0363FPA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCHC-
     A                                      PC","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCHCPC","des-
     A                                      ignValue":"[SCHCPC]","refField":"CP-
     A                                      T4","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"449px","cursor col-
     A                                      umn":"26","top":"350px","cursor row-
     A                                      ":"13","width":"36px","css class 3"-
     A                                      :{"fieldName":"N09 and N46","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"46 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"46 or 09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 5":{-
     A                                      "fieldName":"N46","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"set focu-
     A                                      s":{"fieldName":"35","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"error -
     A                                      messages":"4 messages","parent tab -
     A                                      panel":"F0363FPA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted","error message i-
     A                                      d":"MC40309","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"78","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode":"0","er-
     A                                      ror message id 2":"MCR2387","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"89","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error e-
     A                                      nhanced mode 2":"0","error message -
     A                                      id 3":"MC40312","error message file-
     A                                       3":"FSMESG","error message library-
     A                                       3":"*LIBL","error condition 3":{"f-
     A                                      ieldName":"79","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                       3":"0","error message id 4":"MC405-
     A                                      46","error message file 4":"FSMESG"-
     A                                      ,"error message library 4":"*LIBL",-
     A                                      "error condition 4":{"fieldName":"9-
     A                                      1","dataType":"expres')
     A                                  1  2HTML('sion","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error enhan-
     A                                      ced mode 4":"0"},{"id":"constant20"-
     A                                      ,"field type":"output field","value-
     A                                      ":"-","css class":"constant","left"-
     A                                      :"491px","cursor column":"32","top"-
     A                                      :"350px","cursor row":"13","parent -
     A                                      tab panel":"F0363FPA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPM-
     A                                      OD","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCPMOD","des-
     A                                      ignValue":"[SCPMOD]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"2"},"text transform":"uppercas-
     A                                      e","left":"505px","cursor column":"-
     A                                      34","top":"350px","cursor row":"13"-
     A                                      ,"width":"15px","css class 3":{"fie-
     A                                      ldName":"N09 and N46","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"46 or 09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"46 o-
     A                                      r 09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"set focus":{"fi-
     A                                      eldName":"05","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"error message-
     A                                       id":"MCR2434","error message file"-
     A                                      :"FSMESG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"15","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"1 message-
     A                                      ","description":"Procedure Code Mod-
     A                                      ifier","parent tab panel":"F0363FPA-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant21","field type"-
     A                                      :"output field","value":"Descriptio-
     A                                      n :","css class":"constant","left":-
     A                                      "561px","cursor column":"42","top":-
     A                                      "350px","cursor row":"13","parent t-
     A                                      ab panel":"F0363FPA_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCSCD-
     A                                      S","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCSCDS","desi-
     A                                      gnValue":"[SCSCDS]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase","dataLengt-
     A                                      h":"25"},"text transform":"uppercas-
     A                                      e","left":"659px","cursor column":"-
     A                                      56","top":"350px","cursor row":"13"-
     A                                      ,"width":"176px","css class 3":{"fi-
     A                                      eldName":"N09 and N46","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom')
     A                                  1  2HTML(' Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"46 or 09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      4":{"fieldName":"46 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"set focus":{"fieldName":"06",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"parent tab panel":"F0363FPA-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant22","field type"-
     A                                      :"output field","value":"Descriptio-
     A                                      n           :","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"370px","cursor row":"14",-
     A                                      "parent tab panel":"F0363FPA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCCDDS","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCCD-
     A                                      DS","designValue":"[SCCDDS]","refFi-
     A                                      eld":"DS25","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase"},"text transf-
     A                                      orm":"uppercase","left":"449px","cu-
     A                                      rsor column":"26","top":"370px","cu-
     A                                      rsor row":"14","width":"176px","css-
     A                                       class 3":{"fieldName":"N09 and N46-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "46 or 09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 4":{"f-
     A                                      ieldName":"46 or 09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"error-
     A                                       message id":"MCR0676","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"37 and N38 and N39 and -
     A                                      N40","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"F0363FPA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 5":"profound-converted"},{"id-
     A                                      ":"constant23","field type":"output-
     A                                       field","value":"Service units     -
     A                                          :","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"390px","cursor row":"15","parent -
     A                                      tab panel":"F0363FPA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCUN-
     A                                      TS","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCUNTS","des-
     A                                      ignValue":"[SCUNTS]",')
     A                                  1  2HTML('"dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00","dataLength":"3","decPos":"0"-
     A                                      ,"numBlankFill":"true"},"left":"449-
     A                                      px","cursor column":"26","top":"390-
     A                                      px","cursor row":"15","width":"22px-
     A                                      ","text align":"right","css class 3-
     A                                      ":{"fieldName":"N09 and N46","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"read only":{"fieldName":"46 or 0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 4":{"fieldName-
     A                                      ":"46 or 09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 5":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"set focu-
     A                                      s":{"fieldName":"36","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"error -
     A                                      message id":"MCR0676","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"N37 and 38 and N39 and N-
     A                                      40","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","p-
     A                                      arent tab panel":"F0363FPA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant24","field type":"output -
     A                                      field","value":"Date Entered       -
     A                                            :","css class":"constant","le-
     A                                      ft":"561px","cursor column":"42","t-
     A                                      op":"390px","cursor row":"15","pare-
     A                                      nt tab panel":"F0363FPA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CEDAT","field type":"output field",-
     A                                      "value":{"fieldName":"SCEDAT","desi-
     A                                      gnValue":"[SCEDAT]","refField":"DT8-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","edtWrd":"''  /  /    ''"},"cs-
     A                                      s class":"output-field","left":"750-
     A                                      px","cursor column":"69","top":"390-
     A                                      px","cursor row":"15","width":"70px-
     A                                      ","text align":"right","css class 2-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"parent-
     A                                       tab panel":"F0363FPA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant25","field type":"output field-
     A                                      ","value":"Total charges         :"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"410p-
     A                                      x","cursor row":"16","parent tab pa-
     A                                      nel":"F0363FPA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css')
     A                                  1  2HTML(' class 2":"profound-converted-
     A                                      "},{"id":"SCCHRG","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCCHRG","designValue":"[SCCHRG]",-
     A                                      "refField":"A92","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00"},"left":"449px-
     A                                      ","cursor column":"26","top":"410px-
     A                                      ","cursor row":"16","width":"78px",-
     A                                      "css class 3":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"css class 5":"HI","er-
     A                                      ror message id":"MCR0556","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"80","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"3 messages","error message id 2":-
     A                                      "MC40116","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"58","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 3":"MCR0-
     A                                      676","error message file 3":"FSMESG-
     A                                      ","error message library 3":"*LIBL"-
     A                                      ,"error condition 3":{"fieldName":"-
     A                                      N37 and N38 and 39 and N40","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"F0363FPA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted"},{"id":"con-
     A                                      stant26","field type":"output field-
     A                                      ","value":"Payment                 -
     A                                       :","css class":"constant","left":"-
     A                                      561px","cursor column":"42","top":"-
     A                                      410px","cursor row":"16","parent ta-
     A                                      b panel":"F0363FPA_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPAID-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCPAID","desig-
     A                                      nValue":"[SCPAID]","refField":"A92"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"left":"750px","cursor column-
     A                                      ":"69","top":"410px","cursor row":"-
     A                                      16","width":"78px","css class 3":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / fa')
     A                                  1  2HTML('lse"},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"error messag-
     A                                      e id":"MC40116","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"58","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0676",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"N37 a-
     A                                      nd N38 and N39 and 40","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"F0363FPA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"SCHMR1",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCHMR1","designValue-
     A                                      ":"[SCHMR1]","refField":"DS10","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"430px","cursor row":"17","parent -
     A                                      tab panel":"F0363FPA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant27","field type":"output field"-
     A                                      ,"value":"amount        :","css cla-
     A                                      ss":"constant","left":"358px","curs-
     A                                      or column":"13","top":"430px","curs-
     A                                      or row":"17","parent tab panel":"F0-
     A                                      363FPA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCMRA","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCMRA","designValue":"[SCMR-
     A                                      A]","refField":"A92","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00"},"left":"4-
     A                                      70px","cursor column":"29","top":"4-
     A                                      30px","cursor row":"17","width":"78-
     A                                      px","css class 3":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"set focus":{-
     A                                      "fieldName":"55","dat')
     A                                  1  2HTML('aType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"error message id":"MC4011-
     A                                      6","error message file":"FSMESG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"58","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"2 messages","error me-
     A                                      ssage id 2":"MCR0676","error messag-
     A                                      e file 2":"FSMESG","error message l-
     A                                      ibrary 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"37 and 38 and N39 -
     A                                      and N40","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"F0363F-
     A                                      PA_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"id":"SCHNTW","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCHNTW","designValue":"[SCHNTW]","-
     A                                      refField":"DS10","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","visibility":{"fiel-
     A                                      dName":"47","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"561p-
     A                                      x","cursor column":"42","top":"430p-
     A                                      x","cursor row":"17","parent tab pa-
     A                                      nel":"F0363FPA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant28-
     A                                      ","field type":"output field","valu-
     A                                      e":"amount        :","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "47","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"638px","cur-
     A                                      sor column":"53","top":"430px","cur-
     A                                      sor row":"17","parent tab panel":"F-
     A                                      0363FPA_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCNTWK","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCNTWK","designValue":"[S-
     A                                      CNTWK]","refField":"A92","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00"},"visi-
     A                                      bility":{"fieldName":"47","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"750px","cursor column":"6-
     A                                      9","top":"430px","cursor row":"17",-
     A                                      "width":"78px","css class 3":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","format')
     A                                  1  2HTML('ting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"error message id-
     A                                      ":"MC40116","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "58","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"2 messages",-
     A                                      "error message id 2":"MCR0676","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"N37 and 3-
     A                                      8 and 39 and N40","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"parent tab panel-
     A                                      ":"F0363FPA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"SCHO11","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCHO11","designValue":"[S-
     A                                      CHO11]","refField":"DS10","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      1px","cursor column":"2","top":"450-
     A                                      px","cursor row":"18","parent tab p-
     A                                      anel":"F0363FPA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      9","field type":"output field","val-
     A                                      ue":"amount        :","css class":"-
     A                                      constant","left":"358px","cursor co-
     A                                      lumn":"13","top":"450px","cursor ro-
     A                                      w":"18","parent tab panel":"F0363FP-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCOTHR","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCOTHR","designValue":"[SCOTHR]-
     A                                      ","refField":"A92","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00"},"left":"470-
     A                                      px","cursor column":"29","top":"450-
     A                                      px","cursor row":"18","width":"78px-
     A                                      ","css class 3":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 4":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"error message -
     A                                      id":"MC40116","error message file":-
     A                                      "FSMESG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"58","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"2 messages-
     A                                      ","error message id 2')
     A                                  1  2HTML('":"MCR0676","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"N37 and N38 and 39 and-
     A                                       40","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"F0363FPA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"SCHO12","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCH-
     A                                      O12","designValue":"[SCHO12]","refF-
     A                                      ield":"DS10","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"561px","cursor -
     A                                      column":"42","top":"450px","cursor -
     A                                      row":"18","parent tab panel":"F0363-
     A                                      FPA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant30","field ty-
     A                                      pe":"output field","value":"type co-
     A                                      de     :","css class":"constant","l-
     A                                      eft":"638px","cursor column":"53","-
     A                                      top":"450px","cursor row":"18","par-
     A                                      ent tab panel":"F0363FPA_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCOT1C","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCOT1C",-
     A                                      "designValue":"[SCOT1C]","refField"-
     A                                      :"CODE3","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"750px","curso-
     A                                      r column":"69","top":"450px","curso-
     A                                      r row":"18","width":"22px","css cla-
     A                                      ss 3":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 4":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "48","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"MC4-
     A                                      0072","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"81","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"MCR0513","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"82","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"F0363FPA_SCR')
     A                                  1  2HTML('01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"id":"SCHO21","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCHO21","designValue":"[SCHO21]","-
     A                                      refField":"DS10","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"470px","curs-
     A                                      or row":"19","parent tab panel":"F0-
     A                                      363FPA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant31","field-
     A                                       type":"output field","value":"amou-
     A                                      nt        :","css class":"constant"-
     A                                      ,"left":"358px","cursor column":"13-
     A                                      ","top":"470px","cursor row":"19","-
     A                                      parent tab panel":"F0363FPA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCOTH2","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCOTH-
     A                                      2","designValue":"[SCOTH2]","refFie-
     A                                      ld":"A92","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00"},"left":"470px","curs-
     A                                      or column":"29","top":"470px","curs-
     A                                      or row":"19","width":"78px","css cl-
     A                                      ass 3":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 4":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"49","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"MC-
     A                                      40116","error message file":"FSMESG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"58",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"MCR0676","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"37 and N38 and-
     A                                       N39 and 40","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"parent tab panel":"F0-
     A                                      363FPA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"SCHO22","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCHO22","designValue":"[SCHO22-
     A                                      ]","refField":"DS10","dataType":"re-
     A                                      ference","formatting"')
     A                                  1  2HTML(':"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"561px","cursor column"-
     A                                      :"42","top":"470px","cursor row":"1-
     A                                      9","parent tab panel":"F0363FPA_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant32","field type":"ou-
     A                                      tput field","value":"type code     -
     A                                      :","css class":"constant","left":"6-
     A                                      38px","cursor column":"53","top":"4-
     A                                      70px","cursor row":"19","parent tab-
     A                                       panel":"F0363FPA_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCOT2C"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCOT2C","design-
     A                                      Value":"[SCOT2C]","refField":"CODE3-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"750px","cursor colum-
     A                                      n":"69","top":"470px","cursor row":-
     A                                      "19","width":"22px","css class 3":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 4":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"set focus":{"fieldName":"50","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message id":"MC40072","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"83","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"2 messages","error messag-
     A                                      e id 2":"MCR0513","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"84","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"F0363FPA_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"id":"constant34","f-
     A                                      ield type":"output field","value":"-
     A                                      Rule                     :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"56","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"280p-
     A                                      x","cursor column":"65","top":"490p-
     A                                      x","cursor row":"21","parent tab pa-
     A                                      nel":"F0363FPA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted","wid')
     A                                  1  2HTML('th":"150px"},{"id":"SCRULE","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCRULE","designValue"-
     A                                      :"[SCRULE]","refField":"A90","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00"},"-
     A                                      css class":"output-field","visibili-
     A                                      ty":{"fieldName":"56","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"470px","cursor column":"71","-
     A                                      top":"490px","cursor row":"21","wid-
     A                                      th":"63px","text align":"left","par-
     A                                      ent tab panel":"F0363FPA_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant37","field type":"output fi-
     A                                      eld","value":" ","css class":"const-
     A                                      ant","visibility":{"fieldName":"09 -
     A                                      and 43","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"281px","-
     A                                      cursor column":"2","top":"530px","c-
     A                                      ursor row":"22","css class 2":"BLU"-
     A                                      ,"parent tab panel":"F0363FPA_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant36","field type":"outp-
     A                                      ut field","value":" ","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"N09 and N43","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      81px","cursor column":"2","top":"53-
     A                                      0px","cursor row":"22","css class 2-
     A                                      ":"BLU","parent tab panel":"F0363FP-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant35","field type-
     A                                      ":"output field","value":" ","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"N09 and 43","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"530px","cursor row":"22","css c-
     A                                      lass 2":"BLU","parent tab panel":"F-
     A                                      0363FPA_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant38","fiel-
     A                                      d type":"output field","value":" ",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"N09 and 43","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"550px","cursor row":"23",-
     A                                      "css class 2":"BLU","parent tab pan-
     A                                      el":"F0363FPA_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant40"-
     A                                      ,"field type":"output field","value-
     A                                      ":" ","css class":"constant","visib-
     A                                      ility":{"fieldName":"09 and N43","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"281px","cursor col-
     A                                      umn":"2","top":"550px","cursor row"-
     A                                      :"23","css class 2":"BLU","parent t-
     A                                      ab panel":"F0363FPA_S')
     A                                  1  2HTML('CR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant39","field t-
     A                                      ype":"output field","value":" ","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"N09 and N43","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"550px","cursor row":"23","c-
     A                                      ss class 2":"BLU","parent tab panel-
     A                                      ":"F0363FPA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant41","-
     A                                      field type":"output field","value":-
     A                                      "             ","css class":"consta-
     A                                      nt","visibility":{"fieldName":"70",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"281px","cursor c-
     A                                      olumn":"2","top":"570px","cursor ro-
     A                                      w":"24","parent tab panel":"F0363FP-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF01","field type":"button",-
     A                                      "visibility":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"value":"Repeat","shortcut -
     A                                      key":"F1","left":"14px","top":"183p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF02","field type":"button","vis-
     A                                      ibility":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":"Process","shortcut key-
     A                                      ":"F2","left":"14px","top":"216px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF05","field type":"button","visibi-
     A                                      lity":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"value":"Refresh","shortcut key":"-
     A                                      F5","left":"14px","top":"249px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF0-
     A                                      7","field type":"button","visibilit-
     A                                      y":{"fieldName":"N09 and 43 or N09 -
     A                                      and N43 or 09 and 43 or 09 and N43"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":"Header Info","-
     A                                      shortcut key":"F7","left":"14px","t-
     A                                      op":"282px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF09","field type":"but-
     A                                      ton","visibility":{"fieldName":"43"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":"')
     A                                  1  2HTML('Code info","shortcut key":"F9-
     A                                      ","left":"14px","top":"315px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF10"-
     A                                      ,"field type":"button","visibility"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"val-
     A                                      ue":"Search","shortcut key":"F10","-
     A                                      left":"14px","top":"348px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF11","f-
     A                                      ield type":"button","visibility":{"-
     A                                      fieldName":"43","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"value":-
     A                                      "EOB/Notes","shortcut key":"F11","l-
     A                                      eft":"14px","top":"381px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF12","fi-
     A                                      eld type":"button","visibility":{"f-
     A                                      ieldName":"09 and 43 or N09 and 43 -
     A                                      or N09 and N43 or 09 and N43","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"value":"Cancel","shortcut ke-
     A                                      y":"F12","left":"14px","top":"414px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF14","field type":"button","visi-
     A                                      bility":{"fieldName":"09 and 43 or -
     A                                      N09 and 43 or N09 and N43 or 09 and-
     A                                       N43","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":"DART","sh-
     A                                      ortcut key":"F14","left":"14px","to-
     A                                      p":"447px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF15","field type":"butt-
     A                                      on","visibility":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":"Display lines"-
     A                                      ,"shortcut key":"F15","left":"14px"-
     A                                      ,"top":"480px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"constant42","field type-
     A                                      ":"output field","css class":"const-
     A                                      ant","value":"EOB codes:","cursor r-
     A                                      ow":"21","cursor column":"37","left-
     A                                      ":"280px","top":"510px","css class -
     A                                      2":"profound-converted","visibility-
     A                                      ":{"fieldName":"59 or 09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"parent tab panel":"F0363FPA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0"},{-
     A                                      "id":"SCEOB1","field type":"output -
     A                                      field","css class":"output-field","-
     A                                      value":{"fieldName":"SCEOB1","trimL-
     A                                      eading":"true","trimTrailing":"fals-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"reference","fo-
     A                                      rmatting":"Text","textTransform":"u-
     A                                      ppercase","designValue":"[SCEOB1]",-
     A                                      "refField":"CODE3","k')
     A                                  1  2HTML('eywords":[]},"cursor row":"21-
     A                                      ","cursor column":"48","left":"360p-
     A                                      x","top":"510px","width":"46PX","cs-
     A                                      s class 2":"profound-converted","vi-
     A                                      sibility":{"fieldName":"59 or 09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"parent tab panel":"F0363-
     A                                      FPA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0"},{"id":"SCEOB2","field type":-
     A                                      "output field","css class":"output--
     A                                      field","value":{"fieldName":"SCEOB2-
     A                                      ","trimLeading":"true","trimTrailin-
     A                                      g":"false","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"refere-
     A                                      nce","formatting":"Text","textTrans-
     A                                      form":"uppercase","designValue":"[S-
     A                                      CEOB2]","refField":"CODE3","keyword-
     A                                      s":[]},"cursor row":"21","cursor co-
     A                                      lumn":"52","left":"410px","top":"51-
     A                                      0px","width":"46PX","css class 2":"-
     A                                      profound-converted","visibility":{"-
     A                                      fieldName":"59 or 09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"p-
     A                                      arent tab panel":"F0363FPA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0"},{"id"-
     A                                      :"SCEOB3","field type":"output fiel-
     A                                      d","css class":"output-field","valu-
     A                                      e":{"fieldName":"SCEOB3","trimLeadi-
     A                                      ng":"true","trimTrailing":"false","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"reference","format-
     A                                      ting":"Text","textTransform":"upper-
     A                                      case","designValue":"[SCEOB3]","ref-
     A                                      Field":"CODE3","keywords":[]},"curs-
     A                                      or row":"21","cursor column":"56","-
     A                                      left":"460px","top":"510px","width"-
     A                                      :"46PX","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      59 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"parent tab pa-
     A                                      nel":"F0363FPA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0"},{"id":"SCEOB4","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"output-field","value":{"fieldNa-
     A                                      me":"SCEOB4","trimLeading":"true","-
     A                                      trimTrailing":"false","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"textTransform":"uppercase","desig-
     A                                      nValue":"[SCEOB4]","refField":"CODE-
     A                                      3","keywords":[]},"cursor row":"21"-
     A                                      ,"cursor column":"60","left":"510px-
     A                                      ","top":"510px","width":"46PX","css-
     A                                       class 2":"profound-converted","vis-
     A                                      ibility":{"fieldName":"59 or 09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"parent tab panel":"F0363F-
     A                                      PA_SCR01_MainTabPanel","parent tab"-
     A                                      :"0"},{"id":"SCEOB5","field type":"-
     A                                      output field","css class":"output-f-
     A                                      ield","value":{"fieldName":"SCEOB5"-
     A                                      ,"dataLength":"6","trimLeading":"tr-
     A                                      ue","trimTrailing":"false","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"uppercase","desig-
     A                                      nValue":"[SCEOB5]"},"cursor row":"2-
     A                                      1","cursor column":"6')
     A                                  1  2HTML('0","left":"560px","top":"510p-
     A                                      x","width":"46PX","css class 2":"pr-
     A                                      ofound-converted","visibility":{"fi-
     A                                      eldName":"59 or 09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"par-
     A                                      ent tab panel":"F0363FPA_SCR01_Main-
     A                                      TabPanel","parent tab":"0"},{"id":"-
     A                                      SCEOB6","field type":"output field"-
     A                                      ,"css class":"output-field","value"-
     A                                      :{"fieldName":"SCEOB6","dataLength"-
     A                                      :"6","trimLeading":"true","trimTrai-
     A                                      ling":"false","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"uppercase","designValue":"[SCE-
     A                                      OB6]"},"cursor row":"21","cursor co-
     A                                      lumn":"60","left":"610px","top":"51-
     A                                      0px","width":"46PX","css class 2":"-
     A                                      profound-converted","visibility":{"-
     A                                      fieldName":"59 or 09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"p-
     A                                      arent tab panel":"F0363FPA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0"},{"id"-
     A                                      :"SCEOB7","field type":"output fiel-
     A                                      d","css class":"output-field","valu-
     A                                      e":{"fieldName":"SCEOB7","dataLengt-
     A                                      h":"6","trimLeading":"true","trimTr-
     A                                      ailing":"false","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"uppercase","designValue":"[S-
     A                                      CEOB7]"},"cursor row":"21","cursor -
     A                                      column":"60","left":"660px","top":"-
     A                                      510px","width":"46PX","css class 2"-
     A                                      :"profound-converted","visibility":-
     A                                      {"fieldName":"59 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "parent tab panel":"F0363FPA_SCR01_-
     A                                      MainTabPanel","parent tab":"0"},{"i-
     A                                      d":"SCEOB8","field type":"output fi-
     A                                      eld","css class":"output-field","va-
     A                                      lue":{"fieldName":"SCEOB8","dataLen-
     A                                      gth":"6","trimLeading":"true","trim-
     A                                      Trailing":"false","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [SCEOB8]"},"cursor row":"21","curso-
     A                                      r column":"60","left":"710px","top"-
     A                                      :"510px","width":"46PX","css class -
     A                                      2":"profound-converted","visibility-
     A                                      ":{"fieldName":"59 or 09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"parent tab panel":"F0363FPA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0"},{-
     A                                      "id":"SCEOB9","field type":"output -
     A                                      field","css class":"output-field","-
     A                                      value":{"fieldName":"SCEOB9","dataL-
     A                                      ength":"6","trimLeading":"true","tr-
     A                                      imTrailing":"false","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"uppercase","designValue"-
     A                                      :"[SCEOB9]"},"cursor row":"21","cur-
     A                                      sor column":"60","left":"760px","to-
     A                                      p":"510px","width":"46PX","css clas-
     A                                      s 2":"profound-converted","visibili-
     A                                      ty":{"fieldName":"59')
     A                                  1  2HTML(' or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"parent ta-
     A                                      b panel":"F0363FPA_SCR01_MainTabPan-
     A                                      el","parent tab":"0"},{"id":"SCEOB1-
     A                                      0","field type":"output field","css-
     A                                       class":"output-field","value":{"fi-
     A                                      eldName":"SCEOB10","dataLength":"6"-
     A                                      ,"trimLeading":"true","trimTrailing-
     A                                      ":"false","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "uppercase","designValue":"[SCEOB10-
     A                                      ]"},"cursor row":"21","cursor colum-
     A                                      n":"60","left":"810px","top":"510px-
     A                                      ","width":"46PX","css class 2":"pro-
     A                                      found-converted","visibility":{"fie-
     A                                      ldName":"59 or 09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"pare-
     A                                      nt tab panel":"F0363FPA_SCR01_MainT-
     A                                      abPanel","parent tab":"0"},{"id":"S-
     A                                      CEOB11","field type":"output field"-
     A                                      ,"css class":"output-field","value"-
     A                                      :{"fieldName":"SCEOB11","dataLength-
     A                                      ":"6","trimLeading":"true","trimTra-
     A                                      iling":"false","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SC-
     A                                      EOB11]"},"cursor row":"21","cursor -
     A                                      column":"60","left":"860px","top":"-
     A                                      510px","width":"46PX","css class 2"-
     A                                      :"profound-converted","visibility":-
     A                                      {"fieldName":"59 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "parent tab panel":"F0363FPA_SCR01_-
     A                                      MainTabPanel","parent tab":"0"},{"i-
     A                                      d":"SCEOB12","field type":"output f-
     A                                      ield","css class":"output-field","v-
     A                                      alue":{"fieldName":"SCEOB12","dataL-
     A                                      ength":"6","trimLeading":"true","tr-
     A                                      imTrailing":"false","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"uppercase","designValue"-
     A                                      :"[SCEOB12]"},"cursor row":"21","cu-
     A                                      rsor column":"60","left":"910px","t-
     A                                      op":"510px","width":"46PX","css cla-
     A                                      ss 2":"profound-converted","visibil-
     A                                      ity":{"fieldName":"59 or 09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"parent tab panel":"F0363FPA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB10        6A  H
     A            SCEOB11        6A  H
     A            SCEOB12        6A  H
     A            SCEOB5         6A  H
     A            SCEOB6         6A  H
     A            SCEOB7         6A  H
     A            SCEOB8         6A  H
     A            SCEOB9         6A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         74A  H
     A            SCPMOD         2A  H
     A            SCPOS          2S 0H
     A            SCSCDS        25A  H
     A            SCSVCD        25A  H
     A            SCUNTS         3S 0H
     A            SCZIPB         3A  H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCDDS    R        H      REFFLD(DS25)
     A            SCCHRG    R        H      REFFLD(A92)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCSCD    R        H      REFFLD(CODE3)
     A            SCCSDS    R        H      REFFLD(DS25)
     A            SCEDAT    R        H      REFFLD(DT8)
     A            SCEOB#    R        H      REFFLD(EOB#)
     A            SCEOB1    R        H      REFFLD(CODE3)
     A            SCEOB2    R        H      REFFLD(CODE3)
     A            SCEOB3    R        H      REFFLD(CODE3)
     A            SCEOB4    R        H      REFFLD(CODE3)
     A            SCFDAT    R        H      REFFLD(DT8)
     A            SCHCPC    R        H      REFFLD(CPT4)
     A            SCHMR1    R        H      REFFLD(DS10)
     A            SCHNTW    R        H      REFFLD(DS10)
     A            SCHO11    R        H      REFFLD(DS10)
     A            SCHO12    R        H      REFFLD(DS10)
     A            SCHO21    R        H      REFFLD(DS10)
     A            SCHO22    R        H      REFFLD(DS10)
     A            SCLIN#    R        H      REFFLD(A90)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A92)
     A            SCNTWK    R        H      REFFLD(A92)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOT1C    R        H      REFFLD(CODE3)
     A            SCOT2C    R        H      REFFLD(CODE3)
     A            SCOTH2    R        H      REFFLD(A92)
     A            SCOTHR    R        H      REFFLD(A92)
     A            SCPAID    R        H      REFFLD(A92)
     A            SCPODS    R        H      REFFLD(DS30)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRULE    R        H      REFFLD(A90)
     A            SCRVCD    R        H      REFFLD(RVCD)
     A            SCSEQ#    R        H      REFFLD(SEQ#)
     A            SCTDAT    R        H      REFFLD(DT8)
     A            SCTOTC    R        H      REFFLD(A92)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C5    SCEDIC7    MCR05-
     A                                      03C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     17RERRMSGID  5    C5    SCE-
     A                                      DIC7    MCR0999C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     18')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN1-
     A                                      7","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-10"},"items":[{"i-
     A                                      d":"SCR02_HREC","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HREC","designValu-
     A                                      e":"[HREC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCR02","field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      m Dialog","text align":"center","le-
     A                                      ft":"5px","top":"5px","height":"370-
     A                                      px","width":"324px","z index":"8","-
     A                                      locked in place":"true"},{"id":"con-
     A                                      stant42","field type":"output field-
     A                                      ","value":"****** ERROR ******","cs-
     A                                      s class":"constant","left":"85px","-
     A                                      cursor column":"10","top":"65px","c-
     A                                      ursor row":"1","css class 2":"profo-
     A                                      und-converted"},{"id":"constant43",-
     A                                      "field type":"output field","value"-
     A                                      :"You have marked the data submissi-
     A                                      on","css class":"constant","left":"-
     A                                      29px","cursor column":"2","top":"85-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt44","field type":"output field","-
     A                                      value":"flag.  The Date of Service -
     A                                      is a","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      105px","cursor row":"3","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant45","field type":"output field-
     A                                      ","value":"future date and disquali-
     A                                      fies this","css class":"constant","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"125px","cursor row":"4","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant46","field')
     A                                  1  2HTML(' type":"output field","value"-
     A                                      :"claim for data submission.  Pleas-
     A                                      e","css class":"constant","left":"2-
     A                                      9px","cursor column":"2","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt47","field type":"output field","-
     A                                      value":"correct the flag.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant48","fiel-
     A                                      d type":"output field","value":"Eli-
     A                                      gible for Data Submission:","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"205px","curso-
     A                                      r row":"8","css class 2":"profound--
     A                                      converted"},{"id":"SCEDI","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCEDI","designValue":"[SC-
     A                                      EDI]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"239px","cursor column":"32","top"-
     A                                      :"205px","cursor row":"8","width":"-
     A                                      8px","css class 3":"HI","set focus"-
     A                                      :{"fieldName":"17 or 18","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"17","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0999","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"18","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"css class 4":"profound-co-
     A                                      nverted"},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"330px","width":"80px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF12","field type":"butt-
     A                                      on","value":"Cancel","shortcut key"-
     A                                      :"F12","left":"104px","top":"330px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCEDI     R        H      REFFLD(FLAG)
     A          R SCR03
     A  08 10 11
     A  12 13 21
     A  22 23 25                            CA01(08 'Response Indicator *IN08')
     A  26 27 19
     A  20                                  CA02(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(12 'Response Indicator *IN12')
     A                                      SETOF(13 'Response Indicator *IN13')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC26   RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C6    SCCRDTC7    MC40-
     A                                      144C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     19 26RERRMSGID  5    C6   -
     A                                       SCCRDTC7    MCR0500C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     19 21RERR-
     A                                      MSGID  5    C6    SCCRDTC7    MCR05-
     A                                      56C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     19 10RERRMSGID  5    C6    -
     A                                      SCCRDTC7    MC40056C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     19 22RERRM-
     A                                      SGID  5    C6    SCCRDTC7    MC4014-
     A                                      5C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     19 23RERRMSGID  5    C6    S-
     A                                      CCRDTC7    MCR2397C6    FSMESGC5   -
     A                                       *LIBLC0    E1    6     19 25RERRMS-
     A                                      GID  5    C6    SCRRDTC7    MC40144-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      6     20 26RERRMSGID  5    C6    SC-
     A                                      RRDTC7    MCR0500C6    FSMESGC5    -
     A                                      *LIBLC0    E1    6     20 21RERRMSG-
     A                                      ID  5    C6    SCRRDTC7    MCR0556C-
     A                                      6    FSMESGC5    *LIBLC0    E1    6-
     A                                           20 10RERRMSGID  5    C6    SCR-
     A                                      RDTC7    MC40056C6    FSMESGC5    *-
     A                                      LIBLC0    E1    6     20 22RERRMSGI-
     A                                      D  5    C6    SCRRDTC7    MC40145C6-
     A                                          FSMESGC5    *LIBLC0    E1    6 -
     A                                          20 23RERRMSGID  5    C6    SCRR-
     A                                      DTC7    MCR2397C6    FSMESGC5    *L-
     A                                      IBLC0    E1    6     20 25RERRMSGID-
     A                                        5    C6    SCCSDTC7    MCR0500C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         19 21RERRMSGID  5    C6    SCCSD-
     A                                      TC7    MC40202C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     19 08RERRMSGID -
     A                                       5    C6    SCCSDTC7    MC40056C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        19 13RERRMSGID  5    C6    SCCSDT-
     A                                      C7    MC40145C6    FSMESGC5    *LIB-
     A                                      LC0    E1    6     19 12RERRMSGID  -
     A                                      5    C6    SCCSDTC7    MCR2397C6   -
     A                                       FSMESGC5    *LIBLC0    E1    6    -
     A                                       19 11RERRMSGID  5    C6    SCCSDTC-
     A                                      7    MCR0500C6    FSMESGC5    *LIBL-
     A                                      C0    E1    6     19 27RERRMSGID  5-
     A                                          C6    SCRSDTC7    MCR0500C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      20 21RERRMSGID  5    C6    SCRSDTC7-
     A                                          MC40202C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     20 08RERRMSGID  5 -
     A                                         C6    SCRSDTC7    MC40056C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     2-
     A                                      0 13RERRMSGID  5    C6    SCRSDTC7 -
     A                                         MC40145C6    FSMESGC5    *LIBLC0-
     A                                          E1    6     20 12RERRMSGID  5  -
     A                                        C6    SCRSDTC7    MCR2397C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     20-
     A                                       11RERRMSGID  5    C6    SCRSDTC7  -
     A                                        MCR0500C6    FSMESGC5    *LIBLC0 -
     A                                         E1    6     20 27')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN0-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN10",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 3":{"fieldName":"*IN11","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 4":{"fieldName":"*IN12","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 5":{"fieldName":"*IN13","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 6-
     A                                      ":{"fieldName":"*IN21","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 7":{-
     A                                      "fieldName":"*IN22","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 8":{"fi-
     A                                      eldName":"*IN23","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 9":{"field-
     A                                      Name":"*IN25","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 10":{"fieldNa-
     A                                      me":"*IN26","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 11":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-10"},"i-
     A                                      tems":[{"id":"SCR03_HREC","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"HREC","-
     A                                      designValue":"[HREC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCR03_HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR03"-
     A                                      ,"field type":"panel","panel style"-
     A                                      :"Transform Dialog","text align":"c-
     A                                      enter","left":"5px","top":"5px","he-
     A                                      ight":"370px","width"')
     A                                  1  2HTML(':"324px","z index":"8","locke-
     A                                      d in place":"true"},{"id":"constant-
     A                                      49","field type":"output field","va-
     A                                      lue":"****** ERROR ******","css cla-
     A                                      ss":"constant","left":"85px","curso-
     A                                      r column":"10","top":"65px","cursor-
     A                                       row":"1","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant54","fiel-
     A                                      d type":"output field","value":"Dat-
     A                                      e Recon rcvd/sent must be greater",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "85px","cursor row":"2","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant50","field type":"output field-
     A                                      ","value":"Date Bill rcvd/sent must-
     A                                       be greater","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"19","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"29px","cursor colum-
     A                                      n":"2","top":"85px","cursor row":"2-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant55","field type":-
     A                                      "output field","value":"than or equ-
     A                                      al to \"To date of Service\".","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      9px","cursor column":"2","top":"105-
     A                                      px","cursor row":"3","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt51","field type":"output field","-
     A                                      value":"than or equal to \"To date -
     A                                      of Service\".","css class":"constan-
     A                                      t","visibility":{"fieldName":"19","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"29px","cursor col-
     A                                      umn":"2","top":"105px","cursor row"-
     A                                      :"3","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant56","field typ-
     A                                      e":"output field","value":"Date rec-
     A                                      on rcvd by carrier: ","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"20","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"29px","cur-
     A                                      sor column":"2","top":"145px","curs-
     A                                      or row":"5","css class 2":"profound-
     A                                      -converted"},{"id":"constant52","fi-
     A                                      eld type":"output field","value":"D-
     A                                      ate bill rcvd by carrier: ","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"19","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"29px-
     A                                      ","cursor column":"2","top":"145px"-
     A                                      ,"cursor row":"5","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCRDT","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCCRDT","de-
     A                                      signValue":"[SCCRDT]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units"')
     A                                  1  2HTML(':"","negNum":"-999.00","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"visibility":{"fieldName":"1-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"225px","curso-
     A                                      r column":"30","top":"145px","curso-
     A                                      r row":"5","width":"71px","css clas-
     A                                      s 3":{"fieldName":"19","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"err-
     A                                      or message id":"MC40144","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"19 and 26","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"6 messages","error message -
     A                                      id 2":"MCR0500","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"19 and 21","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 3":"MCR0556","error message fi-
     A                                      le 3":"FSMESG","error message libra-
     A                                      ry 3":"*LIBL","error condition 3":{-
     A                                      "fieldName":"19 and 10","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 4":"MC40056","error message -
     A                                      file 4":"FSMESG","error message lib-
     A                                      rary 4":"*LIBL","error condition 4"-
     A                                      :{"fieldName":"19 and 22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 5":"MC40145","error messag-
     A                                      e file 5":"FSMESG","error message l-
     A                                      ibrary 5":"*LIBL","error condition -
     A                                      5":{"fieldName":"19 and 23","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 6":"MCR2397","error mess-
     A                                      age file 6":"FSMESG","error message-
     A                                       library 6":"*LIBL","error conditio-
     A                                      n 6":{"fieldName":"19 and 25","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"SCRRDT","field type":"date field-
     A                                      ","css class":"input","css class 2"-
     A                                      :"date-field","value":{"fieldName":-
     A                                      "SCRRDT","designValue":"[SCRRDT]","-
     A                                      refField":"DT8","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''","dateFormat":"m/d/Y"},"-
     A                                      visibility":{"fieldName":"20","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"254px","cursor column-
     A                                      ":"31","top":"145px","cursor row":"-
     A                                      5","width":"71px","css class 3":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"error messa-
     A                                      ge id":"MC40144","error message fil-
     A                                      e":"FSMESG","error me')
     A                                  1  2HTML('ssage library":"*LIBL","error-
     A                                       condition":{"fieldName":"20 and 26-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"6 messages","er-
     A                                      ror message id 2":"MCR0500","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"20 and 21","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 3":"MCR0556","erro-
     A                                      r message file 3":"FSMESG","error m-
     A                                      essage library 3":"*LIBL","error co-
     A                                      ndition 3":{"fieldName":"20 and 10"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 4":"MC40056","er-
     A                                      ror message file 4":"FSMESG","error-
     A                                       message library 4":"*LIBL","error -
     A                                      condition 4":{"fieldName":"20 and 2-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 5":"MC40145","-
     A                                      error message file 5":"FSMESG","err-
     A                                      or message library 5":"*LIBL","erro-
     A                                      r condition 5":{"fieldName":"20 and-
     A                                       23","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 6":"MCR2397"-
     A                                      ,"error message file 6":"FSMESG","e-
     A                                      rror message library 6":"*LIBL","er-
     A                                      ror condition 6":{"fieldName":"20 a-
     A                                      nd 25","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"css class 4":"profound-conv-
     A                                      erted"},{"id":"constant53","field t-
     A                                      ype":"output field","value":"Date b-
     A                                      ill sent to carrier: ","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"19","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"29px","cu-
     A                                      rsor column":"2","top":"185px","cur-
     A                                      sor row":"7","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant57","f-
     A                                      ield type":"output field","value":"-
     A                                      Date recon sent to carrier:","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"20","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"29p-
     A                                      x","cursor column":"2","top":"185px-
     A                                      ","cursor row":"7","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCCSDT",-
     A                                      "field type":"date field","css clas-
     A                                      s":"input","css class 2":"date-fiel-
     A                                      d","value":{"fieldName":"SCCSDT","d-
     A                                      esignValue":"[SCCSDT]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","edtWrd":"''  /  /    ''"-
     A                                      ,"dateFormat":"m/d/Y"},"visibility"-
     A                                      :{"fieldName":"19","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"225px","cursor column":"30","top-
     A                                      ":"185px","cursor row":"7","width":-
     A                                      "71px","css class 3":{"fieldName":"-
     A                                      19","dataType":"expre')
     A                                  1  2HTML('ssion","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"er-
     A                                      ror message id":"MCR0500","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"19 and 21","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"6 messages","error message-
     A                                       id 2":"MC40202","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"19 and 08","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 3":"MC40056","error message f-
     A                                      ile 3":"FSMESG","error message libr-
     A                                      ary 3":"*LIBL","error condition 3":-
     A                                      {"fieldName":"19 and 13","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 4":"MC40145","error message-
     A                                       file 4":"FSMESG","error message li-
     A                                      brary 4":"*LIBL","error condition 4-
     A                                      ":{"fieldName":"19 and 12","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 5":"MCR2397","error messa-
     A                                      ge file 5":"FSMESG","error message -
     A                                      library 5":"*LIBL","error condition-
     A                                       5":{"fieldName":"19 and 11","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 6":"MCR0500","error mes-
     A                                      sage file 6":"FSMESG","error messag-
     A                                      e library 6":"*LIBL","error conditi-
     A                                      on 6":{"fieldName":"19 and 27","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"SCRSDT","field type":"date fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"date-field","value":{"fieldName"-
     A                                      :"SCRSDT","designValue":"[SCRSDT]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "visibility":{"fieldName":"20","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"254px","cursor colum-
     A                                      n":"31","top":"185px","cursor row":-
     A                                      "7","width":"71px","css class 3":{"-
     A                                      fieldName":"20","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"error mess-
     A                                      age id":"MCR0500","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"20 and 21","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "6 messages","error message id 2":"-
     A                                      MC40202","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"20 and 08","dataT')
     A                                  1  2HTML('ype":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 3":"MC40056","err-
     A                                      or message file 3":"FSMESG","error -
     A                                      message library 3":"*LIBL","error c-
     A                                      ondition 3":{"fieldName":"20 and 13-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 4":"MC40145","e-
     A                                      rror message file 4":"FSMESG","erro-
     A                                      r message library 4":"*LIBL","error-
     A                                       condition 4":{"fieldName":"20 and -
     A                                      12","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 5":"MCR2397",-
     A                                      "error message file 5":"FSMESG","er-
     A                                      ror message library 5":"*LIBL","err-
     A                                      or condition 5":{"fieldName":"20 an-
     A                                      d 11","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error message id 6":"MCR0500-
     A                                      ","error message file 6":"FSMESG","-
     A                                      error message library 6":"*LIBL","e-
     A                                      rror condition 6":{"fieldName":"20 -
     A                                      and 27","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"css class 4":"profound-con-
     A                                      verted"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"330px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field type":"butto-
     A                                      n","value":"Cancel","shortcut key":-
     A                                      "F12","left":"104px","top":"330px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCCRDT    R        H      REFFLD(DT8)
     A            SCCSDT    R        H      REFFLD(DT8)
     A            SCRRDT    R        H      REFFLD(DT8)
     A            SCRSDT    R        H      REFFLD(DT8)
