     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  46 48 49
     A  51 52 53
     A  54 58 59                            CA01(46 'Response Indicator *IN46')
     A  70 91 92
     A  09 30 29
     A  23 31 32                            CA02(48 'Response Indicator *IN48')
     A  33 34 35
     A  36 38 39
     A  41 42 43                            CA03(49 'Response Indicator *IN49')
     A  44 45 47
     A  65 66 67
     A  68 69 71                            CA04(51 'Response Indicator *IN51')
     A  72 73 74
     A  75 76 77
     A  78 79 80                            CA05(52 'Response Indicator *IN52')
     A  81 82 83
     A  84 85 86
     A  87 88 89                            CA06(53 'Response Indicator *IN53')
     A  93 94                               CA07(54 'Response Indicator *IN54')
     A                                      SETOF(58 'Response Indicator *IN58')
     A                                      SETOF(59 'Response Indicator *IN59')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                      SETOF(92 'Response Indicator *IN92')
     A                                  1  2HTML('QPUIREC46   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCSPCDC7    MCR0-
     A                                      441C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     70RERRMSGID  5    C7    SC-
     A                                      FZIP FMSFZIP    C6    FSMESGC5    *-
     A                                      LIBLC0    FERFZIP    RERRMSGID  5  -
     A                                        C6    SCACCTC7    MCR0676C6    FS-
     A                                      MESGC5    *LIBLC0    E1    12   N51-
     A                                       52 53 54RERRMSGID  5    C6    SCDI-
     A                                      A1C7    MCR2383C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     73RERRMSGID  5-
     A                                          C6    SCDIA1C7    MCR0503C6    -
     A                                      FSMESGC5    *LIBLC0    E1    3     -
     A                                      45RERRMSGID  5    C6    SCBLTYC7   -
     A                                       MCR2441C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     71RERRMSGID  5    C6 -
     A                                         SCBLTYC7    MCR0503C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     49RERRM-
     A                                      SGID  5    C6    SCSCPFC7    MCR050-
     A                                      0C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     74RERRMSGID  5    C6    SCSC-
     A                                      PFC7    MC40056C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     76RERRMSGID  5-
     A                                          C6    SCSCPFC7    MCR2397C6    -
     A                                      FSMESGC5    *LIBLC0    E1    3     -
     A                                      81RERRMSGID  5    C6    SCSCPFC7   -
     A                                       MCR2413C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     83RERRMSGID  5    C6 -
     A                                         SCSCPFC7    MCR2404C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     84RERRM-
     A                                      SGID  5    C6    SCSCPFC7    MCR067-
     A                                      6C6    FSMESGC5    *LIBLC0    E1   -
     A                                       12    51N52N53N54RERRMSGID  5    C-
     A                                      6    SCSCPTC7    MCR0500C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     75RER-
     A                                      RMSGID  5    C6    SCSCPTC7    MC40-
     A                                      056C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     80RERRMSGID  5    C6    SC-
     A                                      SCPTC7    MCR2397C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     82RERRMSGID -
     A                                       5    C6    SCSCPTC7    MCR2404C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        84RERRMSGID  5    C6    SCSCPTC7 -
     A                                         MCR0676C6    FSMESGC5    *LIBLC0-
     A                                          E1    12   N51 52N53N54RERRMSGI-
     A                                      D  5    C6    SCADDTC7    MCR0500C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          72RERRMSGID  5    C6    SCADDTC-
     A                                      7    MC40056C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     77RERRMSGID  5   -
     A                                       C6    SCADDTC7    MCR2397C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     85R-
     A                                      ERRMSGID  5    C6    SCADDTC7    MC-
     A                                      R0676C6    FSMESGC5    *LIBLC0    E-
     A                                      1    12   N51N52 53N54RERRMSGID  5 -
     A                                         C6    SCADHRC7    MC40146C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     8-
     A                                      6RERRMSGID  5    C6    SCADHRC7    -
     A                                      MCR0676C6    FSMESGC5    *LIBLC0   -
     A                                       E1    12   N51N52N53 54RERRMSGID  -
     A                                      5    C6    SCDCDTC7    MCR0500C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       58RERRMSGID  5    C6    SCDCDTC7  -
     A                                        MC40275C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     59RERRMSGID  5    C6-
     A                                          SCDCDTC7    MC40056C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     48RERR-
     A                                      MSGID  5    C6    SCDCDTC7    MCR06-
     A                                      76C6    FSMESGC5    *LIBLC0    E1  -
     A                                        12    51 52N53N54RERRMSGID  5    -
     A                                      C6    SCDCHRC7    MC40146')
     A                                  1  2HTML('QPUIC6    FSMESGC5    *LIBLC0-
     A                                          E1    3     87RERRMSGID  5    C-
     A                                      6    SCDCHRC7    MCR0676C6    FSMES-
     A                                      GC5    *LIBLC0    E1    12   N51 52-
     A                                       53N54RERRMSGID  5    C6    SCSBDTC-
     A                                      7    MCR0500C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     88RERRMSGID  5   -
     A                                       C6    SCSBDTC7    MC40056C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     89R-
     A                                      ERRMSGID  5    C6    SCSBDTC7    MC-
     A                                      R0676C6    FSMESGC5    *LIBLC0    E-
     A                                      1    12   N51N52 53 54RERRMSGID  5 -
     A                                         C6    SCCNTYC7    MCR0503C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     9-
     A                                      1RERRMSGID  5    C6    SCCNTYC7    -
     A                                      MCR2434C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     93RERRMSGID  5    C5  -
     A                                        SCICNC7    MCR2441C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     38RERRMSG-
     A                                      ID  5    C5    SCICNC7    MC40280C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          41RERRMSGID  5    C5    SCICNC7-
     A                                          MC40281C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     46RERRMSGID  5    -
     A                                      C5    SCICNC7    MCR0503C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     67RER-
     A                                      RMSGID  5    C5    SCDCNC7    MCR24-
     A                                      41C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     39RERRMSGID  5    C5    SCE-
     A                                      DIC7    MCR0503C6    FSMESGC5    *L-
     A                                      IBLC0    E1    6     78 30RERRMSGID-
     A                                        5    C5    SCEDIC7    MCR0999C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        79 30RERRMSGID  5    C5    SCEDIC-
     A                                      7    MCR0676C6    FSMESGC5    *LIBL-
     A                                      C0    E1    12    51N52N53 54RERRMS-
     A                                      GID  5    C6    SCSPRTC7    MC40428-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     92')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN46","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN48","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN49","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN51","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN52","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN53","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN54","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN58","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN59","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N70","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN9-
     A                                      1","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN92"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "assume":"true","return cursor reco-
     A                                      rd":{"fieldName":"HREC","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"return cursor field":{"fie-
     A                                      ldName":"HFLD","dataLength":"10","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      overlay range":"1-23"},"items":[{"i-
     A                                      d":"F0361FMA_SCR01_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"F0361FMA_SCR01_a-
     A                                      ction","field type":"html container-
     A                                      ","white space":"normal","left":"0p-
     A                                      x","top":"10px","width":"230px","cs-
     A                                      s class":"action-panel-converted","-
     A                                      height":"700px","html":"<div class=-
     A                                      \"top\"></div><div class=\"imagetop-
     A                                      \"><img src=\"/profoundui/userdata/-
     A                                      images/bar_top.png\" /></div><div c-
     A                                      lass=\"menulinks\"></div><div class-
     A                                      =\"imagebottom\"><img')
     A                                  1  2HTML(' src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","id":"F036-
     A                                      1FMA_SCR01_BtnIconMenuSystemTools"}-
     A                                      ,{"field type":"panel","panel style-
     A                                      ":"TransformButtonBar","id":"F0361F-
     A                                      MA_SCR01_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"F0361FMA_SCR01_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1066px","id":"F0361FMA_SC-
     A                                      R01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"F0361FMA_SCR01_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"F0361FMA-
     A                                      _SCR01_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill"')
     A                                  1  2HTML(':"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1144p-
     A                                      x","id":"F0361FMA_SCR01_BtnSystemMe-
     A                                      ssages","tool tip":"System Messages-
     A                                      ","onclick":"SystemToolbarMessages"-
     A                                      ,"background image":{"fieldName":"M-
     A                                      sgIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"F0361FMA_SCR01_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"F0361FMA_SCR01_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"F0361FMA_SCR01_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0361F-
     A                                      MA_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      1","field type":"output field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"F0361FMA_SCR0-
     A                                      1_MainTabPanel","pare')
     A                                  1  2HTML('nt tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCCONM","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCCONM","designValue"-
     A                                      :"[SCCONM]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"414px","cursor column":"21","top"-
     A                                      :"110px","cursor row":"1","css clas-
     A                                      s 2":"top-line","css class 3":"HI",-
     A                                      "parent tab panel":"F0361FMA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"constant2","field type":"output-
     A                                       field","left":"778px","cursor colu-
     A                                      mn":"73","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentDate()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      F0361FMA_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"F0361FMA_SCR01_f-
     A                                      keyMenu","field type":"menu","left"-
     A                                      :"10px","top":"120px","height":"350-
     A                                      px","width":"230px","hover backgrou-
     A                                      nd color":"#9AAA61","hover text col-
     A                                      or":"#FFFFFF","border color":"#4C61-
     A                                      06","menu option indent":"10px","ba-
     A                                      ckground color":"#758B27","css clas-
     A                                      s":"action-menu","css class 2":"sta-
     A                                      tionary","z index":"101"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0361FMA_SCR01_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValue":"[Q1PG-
     A                                      M]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"F03-
     A                                      61FMA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCAST","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCAST","designValue":"[SCAST]","-
     A                                      refField":"ST","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"358px","curso-
     A                                      r column":"13","top":"130px","curso-
     A                                      r row":"2","css class 2":"HI","pare-
     A                                      nt tab panel":"F0361FMA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CZIPA","field type":"output field",-
     A                                      "value":{"fieldName":"SCZIPA","desi-
     A                                      gnValue":"[SCZIPA]","refField":"ZIP-
     A                                      A","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeadi')
     A                                  1  2HTML('ng":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"379px-
     A                                      ","cursor column":"16","top":"130px-
     A                                      ","cursor row":"2","css class 2":"H-
     A                                      I","parent tab panel":"F0361FMA_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCPRDS","field type":"output-
     A                                       field","value":{"fieldName":"SCPRD-
     A                                      S","designValue":"[SCPRDS]","refFie-
     A                                      ld":"NAME","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"414px","cursor co-
     A                                      lumn":"21","top":"130px","cursor ro-
     A                                      w":"2","css class 2":"HI","parent t-
     A                                      ab panel":"F0361FMA_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","visibility":-
     A                                      "hidden","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant3","field -
     A                                      type":"output field","value":"SCR01-
     A                                      ","css class":"constant","left":"79-
     A                                      9px","cursor column":"76","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"F0361FMA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"SCMODE","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCMODE","designValue":"[SCMOD-
     A                                      E]","refField":"PGM","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"764px",-
     A                                      "cursor column":"71","top":"150px",-
     A                                      "cursor row":"3","css class 2":"HI"-
     A                                      ,"parent tab panel":"F0361FMA_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0361FMA_SCR01-
     A                                      _BtnHiddenSearch","value":"btnSearc-
     A                                      h","top":"150px","response":{"field-
     A                                      Name":"btnSearch","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCHD1","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCHD1","designValue":"[-
     A                                      SCHD1]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"78"},"css cl-
     A                                      ass":"output-field","left":"281px",-
     A                                      "cursor column":"2","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "F0361FMA_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"butto')
     A                                  1  2HTML('n","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0361FMA_SCR01-
     A                                      _BtnHiddenDiaryItems","value":"btnD-
     A                                      iary","top":"175px","response":{"fi-
     A                                      eldName":"btnDiary","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"btnCF03"-
     A                                      ,"field type":"button","visibility"-
     A                                      :{"fieldName":"N09 or 09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":"Exit","shortcut key":"F3-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"SCHD2","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCHD2","designValue":-
     A                                      "[SCHD2]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none","dataLength":"78"},"css -
     A                                      class":"output-field","left":"281px-
     A                                      ","cursor column":"2","top":"190px"-
     A                                      ,"cursor row":"5","parent tab panel-
     A                                      ":"F0361FMA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0361FMA_SCR01_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCHD3","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCHD3","designValue":"[SCHD3]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"78"},"css class":"ou-
     A                                      tput-field","left":"281px","cursor -
     A                                      column":"2","top":"210px","cursor r-
     A                                      ow":"6","parent tab panel":"F0361FM-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"btnCF10","field type":"-
     A                                      button","visibility":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":"Search","s-
     A                                      hortcut key":"F10","left":"14px","t-
     A                                      op":"216px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0361FMA_S-
     A                                      CR01_BtnHiddenWorkSubmitJob","value-
     A                                      ":"btnWrksbmjob","top":"225px","res-
     A                                      ponse":{"fieldName":"btnWrkJob","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant4","field type":"output-
     A                                       field","value":"EOMB#:","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"2')
     A                                  1  2HTML('30px","cursor row":"7","paren-
     A                                      t tab panel":"F0361FMA_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      EOB#","field type":"output field","-
     A                                      value":{"fieldName":"SCEOB#","desig-
     A                                      nValue":"[SCEOB#]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00","dataLength":"9"-
     A                                      ,"decPos":"0"},"css class":"output--
     A                                      field","left":"330px","cursor colum-
     A                                      n":"9","top":"230px","cursor row":"-
     A                                      7","width":"63px","text align":"rig-
     A                                      ht","parent tab panel":"F0361FMA_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant5","field type":"ou-
     A                                      tput field","value":"Specialty:","c-
     A                                      ss class":"constant","left":"414px"-
     A                                      ,"cursor column":"21","top":"230px"-
     A                                      ,"cursor row":"7","parent tab panel-
     A                                      ":"F0361FMA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCSPCD","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCSPCD","designValue"-
     A                                      :"[SCSPCD]","refField":"SPEC","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"491px","cursor column":"32"-
     A                                      ,"top":"230px","cursor row":"7","wi-
     A                                      dth":"22px","css class 3":{"fieldNa-
     A                                      me":"N29 and N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"29 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 4":{"fieldName":"29 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "36","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"MCR-
     A                                      0441","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"70","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","parent-
     A                                       tab panel":"F0361FMA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      5":"profound-converted","tab index"-
     A                                      :"1"},{"id":"SCSCDS","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCSCDS","designValue":"[SCSCDS]","-
     A                                      refField":"DS30","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"519px","cur-
     A                                      sor column":"36","top":"230px","cur-
     A                                      sor row":"7","parent tab panel":"F0-
     A                                      361FMA_SCR01_MainTabP')
     A                                  1  2HTML('anel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant6a","field type":"output -
     A                                      field","css class":"constant","valu-
     A                                      e":"Fac Zip Code:","cursor row":"7"-
     A                                      ,"cursor column":"47","left":"730px-
     A                                      ","top":"230px","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFZIP ","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","value":{"fieldName":"SCFZIP"-
     A                                      ,"refField":"ZIP1","numSep":"false"-
     A                                      ,"zeroBalance":"false","numBlankFil-
     A                                      l":"false","zeroFill":"false","noEx-
     A                                      traSpaces":"false","curSym":"","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","negNum":"999.00","units":"",-
     A                                      "designValue":"[SCFZIP]"},"read onl-
     A                                      y":{"fieldName":"29 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      set focus":{"fieldName":"23","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"cursor row":"7","cursor column":"-
     A                                      61","error messages":"1 message","l-
     A                                      eft":"820px","top":"230px","width":-
     A                                      "36px","css class 2":"textbox","css-
     A                                       class 3":{"fieldName":"N29 and N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N29 and N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"css class -
     A                                      5":{"fieldName":"29 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 6":"profound-converted",-
     A                                      "tab index":"2","error message id":-
     A                                      {"fieldName":"msfzip","dataLength":-
     A                                      "10","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"},"error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "erfzip","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode":"0"},{"-
     A                                      id":"constantdash","field type":"ou-
     A                                      tput field","css class":"constant",-
     A                                      "value":"-","cursor row":"7","curso-
     A                                      r column":"68","left":"865px","top"-
     A                                      :"230px","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCZIP4","field typ-
     A                                      e":"textbox","css class":"input","v-
     A                                      alue":{"fieldName":"SCZIP","dataLen-
     A                                      gth":"4","decPos":"0","numSep":"fal-
     A                                      se","zeroBalance":"false","numBlank-
     A                                      Fill":"false","zeroFill":"false","n-
     A                                      oExtraSpaces":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"999.00","units":"","-
     A                                      designValue":"[SCZIP]"},"read only"-
     A                                      :{"fieldName":"29 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true')
     A                                  1  2HTML(' / false"},"cursor row":"7","-
     A                                      cursor column":"61","left":"875px",-
     A                                      "top":"230px","width":"32px","css c-
     A                                      lass 2":"textbox","css class 3":{"f-
     A                                      ieldName":"N29 and N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"29 or 09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":"profound-con-
     A                                      verted","tab index":"2"},{"id":"con-
     A                                      stant6","field type":"output field"-
     A                                      ,"value":"Ntwk:","css class":"const-
     A                                      ant","visibility":{"fieldName":"69"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"925px","cursor -
     A                                      column":"69","top":"230px","cursor -
     A                                      row":"7","parent tab panel":"F0361F-
     A                                      MA_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCNWCD","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCNWCD","designValue":"[SCNWCD]","-
     A                                      refField":"NWCD","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","visibility":{"fiel-
     A                                      dName":"69","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"965p-
     A                                      x","cursor column":"75","top":"230p-
     A                                      x","cursor row":"7","parent tab pan-
     A                                      el":"F0361FMA_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCACCT","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCACCT","designValu-
     A                                      e":"[SCACCT]","refField":"DS30","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"555px","cursor column":"4-
     A                                      1","top":"270px","cursor row":"9","-
     A                                      width":"211px","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"33","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"MCR0676","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL",')
     A                                  1  2HTML('"error condition":{"fieldName-
     A                                      ":"N51 and 52 and 53 and 54","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","parent tab -
     A                                      panel":"F0361FMA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted","tab index":"2"}-
     A                                      ,{"id":"btnCF11","field type":"butt-
     A                                      on","visibility":{"fieldName":"N09 -
     A                                      or 09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"value":"EOB/Note-
     A                                      s","shortcut key":"F11","left":"14p-
     A                                      x","top":"249px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"constant7","field typ-
     A                                      e":"output field","value":"EOB/Note-
     A                                      s attached","css class":"constant",-
     A                                      "visibility":{"fieldName":"68","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"694px","cursor colum-
     A                                      n":"61","top":"250px","cursor row":-
     A                                      "8","css class 2":{"fieldName":"68"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"RI","customFa-
     A                                      lse":""},"parent tab panel":"F0361F-
     A                                      MA_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0361F-
     A                                      MA_SCR01_BtnHiddenWorkPrinterOutput-
     A                                      ","value":"btnWrkprtout","top":"250-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Prnt","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant8","field type-
     A                                      ":"output field","value":"Patient c-
     A                                      ontrol number             :","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"270px","cur-
     A                                      sor row":"9","parent tab panel":"F0-
     A                                      361FMA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant51","field-
     A                                       type":"output field","css class":"-
     A                                      constant","value":"ICD 10  :","curs-
     A                                      or row":"9","cursor column":"4","le-
     A                                      ft":"775px","top":"270px","parent t-
     A                                      ab panel":"F0361FMA_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"scICD-
     A                                      ind","field type":"checkbox","css c-
     A                                      lass":"input","value":{"fieldName":-
     A                                      "scICDInd","dataLength":"1","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scICDInd]"},"left":"-
     A                                      840px","top":"270px","css class 2":-
     A                                      "checkbox","parent tab panel":"F036-
     A                                      1FMA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","text transform":"uppercase"-
     A                                      ,"checked value":"Y","unchecked val-
     A                                      ue":"N","disabled":{"')
     A                                  1  2HTML('fieldName":"dspICdind","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "tab index":"3"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0361FMA_SCR01_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"btnCF12","field type":-
     A                                      "button","visibility":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":"Cancel","s-
     A                                      hortcut key":"F12","left":"14px","t-
     A                                      op":"282px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"constant9","field type":"o-
     A                                      utput field","value":"Principal dia-
     A                                      gnosis code           :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"290px","cursor -
     A                                      row":"10","parent tab panel":"F0361-
     A                                      FMA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCDIA1","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCDIA1","refField":"DS7","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"reference","-
     A                                      formatting":"Text","textTransform":-
     A                                      "uppercase","designValue":"[SCDIA1]-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"554px","cursor column":"41","t-
     A                                      op":"290px","cursor row":"10","widt-
     A                                      h":"55px","css class 3":"HI","css c-
     A                                      lass 4":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"set focus":{"fieldName":"34-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"error message id":"MCR238-
     A                                      3","error message file":"FSMESG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"73","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"2 messages","error me-
     A                                      ssage id 2":"MCR0503","error messag-
     A                                      e file 2":"FSMESG","error message l-
     A                                      ibrary 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"45","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"parent tab pa-
     A                                      nel":"F0361FMA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css')
     A                                  1  2HTML(' class 6":"profound-converted-
     A                                      ","tab index":"4","text align":"lef-
     A                                      t"},{"id":"SCD1DS","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CD1DS","designValue":"[SCD1DS]","re-
     A                                      fField":"DS30","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"620px","curso-
     A                                      r column":"48","top":"290px","curso-
     A                                      r row":"10","css class 2":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"F0361FMA_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0361FMA_SCR01_BtnHiddenHelp","va-
     A                                      lue":"btnHelp","top":"300px","respo-
     A                                      nse":{"fieldName":"btnHelp","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant10","field type":"output fi-
     A                                      eld","value":"Total charge         -
     A                                                    :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"310px","cursor row":"11-
     A                                      ","parent tab panel":"F0361FMA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCCHRG","field type":"output -
     A                                      field","value":{"fieldName":"SCCHRG-
     A                                      ","designValue":"[SCCHRG]","refFiel-
     A                                      d":"A112","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00"},"css class":"output--
     A                                      field","left":"554px","cursor colum-
     A                                      n":"41","top":"310px","cursor row":-
     A                                      "11","width":"91px","text align":"r-
     A                                      ight","css class 2":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"parent tab panel":"F036-
     A                                      1FMA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant11","field t-
     A                                      ype":"output field","value":"Reduct-
     A                                      ions","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "330px","cursor row":"12","parent t-
     A                                      ab panel":"F0361FMA_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCHMR-
     A                                      A_DOT","field type":"output field",-
     A                                      "value":{"fieldName":"SCHMRA_DOT","-
     A                                      designValue":"[SCHMRA_DOT]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"11"},"css class":"output-fi-
     A                                      eld","left":"372px","cursor column"-
     A                                      :"15","top":"330px","cursor row":"1-
     A                                      2","parent tab panel"')
     A                                  1  2HTML(':"F0361FMA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCHMRA",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCHMRA","designValue-
     A                                      ":"[SCHMRA]","refField":"DS10","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"463px","cursor column":"28","top-
     A                                      ":"330px","cursor row":"12","parent-
     A                                       tab panel":"F0361FMA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant12","field type":"output field-
     A                                      ","value":":","css class":"constant-
     A                                      ","left":"540px","cursor column":"3-
     A                                      9","top":"330px","cursor row":"12",-
     A                                      "parent tab panel":"F0361FMA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCMRA","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCMRA","d-
     A                                      esignValue":"[SCMRA]","refField":"A-
     A                                      112","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00"},"css class":"output-field-
     A                                      ","left":"554px","cursor column":"4-
     A                                      1","top":"330px","cursor row":"12",-
     A                                      "width":"91px","text align":"right"-
     A                                      ,"css class 2":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"parent tab panel":"F0361FMA_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCHNET","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      HNET","designValue":"[SCHNET]","ref-
     A                                      Field":"DS10","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"47","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"652px",-
     A                                      "cursor column":"55","top":"330px",-
     A                                      "cursor row":"12","parent tab panel-
     A                                      ":"F0361FMA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant13","-
     A                                      field type":"output field","value":-
     A                                      ":","css class":"constant","visibil-
     A                                      ity":{"fieldName":"47","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"729px","cursor column":"66",-
     A                                      "top":"330px","cursor row":"12","pa-
     A                                      rent tab panel":"F0361FMA_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCNTWK","field type":"output field-
     A                                      ","value":{"fieldName":"SCNTWK","de-
     A                                      signValue":"[SCNTWK]","refField":"A-
     A                                      112","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","ze')
     A                                  1  2HTML('roFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00"},"css -
     A                                      class":"output-field","visibility":-
     A                                      {"fieldName":"47","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"743px","cursor column":"68","top"-
     A                                      :"330px","cursor row":"12","width":-
     A                                      "91px","text align":"right","css cl-
     A                                      ass 2":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"p-
     A                                      arent tab panel":"F0361FMA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant14","field type":"output -
     A                                      field","value":"Reductions","css cl-
     A                                      ass":"constant","left":"295px","cur-
     A                                      sor column":"4","top":"350px","curs-
     A                                      or row":"13","parent tab panel":"F0-
     A                                      361FMA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCHOT1_DOT","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCHOT1_DOT","designValue":-
     A                                      "[SCHOT1_DOT]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"11"},-
     A                                      "css class":"output-field","left":"-
     A                                      372px","cursor column":"15","top":"-
     A                                      350px","cursor row":"13","parent ta-
     A                                      b panel":"F0361FMA_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCHOT1-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCHOT1","designVal-
     A                                      ue":"[SCHOT1]","refField":"DS10","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"463px","cursor column":"28","t-
     A                                      op":"350px","cursor row":"13","pare-
     A                                      nt tab panel":"F0361FMA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant15","field type":"output fie-
     A                                      ld","value":":","css class":"consta-
     A                                      nt","left":"540px","cursor column":-
     A                                      "39","top":"350px","cursor row":"13-
     A                                      ","parent tab panel":"F0361FMA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCOTHR","field type":"output -
     A                                      field","value":{"fieldName":"SCOTHR-
     A                                      ","designValue":"[SCOTHR]","refFiel-
     A                                      d":"A112","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00"},"css class":"output--
     A                                      field","left":"554px","cursor colum-
     A                                      n":"41","top":"350px","cursor row":-
     A                                      "13","width":"91px","text align":"r-
     A                                      ight","css class 2":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"parent tab panel":"F036-
     A                                      1FMA_SCR01_MainTabPan')
     A                                  1  2HTML('el","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCHOT2","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCHOT2","des-
     A                                      ignValue":"[SCHOT2]","refField":"DS-
     A                                      10","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"652px","cursor column":"-
     A                                      55","top":"350px","cursor row":"13"-
     A                                      ,"parent tab panel":"F0361FMA_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant16","field type":"outp-
     A                                      ut field","value":":","css class":"-
     A                                      constant","left":"729px","cursor co-
     A                                      lumn":"66","top":"350px","cursor ro-
     A                                      w":"13","parent tab panel":"F0361FM-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCOTH2","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCOTH2","designValue":"[SCOTH2]","r-
     A                                      efField":"A112","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00"},"css class":"o-
     A                                      utput-field","left":"743px","cursor-
     A                                       column":"68","top":"350px","cursor-
     A                                       row":"13","width":"91px","text ali-
     A                                      gn":"right","css class 2":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"F0361FMA_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant17","f-
     A                                      ield type":"output field","value":"-
     A                                      Total paid                         -
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"37-
     A                                      0px","cursor row":"14","parent tab -
     A                                      panel":"F0361FMA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPAID",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCPAID","designValue-
     A                                      ":"[SCPAID]","refField":"A112","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "554px","cursor column":"41","top":-
     A                                      "370px","cursor row":"14","width":"-
     A                                      91px","text align":"right","css cla-
     A                                      ss 2":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"pa-
     A                                      rent tab panel":"F0361FMA_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant18","field type":"output f-
     A                                      ield","value":"Type of Bill        -
     A                                                     :","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"390px","cursor row":"1-
     A                                      5","parent tab panel"')
     A                                  1  2HTML(':"F0361FMA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCBLTY",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCBLTY","designV-
     A                                      alue":"[SCBLTY]","refField":"CODE3"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"554px","cursor column-
     A                                      ":"41","top":"390px","cursor row":"-
     A                                      15","width":"22px","css class 3":{"-
     A                                      fieldName":"65 or 09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"set focus":{"fieldName":"3-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error message id":"MCR24-
     A                                      41","error message file":"FSMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"71","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"2 messages","error m-
     A                                      essage id 2":"MCR0503","error messa-
     A                                      ge file 2":"FSMESG","error message -
     A                                      library 2":"*LIBL","error condition-
     A                                       2":{"fieldName":"49","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"parent tab p-
     A                                      anel":"F0361FMA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted","tab index":"5"},-
     A                                      {"id":"SCBTDS","field type":"output-
     A                                       field","value":{"fieldName":"SCBTD-
     A                                      S","designValue":"[SCBTDS]","refFie-
     A                                      ld":"DS35","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"582px","cursor co-
     A                                      lumn":"45","top":"390px","cursor ro-
     A                                      w":"15","parent tab panel":"F0361FM-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant19","field type-
     A                                      ":"output field","value":"Date stat-
     A                                      ement covers from/to      :","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"410px","cur-
     A                                      sor row":"16","parent tab panel":"F-
     A                                      0361FMA_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCSCPF","field ty-
     A                                      pe":"date field","css class":"input-
     A                                      ","css class 2":"date-field","value-
     A                                      ":{"fieldName":"SCSCP')
     A                                  1  2HTML('F","designValue":"[SCSCPF]","-
     A                                      refField":"DT8","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''","dateFormat":"m/d/Y"},"-
     A                                      left":"554px","cursor column":"41",-
     A                                      "top":"410px","cursor row":"16","wi-
     A                                      dth":"71px","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"32","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0500","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"74","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"6 messages","error message id 2":-
     A                                      "MC40056","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"76","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 3":"MCR2-
     A                                      397","error message file 3":"FSMESG-
     A                                      ","error message library 3":"*LIBL"-
     A                                      ,"error condition 3":{"fieldName":"-
     A                                      81","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 4":"MCR2413",-
     A                                      "error message file 4":"FSMESG","er-
     A                                      ror message library 4":"*LIBL","err-
     A                                      or condition 4":{"fieldName":"83","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 5":"MCR2404","erro-
     A                                      r message file 5":"FSMESG","error m-
     A                                      essage library 5":"*LIBL","error co-
     A                                      ndition 5":{"fieldName":"84","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 6":"MCR0676","error mes-
     A                                      sage file 6":"FSMESG","error messag-
     A                                      e library 6":"*LIBL","error conditi-
     A                                      on 6":{"fieldName":"51 and N52 and -
     A                                      N53 and N54","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"parent tab panel":"F0-
     A                                      361FMA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted","text align":"right","tab -
     A                                      index":"6"},{"id":"SCSCPT","field t-
     A                                      ype":"date field","css class":"inpu-
     A                                      t","css class 2":"date-field","valu-
     A                                      e":{"fieldName":"SCSC')
     A                                  1  2HTML('PT","designValue":"[SCSCPT]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "left":"670px","cursor column":"52"-
     A                                      ,"top":"410px","cursor row":"16","w-
     A                                      idth":"71px","css class 3":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"err-
     A                                      or message id":"MCR0500","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"75","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "5 messages","error message id 2":"-
     A                                      MC40056","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"80","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 3":"MCR23-
     A                                      97","error message file 3":"FSMESG"-
     A                                      ,"error message library 3":"*LIBL",-
     A                                      "error condition 3":{"fieldName":"8-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 4":"MCR2404","-
     A                                      error message file 4":"FSMESG","err-
     A                                      or message library 4":"*LIBL","erro-
     A                                      r condition 4":{"fieldName":"84","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror message id 5":"MCR0676","error-
     A                                       message file 5":"FSMESG","error me-
     A                                      ssage library 5":"*LIBL","error con-
     A                                      dition 5":{"fieldName":"N51 and 52 -
     A                                      and N53 and N54","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"F0361FMA_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted","text align":"right","-
     A                                      tab index":"9"},{"id":"constant20",-
     A                                      "field type":"output field","value"-
     A                                      :"Admission date                   -
     A                                        :","css class":"constant","left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      430px","cursor row":"17","parent ta-
     A                                      b panel":"F0361FMA_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCADDT-
     A                                      ","field type":"date field","css cl-
     A                                      ass":"input","css class 2":"date-fi-
     A                                      eld","value":{"fieldName":"SCADDT",-
     A                                      "designValue":"[SCADD')
     A                                  1  2HTML('T]","refField":"DT8","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''","dateFormat"-
     A                                      :"m/d/Y"},"left":"554px","cursor co-
     A                                      lumn":"41","top":"430px","cursor ro-
     A                                      w":"17","width":"71px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"error message id":"MCR0500",-
     A                                      "error message file":"FSMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"72","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"4 messages","error messa-
     A                                      ge id 2":"MC40056","error message f-
     A                                      ile 2":"FSMESG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"77","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       3":"MCR2397","error message file 3-
     A                                      ":"FSMESG","error message library 3-
     A                                      ":"*LIBL","error condition 3":{"fie-
     A                                      ldName":"85","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 4":"-
     A                                      MCR0676","error message file 4":"FS-
     A                                      MESG","error message library 4":"*L-
     A                                      IBL","error condition 4":{"fieldNam-
     A                                      e":"N51 and N52 and 53 and N54","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"pa-
     A                                      rent tab panel":"F0361FMA_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted","text a-
     A                                      lign":"right","tab index":"8"},{"id-
     A                                      ":"constant21","field type":"output-
     A                                       field","value":"Admission hour    -
     A                                         :","css class":"constant","left"-
     A                                      :"670px","cursor column":"52","top"-
     A                                      :"430px","cursor row":"17","parent -
     A                                      tab panel":"F0361FMA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCAD-
     A                                      HR","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCADHR","des-
     A                                      ignValue":"[SCADHR]","dataType":"zo-
     A                                      ned","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","dataLength":-
     A                                      "2","decPos":"0"},"left":"830px","c-
     A                                      ursor column":"75","top":"430px","c-
     A                                      ursor row":"17","widt')
     A                                  1  2HTML('h":"15px","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      error message id":"MC40146","error -
     A                                      message file":"FSMESG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"86","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"2 messages","error message id 2-
     A                                      ":"MCR0676","error message file 2":-
     A                                      "FSMESG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"N51 and N52 and N53 and 54",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "parent tab panel":"F0361FMA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted","tab-
     A                                       index":"9"},{"id":"constant22","fi-
     A                                      eld type":"output field","value":"D-
     A                                      ischarge date                     :-
     A                                      ","css class":"constant","left":"29-
     A                                      5px","cursor column":"4","top":"450-
     A                                      px","cursor row":"18","parent tab p-
     A                                      anel":"F0361FMA_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCDCDT","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCDCDT","de-
     A                                      signValue":"[SCDCDT]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","numBlankFill":"true","edt-
     A                                      Wrd":"''  /  /    ''","dateFormat":-
     A                                      "m/d/Y"},"left":"554px","cursor col-
     A                                      umn":"41","top":"450px","cursor row-
     A                                      ":"18","width":"71px","text align":-
     A                                      "right","css class 3":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"css class 4":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 5":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"set focu-
     A                                      s":{"fieldName":"35","dataType":"ex-
     A                                      pression","formatting')
     A                                  1  2HTML('":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"MC-
     A                                      R0500","error message file":"FSMESG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"58",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"4 messages","erro-
     A                                      r message id 2":"MC40275","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"59","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 3":"MC40056","error message-
     A                                       file 3":"FSMESG","error message li-
     A                                      brary 3":"*LIBL","error condition 3-
     A                                      ":{"fieldName":"48","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 4":"MCR0676","error message file-
     A                                       4":"FSMESG","error message library-
     A                                       4":"*LIBL","error condition 4":{"f-
     A                                      ieldName":"51 and 52 and N53 and N5-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"parent tab panel":"F0361FMA_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted","-
     A                                      tab index":"10"},{"id":"constant23"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Discharge hour       :","css cla-
     A                                      ss":"constant","left":"670px","curs-
     A                                      or column":"52","top":"450px","curs-
     A                                      or row":"18","parent tab panel":"F0-
     A                                      361FMA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCDCHR","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCDCHR","designValue":"[SC-
     A                                      DCHR]","refField":"HOUR","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"lef-
     A                                      t":"830px","cursor column":"75","to-
     A                                      p":"450px","cursor row":"18","width-
     A                                      ":"15px","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 4":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"error m-
     A                                      essage id":"MC40146","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"87","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"2 m-
     A                                      essages","error message id 2":"MCR0-
     A                                      676","error message f')
     A                                  1  2HTML('ile 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"N51 and 52 and -
     A                                      53 and N54","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F03-
     A                                      61FMA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted","tab index":"11"},{"id":"co-
     A                                      nstant24","field type":"output fiel-
     A                                      d","value":"Submission date        -
     A                                                  :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"470px","cursor row":"19",-
     A                                      "parent tab panel":"F0361FMA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCSBDT","field type":"date fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"date-field","value":{"fieldName"-
     A                                      :"SCSBDT","designValue":"[SCSBDT]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "left":"554px","cursor column":"41"-
     A                                      ,"top":"470px","cursor row":"19","w-
     A                                      idth":"71px","css class 3":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"err-
     A                                      or message id":"MCR0500","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"88","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "3 messages","error message id 2":"-
     A                                      MC40056","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"89","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 3":"MCR06-
     A                                      76","error message file 3":"FSMESG"-
     A                                      ,"error message library 3":"*LIBL",-
     A                                      "error condition 3":{"fieldName":"N-
     A                                      51 and N52 and 53 and 54","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"parent t-
     A                                      ab panel":"F0361FMA_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted","text align":-
     A                                      "right","tab index":"12"},{"id":"co-
     A                                      nstant25","field type":"output fiel-
     A                                      d","value":"County code          :"-
     A                                      ,"css class":"constant","left":"670-
     A                                      px","cursor column":"')
     A                                  1  2HTML('52","top":"470px","cursor row-
     A                                      ":"19","parent tab panel":"F0361FMA-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCCNTY","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCCNTY","designValue":"[SCCNTY]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"2"},"text trans-
     A                                      form":"uppercase","left":"830px","c-
     A                                      ursor column":"75","top":"470px","c-
     A                                      ursor row":"19","width":"15px","css-
     A                                       class 3":{"fieldName":"N09 and N29-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09 or 29","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09 or 29","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      set focus":{"fieldName":"94","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"error message id":"MCR0503","erro-
     A                                      r message file":"FSMESG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"91","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"2 messages","error message id-
     A                                       2":"MCR2434","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"93","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"parent tab panel":"F0-
     A                                      361FMA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted","tab index":"13"},{"id":"c-
     A                                      onstant26","field type":"output fie-
     A                                      ld","value":"Type of service       -
     A                                                   :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"490px","cursor row":"20"-
     A                                      ,"parent tab panel":"F0361FMA_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCICN","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCIC-
     A                                      N","designValue":"[SCICN]","refFiel-
     A                                      d":"CODE","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"554px","curs-
     A                                      or column":"41","top":"490px","curs-
     A                                      or row":"20","width":"15px","css cl-
     A                                      ass 3":{"fieldName":"66 or 09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat"')
     A                                  1  2HTML(':"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"css class -
     A                                      4":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"44","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"MCR2441","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"38","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"4 messages","error message-
     A                                       id 2":"MC40280","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"41","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 3-
     A                                      ":"MC40281","error message file 3":-
     A                                      "FSMESG","error message library 3":-
     A                                      "*LIBL","error condition 3":{"field-
     A                                      Name":"46","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 4":"MC-
     A                                      R0503","error message file 4":"FSME-
     A                                      SG","error message library 4":"*LIB-
     A                                      L","error condition 4":{"fieldName"-
     A                                      :"67","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"F0361FMA_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      ","tab index":"14"},{"id":"SCICDS",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCICDS","designValue-
     A                                      ":"[SCICDS]","refField":"DS35","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"582px","cursor column":"45","top-
     A                                      ":"490px","cursor row":"20","parent-
     A                                       tab panel":"F0361FMA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant27","field type":"output field-
     A                                      ","value":"Type of service (status)-
     A                                                 :","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"510px","cursor row":"21","-
     A                                      parent tab panel":"F0361FMA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCDCN","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCDCN"-
     A                                      ,"designValue":"[SCDCN]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"t')
     A                                  1  2HTML('ext transform":"uppercase","l-
     A                                      eft":"554px","cursor column":"41","-
     A                                      top":"510px","cursor row":"21","wid-
     A                                      th":"8px","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"42","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"MCR2441","error mess-
     A                                      age file":"FSMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"39","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"F036-
     A                                      1FMA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted","tab index":"15"},{"id":"SCD-
     A                                      CDS","field type":"output field","v-
     A                                      alue":{"fieldName":"SCDCDS","design-
     A                                      Value":"[SCDCDS]","refField":"DS35"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"582px","cursor column":"45"-
     A                                      ,"top":"510px","cursor row":"21","p-
     A                                      arent tab panel":"F0361FMA_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant28","field type":"output -
     A                                      field","value":"Eligible for data s-
     A                                      ubmission       :","css class":"con-
     A                                      stant","visibility":{"fieldName":"3-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"295px","curso-
     A                                      r column":"4","top":"530px","cursor-
     A                                       row":"22","parent tab panel":"F036-
     A                                      1FMA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCEDI","field type":-
     A                                      "checkbox","css class":"input","css-
     A                                       class 2":"checkbox","value":{"fiel-
     A                                      dName":"SCEDI","designValue":"[SCED-
     A                                      I]","refField":"FLAG","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase"},"t-
     A                                      ext transform":"uppercase","visibil-
     A                                      ity":{"fieldName":"30","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"554px","top":"530px","width"-
     A                                      :"8px","css class 3":{"fieldName":"-
     A                                      09 or 30","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","cus')
     A                                  1  2HTML('tomTrue":"HI","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"N09 -
     A                                      and 30","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09 and 30","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09 and 30","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"43","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"MCR0503","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"78 and 30","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"3 messages","error -
     A                                      message id 2":"MCR0999","error mess-
     A                                      age file 2":"FSMESG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"79 and 30","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 3":"MCR0676","error me-
     A                                      ssage file 3":"FSMESG","error messa-
     A                                      ge library 3":"*LIBL","error condit-
     A                                      ion 3":{"fieldName":"51 and N52 and-
     A                                       N53 and 54","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"parent tab panel":"F0-
     A                                      361FMA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted","checked value":"Y","unche-
     A                                      cked value":"N","tab index":"16"},{-
     A                                      "id":"constant29","field type":"out-
     A                                      put field","value":"1993 special ra-
     A                                      tes   :","css class":"constant","le-
     A                                      ft":"670px","cursor column":"52","t-
     A                                      op":"530px","cursor row":"22","pare-
     A                                      nt tab panel":"F0361FMA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CSPRT","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCSPRT","-
     A                                      designValue":"[SCSPRT]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase","dataL-
     A                                      ength":"1"},"text transform":"upper-
     A                                      case","left":"830px","cursor column-
     A                                      ":"75","top":"530px","cursor row":"-
     A                                      22","width":"8px","css class 3":"HI-
     A                                      ","css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9 or 29","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09 or 29","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"error m-
     A                                      essage id":"MC40428",')
     A                                  1  2HTML('"error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"92","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","parent-
     A                                       tab panel":"F0361FMA_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted","tab index"-
     A                                      :"17"},{"id":"constant31","field ty-
     A                                      pe":"output field","value":" ","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      81px","cursor column":"2","top":"55-
     A                                      0px","cursor row":"23","css class 2-
     A                                      ":"BLU","parent tab panel":"F0361FM-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant30","field type-
     A                                      ":"output field","value":" ","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      1px","cursor column":"2","top":"550-
     A                                      px","cursor row":"23","css class 2"-
     A                                      :"BLU","parent tab panel":"F0361FMA-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"HFLD","field type":"outp-
     A                                      ut field","visibility":"hidden","va-
     A                                      lue":{"fieldName":"HFLD","designVal-
     A                                      ue":"[HFLD]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"10"},"le-
     A                                      ft":"0px","top":"-30px","css class"-
     A                                      :"profound-converted"},{"id":"HREC"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"HREC","designValue":"[HREC]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none","da-
     A                                      taLength":"10"},"left":"0px","top":-
     A                                      "-30px","css class":"profound-conve-
     A                                      rted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            DSPICDIND      1A  H
     A            ERFZIP         1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSFZIP        10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCADHR         2S 0H
     A            SCCNTY         2A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCHMRA_DOT    11A  H
     A            SCHOT1_DOT    11A  H
     A            SCICDIND       1A  H
     A            SCSPRT         1A  H
     A            SCZIP          4S 0H
     A            SCACCT    R        H      REFFLD(DS30)
     A            SCADDT    R        H      REFFLD(DT8)
     A            SCAST     R        H      REFFLD(ST)
     A            SCBLTY    R        H      REFFLD(CODE3)
     A            SCBTDS    R        H      REFFLD(DS35)
     A            SCCHRG    R        H      REFFLD(A112)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCD1DS    R        H      REFFLD(DS30)
     A            SCDCDS    R        H      REFFLD(DS35)
     A            SCDCDT    R        H      REFFLD(DT8)
     A            SCDCHR    R        H      REFFLD(HOUR)
     A            SCDCN     R        H      REFFLD(FLAG)
     A            SCDIA1    R        H      REFFLD(DS7)
     A            SCEDI     R        H      REFFLD(FLAG)
     A            SCFZIP    R        H      REFFLD(ZIP1)
     A            SCHMRA    R        H      REFFLD(DS10)
     A            SCHNET    R        H      REFFLD(DS10)
     A            SCHOT1    R        H      REFFLD(DS10)
     A            SCHOT2    R        H      REFFLD(DS10)
     A            SCICDS    R        H      REFFLD(DS35)
     A            SCICN     R        H      REFFLD(CODE)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A112)
     A            SCNTWK    R        H      REFFLD(A112)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOTH2    R        H      REFFLD(A112)
     A            SCOTHR    R        H      REFFLD(A112)
     A            SCPAID    R        H      REFFLD(A112)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSBDT    R        H      REFFLD(DT8)
     A            SCSCDS    R        H      REFFLD(DS30)
     A            SCSCPF    R        H      REFFLD(DT8)
     A            SCSCPT    R        H      REFFLD(DT8)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  09 29 36
     A  68 69 70                            CA01
     A                                  1  2HTML('QPUIREC3    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C12 -
     A                                        SCR02_SCSPCDC7    MCR0441C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     70-
     A                                      RERRMSGID  5    C6    SCNPI1FMSSNPI-
     A                                          C6    FSMESGC5    *LIBLC0    FE-
     A                                      RSNPI    ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23","return curs-
     A                                      or record":{"fieldName":"HREC","dat-
     A                                      aLength":"10","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"},"return cursor-
     A                                       field":{"fieldName":"HFLD","dataLe-
     A                                      ngth":"10","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},"items":[{"id":"-
     A                                      F0361FMA_SCR02_avKeys","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"AV_KEYS","dataLength":"1134","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[AV_KEYS]"},"left-
     A                                      ":"0px","top":"0px","visibility":"h-
     A                                      idden"},{"id":"F0361FMA_SCR02_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"id":"F0361FMA_SCR02_BtnIconMenuSy-
     A                                      stemTools"},{"field type":"panel","-
     A                                      panel style":"TransformButtonBar","-
     A                                      id":"F0361FMA_SCR02_ButtonBar","top-
     A                                      ":"35px","left":"1036px","width":"1-
     A                                      87px","height":"28px","css class":"-
     A                                      stationary","visibility":"hidden","-
     A                                      locked in place":"true"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1040px","id":"F0361FMA_-
     A                                      SCR02_BtnSave","tool tip":"Save","o-
     A                                      nclick":"SystemToolbarSave","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/save.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cur')
     A                                  1  2HTML('sor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1066px","id":"F0361FMA_SCR02_-
     A                                      BtnRefresh","tool tip":"Refresh","o-
     A                                      nclick":"SystemToolbarRefresh","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/refresh.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1092px",-
     A                                      "id":"F0361FMA_SCR02_BtnSearch","to-
     A                                      ol tip":"Search","onclick":"SystemT-
     A                                      oolbarSearch","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/search.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1118px","id":"F0361FMA_SCR-
     A                                      02_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1144px","id":"F0361FMA_SCR02_-
     A                                      BtnSystemMessages","tool tip":"Syst-
     A                                      em Messages","onclick":"SystemToolb-
     A                                      arMessages","background image":{"fi-
     A                                      eldName":"MsgIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1196px","id":"F0361FMA_SCR02_BtnHel-
     A                                      p","tool tip":"Help","onclick":"Sys-
     A                                      temToolbarHelp","back')
     A                                  1  2HTML('ground image":"url(''/profoun-
     A                                      dui/userdata/images/systool/help.pn-
     A                                      g'')"},{"id":"F0361FMA_SCR02_ImgSys-
     A                                      ToolBottom","field type":"image","i-
     A                                      mage source":"/profoundui/userdata/-
     A                                      images/systool/butbarbot.png","left-
     A                                      ":"1036px","top":"64px","width":"18-
     A                                      7px","locked in place":"true","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden"},{"id":"F0361FMA_SCR02_MainT-
     A                                      abPanel","field type":"tab panel","-
     A                                      tab panel style":"Transform","tab n-
     A                                      ames":{"fieldName":"SCPRDS","design-
     A                                      Value":"[SCPRDS]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"active tab":"0","left":"25-
     A                                      0px","top":"70px","width":"970px","-
     A                                      height":"657px","z index":"8","lock-
     A                                      ed in place":"true","css class":"ta-
     A                                      b-panel","css class 2":"stationary"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0361FMA_S-
     A                                      CR02_BtnHiddenSave","value":"btnSav-
     A                                      e","top":"100px","response":{"field-
     A                                      Name":"btnSave","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant32",-
     A                                      "field type":"output field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      110px","cursor row":"1","css class"-
     A                                      :"top-line","value":"js: currentUse-
     A                                      r()","css class 2":"output-field","-
     A                                      parent tab panel":"F0361FMA_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCR02_SCCONM","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      ONM","designValue":"[SCCONM]","refF-
     A                                      ield":"NAME","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"414px","cursor -
     A                                      column":"21","top":"110px","cursor -
     A                                      row":"1","css class 2":"top-line","-
     A                                      css class 3":"HI","parent tab panel-
     A                                      ":"F0361FMA_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 4":"profou-
     A                                      nd-converted"},{"id":"constant33","-
     A                                      field type":"output field","left":"-
     A                                      778px","cursor column":"73","top":"-
     A                                      110px","cursor row":"1","css class"-
     A                                      :"top-line","value":"js: currentDat-
     A                                      e()","css class 2":"output-field","-
     A                                      parent tab panel":"F0361FMA_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"F0361FMA_SCR02_fkeyMenu","field -
     A                                      type":"menu","left":"10px","top":"1-
     A                                      20px","height":"350px","width":"230-
     A                                      px","hover background color":"#9AAA-
     A                                      61","hover text color":"#FFFFFF","b-
     A                                      order color":"#4C6106","menu option-
     A                                       indent":"10px","background color":-
     A                                      "#758B27","css class":"action-menu"-
     A                                      ,"css class 2":"stationary","z inde-
     A                                      x":"101"},{"field typ')
     A                                  1  2HTML('e":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0361FMA_SCR02_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCR02_Q1PG-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"Q1PGM","designVal-
     A                                      ue":"[Q1PGM]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"10"},"-
     A                                      css class":"output-field","left":"2-
     A                                      81px","cursor column":"2","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"F0361FMA_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCP-
     A                                      RDS","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPRDS","design-
     A                                      Value":"[SCPRDS]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"130px","cursor row":"2","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F0361FMA_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant34","field type":"ou-
     A                                      tput field","value":"SCR02","css cl-
     A                                      ass":"constant","left":"799px","cur-
     A                                      sor column":"76","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"F0-
     A                                      361FMA_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCR02_SCMODE","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCMODE","designValue":"[-
     A                                      SCMODE]","refField":"PGM","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"76-
     A                                      4px","cursor column":"71","top":"15-
     A                                      0px","cursor row":"3","css class 2"-
     A                                      :"HI","parent tab panel":"F0361FMA_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0361FMA_-
     A                                      SCR02_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR02-
     A                                      _SCHD1","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCHD1","desi-
     A                                      gnValue":"[SCHD1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"7-
     A                                      8"},"css class":"outp')
     A                                  1  2HTML('ut-field","left":"281px","cur-
     A                                      sor column":"2","top":"170px","curs-
     A                                      or row":"4","parent tab panel":"F03-
     A                                      61FMA_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F03-
     A                                      61FMA_SCR02_BtnHiddenDiaryItems","v-
     A                                      alue":"btnDiary","top":"175px","res-
     A                                      ponse":{"fieldName":"btnDiary","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"SCR02_SCHD2","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCHD-
     A                                      2","designValue":"[SCHD2]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"78"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"190px","cursor row":"5",-
     A                                      "parent tab panel":"F0361FMA_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0361FMA_SCR02_-
     A                                      BtnHiddenSystemMessages","value":"b-
     A                                      tnMessage","top":"200px","response"-
     A                                      :{"fieldName":"btnMessage","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"S-
     A                                      CR02_SCHD3","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCHD3","-
     A                                      designValue":"[SCHD3]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"78"},"css class":"output-field",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"210px","cursor row":"6","par-
     A                                      ent tab panel":"F0361FMA_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0361FMA_SCR02_BtnH-
     A                                      iddenWorkSubmitJob","value":"btnWrk-
     A                                      sbmjob","top":"225px","response":{"-
     A                                      fieldName":"btnWrkJob","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant35","field type":"output field",-
     A                                      "value":"EOMB#:","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"230px","cursor row":"7"-
     A                                      ,"parent tab panel":"F0361FMA_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR02_SCEOB#","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CEOB#","designValue":"[SCEOB#]","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"fa')
     A                                  1  2HTML('lse","curSym":"","units":"","-
     A                                      negNum":"999.00","dataLength":"9","-
     A                                      decPos":"0"},"css class":"output-fi-
     A                                      eld","left":"330px","cursor column"-
     A                                      :"9","top":"230px","cursor row":"7"-
     A                                      ,"width":"63px","text align":"right-
     A                                      ","parent tab panel":"F0361FMA_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant36","field type":"out-
     A                                      put field","value":"Specialty:","cs-
     A                                      s class":"constant","left":"414px",-
     A                                      "cursor column":"21","top":"230px",-
     A                                      "cursor row":"7","parent tab panel"-
     A                                      :"F0361FMA_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCR02_SCSPCD",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCSPCD","designV-
     A                                      alue":"[SCSPCD]","refField":"SPEC",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","left":"491px","cursor column"-
     A                                      :"32","top":"230px","cursor row":"7-
     A                                      ","width":"22px","css class 3":{"fi-
     A                                      eldName":"N29 and N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"29 or 09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 4":{"fieldName":"29 -
     A                                      or 09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"36","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error message id"-
     A                                      :"MCR0441","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      70","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","p-
     A                                      arent tab panel":"F0361FMA_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 5":"profound-converted"},{"id"-
     A                                      :"SCR02_SCSCDS ","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCS-
     A                                      CDS","designValue":"[SCSCDS]","refF-
     A                                      ield":"DS30","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"519px","cursor -
     A                                      column":"36","top":"230px","cursor -
     A                                      row":"7","parent tab panel":"F0361F-
     A                                      MA_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant37","field typ-
     A                                      e":"output field","value":"Ntwk:","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"69","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"750px","cursor column":"69","top"-
     A                                      :"230px","cursor row"')
     A                                  1  2HTML(':"7","parent tab panel":"F036-
     A                                      1FMA_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCR02_SCNWCD","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCNWCD","designValue":"[SC-
     A                                      NWCD]","refField":"NWCD","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","visibility-
     A                                      ":{"fieldName":"69","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"792px","cursor column":"75","to-
     A                                      p":"230px","cursor row":"7","parent-
     A                                       tab panel":"F0361FMA_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant38","field type":"output field-
     A                                      ","value":"EOB/Notes attached","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"68","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"6-
     A                                      94px","cursor column":"61","top":"2-
     A                                      50px","cursor row":"8","css class 2-
     A                                      ":{"fieldName":"68","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"RI","customFalse":""},"parent-
     A                                       tab panel":"F0361FMA_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0361FMA_SCR02_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0361FMA_SCR02_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0361FMA_SCR02_BtnHiddenHelp","va-
     A                                      lue":"btnHelp","top":"300px","respo-
     A                                      nse":{"fieldName":"btnHelp","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant39","field type":"output fi-
     A                                      eld","value":"Attending Physician N-
     A                                      PI#         :","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"310px","cursor row":"11",-
     A                                      "parent tab panel":"F0361FMA_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCANPI","field ty')
     A                                  1  2HTML('pe":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCANPI","designValu-
     A                                      e":"[SCANPI]","refField":"PREF01/DS-
     A                                      15 *LIBL/FSREFP","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"526px-
     A                                      ","cursor column":"37","top":"310px-
     A                                      ","cursor row":"11","width":"106px"-
     A                                      ,"css class 3":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"F0361FMA_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant40",-
     A                                      "field type":"output field","value"-
     A                                      :"Operating Physician NPI#         -
     A                                      :","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"33-
     A                                      0px","cursor row":"12","parent tab -
     A                                      panel":"F0361FMA_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCONPI",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCONPI","designV-
     A                                      alue":"[SCONPI]","refField":"PREF01-
     A                                      /DS15 *LIBL/FSREFP","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","left":"52-
     A                                      6px","cursor column":"37","top":"33-
     A                                      0px","cursor row":"12","width":"106-
     A                                      px","css class 3":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"parent tab p-
     A                                      anel":"F0361FMA_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant4-
     A                                      1","field type":"output field","val-
     A                                      ue":"Service Facility NPI#         -
     A                                         :","css class":"constant","left"-
     A                                      :"281px","cursor colu')
     A                                  1  2HTML('mn":"2","top":"350px","cursor-
     A                                       row":"13","parent tab panel":"F036-
     A                                      1FMA_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCNPI1","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCNPI1","designValue":"[SCNP-
     A                                      I1]","refField":"PREF01/DS15 *LIBL/-
     A                                      FSREFP","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"526px","cursor-
     A                                       column":"37","top":"350px","cursor-
     A                                       row":"13","width":"106px","css cla-
     A                                      ss 3":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 4":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"parent tab panel":"F0361-
     A                                      FMA_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted","error messages":"1 message",-
     A                                      "error message id":{"fieldName":"ms-
     A                                      snpi","dataLength":"10","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"},"err-
     A                                      or message file":"FSMESG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"ersnpi","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error enh-
     A                                      anced mode":"0"},{"id":"constant42"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Other 2 NPI#                    -
     A                                       :","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"3-
     A                                      70px","cursor row":"14","parent tab-
     A                                       panel":"F0361FMA_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCNPI2"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCNPI2","design-
     A                                      Value":"[SCNPI2]","refField":"PREF0-
     A                                      1/DS15 *LIBL/FSREFP","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      26px","cursor column":"37","top":"3-
     A                                      70px","cursor row":"14","width":"10-
     A                                      6px","css class 3":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only')
     A                                  1  2HTML('":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 4":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"parent tab panel":"F0361FM-
     A                                      A_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant44","field type-
     A                                      ":"output field","value":" ","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      1px","cursor column":"2","top":"550-
     A                                      px","cursor row":"23","css class 2"-
     A                                      :"BLU","parent tab panel":"F0361FMA-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant43","field type"-
     A                                      :"output field","value":" ","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"281p-
     A                                      x","cursor column":"2","top":"550px-
     A                                      ","cursor row":"23","css class 2":"-
     A                                      BLU","parent tab panel":"F0361FMA_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"btnSubmit","field type":"b-
     A                                      utton","value":"Enter","shortcut ke-
     A                                      y":"Enter","left":"14px","top":"150-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF03","field type":"button","vi-
     A                                      sibility":{"fieldName":"09 or N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"value":"Exit ","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF12","field type":"button","v-
     A                                      isibility":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"value":"Cancel","shortcut key-
     A                                      ":"F12","left":"14px","top":"216px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF10","field type":"button","css c-
     A                                      lass":"button","value":"Search","le-
     A                                      ft":"14px","top":"250px","width":"1-
     A                                      00px","shortcut key":"F10"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            ERSNPI         1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            MSSNPI        10A  H
     A            Q1PGM         10A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCANPI    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNPI1    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCNPI2    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCONPI    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCDS    R        H      REFFLD(DS30)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0361FMA_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0361FMA_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","id":"F0361FMA_SCR03_BtnIconM-
     A                                      enuSystemTools"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"F0361FMA_SCR03_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"F036-
     A                                      1FMA_SCR03_BtnSave","tool tip":"Sav-
     A                                      e","onclick":"SystemToolbarSave","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/save.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1066px","-
     A                                      id":"F0361FMA_SCR03_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style"')
     A                                  1  2HTML(':"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"109-
     A                                      2px","id":"F0361FMA_SCR03_BtnSearch-
     A                                      ","tool tip":"Search","onclick":"Sy-
     A                                      stemToolbarSearch","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/search.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1118px","id":"F0361FM-
     A                                      A_SCR03_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1144px","id":"F0361FMA_S-
     A                                      CR03_BtnSystemMessages","tool tip":-
     A                                      "System Messages","onclick":"System-
     A                                      ToolbarMessages","background image"-
     A                                      :{"fieldName":"MsgIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1196px","id":"F0361FMA_SCR03_B-
     A                                      tnHelp","tool tip":"Help","onclick"-
     A                                      :"SystemToolbarHelp","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/help.png'')"},{"id":"F-
     A                                      0361FMA_SCR03_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      F0361FMA_SCR03_MainTabPanel","field-
     A                                       type":"tab panel","tab panel style-
     A                                      ":"Transform","tab na')
     A                                  1  2HTML('mes":{"fieldName":"SCPRDS","d-
     A                                      esignValue":"[SCPRDS]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"active tab":"0","left-
     A                                      ":"250px","top":"70px","width":"970-
     A                                      px","height":"657px","z index":"8",-
     A                                      "locked in place":"true","css class-
     A                                      ":"tab-panel","css class 2":"statio-
     A                                      nary"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0361-
     A                                      FMA_SCR03_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t45","field type":"output field","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntUser()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"F0361FMA_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCR03_SCCONM","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCCONM","designValue":"[SCCONM]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"414px","cu-
     A                                      rsor column":"21","top":"110px","cu-
     A                                      rsor row":"1","css class 2":"top-li-
     A                                      ne","css class 3":"HI","parent tab -
     A                                      panel":"F0361FMA_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 4":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      46","field type":"output field","le-
     A                                      ft":"778px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"F0361FMA_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"F0361FMA_SCR03_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0361FMA_SCR03_BtnHiddenRefresh"-
     A                                      ,"value":"btnRefresh","top":"125px"-
     A                                      ,"response":{"fieldName":"btnRefres-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"SCR03_Q1PGM","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"Q1PGM","designValu')
     A                                  1  2HTML('e":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"F0361FMA_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR0-
     A                                      3_SCPRDS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCPRDS","d-
     A                                      esignValue":"[SCPRDS]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"130px","cursor row":"2-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F0361FMA_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","visibility":"hidd-
     A                                      en","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant47","field type-
     A                                      ":"output field","value":"SCR03","c-
     A                                      ss class":"constant","left":"799px"-
     A                                      ,"cursor column":"76","top":"130px"-
     A                                      ,"cursor row":"2","parent tab panel-
     A                                      ":"F0361FMA_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR03_SCMODE"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCMODE","designValu-
     A                                      e":"[SCMODE]","refField":"PGM","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"764px","cursor column":"71","top-
     A                                      ":"150px","cursor row":"3","css cla-
     A                                      ss 2":"HI","parent tab panel":"F036-
     A                                      1FMA_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F036-
     A                                      1FMA_SCR03_BtnHiddenSearch","value"-
     A                                      :"btnSearch","top":"150px","respons-
     A                                      e":{"fieldName":"btnSearch","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0361FMA_SCR03_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0361FMA_SCR03_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator')
     A                                  1  2HTML('","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0361FMA_SCR03_Bt-
     A                                      nHiddenWorkSubmitJob","value":"btnW-
     A                                      rksbmjob","top":"225px","response":-
     A                                      {"fieldName":"btnWrkJob","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0361FMA_SCR03_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0361FMA_SCR03_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0361FMA_SCR03_BtnHiddenHelp","va-
     A                                      lue":"btnHelp","top":"300px","respo-
     A                                      nse":{"fieldName":"btnHelp","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"150px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
