     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  21 22 23
     A  25 26 31
     A  46 48 49                            CA01(21 'Response Indicator *IN21')
     A  53 54 55
     A  56 57 58
     A  59 61 62                            CA02(22 'Response Indicator *IN22')
     A  63 66 67
     A  70 91 92
     A  97 09 30                            CA03(23 'Response Indicator *IN23')
     A  24 16 27
     A  29 32 33
     A  34 35 36                            CA04(25 'Response Indicator *IN25')
     A  37 38 39
     A  41 47 50
     A  51 52 68                            CA05(26 'Response Indicator *IN26')
     A  71 72 73
     A  74 75 76
     A  77 78 79                            CA06(31 'Response Indicator *IN31')
     A  80 81 82
     A  83 84 85
     A  86 87 88                            CA07(46 'Response Indicator *IN46')
     A  89 94                               CA08(48 'Response Indicator *IN48')
     A                                      SETOF(49 'Response Indicator *IN49')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                      SETOF(55 'Response Indicator *IN55')
     A                                      SETOF(56 'Response Indicator *IN56')
     A                                      SETOF(57 'Response Indicator *IN57')
     A                                      SETOF(58 'Response Indicator *IN58')
     A                                      SETOF(59 'Response Indicator *IN59')
     A                                      SETOF(61 'Response Indicator *IN61')
     A                                      SETOF(62 'Response Indicator *IN62')
     A                                      SETOF(63 'Response Indicator *IN63')
     A                                      SETOF(66 'Response Indicator *IN66')
     A                                      SETOF(67 'Response Indicator *IN67')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                      SETOF(92 'Response Indicator *IN92')
     A                                      SETOF(97 'Response Indicator *IN97')
     A                                  1  2HTML('QPUIREC54   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCSPCDC7    MCR0-
     A                                      441C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     70RERRMSGID  5    C6    SC-
     A                                      FZIPC7    MCR0503C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     25RERRMSGID -
     A                                       5    C6    SCFZIPC7    MCR0676C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        27RERRMSG    2    C8    scCntyCdC-
     A                                      59   This field cannot be blank for-
     A                                       "Type of service" = HO or HSFINDCC-
     A                                      DER1 RERRMSGID  5    C6    SCACCTC7-
     A                                          MCR0676C6    FSMESGC5    *LIBLC-
     A                                      0    E1    12   N61 62 63 49RERRMSG-
     A                                      ID  5    C6    SCDIA1C7    MCR2434C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           71RERRMSGID  5    C6    SCDIA1-
     A                                      C7    MCR0503C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     78RERRMSGID  5  -
     A                                        C6    SCDIA1C7    MC50006C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     94-
     A                                      RERRMSGID  5    C6    SCBLTYC7    M-
     A                                      CR0503C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     72RERRMSGID  5    C6   -
     A                                       SCBLTYC7    MCR2434C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     73RERRMSG-
     A                                      ID  5    C6    SCBLTYC7    MCR2486C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           67RERRMSGID  5    C6    SCSCPF-
     A                                      C7    MCR0556C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     74RERRMSGID  5  -
     A                                        C6    SCSCPFC7    MCR0500C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     76-
     A                                      RERRMSGID  5    C6    SCSCPFC7    M-
     A                                      CR2413C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     53RERRMSGID  5    C6   -
     A                                       SCSCPFC7    MC40056C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     85RERRMSG-
     A                                      ID  5    C6    SCSCPFC7    MCR2397C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           87RERRMSGID  5    C6    SCSCPF-
     A                                      C7    MCR0676C6    FSMESGC5    *LIB-
     A                                      LC0    E1    12    61N62N63N49RERRM-
     A                                      SGID  5    C6    SCSCPTC7    MCR055-
     A                                      6C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     75RERRMSGID  5    C6    SCSC-
     A                                      PTC7    MCR0500C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     77RERRMSGID  5-
     A                                          C6    SCSCPTC7    MCR2413C6    -
     A                                      FSMESGC5    *LIBLC0    E1    3     -
     A                                      53RERRMSGID  5    C6    SCSCPTC7   -
     A                                       MC40056C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     86RERRMSGID  5    C6 -
     A                                         SCSCPTC7    MCR2397C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     88RERRM-
     A                                      SGID  5    C6    SCSCPTC7    MCR067-
     A                                      6C6    FSMESGC5    *LIBLC0    E1   -
     A                                       12   N61 62N63N49RERRMSGID  5    C-
     A                                      6    SCADDTC7    MCR0500C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     54RER-
     A                                      RMSGID  5    C6    SCADDTC7    MC40-
     A                                      056C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     89RERRMSGID  5    C6    SC-
     A                                      ADDTC7    MCR2397C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     50RERRMSGID -
     A                                       5    C6    SCADDTC7    MCR0556C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                       N09 48RERRMSGID  5    C6    SCADDT-
     A                                      C7    MC40277C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     55RERRMSGID  5  -
     A                                        C6    SCADDTC7    MCR06')
     A                                  1  2HTML('QPUI76C6    FSMESGC5    *LIBL-
     A                                      C0    E1    12   N61N62 63N49RERRMS-
     A                                      GID  5    C6    SCADHRC7    MC40271-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     51RERRMSGID  5    C6    SCADH-
     A                                      RC7    MCR0676C6    FSMESGC5    *LI-
     A                                      BLC0    E1    12   N61N62N63 49RERR-
     A                                      MSGID  5    C6    SCADHRC7    MCR24-
     A                                      84C6    FSMESGC5    *LIBLC0    E1  -
     A                                        9    N56 57 97RERRMSGID  5    C6 -
     A                                         SCADHRC7    MCR2485C6    FSMESGC-
     A                                      5    *LIBLC0    E1    9    N56N57 9-
     A                                      7RERRMSGID  5    C6    SCADTYC7    -
     A                                      MC40113C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     91RERRMSGID  5    C6  -
     A                                        SCADTYC7    MCR2434C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     92RERRMS-
     A                                      GID  5    C6    SCDCDTC7    MCR0500-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     58RERRMSGID  5    C6    SCDCD-
     A                                      TC7    MC40275C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     59RERRMSGID  5 -
     A                                         C6    SCDCDTC7    MCR0676C6    F-
     A                                      SMESGC5    *LIBLC0    E1    12    6-
     A                                      1 62N63N49RERRMSGID  5    C6    SCD-
     A                                      CHRC7    MC40271C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     52RERRMSGID  -
     A                                      5    C6    SCDCHRC7    MCR0503C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       66RERRMSGID  5    C6    SCDCHRC7  -
     A                                        MCR0676C6    FSMESGC5    *LIBLC0 -
     A                                         E1    12   N61 62 63N49RERRMSGID-
     A                                        5    C6    SCDCHRC7    MCR2484C6 -
     A                                         FSMESGC5    *LIBLC0    E1    9  -
     A                                         56N57N97RERRMSGID  5    C6    SC-
     A                                      DCHRC7    MCR2485C6    FSMESGC5    -
     A                                      *LIBLC0    E1    9    N56 57N97RERR-
     A                                      MSGID  5    C5    SCICNC7    MCR050-
     A                                      3C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     82RERRMSGID  5    C5    SCIC-
     A                                      NC7    MCR2441C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     83RERRMSGID  5 -
     A                                         C5    SCICNC7    MC40280C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     79-
     A                                      RERRMSGID  5    C5    SCICNC7    MC-
     A                                      40281C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     46RERRMSGID  5    C5    -
     A                                      SCDCNC7    MCR2441C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     84RERRMSGID-
     A                                        5    C6    SCREVIC7    MCR0503C6 -
     A                                         FSMESGC5    *LIBLC0    E1    9  -
     A                                         56 57 97RERRMSGID  5    C6    SC-
     A                                      REVIC7    MCR0999C6    FSMESGC5    -
     A                                      *LIBLC0    E1    9     56 57N97RERR-
     A                                      MSGID  5    C6    SCTAPEC7    MC401-
     A                                      13C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     80RERRMSGID  5    C6    SCT-
     A                                      APEC7    MC40127C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     81')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","set off":{"fieldNa-
     A                                      me":"*IN21","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 2":{"fieldName"-
     A                                      :"*IN22","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 3":{"fieldName":"*-
     A                                      IN23","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 4":{"fieldName":"*IN2-
     A                                      5","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 5":{"fieldName":"*IN26",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 6":{"fieldName":"*IN67","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 7":{"fieldName":"*IN31","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 8":{"fieldName":"*IN46","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 9-
     A                                      ":{"fieldName":"*IN49","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 10":-
     A                                      {"fieldName":"*IN48","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 11":{"-
     A                                      fieldName":"*IN56","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 12":{"fi-
     A                                      eldName":"*IN57","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 13":{"fiel-
     A                                      dName":"*IN97","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 14":{"fieldN-
     A                                      ame":"*IN53","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 15":{"fieldNam-
     A                                      e":"*IN54","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"set off 16":{"fieldName"-
     A                                      :"*IN55","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 17":{"fieldName":"-
     A                                      *IN58","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 18":{"fieldName":"*I-
     A                                      N59","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 19":{"fieldName":"*IN6-
     A                                      1","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 20":{"fieldName":"*IN62"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 21":{"fieldName":"*IN63","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 22":{"fieldName":"*IN66","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 23":{"fieldName"')
     A                                  1  2HTML(':"*IN70","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 24":{"fieldN-
     A                                      ame":"*IN91","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 25":{"fieldNam-
     A                                      e":"*IN92","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"return cursor record":{"-
     A                                      fieldName":"HREC","dataLength":"10"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      },"return cursor field":{"fieldName-
     A                                      ":"HFLD","dataLength":"10","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none"},"overla-
     A                                      y range":"1-23"},"items":[{"id":"F0-
     A                                      361FFL_SCR01_avKeys","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "AV_KEYS","dataLength":"1134","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[AV_KEYS]"},"left":-
     A                                      "0px","top":"0px","visibility":"hid-
     A                                      den"},{"id":"F0361FFL_SCR01_action"-
     A                                      ,"field type":"html container","whi-
     A                                      te space":"normal","left":"0px","to-
     A                                      p":"10px","width":"230px","css clas-
     A                                      s":"action-panel-converted","height-
     A                                      ":"700px","html":"<div class=\"top\-
     A                                      "></div><div class=\"imagetop\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_top.png\" /></div><div class=\-
     A                                      "menulinks\"></div><div class=\"ima-
     A                                      gebottom\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_bottom.png\" /><-
     A                                      /div><div class=\"bottom\"></div>"}-
     A                                      ,{"field type":"icon menu button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"32px","z-
     A                                       index":"20","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1170px","id":"F036-
     A                                      1FFL_SCR01_BtnIconMenuSystemTools",-
     A                                      "tool tip":"System Tools","icon sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/systools.png","data function-
     A                                      ":"SystemToolbarSystools","show dow-
     A                                      n arrow":"Yes"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"F0361FFL_SCR01_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"F0361-
     A                                      FFL_SCR01_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''')
     A                                  1  2HTML('/profoundui/userdata/images/s-
     A                                      ystool/save.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1066px","id":"F0361FFL_SCR0-
     A                                      1_BtnRefresh","tool tip":"Refresh",-
     A                                      "onclick":"SystemToolbarRefresh","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/refresh.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1092px-
     A                                      ","id":"F0361FFL_SCR01_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"F0361FFL_S-
     A                                      CR01_BtnDiaryItems","tool tip":"Dia-
     A                                      ry/Work Items - IDARTS","onclick":"-
     A                                      SystemToolbarDiary","background ima-
     A                                      ge":{"fieldName":"DryIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1144px","id":"F0361FFL_SCR0-
     A                                      1_BtnSystemMessages","tool tip":"Sy-
     A                                      stem Messages","onclick":"SystemToo-
     A                                      lbarMessages","background image":{"-
     A                                      fieldName":"MsgIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color')
     A                                  1  2HTML('":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"F0361FFL_SCR01_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"F0361FFL_SCR01_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"F0361FFL_SCR01_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0361F-
     A                                      FL_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      1","field type":"output field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"F0361FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","css-
     A                                       class 3":"HI","parent tab panel":"-
     A                                      F0361FFL_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant2","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"F0361FFL_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"F-
     A                                      0361FFL_SCR01_fkeyMen')
     A                                  1  2HTML('u","field type":"menu","left"-
     A                                      :"10px","top":"120px","height":"350-
     A                                      px","width":"230px","hover backgrou-
     A                                      nd color":"#9AAA61","hover text col-
     A                                      or":"#FFFFFF","border color":"#4C61-
     A                                      06","menu option indent":"10px","ba-
     A                                      ckground color":"#758B27","css clas-
     A                                      s":"action-menu","css class 2":"sta-
     A                                      tionary","z index":"101"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0361FFL_SCR01_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValue":"[Q1PG-
     A                                      M]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"F03-
     A                                      61FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCAST","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCAST","designValue":"[SCAST]","-
     A                                      refField":"ST","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"358px","curso-
     A                                      r column":"13","top":"130px","curso-
     A                                      r row":"2","css class 2":"HI","pare-
     A                                      nt tab panel":"F0361FFL_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CZIPA","field type":"output field",-
     A                                      "value":{"fieldName":"SCZIPA","desi-
     A                                      gnValue":"[SCZIPA]","refField":"ZIP-
     A                                      A","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"379px","cursor column":"1-
     A                                      6","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0361FFL_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCPRDS","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"41-
     A                                      4px","cursor column":"21","top":"13-
     A                                      0px","cursor row":"2","css class 2"-
     A                                      :"HI","parent tab panel":"F0361FFL_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","visibility":"hidden","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant3","field type":"output field"-
     A                                      ,"value":"SCR01","css class":"const-
     A                                      ant","left":"799px","')
     A                                  1  2HTML('cursor column":"76","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"F0361FFL_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"SCMODE","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCMODE","designValue":"[SCMOD-
     A                                      E]","refField":"PGM","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"764px",-
     A                                      "cursor column":"71","top":"150px",-
     A                                      "cursor row":"3","css class 2":"HI"-
     A                                      ,"parent tab panel":"F0361FFL_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0361FFL_SCR01-
     A                                      _BtnHiddenSearch","value":"btnSearc-
     A                                      h","top":"150px","response":{"field-
     A                                      Name":"btnSearch","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCHD1","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCHD1","designValue":"[-
     A                                      SCHD1]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"78"},"css cl-
     A                                      ass":"output-field","left":"281px",-
     A                                      "cursor column":"2","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "F0361FFL_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0361FFL_SCR01_BtnHiddenDiaryItems-
     A                                      ","value":"btnDiary","top":"175px",-
     A                                      "response":{"fieldName":"btnDiary",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"btnCF03","field type":"butto-
     A                                      n","visibility":{"fieldName":"N09 o-
     A                                      r 09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":"Exit","sh-
     A                                      ortcut key":"F3","left":"14px","top-
     A                                      ":"183px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"SCHD2","field type":"output -
     A                                      field","value":{"fieldName":"SCHD2"-
     A                                      ,"designValue":"[SCHD2]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"78"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"190px","curs')
     A                                  1  2HTML('or row":"5","parent tab panel-
     A                                      ":"F0361FFL_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0361FFL_SCR01_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCHD3","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCHD3","designValue":"[SCHD3]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"78"},"css class":"ou-
     A                                      tput-field","left":"281px","cursor -
     A                                      column":"2","top":"210px","cursor r-
     A                                      ow":"6","parent tab panel":"F0361FF-
     A                                      L_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"btnCF10","field type":"-
     A                                      button","visibility":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":"Search","s-
     A                                      hortcut key":"F10","left":"14px","t-
     A                                      op":"216px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0361FFL_S-
     A                                      CR01_BtnHiddenWorkSubmitJob","value-
     A                                      ":"btnWrksbmjob","top":"225px","res-
     A                                      ponse":{"fieldName":"btnWrkJob","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant4","field type":"output-
     A                                       field","value":"EOMB#:","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"230px","cursor -
     A                                      row":"7","parent tab panel":"F0361F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCEOB#","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCEOB#","designValue":"[SCEOB#]","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00","-
     A                                      dataLength":"9","decPos":"0"},"css -
     A                                      class":"output-field","left":"330px-
     A                                      ","cursor column":"9","top":"230px"-
     A                                      ,"cursor row":"7","width":"63px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"F0361FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant5","-
     A                                      field type":"output field","value":-
     A                                      "SpCd:","css class":"constant","lef-
     A                                      t":"405px","cursor column":"19","to-
     A                                      p":"230px","cursor row":"7","parent-
     A                                       tab panel":"F0361FFL_SCR01_MainTab-
     A                                      Panel","parent tab":"')
     A                                  1  2HTML('0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSPCD","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCSPCD","designValue":"[SC-
     A                                      SPCD]","refField":"SPEC","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"450px","cursor column":"30","top-
     A                                      ":"230px","cursor row":"7","width":-
     A                                      "22px","css class 3":{"fieldName":"-
     A                                      N29 and N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"29 or 09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 4":{"fieldName":"29 or 09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"set focus":{"fieldName":"36",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"error message id":"MCR0441"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"70","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","parent tab -
     A                                      panel":"F0361FFL_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 5":"p-
     A                                      rofound-converted","tab index":"1"}-
     A                                      ,{"id":"SCSCDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCSC-
     A                                      DS","designValue":"[SCSCDS]","refFi-
     A                                      eld":"DS10","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"480px","cursor c-
     A                                      olumn":"34","top":"230px","cursor r-
     A                                      ow":"7","parent tab panel":"F0361FF-
     A                                      L_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant6","field type"-
     A                                      :"output field","value":"Fac Zip:",-
     A                                      "css class":"constant","left":"555p-
     A                                      x","cursor column":"45","top":"230p-
     A                                      x","cursor row":"7","parent tab pan-
     A                                      el":"F0361FFL_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFZIP","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCFZIP","refField":-
     A                                      "ZIP1","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"refe-
     A                                      rence","formatting":"Number","negNu-
     A                                      m":"999.00","units":"","designValue-
     A                                      ":"[SCFZIP]"},"left":"615px","curso-
     A                                      r column":"59","top":"230px","curso-
     A                                      r row":"7","width":"36px","css clas-
     A                                      s 3":{"fieldName":"N29 and N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat')
     A                                  1  2HTML('":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N29 and N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"29 or-
     A                                       09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"29 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"set focus":-
     A                                      {"fieldName":"23","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage id":"MCR0503","error message f-
     A                                      ile":"FSMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"25","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"2 mes-
     A                                      sages","error message id 2":"MCR067-
     A                                      6","error message file 2":"FSMESG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"27-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"parent tab panel":"F0361FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted","t-
     A                                      ab index":"2"},{"id":"constant7_cop-
     A                                      y","field type":"output field","css-
     A                                       class":"constant","value":"-","cur-
     A                                      sor row":"7","cursor column":"68","-
     A                                      left":"655px","top":"230px","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCZIP4","field type":"textbox","cs-
     A                                      s class":"input","value":{"fieldNam-
     A                                      e":"SCZIP","dataLength":"4","decPos-
     A                                      ":"0","numSep":"false","zeroBalance-
     A                                      ":"false","numBlankFill":"false","z-
     A                                      eroFill":"false","noExtraSpaces":"f-
     A                                      alse","curSym":"","dataType":"zoned-
     A                                      ","formatting":"Number","negNum":"9-
     A                                      99.00","units":"","designValue":"[S-
     A                                      CZIP]"},"read only":{"fieldName":"2-
     A                                      9 or 09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"cursor row":"7","c-
     A                                      ursor column":"59","left":"665px","-
     A                                      top":"230px","width":"32px","css cl-
     A                                      ass 2":"textbox","css class 3":{"fi-
     A                                      eldName":"N29 and N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"tab-
     A                                       index":"2","css class 4":{"fieldNa-
     A                                      me":"29 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 5-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant32","field type":"output field"-
     A                                      ,"css class":"constant","value":"Cn-
     A                                      ty:","cursor row":"7","cursor colum-
     A                                      n":"45","left":"720px","top":"230px-
     A                                      ","parent tab panel":"F0361FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"scCntyCd","fiel')
     A                                  1  2HTML('d type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scCn-
     A                                      tyCd","refField":"DS3","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"reference","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[scCntyCd]"},"te-
     A                                      xt transform":"uppercase","read onl-
     A                                      y":{"fieldName":"29 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      set focus":{"fieldName":"indcntycd"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"cursor row":"7","cursor col-
     A                                      umn":"30","left":"765px","top":"230-
     A                                      px","width":"22px","parent tab pane-
     A                                      l":"F0361FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"textb-
     A                                      ox","css class 3":{"fieldName":"N29-
     A                                       and N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"29 or 09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"css c-
     A                                      lass 5":"profound-converted","tab i-
     A                                      ndex":"3","error message":"This fie-
     A                                      ld cannot be blank for \"Type of se-
     A                                      rvice\" = HO or HS","error conditio-
     A                                      n":{"fieldName":"indCcder1","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error e-
     A                                      nhanced mode":"0","error messages":-
     A                                      "1 message"},{"id":"constant7","fie-
     A                                      ld type":"output field","value":"Nt-
     A                                      wk:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"16","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"805px","cursor column":"70"-
     A                                      ,"top":"230px","cursor row":"7","pa-
     A                                      rent tab panel":"F0361FFL_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCNWCD","field type":"output field-
     A                                      ","value":{"fieldName":"SCNWCD","de-
     A                                      signValue":"[SCNWCD]","refField":"N-
     A                                      WCD","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","visibility":{"fieldName":"16",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"850px","cursor c-
     A                                      olumn":"76","top":"230px","cursor r-
     A                                      ow":"7","parent tab panel":"F0361FF-
     A                                      L_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"btnCF11","field type":"-
     A                                      button","visibility":{"fieldName":"-
     A                                      N09 or 09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"value":"EOB/-
     A                                      Notes","shortcut key":"F11","left":-
     A                                      "14px","top":"249px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"t')
     A                                  1  2HTML('rue","cursor":"default"},{"id-
     A                                      ":"constant8","field type":"output -
     A                                      field","value":"EOB/Notes attached"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"68","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"694px","cursor column":"61","to-
     A                                      p":"250px","cursor row":"8","css cl-
     A                                      ass 2":{"fieldName":"68","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"RI","customFalse":""},"p-
     A                                      arent tab panel":"F0361FFL_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0361FFL_SCR01_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant9","field type":"output f-
     A                                      ield","value":"Patient control numb-
     A                                      er             :","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"270px","cursor row":"9-
     A                                      ","parent tab panel":"F0361FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCACCT","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      ACCT","designValue":"[SCACCT]","ref-
     A                                      Field":"DS30","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"554px","-
     A                                      cursor column":"41","top":"270px","-
     A                                      cursor row":"9","width":"211px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"37","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error message id"-
     A                                      :"MCR0676","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      N61 and 62 and 63 and 49","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"1 message","parent tab pan-
     A                                      el":"F0361FFL_SCR01_M')
     A                                  1  2HTML('ainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      ,"tab index":"4"},{"id":"constant51-
     A                                      ","field type":"output field","css -
     A                                      class":"constant","value":"ICD 10  -
     A                                      :","cursor row":"9","cursor column"-
     A                                      :"4","left":"780px","top":"270px","-
     A                                      parent tab panel":"F0361FFL_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"scICDind","field type":"checkbox-
     A                                      ","css class":"input","value":{"fie-
     A                                      ldName":"scICDind","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scICDind]"},-
     A                                      "left":"850px","top":"270px","css c-
     A                                      lass 2":"checkbox","parent tab pane-
     A                                      l":"F0361FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","checked value":"Y",-
     A                                      "unchecked value":"N","text transfo-
     A                                      rm":"uppercase","disabled":{"fieldN-
     A                                      ame":"dspICdind","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"tab index":-
     A                                      "4"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0361FF-
     A                                      L_SCR01_BtnHiddenImageQueue","value-
     A                                      ":"btnImgQue","top":"275px","respon-
     A                                      se":{"fieldName":"btnImgQue","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "btnCF12","field type":"button","vi-
     A                                      sibility":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":"Cancel","shortcut key"-
     A                                      :"F12","left":"14px","top":"282px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"con-
     A                                      stant10","field type":"output field-
     A                                      ","value":"Principal diagnosis code-
     A                                                 :","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"290px","cursor row":"10","-
     A                                      parent tab panel":"F0361FFL_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCDIA1","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCDIA-
     A                                      1","refField":"DS7","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","textTransform":"uppercase"-
     A                                      ,"designValue":"[SCDIA1]"},"text tr-
     A                                      ansform":"uppercase","left":"555px"-
     A                                      ,"cursor column":"41","top":"290px"-
     A                                      ,"cursor row":"10","width":"50px","-
     A                                      css class 3":"HI","css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","d')
     A                                  1  2HTML('ataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"34","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error messages":-
     A                                      "3 messages","parent tab panel":"F0-
     A                                      361FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted","tab index":"6","text alig-
     A                                      n":"left","error message id":"MCR24-
     A                                      34","error message file":"FSMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"71","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror enhanced mode":"0","error messa-
     A                                      ge id 2":"MCR0503","error message f-
     A                                      ile 2":"FSMESG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"78","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode 2":"0","error message id 3":"MC-
     A                                      50006","error message file 3":"FSME-
     A                                      SG","error message library 3":"*LIB-
     A                                      L","error condition 3":{"fieldName"-
     A                                      :"94","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode 3":"0"},-
     A                                      {"id":"SCD1DS","field type":"output-
     A                                       field","value":{"fieldName":"SCD1D-
     A                                      S","designValue":"[SCD1DS]","refFie-
     A                                      ld":"DS30","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"615px","cursor co-
     A                                      lumn":"48","top":"290px","cursor ro-
     A                                      w":"10","css class 2":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"parent tab panel":"F0-
     A                                      361FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      361FFL_SCR01_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant11","field type":"output field"-
     A                                      ,"value":"Total charge             -
     A                                                :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"310px","cursor row":"11","p-
     A                                      arent tab panel":"F0361FFL_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCCHRG","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCCHRG","d-
     A                                      esignValue":"[SCCHRG]","refField":"-
     A                                      A112","dataType":"ref')
     A                                  1  2HTML('erence","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"css-
     A                                       class":"output-field","left":"554p-
     A                                      x","cursor column":"41","top":"310p-
     A                                      x","cursor row":"11","width":"91px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"parent -
     A                                      tab panel":"F0361FFL_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant12","field type":"output field"-
     A                                      ,"value":"Reductions","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"330px","cursor row-
     A                                      ":"12","parent tab panel":"F0361FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCHMRA_DOT","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCHMRA_DOT","designValue":"[SCHM-
     A                                      RA_DOT]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"11"},"css c-
     A                                      lass":"output-field","left":"372px"-
     A                                      ,"cursor column":"15","top":"330px"-
     A                                      ,"cursor row":"12","parent tab pane-
     A                                      l":"F0361FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCHMRA","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCHMRA","designValue":"[-
     A                                      SCHMRA]","refField":"DS10","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      63px","cursor column":"28","top":"3-
     A                                      30px","cursor row":"12","parent tab-
     A                                       panel":"F0361FFL_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t13","field type":"output field","v-
     A                                      alue":":","css class":"constant","l-
     A                                      eft":"540px","cursor column":"39","-
     A                                      top":"330px","cursor row":"12","par-
     A                                      ent tab panel":"F0361FFL_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCMRA","field type":"output field",-
     A                                      "value":{"fieldName":"SCMRA","desig-
     A                                      nValue":"[SCMRA]","refField":"A112"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"554px","cursor column":"41","-
     A                                      top":"330px","cursor row":"12","wid-
     A                                      th":"91px","text align":"right","cs-
     A                                      s class 2":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"parent tab panel":"F0361FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound')
     A                                  1  2HTML('-converted"},{"id":"SCHNET","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCHNET","designValue"-
     A                                      :"[SCHNET]","refField":"DS10","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","visib-
     A                                      ility":{"fieldName":"47","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"652px","cursor column":"55-
     A                                      ","top":"330px","cursor row":"12","-
     A                                      parent tab panel":"F0361FFL_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant14","field type":"output-
     A                                       field","value":":","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      47","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"729px","curs-
     A                                      or column":"66","top":"330px","curs-
     A                                      or row":"12","parent tab panel":"F0-
     A                                      361FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCNTWK","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCNTWK","designValue":"[SCNTWK-
     A                                      ]","refField":"A112","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00"},"css clas-
     A                                      s":"output-field","visibility":{"fi-
     A                                      eldName":"47","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"74-
     A                                      3px","cursor column":"68","top":"33-
     A                                      0px","cursor row":"12","width":"91p-
     A                                      x","text align":"right","css class -
     A                                      2":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"paren-
     A                                      t tab panel":"F0361FFL_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant15","field type":"output fiel-
     A                                      d","value":"Reductions","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"4","top":"350px","cursor r-
     A                                      ow":"13","parent tab panel":"F0361F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCHOT1_DOT","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCHOT1_DOT","designValue":"[SC-
     A                                      HOT1_DOT]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"11"},"css-
     A                                       class":"output-field","left":"372p-
     A                                      x","cursor column":"15","top":"350p-
     A                                      x","cursor row":"13","parent tab pa-
     A                                      nel":"F0361FFL_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCHOT1","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCHOT1","designValue":-
     A                                      "[SCHOT1]","refField":"DS10","dataT-
     A                                      ype":"reference","for')
     A                                  1  2HTML('matting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"463px","cursor-
     A                                       column":"28","top":"350px","cursor-
     A                                       row":"13","parent tab panel":"F036-
     A                                      1FFL_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant16","field t-
     A                                      ype":"output field","value":":","cs-
     A                                      s class":"constant","left":"540px",-
     A                                      "cursor column":"39","top":"350px",-
     A                                      "cursor row":"13","parent tab panel-
     A                                      ":"F0361FFL_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCOTHR","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCOTHR","designValue":"[S-
     A                                      COTHR]","refField":"A112","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"css-
     A                                       class":"output-field","left":"554p-
     A                                      x","cursor column":"41","top":"350p-
     A                                      x","cursor row":"13","width":"91px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"parent -
     A                                      tab panel":"F0361FFL_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCHO-
     A                                      T2","field type":"output field","va-
     A                                      lue":{"fieldName":"SCHOT2","designV-
     A                                      alue":"[SCHOT2]","refField":"DS10",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"652px","cursor column":"55",-
     A                                      "top":"350px","cursor row":"13","pa-
     A                                      rent tab panel":"F0361FFL_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant17","field type":"output f-
     A                                      ield","value":":","css class":"cons-
     A                                      tant","left":"729px","cursor column-
     A                                      ":"66","top":"350px","cursor row":"-
     A                                      13","parent tab panel":"F0361FFL_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCOTH2","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCOT-
     A                                      H2","designValue":"[SCOTH2]","refFi-
     A                                      eld":"A112","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00"},"css class":"outpu-
     A                                      t-field","left":"743px","cursor col-
     A                                      umn":"68","top":"350px","cursor row-
     A                                      ":"13","width":"91px","text align":-
     A                                      "right","css class 2":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"parent tab panel":"F0-
     A                                      361FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"cons')
     A                                  1  2HTML('tant18","field type":"output -
     A                                      field","value":"Total paid         -
     A                                                      :","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"370px","cursor row":"-
     A                                      14","parent tab panel":"F0361FFL_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCPAID","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPA-
     A                                      ID","designValue":"[SCPAID]","refFi-
     A                                      eld":"A112","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"-999.00"},"css class":"outpu-
     A                                      t-field","left":"554px","cursor col-
     A                                      umn":"41","top":"370px","cursor row-
     A                                      ":"14","width":"91px","text align":-
     A                                      "right","css class 2":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"parent tab panel":"F0-
     A                                      361FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant19","field-
     A                                       type":"output field","value":"Type-
     A                                       of bill                       :","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"390px"-
     A                                      ,"cursor row":"15","parent tab pane-
     A                                      l":"F0361FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCBLTY","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCBLTY","designValue-
     A                                      ":"[SCBLTY]","refField":"CODE3","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"554px","cursor column":"4-
     A                                      1","top":"390px","cursor row":"15",-
     A                                      "width":"22px","css class 3":"HI","-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"set focus":{"fieldName-
     A                                      ":"31","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"error message id":"M-
     A                                      CR0503","error message file":"FSMES-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"72"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"3 messages","err-
     A                                      or message id 2":"MCR2434","error m-
     A                                      essage file 2":"FSMESG","error mess-
     A                                      age library 2":"*LIBL","error condi-
     A                                      tion 2":{"fieldName":"73","dataType-
     A                                      ":"expression","forma')
     A                                  1  2HTML('tting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 3":"MC-
     A                                      R2486","error message file 3":"FSME-
     A                                      SG","error message library 3":"*LIB-
     A                                      L","error condition 3":{"fieldName"-
     A                                      :"67","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"F0361FFL_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      ","tab index":"7"},{"id":"SCBTDS","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCBTDS","designValue"-
     A                                      :"[SCBTDS]","refField":"DS35","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"582px","cursor column":"45","top"-
     A                                      :"390px","cursor row":"15","parent -
     A                                      tab panel":"F0361FFL_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant20","field type":"output field"-
     A                                      ,"value":"Date statement covers fro-
     A                                      m/to      :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"410px","cursor row":"16","p-
     A                                      arent tab panel":"F0361FFL_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCSCPF","field type":"date field"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "date-field","value":{"fieldName":"-
     A                                      SCSCPF","designValue":"[SCSCPF]","r-
     A                                      efField":"DT8","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","numBlankFill":-
     A                                      "true","edtWrd":"''  /  /    ''","d-
     A                                      ateFormat":"m/d/Y"},"left":"554px",-
     A                                      "cursor column":"41","top":"410px",-
     A                                      "cursor row":"16","width":"71px","t-
     A                                      ext align":"right","css class 3":"H-
     A                                      I","css class 4":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"33","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"MCR0556","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "74","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"6 messages",-
     A                                      "error message id 2":"MCR0500","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"76","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":')
     A                                  1  2HTML('"1 / 0"},"error message id 3"-
     A                                      :"MCR2413","error message file 3":"-
     A                                      FSMESG","error message library 3":"-
     A                                      *LIBL","error condition 3":{"fieldN-
     A                                      ame":"53","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 4":"MC4-
     A                                      0056","error message file 4":"FSMES-
     A                                      G","error message library 4":"*LIBL-
     A                                      ","error condition 4":{"fieldName":-
     A                                      "85","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 5":"MCR2397"-
     A                                      ,"error message file 5":"FSMESG","e-
     A                                      rror message library 5":"*LIBL","er-
     A                                      ror condition 5":{"fieldName":"87",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 6":"MCR0676","err-
     A                                      or message file 6":"FSMESG","error -
     A                                      message library 6":"*LIBL","error c-
     A                                      ondition 6":{"fieldName":"61 and N6-
     A                                      2 and N63 and N49","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"F0361FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted","tab index":"8"},{"i-
     A                                      d":"SCSCPT","field type":"date fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"date-field","value":{"fieldName"-
     A                                      :"SCSCPT","designValue":"[SCSCPT]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","numBlankFill-
     A                                      ":"true","edtWrd":"''  /  /    ''",-
     A                                      "dateFormat":"m/d/Y"},"left":"670px-
     A                                      ","cursor column":"52","top":"410px-
     A                                      ","cursor row":"16","width":"71px",-
     A                                      "text align":"right","css class 3":-
     A                                      "HI","css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 5":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"error message id-
     A                                      ":"MCR0556","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "75","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"6 messages",-
     A                                      "error message id 2":"MCR0500","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"77","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 3":"MCR2413","error me-
     A                                      ssage file 3":"FSMESG","error messa-
     A                                      ge library 3":"*LIBL","error condit-
     A                                      ion 3":{"fieldName":"53","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 /')
     A                                  1  2HTML(' 0"},"error message id 4":"MC-
     A                                      40056","error message file 4":"FSME-
     A                                      SG","error message library 4":"*LIB-
     A                                      L","error condition 4":{"fieldName"-
     A                                      :"86","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error message id 5":"MCR2397-
     A                                      ","error message file 5":"FSMESG","-
     A                                      error message library 5":"*LIBL","e-
     A                                      rror condition 5":{"fieldName":"88"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 6":"MCR0676","er-
     A                                      ror message file 6":"FSMESG","error-
     A                                       message library 6":"*LIBL","error -
     A                                      condition 6":{"fieldName":"N61 and -
     A                                      62 and N63 and N49","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"F0361FFL_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted","tab index":"9"},{"-
     A                                      id":"constant21","field type":"outp-
     A                                      ut field","value":"Admission date  -
     A                                                         :","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"430px","cursor row-
     A                                      ":"17","parent tab panel":"F0361FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCADDT","field type":"da-
     A                                      te field","css class":"input","css -
     A                                      class 2":"date-field","value":{"fie-
     A                                      ldName":"SCADDT","designValue":"[SC-
     A                                      ADDT]","refField":"DT8","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","numBl-
     A                                      ankFill":"true","edtWrd":"''  /  / -
     A                                         ''","dateFormat":"m/d/Y"},"left"-
     A                                      :"554px","cursor column":"41","top"-
     A                                      :"430px","cursor row":"17","width":-
     A                                      "71px","text align":"right","css cl-
     A                                      ass 3":"HI","css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"error mes-
     A                                      sage id":"MCR0500","error message f-
     A                                      ile":"FSMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"54","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"6 mes-
     A                                      sages","error message id 2":"MC4005-
     A                                      6","error message file 2":"FSMESG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"89-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 3":"MCR2397","e-
     A                                      rror message file 3":"FSMESG","erro-
     A                                      r message library 3":"*LIBL","error-
     A                                       condition 3":{"field')
     A                                  1  2HTML('Name":"50","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      4":"MCR0556","error message file 4"-
     A                                      :"FSMESG","error message library 4"-
     A                                      :"*LIBL","error condition 4":{"fiel-
     A                                      dName":"N09 and 48","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 5":"MC40277","error message file-
     A                                       5":"FSMESG","error message library-
     A                                       5":"*LIBL","error condition 5":{"f-
     A                                      ieldName":"55","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 6"-
     A                                      :"MCR0676","error message file 6":"-
     A                                      FSMESG","error message library 6":"-
     A                                      *LIBL","error condition 6":{"fieldN-
     A                                      ame":"N61 and N62 and 63 and N49","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"F0361FFL_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted","tab -
     A                                      index":"10"},{"id":"constant22","fi-
     A                                      eld type":"output field","value":"A-
     A                                      dmission hour       :","css class":-
     A                                      "constant","left":"670px","cursor c-
     A                                      olumn":"52","top":"430px","cursor r-
     A                                      ow":"17","parent tab panel":"F0361F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCADHR","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCADHR","designValue":"[SCADHR-
     A                                      ]","refField":"DS2","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","left":"83-
     A                                      0px","cursor column":"75","top":"43-
     A                                      0px","cursor row":"17","width":"15p-
     A                                      x","css class 3":"HI","css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "error message id":"MC40271","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"51","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"4 messages","error message id -
     A                                      2":"MCR0676","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"N61 and N62 and N63 and 49"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 3":"MCR2484","er-
     A                                      ror message file 3":"FSMESG","error-
     A                                       message library 3":"*LIBL","error -
     A                                      condition 3":{"fieldN')
     A                                  1  2HTML('ame":"N56 and 57 and 97","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or message id 4":"MCR2485","error m-
     A                                      essage file 4":"FSMESG","error mess-
     A                                      age library 4":"*LIBL","error condi-
     A                                      tion 4":{"fieldName":"N56 and N57 a-
     A                                      nd 97","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"parent tab panel":"F0361FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d","tab index":"11"},{"id":"constan-
     A                                      t31","field type":"output field","v-
     A                                      alue":"Type of admission           -
     A                                             :","css class":"constant","l-
     A                                      eft":"295px","cursor column":"4","t-
     A                                      op":"450px","cursor row":"18","pare-
     A                                      nt tab panel":"F0361FFL_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CADTY","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCADTY","-
     A                                      designValue":"[SCADTY]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase","dataL-
     A                                      ength":"1"},"text transform":"upper-
     A                                      case","left":"554px","cursor column-
     A                                      ":"41","top":"450px","cursor row":"-
     A                                      18","width":"8px","css class 3":"HI-
     A                                      ","read only":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 4":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"PR","customFa-
     A                                      lse":""},"css class 5":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"39","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error message id"-
     A                                      :"MC40113","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      91","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"MCR2434","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"92","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"F0361FFL_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted","tab index-
     A                                      ":"12"},{"id":"SCATDS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCATDS","designValue":"[SCATDS]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      ","dataLength":"35"},"css class":"o-
     A                                      utput-field","left":"582px","cursor-
     A                                       column":"45","top":"450px","cursor-
     A                                       row":"18","parent ta')
     A                                  1  2HTML('b panel":"F0361FFL_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant23","field type":"output fi-
     A                                      eld","value":"Discharge date       -
     A                                                    :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"470px","cursor row":"19-
     A                                      ","parent tab panel":"F0361FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCDCDT","field type":"date fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"date-field","value":{"fieldNam-
     A                                      e":"SCDCDT","designValue":"[SCDCDT]-
     A                                      ","refField":"DT8","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00","numBlankFi-
     A                                      ll":"true","edtWrd":"''  /  /    ''-
     A                                      ","dateFormat":"m/d/Y"},"left":"554-
     A                                      px","cursor column":"41","top":"470-
     A                                      px","cursor row":"19","width":"71px-
     A                                      ","text align":"right","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"set focus":{"fieldName":"41"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"MCR0500-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"58","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"3 messages","error mes-
     A                                      sage id 2":"MC40275","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"59","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 3":"MCR0676","error message file-
     A                                       3":"FSMESG","error message library-
     A                                       3":"*LIBL","error condition 3":{"f-
     A                                      ieldName":"61 and 62 and N63 and N4-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"parent tab panel":"F0361FFL_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted","-
     A                                      tab index":"13"},{"id":"constant24"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Discharge hour       :","css cla-
     A                                      ss":"constant","left":"670px","curs-
     A                                      or column":"52","top":"470px","curs-
     A                                      or row":"19","parent tab panel":"F0-
     A                                      361FFL_SCR01_MainTabP')
     A                                  1  2HTML('anel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCDCHR","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCDCHR-
     A                                      ","designValue":"[SCDCHR]","refFiel-
     A                                      d":"DS2","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"830px","curso-
     A                                      r column":"75","top":"470px","curso-
     A                                      r row":"19","width":"15px","css cla-
     A                                      ss 3":"HI","css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"error mess-
     A                                      age id":"MC40271","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"52","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"5 mess-
     A                                      ages","error message id 2":"MCR0503-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"66"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 3":"MCR0676","er-
     A                                      ror message file 3":"FSMESG","error-
     A                                       message library 3":"*LIBL","error -
     A                                      condition 3":{"fieldName":"N61 and -
     A                                      62 and 63 and N49","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 4":"MCR2484","error message file -
     A                                      4":"FSMESG","error message library -
     A                                      4":"*LIBL","error condition 4":{"fi-
     A                                      eldName":"56 and N57 and N97","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 5":"MCR2485","error me-
     A                                      ssage file 5":"FSMESG","error messa-
     A                                      ge library 5":"*LIBL","error condit-
     A                                      ion 5":{"fieldName":"N56 and 57 and-
     A                                       N97","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"F0361FFL_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      ","tab index":"14"},{"id":"constant-
     A                                      25","field type":"output field","va-
     A                                      lue":"Type of service              -
     A                                            :","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"490px","cursor row":"20","paren-
     A                                      t tab panel":"F0361FFL_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      ICN","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCICN","des-
     A                                      ignValue":"[SCICN]","')
     A                                  1  2HTML('refField":"CODE","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "554px","cursor column":"41","top":-
     A                                      "490px","cursor row":"20","width":"-
     A                                      15px","css class 3":"HI","css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"set focus":{"fieldName":"32","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message id":"MCR0503","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"82","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"4 messages","error messag-
     A                                      e id 2":"MCR2441","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"83","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      3":"MC40280","error message file 3"-
     A                                      :"FSMESG","error message library 3"-
     A                                      :"*LIBL","error condition 3":{"fiel-
     A                                      dName":"79","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error message id 4":"M-
     A                                      C40281","error message file 4":"FSM-
     A                                      ESG","error message library 4":"*LI-
     A                                      BL","error condition 4":{"fieldName-
     A                                      ":"46","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"parent tab panel":"F0361FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d","tab index":"15"},{"id":"SCICDS"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCICDS","designValu-
     A                                      e":"[SCICDS]","refField":"DS35","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"582px","cursor column":"45","to-
     A                                      p":"490px","cursor row":"20","paren-
     A                                      t tab panel":"F0361FFL_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant26","field type":"output fiel-
     A                                      d","value":"Type of service (status-
     A                                      )           :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"510px","cursor row":"21",-
     A                                      "parent tab panel":"F0361FFL_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCDCN","field type":"textbox","-
     A                                      css class":"input","c')
     A                                  1  2HTML('ss class 2":"textbox","value"-
     A                                      :{"fieldName":"SCDCN","designValue"-
     A                                      :"[SCDCN]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"554px","cursor column":"41",-
     A                                      "top":"510px","cursor row":"21","wi-
     A                                      dth":"8px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"35","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"err-
     A                                      or message id":"MCR2441","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"84","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"F03-
     A                                      61FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted","tab index":"16"},{"id":"SC-
     A                                      DCDS","field type":"output field","-
     A                                      value":{"fieldName":"SCDCDS","desig-
     A                                      nValue":"[SCDCDS]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"8-
     A                                      "},"css class":"output-field","left-
     A                                      ":"582px","cursor column":"45","top-
     A                                      ":"510px","cursor row":"21","parent-
     A                                       tab panel":"F0361FFL_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant27","field type":"output field-
     A                                      ","value":"Revision Indicator :","c-
     A                                      ss class":"constant","left":"645px"-
     A                                      ,"cursor column":"54","top":"510px"-
     A                                      ,"cursor row":"21","parent tab pane-
     A                                      l":"F0361FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCREVI","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCREVI","designValue-
     A                                      ":"[SCREVI]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase","dataLength":"1"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"790px","cursor column":"75","top-
     A                                      ":"510px","cursor row":"21","width"-
     A                                      :"8px","css class 3":"HI","css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custo')
     A                                  1  2HTML('m Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"set focus"-
     A                                      :{"fieldName":"56 and N57 and 97","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"error message id":"MCR0503",-
     A                                      "error message file":"FSMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"56 and 57 a-
     A                                      nd 97","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"2 messages-
     A                                      ","error message id 2":"MCR0999","e-
     A                                      rror message file 2":"FSMESG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"56 and -
     A                                      57 and N97","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F03-
     A                                      61FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted","tab index":"17"},{"id":"co-
     A                                      nstant28","field type":"output fiel-
     A                                      d","value":"Eligible for data submi-
     A                                      ssion       :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"530px","cursor row":"22",-
     A                                      "parent tab panel":"F0361FFL_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCTAPE","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCTA-
     A                                      PE","designValue":"[SCTAPE]","refFi-
     A                                      eld":"FLAG","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase"},"text transf-
     A                                      orm":"uppercase","visibility":{"fie-
     A                                      ldName":"30","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"555-
     A                                      px","cursor column":"41","top":"530-
     A                                      px","cursor row":"22","width":"8px"-
     A                                      ,"css class 3":{"fieldName":"09 or -
     A                                      30","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09 and 30 and N24","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09 and 30 o-
     A                                      r 24","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 5":{"fieldN-
     A                                      ame":"09 and 30 or 24","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"set-
     A                                       focus":{"fieldName":"38","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"MC4')
     A                                  1  2HTML('0113","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "80","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"2 messages",-
     A                                      "error message id 2":"MC40127","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"81","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"pare-
     A                                      nt tab panel":"F0361FFL_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted","tab inde-
     A                                      x":"18"},{"id":"SCDSDS","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCDSDS","designValue":"[SCDSDS]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"35"},"css class":"-
     A                                      output-field","left":"582px","curso-
     A                                      r column":"45","top":"530px","curso-
     A                                      r row":"22","parent tab panel":"F03-
     A                                      61FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant29","field -
     A                                      type":"output field","value":" ","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "550px","cursor row":"23","css clas-
     A                                      s 2":"BLU","parent tab panel":"F036-
     A                                      1FFL_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant30","field t-
     A                                      ype":"output field","value":" ","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      281px","cursor column":"2","top":"5-
     A                                      50px","cursor row":"23","css class -
     A                                      2":"BLU","parent tab panel":"F0361F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"HREC","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"HREC","designV-
     A                                      alue":"[HREC]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"10"},"-
     A                                      left":"0px","top":"-30px","css clas-
     A                                      s":"profound-converted"},{"id":"HFL-
     A                                      D","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"HFLD","designValue":"[HFLD]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"10"},"left":"0px","top-
     A                                      ":"-30px","css class":"profound-con-
     A                                      verted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            DSPICDIND      1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            INDCCDER1      1A  H
     A            INDCNTYCD      1A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCADTY         1A  H
     A            SCATDS        35A  H
     A            SCDCDS         8A  H
     A            SCDSDS        35A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCHMRA_DOT    11A  H
     A            SCHOT1_DOT    11A  H
     A            SCICDIND       1A  H
     A            SCREVI         1A  H
     A            SCZIP          4S 0H
     A            SCACCT    R        H      REFFLD(DS30)
     A            SCADDT    R        H      REFFLD(DT8)
     A            SCADHR    R        H      REFFLD(DS2)
     A            SCAST     R        H      REFFLD(ST)
     A            SCBLTY    R        H      REFFLD(CODE3)
     A            SCBTDS    R        H      REFFLD(DS35)
     A            SCCHRG    R        H      REFFLD(A112)
     A            SCCNTYCD  R        H      REFFLD(DS3)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCD1DS    R        H      REFFLD(DS30)
     A            SCDCDT    R        H      REFFLD(DT8)
     A            SCDCHR    R        H      REFFLD(DS2)
     A            SCDCN     R        H      REFFLD(FLAG)
     A            SCDIA1    R        H      REFFLD(DS7)
     A            SCFZIP    R        H      REFFLD(ZIP1)
     A            SCHMRA    R        H      REFFLD(DS10)
     A            SCHNET    R        H      REFFLD(DS10)
     A            SCHOT1    R        H      REFFLD(DS10)
     A            SCHOT2    R        H      REFFLD(DS10)
     A            SCICDS    R        H      REFFLD(DS35)
     A            SCICN     R        H      REFFLD(CODE)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A112)
     A            SCNTWK    R        H      REFFLD(A112)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOTH2    R        H      REFFLD(A112)
     A            SCOTHR    R        H      REFFLD(A112)
     A            SCPAID    R        H      REFFLD(A112)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCDS    R        H      REFFLD(DS10)
     A            SCSCPF    R        H      REFFLD(DT8)
     A            SCSCPT    R        H      REFFLD(DT8)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCTAPE    R        H      REFFLD(FLAG)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  10 11 12
     A  13 14 15
     A  17 18 19                            CA01(10 'Response Indicator *IN10')
     A  20 21 22
     A  23 24 25
     A  26 27 34                            CA02(11 'Response Indicator *IN11')
     A  35 36 37
     A  49 61 62
     A  63 64 65                            CA03(12 'Response Indicator *IN12')
     A  66 67 68
     A  69 70 91
     A  92 93 94                            CA04(13 'Response Indicator *IN13')
     A  95 96 09
     A  97 16 28
     A  31 32 33                            CA05(14 'Response Indicator *IN14')
     A  39 40 43
     A  44 45 46
     A  48 50 53                            CA06(15 'Response Indicator *IN15')
     A  71 72 73
     A  74 75 76
     A  77 78 79                            CA07(17 'Response Indicator *IN17')
     A  88 89                               CA08(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(49 'Response Indicator *IN49')
     A                                      SETOF(61 'Response Indicator *IN61')
     A                                      SETOF(62 'Response Indicator *IN62')
     A                                      SETOF(63 'Response Indicator *IN63')
     A                                      SETOF(64 'Response Indicator *IN64')
     A                                      SETOF(65 'Response Indicator *IN65')
     A                                      SETOF(66 'Response Indicator *IN66')
     A                                      SETOF(67 'Response Indicator *IN67')
     A                                      SETOF(68 'Response Indicator *IN68')
     A                                      SETOF(69 'Response Indicator *IN69')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                      SETOF(92 'Response Indicator *IN92')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                      SETOF(94 'Response Indicator *IN94')
     A                                      SETOF(95 'Response Indicator *IN95')
     A                                      SETOF(96 'Response Indicator *IN96')
     A                                  1  2HTML('QPUIREC61   RROWS      2    C-
     A                                      1    1C2    23 RERRMSG    2    C6  -
     A                                        SCFALCC36   The license # must be-
     A                                       ZZ99999999999.E1    9    N91 92N93-
     A                                      RERRMSGID  5    C6    SCFALCC7    M-
     A                                      CR0745C6    FSMESGC5    *LIBLC0    -
     A                                      E1    9     91N92 93RERRMSGID  5   -
     A                                       C6    SCFALCC7    MC40246C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    9     91 -
     A                                      92N93RERRMSGID  5    C6    SCFALCC7-
     A                                          MC40301C6    FSMESGC5    *LIBLC-
     A                                      0    E1    9    N91N92 93RERRMSGID -
     A                                       5    C6    SCFALCC7    MC40320C6  -
     A                                        FSMESGC5    *LIBLC0    E1    9   -
     A                                       N91 92 93RERRMSGID  5    C6    SCF-
     A                                      ALCC7    MC40432C6    FSMESGC5    *-
     A                                      LIBLC0    E1    9    N91 92N93RERRM-
     A                                      SGID  5    C6    SCFALCC7    MC4043-
     A                                      3C6    FSMESGC5    *LIBLC0    E1   -
     A                                       9     91 92 93RERRMSGID  5    C6  -
     A                                        SCFALCC7    MCR0676C6    FSMESGC5-
     A                                          *LIBLC0    E1    9    N94N95 96-
     A                                      RERRMSGID  5    C6    SCFALCC7    M-
     A                                      C40283C6    FSMESGC5    *LIBLC0    -
     A                                      E1    9    N94 95 96RERRMSGID  5   -
     A                                       C6    SCFALCC7    MCR2484C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    9     94 -
     A                                      95 96RERRMSG    2    C6    SCLIC#C3-
     A                                      6   The license # must be ZZ9999999-
     A                                      9999.E1    3     89RERRMSGID  5    -
     A                                      C6    SCLIC#C7    MCR0503C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     68RE-
     A                                      RRMSGID  5    C6    SCLIC#C7    MCR-
     A                                      0745C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     69RERRMSGID  5    C6    S-
     A                                      CLIC#C7    MC40246C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     70RERRMSGID-
     A                                        5    C6    SCLIC#C7    MC40301C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         75RERRMSGID  5    C6    SCLIC#C7-
     A                                          MC40320C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     76RERRMSGID  5    -
     A                                      C6    SCLIC#C7    MC40432C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     89RE-
     A                                      RRMSGID  5    C6    SCLIC#C7    MC4-
     A                                      0433C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     88RERRMSGID  5    C6    S-
     A                                      CLIC#C7    MCR0676C6    FSMESGC5   -
     A                                       *LIBLC0    E1    12    61N62N63 49-
     A                                      RERRMSGID  5    C6    SCLIC#C7    M-
     A                                      C40283C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     10RERRMSGID  5    C6   -
     A                                       SCPPLNC7    MC40113C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     66RERRMSG-
     A                                      ID  5    C6    SCPPLNC7    MCR2441C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           67RERRMSGID  5    C5    SCPCMC-
     A                                      7    MCR0503C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     71RERRMSGID  5   -
     A                                       C5    SCPCMC7    MCR0490C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     72RE-
     A                                      RRMSGID  5    C6    SCPRC1C7    MCR-
     A                                      0489C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     73RERRMSGID  5    C6    S-
     A                                      CPRC1C7    MCR0491C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     50RERRMSGID-
     A                                        5    C6    SCPRC1C7    MC40254C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         64RERRMSGID  5    C6    SCPRC1C7-
     A                                          MCR0676C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     32RERRMSGID  5    -
     A                                      C6    SCPRC1C7    MC50006')
     A                                  1  2HTML('QPUIC6    FSMESGC5    *LIBLC0-
     A                                          FERPRC1    RERRMSGID  5    C6  -
     A                                        SCPRC2C7    MCR0489C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     74RERRMS-
     A                                      GID  5    C6    SCPRC2C7    MCR0491-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     53RERRMSGID  5    C6    SCPRC-
     A                                      2C7    MC40254C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     65RERRMSGID  5 -
     A                                         C6    SCPRC2C7    MCR0676C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     3-
     A                                      3RERRMSGID  5    C6    SCPRC2C7    -
     A                                      MC50006C6    FSMESGC5    *LIBLC0   -
     A                                       FERPRC2    RERRMSGID  5    C6    S-
     A                                      CPRC3C7    MCR0489C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     12RERRMSGID-
     A                                        5    C6    SCPRC3C7    MCR0491C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         13RERRMSGID  5    C6    SCPRC3C7-
     A                                          MC40254C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     14RERRMSGID  5    -
     A                                      C6    SCPRC3C7    MCR0676C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     15RE-
     A                                      RRMSGID  5    C6    SCPRC3C7    MC5-
     A                                      0006C6    FSMESGC5    *LIBLC0    FE-
     A                                      RPRC3    RERRMSGID  5    C6    SCPR-
     A                                      C4C7    MCR0489C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     18RERRMSGID  5-
     A                                          C6    SCPRC4C7    MCR0491C6    -
     A                                      FSMESGC5    *LIBLC0    E1    3     -
     A                                      19RERRMSGID  5    C6    SCPRC4C7   -
     A                                       MC40254C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     20RERRMSGID  5    C6 -
     A                                         SCPRC4C7    MCR0676C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     21RERRM-
     A                                      SGID  5    C6    SCPRC4C7    MC5000-
     A                                      6C6    FSMESGC5    *LIBLC0    FERPR-
     A                                      C4    RERRMSGID  5    C6    SCPRC5C-
     A                                      7    MCR0489C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     23RERRMSGID  5   -
     A                                       C6    SCPRC5C7    MCR0491C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     24R-
     A                                      ERRMSGID  5    C6    SCPRC5C7    MC-
     A                                      40254C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     25RERRMSGID  5    C6    -
     A                                      SCPRC5C7    MCR0676C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     26RERRMSGI-
     A                                      D  5    C6    SCPRC5C7    MC50006C6-
     A                                          FSMESGC5    *LIBLC0    FERPRC5 -
     A                                         RERRMSGID  5    C6    SCPRC6C7  -
     A                                        MCR0489C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     34RERRMSGID  5    C6-
     A                                          SCPRC6C7    MCR0491C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     35RERR-
     A                                      MSGID  5    C6    SCPRC6C7    MC402-
     A                                      54C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     36RERRMSGID  5    C6    SCP-
     A                                      RC6C7    MCR0676C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     37RERRMSGID  -
     A                                      5    C6    SCPRC6C7    MC50006C6   -
     A                                       FSMESGC5    *LIBLC0    FERPRC6    -
     A                                      RERRMSGID  5    C6    SCDIA2C7    M-
     A                                      CR2392C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     77RERRMSGID  5    C6   -
     A                                       SCDIA2C7    MC50006C6    FSMESGC5 -
     A                                         *LIBLC0    FERDIA2    RERRMSGID -
     A                                       5    C6    SCDIA3C7    MCR2392C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        78RERRMSGID  5    C6    SCDIA3C7 -
     A                                         MC50006C6    FSMESGC5    *LIBLC0-
     A                                          FERDIA3    RERRMSGID  5    C6  -
     A                                        SCDIA4C7    MCR2392C6')
     A                                  1  2HTML('QPUI    FSMESGC5    *LIBLC0  -
     A                                        E1    3     79RERRMSGID  5    C6 -
     A                                         SCDIA4C7    MC50006C6    FSMESGC-
     A                                      5    *LIBLC0    FERDIA4    ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN10","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN11","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN12","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN13","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN14","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN15","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN17","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN18","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN19","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N20","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN2-
     A                                      1","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN22"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN23","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN24","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN25","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN26","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN27","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN34","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN35","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 20":{-
     A                                      "fieldName":"*IN36","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 21":{"f-
     A                                      ieldName":"*IN37","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 22":{"fie-
     A                                      ldName":"*IN49","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 23":{"field-
     A                                      Name":"*IN61","dataTy')
     A                                  1  2HTML('pe":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 24":{"fieldName":"*IN62","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 25":{"fieldName":"*IN63","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 26":{"fieldName":"*IN64","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       27":{"fieldName":"*IN65","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 2-
     A                                      8":{"fieldName":"*IN66","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 29"-
     A                                      :{"fieldName":"*IN67","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 30":{-
     A                                      "fieldName":"*IN68","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 31":{"f-
     A                                      ieldName":"*IN69","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 32":{"fie-
     A                                      ldName":"*IN70","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 33":{"field-
     A                                      Name":"*IN91","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 34":{"fieldNa-
     A                                      me":"*IN92","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 35":{"fieldName-
     A                                      ":"*IN93","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 36":{"fieldName":-
     A                                      "*IN94","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 37":{"fieldName":"*-
     A                                      IN95","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 38":{"fieldName":"*IN-
     A                                      96","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"return cursor record":{"fieldNa-
     A                                      me":"HREC","dataLength":"10","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none"},"retu-
     A                                      rn cursor field":{"fieldName":"HFLD-
     A                                      ","dataLength":"10","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"overlay range-
     A                                      ":"1-23"},"items":[{"id":"SCR02_HFL-
     A                                      D","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"HFLD","designValue":"[HFLD]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"10"},"left":"0px","top-
     A                                      ":"-30px","css class":"profound-con-
     A                                      verted"},{"id":"SCR02_HREC","field -
     A                                      type":"output field","visibility":"-
     A                                      hidden","value":{"fieldName":"HREC"-
     A                                      ,"designValue":"[HREC]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"non')
     A                                  1  2HTML('e","dataLength":"10"},"left":-
     A                                      "0px","top":"-30px","css class":"pr-
     A                                      ofound-converted"},{"id":"F0361FFL_-
     A                                      SCR02_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"F0361FFL_SCR02_action","field-
     A                                       type":"html container","white spac-
     A                                      e":"normal","left":"0px","top":"10p-
     A                                      x","width":"230px","css class":"act-
     A                                      ion-panel-converted","height":"700p-
     A                                      x","html":"<div class=\"top\"></div-
     A                                      ><div class=\"imagetop\"><img src=\-
     A                                      "/profoundui/userdata/images/bar_to-
     A                                      p.png\" /></div><div class=\"menuli-
     A                                      nks\"></div><div class=\"imagebotto-
     A                                      m\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_bottom.png\" /></div><d-
     A                                      iv class=\"bottom\"></div>"},{"fiel-
     A                                      d type":"icon menu button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"32px","z index"-
     A                                      :"20","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1170px","id":"F0361FFL_SC-
     A                                      R02_BtnIconMenuSystemTools","tool t-
     A                                      ip":"System Tools","icon source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      systools.png","data function":"Syst-
     A                                      emToolbarSystools","show down arrow-
     A                                      ":"Yes"},{"field type":"panel","pan-
     A                                      el style":"TransformButtonBar","id"-
     A                                      :"F0361FFL_SCR02_ButtonBar","top":"-
     A                                      35px","left":"1036px","width":"187p-
     A                                      x","height":"28px","css class":"sta-
     A                                      tionary","visibility":"hidden","loc-
     A                                      ked in place":"true"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1040px","id":"F0361FFL_SCR-
     A                                      02_BtnSave","tool tip":"Save","oncl-
     A                                      ick":"SystemToolbarSave","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/save.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1066px","id":"F03-
     A                                      61FFL_SCR02_BtnRefresh","tool tip":-
     A                                      "Refresh","onclick":"SystemToolbarR-
     A                                      efresh","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      refresh.png'')"},{"fi')
     A                                  1  2HTML('eld type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1092px","id-
     A                                      ":"F0361FFL_SCR02_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/search.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1118px","id":"F0361FFL_SCR02_-
     A                                      BtnDiaryItems","tool tip":"Diary/Wo-
     A                                      rk Items - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"F0361FFL_SCR02_Btn-
     A                                      SystemMessages","tool tip":"System -
     A                                      Messages","onclick":"SystemToolbarM-
     A                                      essages","background image":{"field-
     A                                      Name":"MsgIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"119-
     A                                      6px","id":"F0361FFL_SCR02_BtnHelp",-
     A                                      "tool tip":"Help","onclick":"System-
     A                                      ToolbarHelp","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/help.png'')"},{"id":"F0361FFL_-
     A                                      SCR02_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","loc')
     A                                  1  2HTML('ked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"F0361FFL_SCR02_MainTabP-
     A                                      anel","field type":"tab panel","tab-
     A                                       panel style":"Transform","tab name-
     A                                      s":{"fieldName":"SCPRDS","designVal-
     A                                      ue":"[SCPRDS]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0361FFL_SCR0-
     A                                      2_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant32","fi-
     A                                      eld type":"output field","left":"28-
     A                                      1px","cursor column":"2","top":"110-
     A                                      px","cursor row":"1","css class":"t-
     A                                      op-line","value":"js: currentUser()-
     A                                      ","css class 2":"output-field","par-
     A                                      ent tab panel":"F0361FFL_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCR02_SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","css-
     A                                       class 3":"HI","parent tab panel":"-
     A                                      F0361FFL_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant33","fie-
     A                                      ld type":"output field","left":"778-
     A                                      px","cursor column":"73","top":"110-
     A                                      px","cursor row":"1","css class":"t-
     A                                      op-line","value":"js: currentDate()-
     A                                      ","css class 2":"output-field","par-
     A                                      ent tab panel":"F0361FFL_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      F0361FFL_SCR02_fkeyMenu","field typ-
     A                                      e":"menu","left":"10px","top":"120p-
     A                                      x","height":"350px","width":"230px"-
     A                                      ,"hover background color":"#9AAA61"-
     A                                      ,"hover text color":"#FFFFFF","bord-
     A                                      er color":"#4C6106","menu option in-
     A                                      dent":"10px","background color":"#7-
     A                                      58B27","css class":"action-menu","c-
     A                                      ss class 2":"stationary","z index":-
     A                                      "101"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0361-
     A                                      FFL_SCR02_BtnHiddenRefresh","value"-
     A                                      :"btnRefresh","top":"125px","respon-
     A                                      se":{"fieldName":"btn')
     A                                  1  2HTML('Refresh","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCR02_Q1PGM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"Q1PGM","designValue"-
     A                                      :"[Q1PGM]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"10"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"F0361FFL_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR02_SCAST"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCAST","designValue-
     A                                      ":"[SCAST]","refField":"ST","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      358px","cursor column":"13","top":"-
     A                                      130px","cursor row":"2","css class -
     A                                      2":"HI","parent tab panel":"F0361FF-
     A                                      L_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCR02_SCZIPA","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCZIPA","designValue":"[SCZIP-
     A                                      A]","refField":"ZIPA","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"379px"-
     A                                      ,"cursor column":"16","top":"130px"-
     A                                      ,"cursor row":"2","css class 2":"HI-
     A                                      ","parent tab panel":"F0361FFL_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCR02_SCPRDS","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"130px","curs-
     A                                      or row":"2","css class 2":"HI","par-
     A                                      ent tab panel":"F0361FFL_SCR02_Main-
     A                                      TabPanel","parent tab":"0","visibil-
     A                                      ity":"hidden","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant34","-
     A                                      field type":"output field","value":-
     A                                      "SCR02","css class":"constant","lef-
     A                                      t":"799px","cursor column":"76","to-
     A                                      p":"130px","cursor row":"2","parent-
     A                                       tab panel":"F0361FFL_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      02_SCMODE","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCMODE","-
     A                                      designValue":"[SCMODE]","refField":-
     A                                      "PGM","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"764px","cursor column"-
     A                                      :"71","top":"150px","cursor row":"3-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F0361FFL_SCR02_')
     A                                  1  2HTML('MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0361FFL_-
     A                                      SCR02_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR02-
     A                                      _SCHD1","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCHD1","desi-
     A                                      gnValue":"[SCHD1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"7-
     A                                      8"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"170px","cursor row":"4","parent -
     A                                      tab panel":"F0361FFL_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0361FFL_SCR02_BtnHidde-
     A                                      nDiaryItems","value":"btnDiary","to-
     A                                      p":"175px","response":{"fieldName":-
     A                                      "btnDiary","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"SCR02_SCHD2","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCHD2","designValue":"[S-
     A                                      CHD2]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"78"},"css cla-
     A                                      ss":"output-field","left":"281px","-
     A                                      cursor column":"2","top":"190px","c-
     A                                      ursor row":"5","parent tab panel":"-
     A                                      F0361FFL_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0361FFL_SCR02_BtnHiddenSystemMessa-
     A                                      ges","value":"btnMessage","top":"20-
     A                                      0px","response":{"fieldName":"btnMe-
     A                                      ssage","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"SCR02_SCHD3","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCHD3","designValue":"[SCHD3-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"78"},"css class":-
     A                                      "output-field","left":"281px","curs-
     A                                      or column":"2","top":"210px","curso-
     A                                      r row":"6","parent tab panel":"F036-
     A                                      1FFL_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidd')
     A                                  1  2HTML('en","id":"F0361FFL_SCR02_BtnH-
     A                                      iddenWorkSubmitJob","value":"btnWrk-
     A                                      sbmjob","top":"225px","response":{"-
     A                                      fieldName":"btnWrkJob","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant35","field type":"output field",-
     A                                      "value":"EOMB#:","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"230px","cursor row":"7"-
     A                                      ,"parent tab panel":"F0361FFL_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR02_SCEOB#","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CEOB#","designValue":"[SCEOB#]","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00","da-
     A                                      taLength":"9","decPos":"0"},"css cl-
     A                                      ass":"output-field","left":"330px",-
     A                                      "cursor column":"9","top":"230px","-
     A                                      cursor row":"7","width":"63px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"F0361FFL_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant36","f-
     A                                      ield type":"output field","value":"-
     A                                      Specialty:","css class":"constant",-
     A                                      "left":"400px","cursor column":"19"-
     A                                      ,"top":"230px","cursor row":"7","pa-
     A                                      rent tab panel":"F0361FFL_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR02_SCSPCD","field type":"output-
     A                                       field","value":{"fieldName":"SCSPC-
     A                                      D","designValue":"[SCSPCD]","refFie-
     A                                      ld":"SPEC","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"477px","cursor co-
     A                                      lumn":"30","top":"230px","cursor ro-
     A                                      w":"7","parent tab panel":"F0361FFL-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR02_SCSCDS","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCSCDS","designValue":"[SCSCDS-
     A                                      ]","refField":"DS10","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"505px",-
     A                                      "cursor column":"34","top":"230px",-
     A                                      "cursor row":"7","parent tab panel"-
     A                                      :"F0361FFL_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant37","f-
     A                                      ield type":"output field","value":"-
     A                                      Fac Zip Code:","css class":"constan-
     A                                      t","left":"582px","cursor column":"-
     A                                      45","top":"230px","cursor row":"7",-
     A                                      "parent tab panel":"F0361FFL_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR02_SCFZIP","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      FZIP","designValue":"[SCFZIP]","ref-
     A                                      Field":"ZIP1","dataType":"reference-
     A                                      ","formatting":"Numbe')
     A                                  1  2HTML('r","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"true","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      "},"css class":"output-field","left-
     A                                      ":"680px","cursor column":"59","top-
     A                                      ":"230px","cursor row":"7","width":-
     A                                      "35px","text align":"right","parent-
     A                                       tab panel":"F0361FFL_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant38","field type":"output field-
     A                                      ","value":"Ntwk:","css class":"cons-
     A                                      tant","visibility":{"fieldName":"16-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"757px","cursor-
     A                                       column":"70","top":"230px","cursor-
     A                                       row":"7","parent tab panel":"F0361-
     A                                      FFL_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCR02_SCNWCD","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCNWCD","designValue":"[SCN-
     A                                      WCD]","refField":"NWCD","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","visibility"-
     A                                      :{"fieldName":"16","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"799px","cursor column":"76","top-
     A                                      ":"230px","cursor row":"7","parent -
     A                                      tab panel":"F0361FFL_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant39","field type":"output field"-
     A                                      ,"value":"EOB/Notes attached","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"68","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"69-
     A                                      4px","cursor column":"61","top":"25-
     A                                      0px","cursor row":"8","css class 2"-
     A                                      :{"fieldName":"68","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"RI","customFalse":""},"parent -
     A                                      tab panel":"F0361FFL_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F0361FFL_SCR02_BtnHidde-
     A                                      nWorkPrinterOutput","value":"btnWrk-
     A                                      prtout","top":"250px","response":{"-
     A                                      fieldName":"btnWrkPrnt","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant40","field type":"output field"-
     A                                      ,"value":"Facility license#        -
     A                                          :","css class":"constant","visi-
     A                                      bility":{"fieldName":"48","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"295px","cursor column":"4-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"F0361FFL_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-con')
     A                                  1  2HTML('verted"},{"id":"SCFALC","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCFALC","designValue"-
     A                                      :"[SCFALC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"15"}-
     A                                      ,"text transform":"uppercase","visi-
     A                                      bility":{"fieldName":"48","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"512px","cursor column":"3-
     A                                      5","top":"270px","cursor row":"9","-
     A                                      width":"106px","css class 3":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"09 or 97","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"set focus":{"fieldName":"91 an-
     A                                      d N92 and N93","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      e":"The license # must be ZZ9999999-
     A                                      9999.","error condition":{"fieldNam-
     A                                      e":"N91 and 92 and N93","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"10 messages","error message -
     A                                      id 2":"MCR0745","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"91 and N92 and 93","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 3":"MC40246","error me-
     A                                      ssage file 3":"FSMESG","error messa-
     A                                      ge library 3":"*LIBL","error condit-
     A                                      ion 3":{"fieldName":"91 and 92 and -
     A                                      N93","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 4":"MC40301"-
     A                                      ,"error message file 4":"FSMESG","e-
     A                                      rror message library 4":"*LIBL","er-
     A                                      ror condition 4":{"fieldName":"N91 -
     A                                      and N92 and 93","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 5-
     A                                      ":"MC40320","error message file 5":-
     A                                      "FSMESG","error message library 5":-
     A                                      "*LIBL","error condition 5":{"field-
     A                                      Name":"N91 and 92 and 93","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 6":"MC40432","error messag-
     A                                      e file 6":"FSMESG","error message l-
     A                                      ibrary 6":"*LIBL","error condition -
     A                                      6":{"fieldName":"N91 and 92 and N93-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 7')
     A                                  1  2HTML('":"MC40433","error message fi-
     A                                      le 7":"FSMESG","error message libra-
     A                                      ry 7":"*LIBL","error condition 7":{-
     A                                      "fieldName":"91 and 92 and 93","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or message id 8":"MCR0676","error m-
     A                                      essage file 8":"FSMESG","error mess-
     A                                      age library 8":"*LIBL","error condi-
     A                                      tion 8":{"fieldName":"N94 and N95 a-
     A                                      nd 96","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 9":"MC4028-
     A                                      3","error message file 9":"FSMESG",-
     A                                      "error message library 9":"*LIBL","-
     A                                      error condition 9":{"fieldName":"N9-
     A                                      4 and 95 and 96","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      10":"MCR2484","error message file 1-
     A                                      0":"FSMESG","error message library -
     A                                      10":"*LIBL","error condition 10":{"-
     A                                      fieldName":"94 and 95 and 96","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"pare-
     A                                      nt tab panel":"F0361FFL_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0361FFL_SCR02_BtnHi-
     A                                      ddenImageQueue","value":"btnImgQue"-
     A                                      ,"top":"275px","response":{"fieldNa-
     A                                      me":"btnImgQue","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant41",-
     A                                      "field type":"output field","value"-
     A                                      :"Attending physician license# :","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"290px"-
     A                                      ,"cursor row":"10","parent tab pane-
     A                                      l":"F0361FFL_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCLIC#","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCLIC#","designValue-
     A                                      ":"[SCLIC#]","refField":"LIC#","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"512px","cursor column":"35-
     A                                      ","top":"290px","cursor row":"10","-
     A                                      width":"92px","css class 3":"HI","c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"28","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error m')
     A                                  1  2HTML('essage":"The license # must b-
     A                                      e ZZ99999999999.","error condition"-
     A                                      :{"fieldName":"89","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"10 messages","error message id 2"-
     A                                      :"MCR0503","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"68","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MCR-
     A                                      0745","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "69","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 4":"MC40246"-
     A                                      ,"error message file 4":"FSMESG","e-
     A                                      rror message library 4":"*LIBL","er-
     A                                      ror condition 4":{"fieldName":"70",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 5":"MC40301","err-
     A                                      or message file 5":"FSMESG","error -
     A                                      message library 5":"*LIBL","error c-
     A                                      ondition 5":{"fieldName":"75","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 6":"MC40320","error me-
     A                                      ssage file 6":"FSMESG","error messa-
     A                                      ge library 6":"*LIBL","error condit-
     A                                      ion 6":{"fieldName":"76","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 7":"MC40432","error message-
     A                                       file 7":"FSMESG","error message li-
     A                                      brary 7":"*LIBL","error condition 7-
     A                                      ":{"fieldName":"89","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 8":"MC40433","error message file-
     A                                       8":"FSMESG","error message library-
     A                                       8":"*LIBL","error condition 8":{"f-
     A                                      ieldName":"88","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 9"-
     A                                      :"MCR0676","error message file 9":"-
     A                                      FSMESG","error message library 9":"-
     A                                      *LIBL","error condition 9":{"fieldN-
     A                                      ame":"61 and N62 and N63 and 49","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror message id 10":"MC40283","erro-
     A                                      r message file 10":"FSMESG","error -
     A                                      message library 10":"*LIBL","error -
     A                                      condition 10":{"fieldName":"10","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"pa-
     A                                      rent tab panel":"F0361FFL_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant42","field type":"output f-
     A                                      ield","value":"Master Lic#:","css c-
     A                                      lass":"constant","left":"617px","cu-
     A                                      rsor column":"50","top":"290px","cu-
     A                                      rsor row":"10","parent tab panel":"-
     A                                      F0361FFL_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCFLIC","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCFLIC","desig')
     A                                  1  2HTML('nValue":"[SCFLIC]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"13"},"css class":"output-field-
     A                                      ","left":"715px","cursor column":"6-
     A                                      4","top":"290px","cursor row":"10",-
     A                                      "parent tab panel":"F0361FFL_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0361FFL_SCR02_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant43","fiel-
     A                                      d type":"output field","value":"Pay-
     A                                      ment plan (detail default):","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"310px","cur-
     A                                      sor row":"11","parent tab panel":"F-
     A                                      0361FFL_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPPLN","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCPPLN","designValue":"[S-
     A                                      CPPLN]","refField":"CODE","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"512px","cursor column":"35","to-
     A                                      p":"310px","cursor row":"11","width-
     A                                      ":"15px","css class 3":"HI","css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"set focus":{"fieldName":"31"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"MC40113-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"66","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"MCR2441","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"67","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"F0361FFL_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"SCPPLD","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCPPLD","designValue":"-
     A                                      [SCPPLD]","refField":')
     A                                  1  2HTML('"DS35","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"540px","cursor -
     A                                      column":"39","top":"310px","cursor -
     A                                      row":"11","parent tab panel":"F0361-
     A                                      FFL_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant44","field ty-
     A                                      pe":"output field","value":"Procedu-
     A                                      re code method        :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"350px","cursor -
     A                                      row":"13","parent tab panel":"F0361-
     A                                      FFL_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPCM","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCPCM","designValue":"[SCPCM]"-
     A                                      ,"refField":"FLAG","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"512-
     A                                      px","cursor column":"35","top":"350-
     A                                      px","cursor row":"13","width":"8px"-
     A                                      ,"css class 3":"HI","css class 4":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"46","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"MCR0503","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"71","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0490","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"72","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F03-
     A                                      61FFL_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"id":"SCPDSC","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPDSC","designValue":"[SCPDSC]-
     A                                      ","refField":"DS35","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"540px","-
     A                                      cursor column":"39","top":"350px","-
     A                                      cursor row":"13","parent tab panel"-
     A                                      :"F0361FFL_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant45","f-
     A                                      ield type":"output fi')
     A                                  1  2HTML('eld","value":"Principal proc -
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"37-
     A                                      0px","cursor row":"14","parent tab -
     A                                      panel":"F0361FFL_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPRC1",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCPRC1","refFiel-
     A                                      d":"DS7","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "reference","formatting":"Text","te-
     A                                      xtTransform":"uppercase","designVal-
     A                                      ue":"[SCPRC1]"},"text transform":"u-
     A                                      ppercase","left":"415px","cursor co-
     A                                      lumn":"21","top":"370px","cursor ro-
     A                                      w":"14","width":"50px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"set focus":{"fieldName":"39"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error messages":"5 message-
     A                                      s","parent tab panel":"F0361FFL_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted","-
     A                                      text align":"left","error message i-
     A                                      d":"MCR0489","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"73","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode":"0","er-
     A                                      ror message id 2":"MCR0491","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"50","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error e-
     A                                      nhanced mode 2":"0","error message -
     A                                      id 3":"MC40254","error message file-
     A                                       3":"FSMESG","error message library-
     A                                       3":"*LIBL","error condition 3":{"f-
     A                                      ieldName":"64","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                       3":"0","error message id 4":"MCR06-
     A                                      76","error message file 4":"FSMESG"-
     A                                      ,"error message library 4":"*LIBL",-
     A                                      "error condition 4":{"fieldName":"3-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error enhanced mode 4":"0","err-
     A                                      or message id 5":"MC50006","error m-
     A                                      essage file 5":"FSMESG","error mess-
     A                                      age library 5":"*LIBL","error condi-
     A                                      tion 5":{"fieldName":')
     A                                  1  2HTML('"ERPRC1","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error enhanced mode -
     A                                      5":"0"},{"id":"SCLOS1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCLOS1","designValue":"[SCLOS1]"-
     A                                      ,"refField":"FLAG","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"470px","c-
     A                                      ursor column":"27","top":"370px","c-
     A                                      ursor row":"14","parent tab panel":-
     A                                      "F0361FFL_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCP1DS","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCP1DS","designValue":"[SCP-
     A                                      1DS]","refField":"DS40","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"490p-
     A                                      x","cursor column":"30","top":"370p-
     A                                      x","cursor row":"14","parent tab pa-
     A                                      nel":"F0361FFL_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant46-
     A                                      ","field type":"output field","valu-
     A                                      e":"Other proc (2) :","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"F0361FFL-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPRC2","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCPRC2","refField":"DS7","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"up-
     A                                      percase","designValue":"[SCPRC2]"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"415px","cursor column":"21","top"-
     A                                      :"390px","cursor row":"15","width":-
     A                                      "50px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"set focus-
     A                                      ":{"fieldName":"40","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essages":"5 messages","parent tab p-
     A                                      anel":"F0361FFL_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted","text align":"lef-
     A                                      t","error message id":"MCR0489","er-
     A                                      ror message file":"FS')
     A                                  1  2HTML('MESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"74","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode":"0"-
     A                                      ,"error message id 2":"MCR0491","er-
     A                                      ror message file 2":"FSMESG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"53","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or enhanced mode 2":"0","error mess-
     A                                      age id 3":"MC40254","error message -
     A                                      file 3":"FSMESG","error message lib-
     A                                      rary 3":"*LIBL","error condition 3"-
     A                                      :{"fieldName":"65","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error enhanced -
     A                                      mode 3":"0","error message id 4":"M-
     A                                      CR0676","error message file 4":"FSM-
     A                                      ESG","error message library 4":"*LI-
     A                                      BL","error condition 4":{"fieldName-
     A                                      ":"33","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error enhanced mode 4":"0",-
     A                                      "error message id 5":"MC50006","err-
     A                                      or message file 5":"FSMESG","error -
     A                                      message library 5":"*LIBL","error c-
     A                                      ondition 5":{"fieldName":"ERPRC2","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode 5":"0"},{"id":"S-
     A                                      CLOS2","field type":"output field",-
     A                                      "value":{"fieldName":"SCLOS2","desi-
     A                                      gnValue":"[SCLOS2]","refField":"FLA-
     A                                      G","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"470px","cursor column":"2-
     A                                      7","top":"390px","cursor row":"15",-
     A                                      "parent tab panel":"F0361FFL_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCP2DS","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCP2DS",-
     A                                      "designValue":"[SCP2DS]","refField"-
     A                                      :"DS40","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"490px","cursor colum-
     A                                      n":"30","top":"390px","cursor row":-
     A                                      "15","parent tab panel":"F0361FFL_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant47","field type":"-
     A                                      output field","value":"Other proc (-
     A                                      3) :","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "410px","cursor row":"16","parent t-
     A                                      ab panel":"F0361FFL_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCPRC-
     A                                      3","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCPRC3","refF-
     A                                      ield":"DS7","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "textTransform":"uppe')
     A                                  1  2HTML('rcase","designValue":"[SCPRC3-
     A                                      ]"},"text transform":"uppercase","l-
     A                                      eft":"415px","cursor column":"21","-
     A                                      top":"410px","cursor row":"16","wid-
     A                                      th":"50px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"set focus":{-
     A                                      "fieldName":"11","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"err-
     A                                      or messages":"5 messages","parent t-
     A                                      ab panel":"F0361FFL_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted","text align":-
     A                                      "left","error message id":"MCR0489"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"12","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       enhanced mode":"0","error message -
     A                                      id 2":"MCR0491","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"13","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                       2":"0","error message id 3":"MC402-
     A                                      54","error message file 3":"FSMESG"-
     A                                      ,"error message library 3":"*LIBL",-
     A                                      "error condition 3":{"fieldName":"1-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error enhanced mode 3":"0","err-
     A                                      or message id 4":"MCR0676","error m-
     A                                      essage file 4":"FSMESG","error mess-
     A                                      age library 4":"*LIBL","error condi-
     A                                      tion 4":{"fieldName":"15","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error en-
     A                                      hanced mode 4":"0","error message i-
     A                                      d 5":"MC50006","error message file -
     A                                      5":"FSMESG","error message library -
     A                                      5":"*LIBL","error condition 5":{"fi-
     A                                      eldName":"ERPRC3","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de 5":"0"},{"id":"SCLOS3","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCLOS3","designValue":"[SCLOS-
     A                                      3]","refField":"FLAG","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"470px"-
     A                                      ,"cursor column":"27","top":"410px"-
     A                                      ,"cursor row":"16","parent tab pane-
     A                                      l":"F0361FFL_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css c')
     A                                  1  2HTML('lass 2":"profound-converted"}-
     A                                      ,{"id":"SCP3DS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCP3-
     A                                      DS","designValue":"[SCP3DS]","refFi-
     A                                      eld":"DS40","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"490px","cursor c-
     A                                      olumn":"30","top":"410px","cursor r-
     A                                      ow":"16","parent tab panel":"F0361F-
     A                                      FL_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant48","field typ-
     A                                      e":"output field","value":"Other pr-
     A                                      oc (4) :","css class":"constant","l-
     A                                      eft":"295px","cursor column":"4","t-
     A                                      op":"430px","cursor row":"17","pare-
     A                                      nt tab panel":"F0361FFL_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPRC4","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCPRC4","-
     A                                      refField":"DS7","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","textTransform":"uppercase","de-
     A                                      signValue":"[SCPRC4]"},"text transf-
     A                                      orm":"uppercase","left":"415px","cu-
     A                                      rsor column":"21","top":"430px","cu-
     A                                      rsor row":"17","width":"50px","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"set focus":{"fieldName":"17"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"error messages":"5 -
     A                                      messages","parent tab panel":"F0361-
     A                                      FFL_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted","text align":"left","error me-
     A                                      ssage id":"MCR0489","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"18","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error enhanced mode":-
     A                                      "0","error message id 2":"MCR0491",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"19","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error enhanced mode 2":"0","error m-
     A                                      essage id 3":"MC40254","error messa-
     A                                      ge file 3":"FSMESG","error message -
     A                                      library 3":"*LIBL","e')
     A                                  1  2HTML('rror condition 3":{"fieldName-
     A                                      ":"20","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error enhanced mode 3":"0",-
     A                                      "error message id 4":"MCR0676","err-
     A                                      or message file 4":"FSMESG","error -
     A                                      message library 4":"*LIBL","error c-
     A                                      ondition 4":{"fieldName":"21","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r enhanced mode 4":"0","error messa-
     A                                      ge id 5":"MC50006","error message f-
     A                                      ile 5":"FSMESG","error message libr-
     A                                      ary 5":"*LIBL","error condition 5":-
     A                                      {"fieldName":"ERPRC4","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error enhance-
     A                                      d mode 5":"0"},{"id":"SCLOS4","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCLOS4","designValue":"[S-
     A                                      CLOS4]","refField":"FLAG","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"47-
     A                                      0px","cursor column":"27","top":"43-
     A                                      0px","cursor row":"17","parent tab -
     A                                      panel":"F0361FFL_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCP4DS",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCP4DS","designValue-
     A                                      ":"[SCP4DS]","refField":"DS40","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"490px","cursor column":"30","top-
     A                                      ":"430px","cursor row":"17","parent-
     A                                       tab panel":"F0361FFL_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant49","field type":"output field-
     A                                      ","value":"Other proc (5) :","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"450px","cur-
     A                                      sor row":"18","parent tab panel":"F-
     A                                      0361FFL_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPRC5","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCPRC5","refField":"DS7",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"referenc-
     A                                      e","formatting":"Text","textTransfo-
     A                                      rm":"uppercase","designValue":"[SCP-
     A                                      RC5]"},"text transform":"uppercase"-
     A                                      ,"left":"415px","cursor column":"21-
     A                                      ","top":"450px","cursor row":"18","-
     A                                      width":"50px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"set focus-
     A                                      ":{"fieldName":"22","dataType":"exp-
     A                                      ression","formatting"')
     A                                  1  2HTML(':"Indicator","indFormat":"tru-
     A                                      e / false"},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"error messages"-
     A                                      :"5 messages","parent tab panel":"F-
     A                                      0361FFL_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted","text align":"left","erro-
     A                                      r message id":"MCR0489","error mess-
     A                                      age file":"FSMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"23","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de":"0","error message id 2":"MCR04-
     A                                      91","error message file 2":"FSMESG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{"fieldName":"2-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error enhanced mode 2":"0","err-
     A                                      or message id 3":"MC40254","error m-
     A                                      essage file 3":"FSMESG","error mess-
     A                                      age library 3":"*LIBL","error condi-
     A                                      tion 3":{"fieldName":"25","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error en-
     A                                      hanced mode 3":"0","error message i-
     A                                      d 4":"MCR0676","error message file -
     A                                      4":"FSMESG","error message library -
     A                                      4":"*LIBL","error condition 4":{"fi-
     A                                      eldName":"26","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error enhanced mode -
     A                                      4":"0","error message id 5":"MC5000-
     A                                      6","error message file 5":"FSMESG",-
     A                                      "error message library 5":"*LIBL","-
     A                                      error condition 5":{"fieldName":"ER-
     A                                      PRC5","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode 5":"0"},{-
     A                                      "id":"SCLOS5","field type":"output -
     A                                      field","value":{"fieldName":"SCLOS5-
     A                                      ","designValue":"[SCLOS5]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"470px","cursor col-
     A                                      umn":"27","top":"450px","cursor row-
     A                                      ":"18","parent tab panel":"F0361FFL-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCP5DS","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CP5DS","designValue":"[SCP5DS]","re-
     A                                      fField":"DS40","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"490px","curso-
     A                                      r column":"30","top":"450px","curso-
     A                                      r row":"18","parent tab panel":"F03-
     A                                      61FFL_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant50","field -
     A                                      type":"output field",')
     A                                  1  2HTML('"value":"Other proc (6) :","c-
     A                                      ss class":"constant","left":"295px"-
     A                                      ,"cursor column":"4","top":"470px",-
     A                                      "cursor row":"19","parent tab panel-
     A                                      ":"F0361FFL_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCPRC6","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCPRC6","refField":"D-
     A                                      S7","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"refe-
     A                                      rence","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [SCPRC6]"},"text transform":"upperc-
     A                                      ase","left":"415px","cursor column"-
     A                                      :"21","top":"470px","cursor row":"1-
     A                                      9","width":"50px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"27","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"error messages":"5 messages","p-
     A                                      arent tab panel":"F0361FFL_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted","text -
     A                                      align":"left","error message id":"M-
     A                                      CR0489","error message file":"FSMES-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"34"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode":"0","error m-
     A                                      essage id 2":"MCR0491","error messa-
     A                                      ge file 2":"FSMESG","error message -
     A                                      library 2":"*LIBL","error condition-
     A                                       2":{"fieldName":"35","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode 2":"0","error message id 3"-
     A                                      :"MC40254","error message file 3":"-
     A                                      FSMESG","error message library 3":"-
     A                                      *LIBL","error condition 3":{"fieldN-
     A                                      ame":"36","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode 3":"-
     A                                      0","error message id 4":"MCR0676","-
     A                                      error message file 4":"FSMESG","err-
     A                                      or message library 4":"*LIBL","erro-
     A                                      r condition 4":{"fieldName":"37","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode 4":"0","error me-
     A                                      ssage id 5":"MC50006","error messag-
     A                                      e file 5":"FSMESG","error message l-
     A                                      ibrary 5":"*LIBL","error condition -
     A                                      5":{"fieldName":"ERPR')
     A                                  1  2HTML('C6","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode 5":"0-
     A                                      "},{"id":"SCLOS6","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      LOS6","designValue":"[SCLOS6]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"470px","cursor-
     A                                       column":"27","top":"470px","cursor-
     A                                       row":"19","parent tab panel":"F036-
     A                                      1FFL_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCP6DS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCP6DS","designValue":"[SCP6DS]"-
     A                                      ,"refField":"DS40","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"490px","c-
     A                                      ursor column":"30","top":"470px","c-
     A                                      ursor row":"19","parent tab panel":-
     A                                      "F0361FFL_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant51","fi-
     A                                      eld type":"output field","value":"O-
     A                                      ther diag (2) :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"490px","cursor row":"20-
     A                                      ","parent tab panel":"F0361FFL_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCDIA2","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      DIA2","refField":"DS7","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"reference","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCDIA2]"},"text-
     A                                       transform":"uppercase","left":"415-
     A                                      px","cursor column":"21","top":"490-
     A                                      px","cursor row":"20","width":"50px-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"43","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      es":"2 messages","parent tab panel"-
     A                                      :"F0361FFL_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted","text align":"left","e-
     A                                      rror message id":"MCR2392","error m-
     A                                      essage file":"FSMESG"')
     A                                  1  2HTML(',"error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "77","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode":"0","err-
     A                                      or message id 2":"MC50006","error m-
     A                                      essage file 2":"FSMESG","error mess-
     A                                      age library 2":"*LIBL","error condi-
     A                                      tion 2":{"fieldName":"ERDIA2","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       enhanced mode 2":"0"},{"id":"SCD2D-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCD2DS","designVa-
     A                                      lue":"[SCD2DS]","refField":"DS40","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"490px","cursor column":"30","-
     A                                      top":"490px","cursor row":"20","par-
     A                                      ent tab panel":"F0361FFL_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant52","field type":"output fi-
     A                                      eld","value":"Other diag (3) :","cs-
     A                                      s class":"constant","left":"295px",-
     A                                      "cursor column":"4","top":"510px","-
     A                                      cursor row":"21","parent tab panel"-
     A                                      :"F0361FFL_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCDIA3","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCDIA3","refField":"DS-
     A                                      7","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"refer-
     A                                      ence","formatting":"Text","textTran-
     A                                      sform":"uppercase","designValue":"[-
     A                                      SCDIA3]"},"text transform":"upperca-
     A                                      se","left":"415px","cursor column":-
     A                                      "21","top":"510px","cursor row":"21-
     A                                      ","width":"50px","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "set focus":{"fieldName":"44","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error messages":"2 messages","pa-
     A                                      rent tab panel":"F0361FFL_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted","text a-
     A                                      lign":"left","error message id":"MC-
     A                                      R2392","error message file":"FSMESG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"78",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFor')
     A                                  1  2HTML('mat":"1 / 0"},"error enhanced-
     A                                       mode":"0","error message id 2":"MC-
     A                                      50006","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"ERDIA3","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode 2":"0-
     A                                      "},{"id":"SCD3DS","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      D3DS","designValue":"[SCD3DS]","ref-
     A                                      Field":"DS40","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"490px","cursor-
     A                                       column":"30","top":"510px","cursor-
     A                                       row":"21","parent tab panel":"F036-
     A                                      1FFL_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant53","field t-
     A                                      ype":"output field","value":"Other -
     A                                      diag (4) :","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"530px","cursor row":"22","pa-
     A                                      rent tab panel":"F0361FFL_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCDIA4","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCDIA4"-
     A                                      ,"refField":"DS7","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","textTransform":"uppercase","-
     A                                      designValue":"[SCDIA4]"},"text tran-
     A                                      sform":"uppercase","left":"415px","-
     A                                      cursor column":"21","top":"530px","-
     A                                      cursor row":"22","width":"50px","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"45","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error messages":"-
     A                                      2 messages","parent tab panel":"F03-
     A                                      61FFL_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted","text align":"left","error -
     A                                      message id":"MCR2392","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"79","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                      ":"0","error message id 2":"MC50006-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library')
     A                                  1  2HTML(' 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"ERDIA4","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error enha-
     A                                      nced mode 2":"0"},{"id":"SCD4DS","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCD4DS","designValue":-
     A                                      "[SCD4DS]","refField":"DS40","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "490px","cursor column":"30","top":-
     A                                      "530px","cursor row":"22","parent t-
     A                                      ab panel":"F0361FFL_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant54","field type":"output field",-
     A                                      "value":" ","css class":"constant",-
     A                                      "visibility":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"274px","cursor colum-
     A                                      n":"1","top":"550px","cursor row":"-
     A                                      23","css class 2":"BLU","parent tab-
     A                                       panel":"F0361FFL_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t55","field type":"output field","v-
     A                                      alue":" ","css class":"constant","v-
     A                                      isibility":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"281px","cursor column-
     A                                      ":"2","top":"550px","cursor row":"2-
     A                                      3","css class 2":"BLU","parent tab -
     A                                      panel":"F0361FFL_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"btnSubmi-
     A                                      t","field type":"button","value":"E-
     A                                      nter","shortcut key":"Enter","left"-
     A                                      :"14px","top":"150px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF03","field -
     A                                      type":"button","visibility":{"field-
     A                                      Name":"09 or N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"value-
     A                                      ":"Exit","shortcut key":"F3","left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF10","field -
     A                                      type":"button","visibility":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"value":"Sea-
     A                                      rch","shortcut key":"F10","left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF12","field typ-
     A                                      e":"button","visibility":{"fieldNam-
     A                                      e":"09 or N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"value":"-
     A                                      Cancel","shortcut key":"F12","left"-
     A                                      :"14px","top":"249px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            ERDIA2         1A  H
     A            ERDIA3         1A  H
     A            ERDIA4         1A  H
     A            ERPRC1         1A  H
     A            ERPRC2         1A  H
     A            ERPRC3         1A  H
     A            ERPRC4         1A  H
     A            ERPRC5         1A  H
     A            ERPRC6         1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB#         9S 0H
     A            SCFALC        15A  H
     A            SCFLIC        13A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCD2DS    R        H      REFFLD(DS40)
     A            SCD3DS    R        H      REFFLD(DS40)
     A            SCD4DS    R        H      REFFLD(DS40)
     A            SCDIA2    R        H      REFFLD(DS7)
     A            SCDIA3    R        H      REFFLD(DS7)
     A            SCDIA4    R        H      REFFLD(DS7)
     A            SCFZIP    R        H      REFFLD(ZIP1)
     A            SCLIC#    R        H      REFFLD(LIC#)
     A            SCLOS1    R        H      REFFLD(FLAG)
     A            SCLOS2    R        H      REFFLD(FLAG)
     A            SCLOS3    R        H      REFFLD(FLAG)
     A            SCLOS4    R        H      REFFLD(FLAG)
     A            SCLOS5    R        H      REFFLD(FLAG)
     A            SCLOS6    R        H      REFFLD(FLAG)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCP1DS    R        H      REFFLD(DS40)
     A            SCP2DS    R        H      REFFLD(DS40)
     A            SCP3DS    R        H      REFFLD(DS40)
     A            SCP4DS    R        H      REFFLD(DS40)
     A            SCP5DS    R        H      REFFLD(DS40)
     A            SCP6DS    R        H      REFFLD(DS40)
     A            SCPCM     R        H      REFFLD(FLAG)
     A            SCPDSC    R        H      REFFLD(DS35)
     A            SCPPLD    R        H      REFFLD(DS35)
     A            SCPPLN    R        H      REFFLD(CODE)
     A            SCPRC1    R        H      REFFLD(DS7)
     A            SCPRC2    R        H      REFFLD(DS7)
     A            SCPRC3    R        H      REFFLD(DS7)
     A            SCPRC4    R        H      REFFLD(DS7)
     A            SCPRC5    R        H      REFFLD(DS7)
     A            SCPRC6    R        H      REFFLD(DS7)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCDS    R        H      REFFLD(DS10)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR03
     A  04 05 06
     A  07 10 11
     A  17 18 31                            CA01(04 'Response Indicator *IN04')
     A  35 37 38
     A  39 40 41
     A  42 49 56                            CA02(05 'Response Indicator *IN05')
     A  61 62 63
     A  64 65 66
     A  67 68 69                            CA03(06 'Response Indicator *IN06')
     A  70 93 94
     A  95 96 09
     A  16 51 52                            CA04(07 'Response Indicator *IN07')
     A  80 81 82
     A  83 84 85
     A  86 87 88                            CA05(10 'Response Indicator *IN10')
     A  89                                  CA06(11 'Response Indicator *IN11')
     A                                      SETOF(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(40 'Response Indicator *IN40')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                      SETOF(42 'Response Indicator *IN42')
     A                                      SETOF(49 'Response Indicator *IN49')
     A                                      SETOF(56 'Response Indicator *IN56')
     A                                      SETOF(61 'Response Indicator *IN61')
     A                                      SETOF(62 'Response Indicator *IN62')
     A                                      SETOF(63 'Response Indicator *IN63')
     A                                      SETOF(64 'Response Indicator *IN64')
     A                                      SETOF(65 'Response Indicator *IN65')
     A                                      SETOF(66 'Response Indicator *IN66')
     A                                      SETOF(67 'Response Indicator *IN67')
     A                                      SETOF(68 'Response Indicator *IN68')
     A                                      SETOF(69 'Response Indicator *IN69')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                      SETOF(94 'Response Indicator *IN94')
     A                                      SETOF(95 'Response Indicator *IN95')
     A                                      SETOF(96 'Response Indicator *IN96')
     A                                  1  2HTML('QPUIREC26   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCDIA5C7    MCR2392C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     80RERRMS-
     A                                      GID  5    C6    SCDIA5C7    MC50006-
     A                                      C6    FSMESGC5    *LIBLC0    FERDIA-
     A                                      5    RERRMSGID  5    C6    SCDIA6C7-
     A                                          MCR2392C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     81RERRMSGID  5    -
     A                                      C6    SCDIA6C7    MC50006C6    FSME-
     A                                      SGC5    *LIBLC0    FERDIA6    RERRM-
     A                                      SGID  5    C6    SCDIA7C7    MCR239-
     A                                      2C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     82RERRMSGID  5    C6    SCDI-
     A                                      A7C7    MC50006C6    FSMESGC5    *L-
     A                                      IBLC0    FERDIA7    RERRMSGID  5   -
     A                                       C6    SCDIA8C7    MCR2392C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     83R-
     A                                      ERRMSGID  5    C6    SCDIA8C7    MC-
     A                                      50006C6    FSMESGC5    *LIBLC0    F-
     A                                      ERDIA8    RERRMSGID  5    C6    SCC-
     A                                      AU1C7    MCR0319C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     84RERRMSGID  -
     A                                      5    C6    SCCAU1C7    MC50006C6   -
     A                                       FSMESGC5    *LIBLC0    FERCAU1    -
     A                                      RERRMSGID  5    C6    SCCAU2C7    M-
     A                                      CR0319C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     85RERRMSGID  5    C6   -
     A                                       SCCAU2C7    MC50006C6    FSMESGC5 -
     A                                         *LIBLC0    FERCAU2    RERRMSGID -
     A                                       5    C6    SCCAU3C7    MCR0319C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        86RERRMSGID  5    C6    SCCAU3C7 -
     A                                         MC50006C6    FSMESGC5    *LIBLC0-
     A                                          FERCAU3    RERRMSGID  5    C6  -
     A                                        SCSCHDC7    MCR0759C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     87RERRMS-
     A                                      GID  5    C6    SCSCHDC7    MCR0503-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     88RERRMSG    2    C6    SCOLI-
     A                                      CC36   The license # must be ZZ9999-
     A                                      9999999.E1    3     89RERRMSGID  5 -
     A                                         C6    SCOLICC7    MCR0503C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     0-
     A                                      4RERRMSGID  5    C6    SCOLICC7    -
     A                                      MCR0745C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     05RERRMSGID  5    C6  -
     A                                        SCOLICC7    MC40246C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     06RERRMS-
     A                                      GID  5    C6    SCOLICC7    MC40432-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     07RERRMSGID  5    C6    SCOLI-
     A                                      CC7    MC40433C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     93RERRMSGID  5 -
     A                                         C6    SCOLICC7    MC40301C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     9-
     A                                      4RERRMSGID  5    C6    SCOLICC7    -
     A                                      MC40320C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     96REMSGID    5    C6  -
     A                                        SCNPI1FMSSNPI    C6    FSMESGC5  -
     A                                        *LIBLC0    FERSNPI    ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN04","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN05","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN06","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN07","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN10","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN11","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN17","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN18","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN31","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N42","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN9-
     A                                      5","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN35"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN37","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN38","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN39","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN40","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN41","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN49","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN56","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 20":{-
     A                                      "fieldName":"*IN61","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 21":{"f-
     A                                      ieldName":"*IN62","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 22":{"fie-
     A                                      ldName":"*IN63","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 23":{"field-
     A                                      Name":"*IN64","dataTy')
     A                                  1  2HTML('pe":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 24":{"fieldName":"*IN65","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 25":{"fieldName":"*IN66","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 26":{"fieldName":"*IN67","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       27":{"fieldName":"*IN68","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 2-
     A                                      8":{"fieldName":"*IN69","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 29"-
     A                                      :{"fieldName":"*IN70","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 30":{-
     A                                      "fieldName":"*IN93","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 31":{"f-
     A                                      ieldName":"*IN94","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 32":{"fie-
     A                                      ldName":"*IN96","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"return cursor recor-
     A                                      d":{"fieldName":"HREC","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"return cursor field":{"fiel-
     A                                      dName":"HFLD","dataLength":"10","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none"},"o-
     A                                      verlay range":"1-23"},"items":[{"id-
     A                                      ":"ATR","field type":"output field"-
     A                                      ,"visibility":"hidden","value":{"fi-
     A                                      eldName":"ATR","designValue":"[ATR]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"1"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"SCR03_HREC","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"HRE-
     A                                      C","designValue":"[HREC]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"SCR03_HFLD","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"HFLD","design-
     A                                      Value":"[HFLD]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "left":"0px","top":"-30px","css cla-
     A                                      ss":"profound-converted"},{"id":"F0-
     A                                      361FFL_SCR03_avKeys","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "AV_KEYS","dataLength":"1134","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTra')
     A                                  1  2HTML('nsform":"none","designValue":-
     A                                      "[AV_KEYS]"},"left":"0px","top":"0p-
     A                                      x","visibility":"hidden"},{"id":"F0-
     A                                      361FFL_SCR03_action","field type":"-
     A                                      html container","white space":"norm-
     A                                      al","left":"0px","top":"10px","widt-
     A                                      h":"230px","css class":"action-pane-
     A                                      l-converted","height":"700px","html-
     A                                      ":"<div class=\"top\"></div><div cl-
     A                                      ass=\"imagetop\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_top.png\" -
     A                                      /></div><div class=\"menulinks\"></-
     A                                      div><div class=\"imagebottom\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_bottom.png\" /></div><div class-
     A                                      =\"bottom\"></div>"},{"field type":-
     A                                      "icon menu button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"32px","z index":"20","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1170px","id":"F0361FFL_SCR03_BtnI-
     A                                      conMenuSystemTools","tool tip":"Sys-
     A                                      tem Tools","icon source":"/profound-
     A                                      ui/userdata/images/systool/systools-
     A                                      .png","data function":"SystemToolba-
     A                                      rSystools","show down arrow":"Yes"}-
     A                                      ,{"field type":"panel","panel style-
     A                                      ":"TransformButtonBar","id":"F0361F-
     A                                      FL_SCR03_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"F0361FFL_SCR03_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1066px","id":"F0361FFL_SC-
     A                                      R03_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true')
     A                                  1  2HTML('","left":"1092px","id":"F0361-
     A                                      FFL_SCR03_BtnSearch","tool tip":"Se-
     A                                      arch","onclick":"SystemToolbarSearc-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/searc-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      18px","id":"F0361FFL_SCR03_BtnDiary-
     A                                      Items","tool tip":"Diary/Work Items-
     A                                       - IDARTS","onclick":"SystemToolbar-
     A                                      Diary","background image":{"fieldNa-
     A                                      me":"DryIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1144p-
     A                                      x","id":"F0361FFL_SCR03_BtnSystemMe-
     A                                      ssages","tool tip":"System Messages-
     A                                      ","onclick":"SystemToolbarMessages"-
     A                                      ,"background image":{"fieldName":"M-
     A                                      sgIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"F0361FFL_SCR03_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"F0361FFL_SCR03_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"F0361FFL_SCR03_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false')
     A                                  1  2HTML('","textTransform":"none"},"ac-
     A                                      tive tab":"0","left":"250px","top":-
     A                                      "70px","width":"970px","height":"65-
     A                                      7px","z index":"8","locked in place-
     A                                      ":"true","css class":"tab-panel","c-
     A                                      ss class 2":"stationary"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0361FFL_SCR03_BtnHid-
     A                                      denSave","value":"btnSave","top":"1-
     A                                      00px","response":{"fieldName":"btnS-
     A                                      ave","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant64","field type-
     A                                      ":"output field","left":"281px","cu-
     A                                      rsor column":"2","top":"110px","cur-
     A                                      sor row":"1","css class":"top-line"-
     A                                      ,"value":"js: currentUser()","css c-
     A                                      lass 2":"output-field","parent tab -
     A                                      panel":"F0361FFL_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCR03_SC-
     A                                      CONM","field type":"output field","-
     A                                      value":{"fieldName":"SCCONM","desig-
     A                                      nValue":"[SCCONM]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class 2":"top-line","css class 3-
     A                                      ":"HI","parent tab panel":"F0361FFL-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"constant65","field type"-
     A                                      :"output field","left":"778px","cur-
     A                                      sor column":"73","top":"110px","cur-
     A                                      sor row":"1","css class":"top-line"-
     A                                      ,"value":"js: currentDate()","css c-
     A                                      lass 2":"output-field","parent tab -
     A                                      panel":"F0361FFL_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"F0361FFL-
     A                                      _SCR03_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0361FFL_SCR0-
     A                                      3_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"SCR03_-
     A                                      Q1PGM","field type":"output field",-
     A                                      "value":{"fieldName":"Q1PGM","desig-
     A                                      nValue":"[Q1PGM]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"10-
     A                                      "},"css class":"outpu')
     A                                  1  2HTML('t-field","left":"281px","curs-
     A                                      or column":"2","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"F036-
     A                                      1FFL_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCR03_SCAST","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCAST","designValue":"[SCAS-
     A                                      T]","refField":"ST","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"358px","-
     A                                      cursor column":"13","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "parent tab panel":"F0361FFL_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCR03_SCZIPA","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      ZIPA","designValue":"[SCZIPA]","ref-
     A                                      Field":"ZIPA","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"379px","cursor-
     A                                       column":"16","top":"130px","cursor-
     A                                       row":"2","css class 2":"HI","paren-
     A                                      t tab panel":"F0361FFL_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      R03_SCPRDS","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCPRDS",-
     A                                      "designValue":"[SCPRDS]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"130px","cursor row":-
     A                                      "2","css class 2":"HI","parent tab -
     A                                      panel":"F0361FFL_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","visibility":"hi-
     A                                      dden","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant66","field ty-
     A                                      pe":"output field","value":"SCR03",-
     A                                      "css class":"constant","left":"799p-
     A                                      x","cursor column":"76","top":"130p-
     A                                      x","cursor row":"2","parent tab pan-
     A                                      el":"F0361FFL_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCR03_SCMOD-
     A                                      E","field type":"output field","val-
     A                                      ue":{"fieldName":"SCMODE","designVa-
     A                                      lue":"[SCMODE]","refField":"PGM","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"764px","cursor column":"71","t-
     A                                      op":"150px","cursor row":"3","css c-
     A                                      lass 2":"HI","parent tab panel":"F0-
     A                                      361FFL_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      361FFL_SCR03_BtnHiddenSearch","valu-
     A                                      e":"btnSearch","top":"150px","respo-
     A                                      nse":{"fieldName":"bt')
     A                                  1  2HTML('nSearch","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCR03_SCHD1",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCHD1","designValue"-
     A                                      :"[SCHD1]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"78"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"170px-
     A                                      ","cursor row":"4","parent tab pane-
     A                                      l":"F0361FFL_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F0361FFL_SCR03_BtnHiddenDiaryIt-
     A                                      ems","value":"btnDiary","top":"175p-
     A                                      x","response":{"fieldName":"btnDiar-
     A                                      y","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"SCR03_SCHD2","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCHD2","designValue":"[SCHD2]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none",-
     A                                      "dataLength":"78"},"css class":"out-
     A                                      put-field","left":"281px","cursor c-
     A                                      olumn":"2","top":"190px","cursor ro-
     A                                      w":"5","parent tab panel":"F0361FFL-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0361FFL-
     A                                      _SCR03_BtnHiddenSystemMessages","va-
     A                                      lue":"btnMessage","top":"200px","re-
     A                                      sponse":{"fieldName":"btnMessage","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SCR03_SCHD3","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CHD3","designValue":"[SCHD3]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"78"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"210px","cursor row":"-
     A                                      6","parent tab panel":"F0361FFL_SCR-
     A                                      03_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0361FFL_SCR-
     A                                      03_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant67","field type":"output -
     A                                      field","value":"EOMB#:","css class"-
     A                                      :"constant","left":"281px","cursor -
     A                                      column":"2","top":"23')
     A                                  1  2HTML('0px","cursor row":"7","parent-
     A                                       tab panel":"F0361FFL_SCR03_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      03_SCEOB#","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCEOB#","-
     A                                      designValue":"[SCEOB#]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","dataLength-
     A                                      ":"9","decPos":"0"},"css class":"ou-
     A                                      tput-field","left":"330px","cursor -
     A                                      column":"9","top":"230px","cursor r-
     A                                      ow":"7","width":"63px","text align"-
     A                                      :"right","parent tab panel":"F0361F-
     A                                      FL_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant68","field typ-
     A                                      e":"output field","value":"Specialt-
     A                                      y:","css class":"constant","left":"-
     A                                      400px","cursor column":"19","top":"-
     A                                      230px","cursor row":"7","parent tab-
     A                                       panel":"F0361FFL_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR03_S-
     A                                      CSPCD","field type":"output field",-
     A                                      "value":{"fieldName":"SCSPCD","desi-
     A                                      gnValue":"[SCSPCD]","refField":"SPE-
     A                                      C","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"477px","cursor column":"3-
     A                                      0","top":"230px","cursor row":"7","-
     A                                      parent tab panel":"F0361FFL_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCR03_SCSCDS","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCS-
     A                                      CDS","designValue":"[SCSCDS]","refF-
     A                                      ield":"DS10","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"505px","cursor -
     A                                      column":"34","top":"230px","cursor -
     A                                      row":"7","parent tab panel":"F0361F-
     A                                      FL_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant69","field typ-
     A                                      e":"output field","value":"Fac Zip -
     A                                      Code:","css class":"constant","left-
     A                                      ":"582px","cursor column":"45","top-
     A                                      ":"230px","cursor row":"7","parent -
     A                                      tab panel":"F0361FFL_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR0-
     A                                      3_SCFZIP","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCFZIP","d-
     A                                      esignValue":"[SCFZIP]","refField":"-
     A                                      ZIP1","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00"},"css class":"output-field-
     A                                      ","left":"680px","cursor column":"5-
     A                                      9","top":"230px","cursor row":"7","-
     A                                      width":"35px","text align":"right",-
     A                                      "parent tab panel":"F0361FFL_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-c')
     A                                  1  2HTML('onverted"},{"id":"constant70"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Ntwk:","css class":"constant","v-
     A                                      isibility":{"fieldName":"16","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"757px","cursor column"-
     A                                      :"70","top":"230px","cursor row":"7-
     A                                      ","parent tab panel":"F0361FFL_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCR03_SCNWCD","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCNWCD","designValue":"[SCNWCD]","r-
     A                                      efField":"NWCD","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","visibility":{"field-
     A                                      Name":"16","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"799px-
     A                                      ","cursor column":"76","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"F0361FFL_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant71",-
     A                                      "field type":"output field","value"-
     A                                      :"EOB/Notes attached","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"68","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"694px","cu-
     A                                      rsor column":"61","top":"250px","cu-
     A                                      rsor row":"8","parent tab panel":"F-
     A                                      0361FFL_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0361FFL_SCR03_BtnHiddenWorkPrinterO-
     A                                      utput","value":"btnWrkprtout","top"-
     A                                      :"250px","response":{"fieldName":"b-
     A                                      tnWrkPrnt","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant72","fiel-
     A                                      d type":"output field","value":"Oth-
     A                                      er diag (5)           :","css class-
     A                                      ":"constant","left":"288px","cursor-
     A                                       column":"3","top":"270px","cursor -
     A                                      row":"9","parent tab panel":"F0361F-
     A                                      FL_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCDIA5","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCDIA5","refField":"DS7","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"reference","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      uppercase","designValue":"[SCDIA5]"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"477px","cursor column":"30","to-
     A                                      p":"270px","cursor row":"9","width"-
     A                                      :"50px","css class 3":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"css cla')
     A                                  1  2HTML('ss 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"37","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error messages":"2 me-
     A                                      ssages","parent tab panel":"F0361FF-
     A                                      L_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed","text align":"left","error mess-
     A                                      age id":"MCR2392","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"80","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error enhanced mode":"0-
     A                                      ","error message id 2":"MC50006","e-
     A                                      rror message file 2":"FSMESG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"ERDIA5"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error enhanced mode 2":"0"},{"id":-
     A                                      "SCD5DS","field type":"output field-
     A                                      ","value":{"fieldName":"SCD5DS","de-
     A                                      signValue":"[SCD5DS]","refField":"D-
     A                                      S40","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"540px","cursor column":-
     A                                      "39","top":"270px","cursor row":"9"-
     A                                      ,"parent tab panel":"F0361FFL_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0361FFL_SCR03-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt73","field type":"output field","-
     A                                      value":"Other diag (6)           :"-
     A                                      ,"css class":"constant","left":"288-
     A                                      px","cursor column":"3","top":"290p-
     A                                      x","cursor row":"10","parent tab pa-
     A                                      nel":"F0361FFL_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCDIA6","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCDIA6","refField"-
     A                                      :"DS7","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"r-
     A                                      eference","formatting":"Text","text-
     A                                      Transform":"uppercase","designValue-
     A                                      ":"[SCDIA6]"},"text transform":"upp-
     A                                      ercase","left":"475px')
     A                                  1  2HTML('","cursor column":"30","top":-
     A                                      "290px","cursor row":"10","width":"-
     A                                      50px","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"set focus"-
     A                                      :{"fieldName":"95","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssages":"2 messages","parent tab pa-
     A                                      nel":"F0361FFL_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted","text align":"left-
     A                                      ","error message id":"MCR2392","err-
     A                                      or message file":"FSMESG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"81","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error enha-
     A                                      nced mode":"0","error message id 2"-
     A                                      :"MC50006","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"ERDIA6","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error enhanced mode 2-
     A                                      ":"0"},{"id":"SCD6DS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCD6DS","designValue":"[SCD6DS]",-
     A                                      "refField":"DS40","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"540px","cu-
     A                                      rsor column":"39","top":"290px","cu-
     A                                      rsor row":"10","parent tab panel":"-
     A                                      F0361FFL_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0361FFL_SCR03_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant74","field type":"output fiel-
     A                                      d","value":"Other diag (7)         -
     A                                        :","css class":"constant","left":-
     A                                      "288px","cursor column":"3","top":"-
     A                                      310px","cursor row":"11","parent ta-
     A                                      b panel":"F0361FFL_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCDIA7-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCDIA7","refFi-
     A                                      eld":"DS7","trimLeadi')
     A                                  1  2HTML('ng":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"reference","-
     A                                      formatting":"Text","textTransform":-
     A                                      "uppercase","designValue":"[SCDIA7]-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"475px","cursor column":"30","t-
     A                                      op":"310px","cursor row":"11","widt-
     A                                      h":"50px","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"35","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r messages":"2 messages","parent ta-
     A                                      b panel":"F0361FFL_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted","text align":"-
     A                                      left","error message id":"MCR2392",-
     A                                      "error message file":"FSMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"82","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      enhanced mode":"0","error message i-
     A                                      d 2":"MC50006","error message file -
     A                                      2":"FSMESG","error message library -
     A                                      2":"*LIBL","error condition 2":{"fi-
     A                                      eldName":"ERDIA7","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de 2":"0"},{"id":"SCD7DS","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCD7DS","designValue":"[SCD7D-
     A                                      S]","refField":"DS40","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"540px"-
     A                                      ,"cursor column":"39","top":"310px"-
     A                                      ,"cursor row":"11","parent tab pane-
     A                                      l":"F0361FFL_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant75",-
     A                                      "field type":"output field","value"-
     A                                      :"Other diag (8)           :","css -
     A                                      class":"constant","left":"288px","c-
     A                                      ursor column":"3","top":"330px","cu-
     A                                      rsor row":"12","parent tab panel":"-
     A                                      F0361FFL_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCDIA8","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCDIA8","refField":"DS7"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"referen-
     A                                      ce","formatting":"Tex')
     A                                  1  2HTML('t","textTransform":"uppercase-
     A                                      ","designValue":"[SCDIA8]"},"text t-
     A                                      ransform":"uppercase","left":"475px-
     A                                      ","cursor column":"30","top":"330px-
     A                                      ","cursor row":"12","width":"50px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 5":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"38","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"error messages-
     A                                      ":"2 messages","parent tab panel":"-
     A                                      F0361FFL_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted","text align":"left","err-
     A                                      or message id":"MCR2392","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"83","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode":"0","error message id 2":"MC50-
     A                                      006","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      ERDIA8","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error enhanced mode 2":"0"}-
     A                                      ,{"id":"SCD8DS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCD8-
     A                                      DS","designValue":"[SCD8DS]","refFi-
     A                                      eld":"DS40","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"540px","cursor c-
     A                                      olumn":"39","top":"330px","cursor r-
     A                                      ow":"12","parent tab panel":"F0361F-
     A                                      FL_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant76","field typ-
     A                                      e":"output field","value":"Ext. cau-
     A                                      se (1)           :","css class":"co-
     A                                      nstant","left":"288px","cursor colu-
     A                                      mn":"3","top":"350px","cursor row":-
     A                                      "13","parent tab panel":"F0361FFL_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCAU1","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCCAU1","refField":"DS7","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"reference","forma-
     A                                      tting":"Text","textTransform":"uppe-
     A                                      rcase","designValue":"[SCCAU1]"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      475px","cursor column')
     A                                  1  2HTML('":"30","top":"350px","cursor -
     A                                      row":"13","width":"50px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"51 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 5":{"fieldName"-
     A                                      :"51 or 09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"31","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      es":"2 messages","parent tab panel"-
     A                                      :"F0361FFL_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted","text align":"left","e-
     A                                      rror message id":"MCR0319","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"84","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode":"0","error message id 2":"MC-
     A                                      50006","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"ERCAU1","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode 2":"0-
     A                                      "},{"id":"SCC1DS","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      C1DS","designValue":"[SCC1DS]","ref-
     A                                      Field":"DS40","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"540px","cursor-
     A                                       column":"39","top":"350px","cursor-
     A                                       row":"13","parent tab panel":"F036-
     A                                      1FFL_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant77","field t-
     A                                      ype":"output field","value":"Ext. C-
     A                                      ause (2)           :","css class":"-
     A                                      constant","left":"288px","cursor co-
     A                                      lumn":"3","top":"370px","cursor row-
     A                                      ":"14","parent tab panel":"F0361FFL-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCCAU2","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCCAU2","refField":"DS7","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"up-
     A                                      percase","designValue":"[SCCAU2]"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"475px","cursor column":"30","top"-
     A                                      :"370px","cursor row":"14","width":-
     A                                      "50px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expre')
     A                                  1  2HTML('ssion","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"52 or -
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"52 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"set focus":{-
     A                                      "fieldName":"39","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      ages":"2 messages","parent tab pane-
     A                                      l":"F0361FFL_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted","text align":"left",-
     A                                      "error message id":"MCR0319","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"85","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode":"0","error message id 2":"-
     A                                      MC50006","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"ERCAU2","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error enhanced mode 2":-
     A                                      "0"},{"id":"SCC2DS","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCC2DS","designValue":"[SCC2DS]","r-
     A                                      efField":"DS40","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"540px","curs-
     A                                      or column":"39","top":"370px","curs-
     A                                      or row":"14","parent tab panel":"F0-
     A                                      361FFL_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant78","field-
     A                                       type":"output field","value":"Ext.-
     A                                       cause (3)           :","css class"-
     A                                      :"constant","left":"288px","cursor -
     A                                      column":"3","top":"390px","cursor r-
     A                                      ow":"15","parent tab panel":"F0361F-
     A                                      FL_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCCAU3","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCCAU3","refField":"DS7","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"reference","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      uppercase","designValue":"[SCCAU3]"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"475px","cursor column":"30","to-
     A                                      p":"390px","cursor row":"15","width-
     A                                      ":"50px","css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css cl')
     A                                  1  2HTML('ass 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"set focus":{"fieldName":"40",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 5":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"error messages":"2 m-
     A                                      essages","parent tab panel":"F0361F-
     A                                      FL_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted","text align":"left","error mes-
     A                                      sage id":"MCR0319","error message f-
     A                                      ile":"FSMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"86","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error enhanced mode":"-
     A                                      0","error message id 2":"MC50006","-
     A                                      error message file 2":"FSMESG","err-
     A                                      or message library 2":"*LIBL","erro-
     A                                      r condition 2":{"fieldName":"ERCAU3-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode 2":"0"},{"id"-
     A                                      :"SCC3DS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCC3DS","d-
     A                                      esignValue":"[SCC3DS]","refField":"-
     A                                      DS40","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"540px","cursor column"-
     A                                      :"39","top":"390px","cursor row":"1-
     A                                      5","parent tab panel":"F0361FFL_SCR-
     A                                      03_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant79","field type":"ou-
     A                                      tput field","value":"Sched/Unsched -
     A                                                 :","css class":"constant-
     A                                      ","left":"288px","cursor column":"3-
     A                                      ","top":"410px","cursor row":"16","-
     A                                      parent tab panel":"F0361FFL_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSCHD","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCSCH-
     A                                      D","designValue":"[SCSCHD]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"477px","cur-
     A                                      sor column":"30","top":"410px","cur-
     A                                      sor row":"16","width":"8px","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fie')
     A                                  1  2HTML('ldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"set-
     A                                       focus":{"fieldName":"41","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"MCR0759","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"87","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0503","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"88","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"F0361-
     A                                      FFL_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"SCSHDS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCSHDS","designValue":"[SCSHDS]",-
     A                                      "refField":"DS40","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"540px","cu-
     A                                      rsor column":"39","top":"410px","cu-
     A                                      rsor row":"16","parent tab panel":"-
     A                                      F0361FFL_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant80","fie-
     A                                      ld type":"output field","value":"Op-
     A                                      erating physicians lic#:","css clas-
     A                                      s":"constant","left":"288px","curso-
     A                                      r column":"3","top":"430px","cursor-
     A                                       row":"17","parent tab panel":"F036-
     A                                      1FFL_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCOLIC","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCOLIC","designValue":"[SCOL-
     A                                      IC]","refField":"LIC#","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "477px","cursor column":"30","top":-
     A                                      "430px","cursor row":"17","width":"-
     A                                      92px","display attribute field":{"f-
     A                                      ieldName":"ATR","dataLength":"1","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      css class 3":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTru')
     A                                  1  2HTML('e":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"42","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message":"The license # must -
     A                                      be ZZ99999999999.","error condition-
     A                                      ":{"fieldName":"89","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"8 messages","error message id 2"-
     A                                      :"MCR0503","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"04","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 3":"MCR-
     A                                      0745","error message file 3":"FSMES-
     A                                      G","error message library 3":"*LIBL-
     A                                      ","error condition 3":{"fieldName":-
     A                                      "05","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 4":"MC40246"-
     A                                      ,"error message file 4":"FSMESG","e-
     A                                      rror message library 4":"*LIBL","er-
     A                                      ror condition 4":{"fieldName":"06",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 5":"MC40432","err-
     A                                      or message file 5":"FSMESG","error -
     A                                      message library 5":"*LIBL","error c-
     A                                      ondition 5":{"fieldName":"07","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r message id 6":"MC40433","error me-
     A                                      ssage file 6":"FSMESG","error messa-
     A                                      ge library 6":"*LIBL","error condit-
     A                                      ion 6":{"fieldName":"93","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 7":"MC40301","error message-
     A                                       file 7":"FSMESG","error message li-
     A                                      brary 7":"*LIBL","error condition 7-
     A                                      ":{"fieldName":"94","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 8":"MC40320","error message file-
     A                                       8":"FSMESG","error message library-
     A                                       8":"*LIBL","error condition 8":{"f-
     A                                      ieldName":"96","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"parent tab panel":"-
     A                                      F0361FFL_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 5":"profound--
     A                                      converted"},{"id":"constant81","fie-
     A                                      ld type":"output field","value":"At-
     A                                      tending physician NPI# :","css clas-
     A                                      s":"constant","left":"288px","curso-
     A                                      r column":"3","top":"450px","cursor-
     A                                       row":"18","parent tab panel":"F036-
     A                                      1FFL_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCANPI","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCANPI","designValue":"[SCAN-
     A                                      PI]","refField":"PREF01/DS15 *LIBL/-
     A                                      FSREFP","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"477px","cursor-
     A                                       column":"30","top":"')
     A                                  1  2HTML('450px","cursor row":"18","wid-
     A                                      th":"106px","css class 3":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 4":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"pare-
     A                                      nt tab panel":"F0361FFL_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant82","field type":"output fie-
     A                                      ld","value":"Operating physician NP-
     A                                      I# :","css class":"constant","left"-
     A                                      :"288px","cursor column":"3","top":-
     A                                      "470px","cursor row":"19","parent t-
     A                                      ab panel":"F0361FFL_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCONP-
     A                                      I","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCONPI","desi-
     A                                      gnValue":"[SCONPI]","refField":"PRE-
     A                                      F01/DS15 *LIBL/FSREFP","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "477px","cursor column":"30","top":-
     A                                      "470px","cursor row":"19","width":"-
     A                                      106px","css class 3":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"parent ta-
     A                                      b panel":"F0361FFL_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt83","field type":"output field","-
     A                                      value":"Service Facility NPI#    :"-
     A                                      ,"css class":"constant","left":"288-
     A                                      px","cursor column":"3","top":"490p-
     A                                      x","cursor row":"20","parent tab pa-
     A                                      nel":"F0361FFL_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCNPI1","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCNPI1","designVal-
     A                                      ue":"[SCNPI1]","refField":"PREF01/D-
     A                                      S15 *LIBL/FSREFP","dataType":"refer-
     A                                      ence","formatting":"T')
     A                                  1  2HTML('ext","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"477px","cursor colu-
     A                                      mn":"30","top":"490px","cursor row"-
     A                                      :"20","width":"106px","css class 3"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 4":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"parent tab panel":"F0361FFL_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      ,"error messages":"1 message","erro-
     A                                      r message id":{"fieldName":"mssnpi"-
     A                                      ,"dataLength":"10","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"},"error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"ersnpi","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode":"1"},{"id":"constant84","fie-
     A                                      ld type":"output field","value":"Ot-
     A                                      her 2 NPI#             :","css clas-
     A                                      s":"constant","left":"288px","curso-
     A                                      r column":"3","top":"510px","cursor-
     A                                       row":"21","parent tab panel":"F036-
     A                                      1FFL_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCNPI2","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCNPI2","designValue":"[SCNP-
     A                                      I2]","refField":"PREF01/DS15 *LIBL/-
     A                                      FSREFP","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"477px","cursor-
     A                                       column":"30","top":"510px","cursor-
     A                                       row":"21","width":"106px","css cla-
     A                                      ss 3":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 4":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue"')
     A                                  1  2HTML(':"HI","customFalse":""},"pare-
     A                                      nt tab panel":"F0361FFL_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"150px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF03",-
     A                                      "field type":"button","value":"Exit-
     A                                      ","shortcut key":"F3","left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF10","field type":"-
     A                                      button","visibility":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"value":"Search","s-
     A                                      hortcut key":"F10","left":"14px","t-
     A                                      op":"216px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"14px","top":"249px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"}]}')
     A            ATR            1A  H
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            ERCAU1         1A  H
     A            ERCAU2         1A  H
     A            ERCAU3         1A  H
     A            ERDIA5         1A  H
     A            ERDIA6         1A  H
     A            ERDIA7         1A  H
     A            ERDIA8         1A  H
     A            ERSNPI         1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            MSSNPI        10A  H
     A            Q1PGM         10A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCANPI    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCAST     R        H      REFFLD(ST)
     A            SCC1DS    R        H      REFFLD(DS40)
     A            SCC2DS    R        H      REFFLD(DS40)
     A            SCC3DS    R        H      REFFLD(DS40)
     A            SCCAU1    R        H      REFFLD(DS7)
     A            SCCAU2    R        H      REFFLD(DS7)
     A            SCCAU3    R        H      REFFLD(DS7)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCD5DS    R        H      REFFLD(DS40)
     A            SCD6DS    R        H      REFFLD(DS40)
     A            SCD7DS    R        H      REFFLD(DS40)
     A            SCD8DS    R        H      REFFLD(DS40)
     A            SCDIA5    R        H      REFFLD(DS7)
     A            SCDIA6    R        H      REFFLD(DS7)
     A            SCDIA7    R        H      REFFLD(DS7)
     A            SCDIA8    R        H      REFFLD(DS7)
     A            SCFZIP    R        H      REFFLD(ZIP1)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNPI1    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCNPI2    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOLIC    R        H      REFFLD(LIC#)
     A            SCONPI    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCDS    R        H      REFFLD(DS10)
     A            SCSCHD    R        H      REFFLD(FLAG)
     A            SCSHDS    R        H      REFFLD(DS40)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR04
     A  09 16 68                            CA01
     A                                  1  2HTML('QPUIREC0    ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR04"},"items":[{"id":"F0361FF-
     A                                      L_SCR02_avKeys_copy","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "AV_KEYS","dataLength":"1134","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[AV_KEYS]"},"left":-
     A                                      "0px","top":"0px","visibility":"hid-
     A                                      den"},{"id":"F0361FFL_SCR02_action_-
     A                                      copy","field type":"html container"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","white space":"normal","html":"<-
     A                                      div class=\"top\"></div><div class=-
     A                                      \"imagetop\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_top.png\" /></-
     A                                      div><div class=\"menulinks\"></div>-
     A                                      <div class=\"imagebottom\"><img src-
     A                                      =\"/profoundui/userdata/images/bar_-
     A                                      bottom.png\" /></div><div class=\"b-
     A                                      ottom\"></div>","left":"0px","top":-
     A                                      "10px","height":"700px","width":"23-
     A                                      0px"},{"id":"F0361FFL_SCR04_MainTab-
     A                                      Panel","field type":"tab panel","cs-
     A                                      s class":"tab-panel","left":"250px"-
     A                                      ,"top":"70px","height":"657px","wid-
     A                                      th":"970px","z index":"8","locked i-
     A                                      n place":"true","tab panel style":"-
     A                                      Transform","tab names":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"active ta-
     A                                      b":"0","css class 2":"stationary"},-
     A                                      {"id":"constant102","field type":"o-
     A                                      utput field","css class":"top-line"-
     A                                      ,"value":"js: currentUser()","curso-
     A                                      r row":"1","cursor column":"2","lef-
     A                                      t":"280px","top":"110px","parent ta-
     A                                      b panel":"F0361FFL_SCR04_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "output-field","css class 3":"profo-
     A                                      und-converted"},{"id":"SCR04_SCCONM-
     A                                      ","field type":"output field","css -
     A                                      class":"output-field","value":{"fie-
     A                                      ldName":"SCCONM","designValue":"[SC-
     A                                      CONM]","refField":"NAME","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cu-
     A                                      rsor row":"1","cursor column":"21",-
     A                                      "left":"415px","top":"110px","paren-
     A                                      t tab panel":"F0361FFL_SCR04_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"top-line","css class 3":"HI","-
     A                                      css class 4":"profound-converted"},-
     A                                      {"id":"constant103","field type":"o-
     A                                      utput field","css class":"top-line"-
     A                                      ,"value":"js: currentDate()","curso-
     A                                      r row":"1","cursor column":"73","le-
     A                                      ft":"780px","top":"110px","parent t-
     A                                      ab panel":"F0361FFL_SCR04_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"output-field","css class 3":"prof-
     A                                      ound-converted"},{"id":"F0361FFL_SC-
     A                                      R02_fkeyMenu_copy","field type":"me-
     A                                      nu","css class":"action-menu","hove-
     A                                      r background color":"#9AAA61","hove-
     A                                      r text color":"#FFFFF')
     A                                  1  2HTML('F","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","left":"10px",-
     A                                      "top":"120px","height":"350px","wid-
     A                                      th":"230px","z index":"101","css cl-
     A                                      ass 2":"stationary"},{"id":"SCR04_Q-
     A                                      1PGM","field type":"output field","-
     A                                      css class":"output-field","value":{-
     A                                      "fieldName":"Q1PGM","designValue":"-
     A                                      [Q1PGM]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"10"},"curso-
     A                                      r row":"2","cursor column":"2","lef-
     A                                      t":"280px","top":"130px","parent ta-
     A                                      b panel":"F0361FFL_SCR04_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR04_-
     A                                      SCAST","field type":"output field",-
     A                                      "css class":"output-field","value":-
     A                                      {"fieldName":"SCAST","designValue":-
     A                                      "[SCAST]","refField":"ST","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ursor row":"2","cursor column":"13"-
     A                                      ,"left":"360px","top":"130px","pare-
     A                                      nt tab panel":"F0361FFL_SCR04_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"HI","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCR04_SCZIPA","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"output-field","value":{"fieldNam-
     A                                      e":"SCZIPA","designValue":"[SCZIPA]-
     A                                      ","refField":"ZIPA","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"cursor -
     A                                      row":"2","cursor column":"16","left-
     A                                      ":"380px","top":"130px","parent tab-
     A                                       panel":"F0361FFL_SCR04_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      HI","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCR04_SCPRDS","field ty-
     A                                      pe":"output field","css class":"out-
     A                                      put-field","value":{"fieldName":"SC-
     A                                      PRDS","designValue":"[SCPRDS]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"cursor row":"-
     A                                      2","cursor column":"21","left":"415-
     A                                      px","top":"130px","parent tab panel-
     A                                      ":"F0361FFL_SCR04_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"HI","c-
     A                                      ss class 3":"profound-converted","v-
     A                                      isibility":"hidden"},{"id":"constan-
     A                                      t104","field type":"output field","-
     A                                      css class":"constant","value":"SCR0-
     A                                      4","cursor row":"2","cursor column"-
     A                                      :"76","left":"795px","top":"130px",-
     A                                      "parent tab panel":"F0361FFL_SCR04_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR04_SCMODE","field type":"out-
     A                                      put field","css class":"output-fiel-
     A                                      d","value":{"fieldName":"SCMODE","d-
     A                                      esignValue":"[SCMODE]","refField":"-
     A                                      PGM","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"cursor r')
     A                                  1  2HTML('ow":"3","cursor column":"71",-
     A                                      "left":"765px","top":"150px","paren-
     A                                      t tab panel":"F0361FFL_SCR04_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"HI","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCR04_SCHD1","fiel-
     A                                      d type":"output field","css class":-
     A                                      "output-field","value":{"fieldName"-
     A                                      :"SCHD1","designValue":"[SCHD1]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none","-
     A                                      dataLength":"78"},"cursor row":"4",-
     A                                      "cursor column":"2","left":"280px",-
     A                                      "top":"170px","parent tab panel":"F-
     A                                      0361FFL_SCR04_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR04_SCHD2","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"SCHD2","designValue":"[SCHD2]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none",-
     A                                      "dataLength":"78"},"cursor row":"5"-
     A                                      ,"cursor column":"2","left":"280px"-
     A                                      ,"top":"190px","parent tab panel":"-
     A                                      F0361FFL_SCR04_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCR04_SCHD3","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"output-field","value":{"fieldNam-
     A                                      e":"SCHD3","designValue":"[SCHD3]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"78"},"cursor row":"6-
     A                                      ","cursor column":"2","left":"280px-
     A                                      ","top":"210px","parent tab panel":-
     A                                      "F0361FFL_SCR04_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant105","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"constant","value":"EOMB#:","cur-
     A                                      sor row":"7","cursor column":"2","l-
     A                                      eft":"281px","top":"230px","parent -
     A                                      tab panel":"F0361FFL_SCR04_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR0-
     A                                      4_SCEOB#","field type":"output fiel-
     A                                      d","css class":"output-field","valu-
     A                                      e":{"fieldName":"SCEOB#","designVal-
     A                                      ue":"[SCEOB#]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","dataLength":"9","de-
     A                                      cPos":"0"},"text align":"right","cu-
     A                                      rsor row":"7","cursor column":"9","-
     A                                      left":"330px","top":"230px","width"-
     A                                      :"63px","parent tab panel":"F0361FF-
     A                                      L_SCR04_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant106","field typ-
     A                                      e":"output field","css class":"cons-
     A                                      tant","value":"Specialty:","cursor -
     A                                      row":"7","cursor column":"19","left-
     A                                      ":"400px","top":"230px","parent tab-
     A                                       panel":"F0361FFL_SCR04_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR04_S-
     A                                      CSPCD","field type":"')
     A                                  1  2HTML('output field","css class":"ou-
     A                                      tput-field","value":{"fieldName":"S-
     A                                      CSPCD","designValue":"[SCSPCD]","re-
     A                                      fField":"SPEC","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"cursor row":-
     A                                      "7","cursor column":"30","left":"47-
     A                                      5px","top":"230px","parent tab pane-
     A                                      l":"F0361FFL_SCR04_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR04_SCSCDS-
     A                                      ","field type":"output field","css -
     A                                      class":"output-field","value":{"fie-
     A                                      ldName":"SCSCDS","designValue":"[SC-
     A                                      SCDS]","refField":"DS10","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cu-
     A                                      rsor row":"7","cursor column":"34",-
     A                                      "left":"505px","top":"230px","paren-
     A                                      t tab panel":"F0361FFL_SCR04_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant107","field type":"output fie-
     A                                      ld","css class":"constant","value":-
     A                                      "Fac Zip Code:","cursor row":"7","c-
     A                                      ursor column":"45","left":"580px","-
     A                                      top":"230px","parent tab panel":"F0-
     A                                      361FFL_SCR04_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCR04_SCFZIP","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"SCFZIP","designValue":"[SCFZIP]"-
     A                                      ,"refField":"ZIP1","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"true","curSym":"","units":-
     A                                      "","negNum":"-999.00"},"text align"-
     A                                      :"right","cursor row":"7","cursor c-
     A                                      olumn":"59","left":"680px","top":"2-
     A                                      30px","width":"35px","parent tab pa-
     A                                      nel":"F0361FFL_SCR04_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant10-
     A                                      9","field type":"output field","css-
     A                                       class":"constant","value":"EOB/Not-
     A                                      es attached","cursor row":"8","curs-
     A                                      or column":"61","left":"695px","top-
     A                                      ":"250px","parent tab panel":"F0361-
     A                                      FFL_SCR04_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":{"fieldName":"6-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"RI","custom-
     A                                      False":""},"css class 3":"profound--
     A                                      converted","visibility":{"fieldName-
     A                                      ":"68","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"}},{"id":"constant1-
     A                                      10","field type":"output field","cs-
     A                                      s class":"constant","value":"Render-
     A                                      ing provider FEIN            :","cu-
     A                                      rsor row":"9","cursor column":"4","-
     A                                      left":"295px","top":"270px","parent-
     A                                       tab panel":"F0361FFL_SCR04_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      FEI","field type":"textbox","css cl-
     A                                      ass":"input","value":{"fieldName":"-
     A                                      SCRFEI","refField":"F')
     A                                  1  2HTML('EIN","numSep":"false","zeroBa-
     A                                      lance":"false","numBlankFill":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","negNum":"999.00","units":-
     A                                      "","designValue":"[SCRFEI]"},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"554px","top":"270px","width":"6-
     A                                      4px","parent tab panel":"F0361FFL_S-
     A                                      CR04_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"textbox","css class-
     A                                       3":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"css-
     A                                       class 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":"profound-converted"-
     A                                      ,"tab index":"1"},{"id":"constant11-
     A                                      1","field type":"output field","css-
     A                                       class":"constant","value":"Renderi-
     A                                      ng provider last/group name :","cur-
     A                                      sor row":"10","cursor column":"4","-
     A                                      left":"295px","top":"290px","parent-
     A                                       tab panel":"F0361FFL_SCR04_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant112","field type":"output fiel-
     A                                      d","css class":"constant","value":"-
     A                                      Rendering provider first name      -
     A                                      :","cursor row":"11","cursor column-
     A                                      ":"4","left":"295px","top":"310px",-
     A                                      "parent tab panel":"F0361FFL_SCR04_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant54_copy","field type":"-
     A                                      output field","css class":"constant-
     A                                      ","value":" ","cursor row":"23","cu-
     A                                      rsor column":"1","left":"275px","to-
     A                                      p":"550px","parent tab panel":"F036-
     A                                      1FFL_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"BLU","css cla-
     A                                      ss 3":"profound-converted","visibil-
     A                                      ity":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"}},-
     A                                      {"id":"constant55_copy","field type-
     A                                      ":"output field","css class":"const-
     A                                      ant","value":" ","cursor row":"23",-
     A                                      "cursor column":"2","left":"280px",-
     A                                      "top":"550px","parent tab panel":"F-
     A                                      0361FFL_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"BLU","css -
     A                                      class 3":"profound-converted","visi-
     A                                      bility":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "}},{"id":"btnSubmit_copy","field t-
     A                                      ype":"button","css class":"button",-
     A                                      "cursor":"default","value":"Enter",-
     A                                      "shortcut key":"Enter","left":"15px-
     A                                      ","top":"150px","height":"23px","wi-
     A                                      dth":"100px","auto arrange":"true"}-
     A                                      ,{"id":"btnCF03_copy","field type":-
     A                                      "button","css class":"button","curs-
     A                                      or":"default","value":"Exit","short-
     A                                      cut key":"F3","left":"15px","top":"-
     A                                      185px","height":"23px')
     A                                  1  2HTML('","width":"100px","auto arran-
     A                                      ge":"true","visibility":{"fieldName-
     A                                      ":"09 or N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"}},{"id":"bt-
     A                                      nCF10_copy","field type":"button","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","value":"Search","shortcut key"-
     A                                      :"F10","left":"15px","top":"215px",-
     A                                      "height":"23px","width":"100px","au-
     A                                      to arrange":"true","visibility":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"}},{"id":"-
     A                                      btnCF12_copy","field type":"button"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","value":"Cancel","shortcut ke-
     A                                      y":"F12","left":"15px","top":"250px-
     A                                      ","height":"23px","width":"100px","-
     A                                      auto arrange":"true","visibility":{-
     A                                      "fieldName":"09 or N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"}}-
     A                                      ,{"id":"constant113","field type":"-
     A                                      output field","css class":"constant-
     A                                      ","value":"Rendering provider addre-
     A                                      ss 1       :","cursor row":"11","cu-
     A                                      rsor column":"4","left":"295px","to-
     A                                      p":"330px","parent tab panel":"F036-
     A                                      1FFL_SCR04_MainTabPanel","css class-
     A                                       2":"profound-converted","parent ta-
     A                                      b":"0"},{"id":"constant114","field -
     A                                      type":"output field","css class":"c-
     A                                      onstant","value":"Rendering provide-
     A                                      r address 2       :","cursor row":"-
     A                                      11","cursor column":"4","left":"295-
     A                                      px","top":"350px","parent tab panel-
     A                                      ":"F0361FFL_SCR04_MainTabPanel","cs-
     A                                      s class 2":"profound-converted","pa-
     A                                      rent tab":"0"},{"id":"constant115",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"constant","value":"Rendering -
     A                                      provider city            :","cursor-
     A                                       row":"11","cursor column":"4","lef-
     A                                      t":"295px","top":"370px","parent ta-
     A                                      b panel":"F0361FFL_SCR04_MainTabPan-
     A                                      el","css class 2":"profound-convert-
     A                                      ed","parent tab":"0"},{"id":"consta-
     A                                      nt116","field type":"output field",-
     A                                      "css class":"constant","value":"Ren-
     A                                      dering provider state           :",-
     A                                      "cursor row":"11","cursor column":"-
     A                                      4","left":"295px","top":"390px","pa-
     A                                      rent tab panel":"F0361FFL_SCR04_Mai-
     A                                      nTabPanel","css class 2":"profound--
     A                                      converted","parent tab":"0"},{"id":-
     A                                      "constant117","field type":"output -
     A                                      field","css class":"constant","valu-
     A                                      e":"Rendering provider zip         -
     A                                          :","cursor row":"11","cursor co-
     A                                      lumn":"4","left":"295px","top":"410-
     A                                      px","parent tab panel":"F0361FFL_SC-
     A                                      R04_MainTabPanel","css class 2":"pr-
     A                                      ofound-converted","parent tab":"0"}-
     A                                      ,{"id":"SCRLSN","field type":"textb-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"SCRLSN","refField":"NAME-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"refere-
     A                                      nce","formatting":"Text","textTrans-
     A                                      form":"uppercase","de')
     A                                  1  2HTML('signValue":"[SCRLSN]"},"text -
     A                                      transform":"uppercase","read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"left":"55-
     A                                      4px","top":"290px","width":"281px",-
     A                                      "parent tab panel":"F0361FFL_SCR04_-
     A                                      MainTabPanel","css class 2":"textbo-
     A                                      x","css class 3":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 5":"profou-
     A                                      nd-converted","parent tab":"0","tab-
     A                                       index":"2"},{"id":"SCRFSN","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"value":{"fieldName":"SCRFSN","ref-
     A                                      Field":"FSN","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"textTransform":"uppercase","desig-
     A                                      nValue":"[SCRFSN]"},"text transform-
     A                                      ":"uppercase","read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"554px","top-
     A                                      ":"310px","width":"106px","parent t-
     A                                      ab panel":"F0361FFL_SCR04_MainTabPa-
     A                                      nel","css class 2":"textbox","css c-
     A                                      lass 3":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "css class 4":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 5":"profound-conver-
     A                                      ted","parent tab":"0","tab index":"-
     A                                      3"},{"id":"SCRAD1","field type":"te-
     A                                      xtbox","css class":"input","value":-
     A                                      {"fieldName":"SCRAD1","refField":"A-
     A                                      DR1","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"ref-
     A                                      erence","formatting":"Text","textTr-
     A                                      ansform":"uppercase","designValue":-
     A                                      "[SCRAD1]"},"text transform":"upper-
     A                                      case","read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"left":"554px","top":"330px-
     A                                      ","width":"281px","parent tab panel-
     A                                      ":"F0361FFL_SCR04_MainTabPanel","cs-
     A                                      s class 2":"textbox","css class 3":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 5":"profound-converted","pa-
     A                                      rent tab":"0","tab index":"4"},{"id-
     A                                      ":"SCRADR2","field type":"textbox",-
     A                                      "css class":"input","')
     A                                  1  2HTML('value":{"fieldName":"SCRAD2",-
     A                                      "refField":"ADR1","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","textTransform":"uppercase","-
     A                                      designValue":"[SCRAD2]"},"text tran-
     A                                      sform":"uppercase","read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"left":"554px"-
     A                                      ,"top":"350px","width":"281px","par-
     A                                      ent tab panel":"F0361FFL_SCR04_Main-
     A                                      TabPanel","css class 2":"textbox","-
     A                                      css class 3":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":"profound-c-
     A                                      onverted","parent tab":"0","tab ind-
     A                                      ex":"5"},{"id":"SCRCTY","field type-
     A                                      ":"textbox","css class":"input","va-
     A                                      lue":{"fieldName":"SCRCTY","refFiel-
     A                                      d":"CTY","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "reference","formatting":"Text","te-
     A                                      xtTransform":"uppercase","designVal-
     A                                      ue":"[SCRCTY]"},"text transform":"u-
     A                                      ppercase","read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"554px","top":"3-
     A                                      70px","width":"176px","parent tab p-
     A                                      anel":"F0361FFL_SCR04_MainTabPanel"-
     A                                      ,"css class 2":"textbox","css class-
     A                                       3":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"css-
     A                                       class 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":"profound-converted"-
     A                                      ,"parent tab":"0","tab index":"6"},-
     A                                      {"id":"SCRST","field type":"textbox-
     A                                      ","css class":"input","value":{"fie-
     A                                      ldName":"SCRST","refField":"ST","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"reference",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"uppercase","designValue":"[SCRST]-
     A                                      "},"text transform":"uppercase","re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      left":"554px","top":"390px","width"-
     A                                      :"15px","parent tab panel":"F0361FF-
     A                                      L_SCR04_MainTabPanel","css class 2"-
     A                                      :"textbox","css class 3":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indi')
     A                                  1  2HTML('cator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 5":"profound-conv-
     A                                      erted","parent tab":"0","tab index"-
     A                                      :"7"},{"id":"SCRZIP","field type":"-
     A                                      textbox","css class":"input","value-
     A                                      ":{"fieldName":"SCRZIP","refField":-
     A                                      "ZIP","numSep":"false","zeroBalance-
     A                                      ":"false","numBlankFill":"false","z-
     A                                      eroFill":"false","curSym":"","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","negNum":"999.00","units":"","d-
     A                                      esignValue":"[SCRZIP]"},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"5-
     A                                      54px","top":"410px","width":"64px",-
     A                                      "parent tab panel":"F0361FFL_SCR04_-
     A                                      MainTabPanel","css class 2":"textbo-
     A                                      x","css class 3":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 5":"profou-
     A                                      nd-converted","parent tab":"0","tab-
     A                                       index":"8"},{"id":"constant108","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"constant","value":"Ntwk:","curs-
     A                                      or row":"7","cursor column":"70","l-
     A                                      eft":"755px","top":"230px","parent -
     A                                      tab panel":"F0361FFL_SCR04_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted","visibility"-
     A                                      :{"fieldName":"16","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"}},{"id-
     A                                      ":"SCR04_SCNWCD","field type":"outp-
     A                                      ut field","css class":"output-field-
     A                                      ","value":{"fieldName":"SCNWCD","de-
     A                                      signValue":"[SCNWCD]","refField":"N-
     A                                      WCD","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"cursor row":"7","curso-
     A                                      r column":"76","left":"800px","top"-
     A                                      :"230px","parent tab panel":"F0361F-
     A                                      FL_SCR04_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted","visibility":{"fieldName":"16"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"}}]}')
     A            AV_KEYS     1134A  H
     A            Q1PGM         10A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFZIP    R        H      REFFLD(ZIP1)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRAD1    R        H      REFFLD(ADR1)
     A            SCRAD2    R        H      REFFLD(ADR1)
     A            SCRCTY    R        H      REFFLD(CTY)
     A            SCRFEI    R        H      REFFLD(FEIN)
     A            SCRFSN    R        H      REFFLD(FSN)
     A            SCRLSN    R        H      REFFLD(NAME)
     A            SCRST     R        H      REFFLD(ST)
     A            SCRZIP    R        H      REFFLD(ZIP)
     A            SCSCDS    R        H      REFFLD(DS10)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR05
     A  08 10 11
     A  12 13 21
     A  22 23 25                            CA01(08 'Response Indicator *IN08')
     A  26 27 19
     A  20                                  CA02(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(12 'Response Indicator *IN12')
     A                                      SETOF(13 'Response Indicator *IN13')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC26   RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C6    SCCRDTC7    MC40-
     A                                      144C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     19 26RERRMSGID  5    C6   -
     A                                       SCCRDTC7    MCR0500C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     19 21RERR-
     A                                      MSGID  5    C6    SCCRDTC7    MCR05-
     A                                      56C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     19 10RERRMSGID  5    C6    -
     A                                      SCCRDTC7    MC40056C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     19 22RERRM-
     A                                      SGID  5    C6    SCCRDTC7    MC4014-
     A                                      5C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     19 23RERRMSGID  5    C6    S-
     A                                      CCRDTC7    MCR2397C6    FSMESGC5   -
     A                                       *LIBLC0    E1    6     19 25RERRMS-
     A                                      GID  5    C6    SCRRDTC7    MC40144-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      6     20 26RERRMSGID  5    C6    SC-
     A                                      RRDTC7    MCR0500C6    FSMESGC5    -
     A                                      *LIBLC0    E1    6     20 21RERRMSG-
     A                                      ID  5    C6    SCRRDTC7    MCR0556C-
     A                                      6    FSMESGC5    *LIBLC0    E1    6-
     A                                           20 10RERRMSGID  5    C6    SCR-
     A                                      RDTC7    MC40056C6    FSMESGC5    *-
     A                                      LIBLC0    E1    6     20 22RERRMSGI-
     A                                      D  5    C6    SCRRDTC7    MC40145C6-
     A                                          FSMESGC5    *LIBLC0    E1    6 -
     A                                          20 23RERRMSGID  5    C6    SCRR-
     A                                      DTC7    MCR2397C6    FSMESGC5    *L-
     A                                      IBLC0    E1    6     20 25RERRMSGID-
     A                                        5    C6    SCCSDTC7    MCR0500C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         19 21RERRMSGID  5    C6    SCCSD-
     A                                      TC7    MC40202C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     19 08RERRMSGID -
     A                                       5    C6    SCCSDTC7    MC40056C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        19 13RERRMSGID  5    C6    SCCSDT-
     A                                      C7    MC40145C6    FSMESGC5    *LIB-
     A                                      LC0    E1    6     19 12RERRMSGID  -
     A                                      5    C6    SCCSDTC7    MCR2397C6   -
     A                                       FSMESGC5    *LIBLC0    E1    6    -
     A                                       19 11RERRMSGID  5    C6    SCCSDTC-
     A                                      7    MCR0500C6    FSMESGC5    *LIBL-
     A                                      C0    E1    6     19 27RERRMSGID  5-
     A                                          C6    SCRSDTC7    MCR0500C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      20 21RERRMSGID  5    C6    SCRSDTC7-
     A                                          MC40202C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     20 08RERRMSGID  5 -
     A                                         C6    SCRSDTC7    MC40056C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     2-
     A                                      0 13RERRMSGID  5    C6    SCRSDTC7 -
     A                                         MC40145C6    FSMESGC5    *LIBLC0-
     A                                          E1    6     20 12RERRMSGID  5  -
     A                                        C6    SCRSDTC7    MCR2397C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     20-
     A                                       11RERRMSGID  5    C6    SCRSDTC7  -
     A                                        MCR0500C6    FSMESGC5    *LIBLC0 -
     A                                         E1    6     20 27')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR05","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN0-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN10",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 3":{"fieldName":"*IN11","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 4":{"fieldName":"*IN12","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 5":{"fieldName":"*IN13","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 6-
     A                                      ":{"fieldName":"*IN21","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 7":{-
     A                                      "fieldName":"*IN22","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 8":{"fi-
     A                                      eldName":"*IN23","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 9":{"field-
     A                                      Name":"*IN25","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 10":{"fieldNa-
     A                                      me":"*IN26","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 11":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-10"},"i-
     A                                      tems":[{"id":"SCR04_HREC","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"HREC","-
     A                                      designValue":"[HREC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCR04_HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR04"-
     A                                      ,"field type":"panel","panel style"-
     A                                      :"Transform Dialog","text align":"c-
     A                                      enter","left":"5px","top":"5px","he-
     A                                      ight":"370px","width"')
     A                                  1  2HTML(':"324px","z index":"8","locke-
     A                                      d in place":"true"},{"id":"constant-
     A                                      86","field type":"output field","va-
     A                                      lue":"****** ERROR ******","css cla-
     A                                      ss":"constant","left":"85px","curso-
     A                                      r column":"10","top":"65px","cursor-
     A                                       row":"1","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant91","fiel-
     A                                      d type":"output field","value":"Dat-
     A                                      e Recon rcvd/sent must be greater",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "85px","cursor row":"2","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant87","field type":"output field-
     A                                      ","value":"Date Bill rcvd/sent must-
     A                                       be greater","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"19","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"29px","cursor colum-
     A                                      n":"2","top":"85px","cursor row":"2-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant92","field type":-
     A                                      "output field","value":"than or equ-
     A                                      al to \"To date of Service\".","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      9px","cursor column":"2","top":"105-
     A                                      px","cursor row":"3","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt88","field type":"output field","-
     A                                      value":"than or equal to \"To date -
     A                                      of Service\".","css class":"constan-
     A                                      t","visibility":{"fieldName":"19","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"29px","cursor col-
     A                                      umn":"2","top":"105px","cursor row"-
     A                                      :"3","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant85","field typ-
     A                                      e":"output field","value":"F0361FFL-
     A                                      -SCR05-JWALK TAG","css class":"cons-
     A                                      tant","left":"29px","cursor column"-
     A                                      :"2","top":"125px","cursor row":"4"-
     A                                      ,"visibility":"hidden","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant89","field type":"output field"-
     A                                      ,"value":"Date bill rcvd by carrier-
     A                                      : ","css class":"constant","visibil-
     A                                      ity":{"fieldName":"19","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"145px","cursor row":"5","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant93","field type":"output -
     A                                      field","value":"Date recon rcvd by -
     A                                      carrier: ","css class":"constant","-
     A                                      visibility":{"fieldName":"20","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"29px","cursor column"-
     A                                      :"2","top":"145px","cursor row":"5"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCRDT","field type":"date-
     A                                       field","css class":"')
     A                                  1  2HTML('input","css class 2":"date-fi-
     A                                      eld","value":{"fieldName":"SCCRDT",-
     A                                      "designValue":"[SCCRDT]","refField"-
     A                                      :"DT8","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00","edtWrd":"''  /  /    '-
     A                                      '","dateFormat":"m/d/Y"},"visibilit-
     A                                      y":{"fieldName":"19","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"225px","cursor column":"30","t-
     A                                      op":"145px","cursor row":"5","width-
     A                                      ":"71px","css class 3":{"fieldName"-
     A                                      :"19","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"error message id":"M-
     A                                      C40144","error message file":"FSMES-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"19 -
     A                                      and 26","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"6 message-
     A                                      s","error message id 2":"MCR0500","-
     A                                      error message file 2":"FSMESG","err-
     A                                      or message library 2":"*LIBL","erro-
     A                                      r condition 2":{"fieldName":"19 and-
     A                                       21","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 3":"MCR0556"-
     A                                      ,"error message file 3":"FSMESG","e-
     A                                      rror message library 3":"*LIBL","er-
     A                                      ror condition 3":{"fieldName":"19 a-
     A                                      nd 10","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 4":"MC4005-
     A                                      6","error message file 4":"FSMESG",-
     A                                      "error message library 4":"*LIBL","-
     A                                      error condition 4":{"fieldName":"19-
     A                                       and 22","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 5":"MC40-
     A                                      145","error message file 5":"FSMESG-
     A                                      ","error message library 5":"*LIBL"-
     A                                      ,"error condition 5":{"fieldName":"-
     A                                      19 and 23","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 6":"MC-
     A                                      R2397","error message file 6":"FSME-
     A                                      SG","error message library 6":"*LIB-
     A                                      L","error condition 6":{"fieldName"-
     A                                      :"19 and 25","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"css class 4":"profoun-
     A                                      d-converted"},{"id":"SCRRDT","field-
     A                                       type":"date field","css class":"in-
     A                                      put","css class 2":"date-field","va-
     A                                      lue":{"fieldName":"SCRRDT","designV-
     A                                      alue":"[SCRRDT]","refField":"DT8","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","edtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"visibility":{"fie-
     A                                      ldName":"20","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"225-
     A                                      px","cursor column":"31","top":"145-
     A                                      px","cursor row":"5",')
     A                                  1  2HTML('"width":"71px","css class 3":-
     A                                      {"fieldName":"20","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"error me-
     A                                      ssage id":"MC40144","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"20 and 26","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"6 messages","error message id 2"-
     A                                      :"MCR0500","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"20 and 21","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      3":"MCR0556","error message file 3"-
     A                                      :"FSMESG","error message library 3"-
     A                                      :"*LIBL","error condition 3":{"fiel-
     A                                      dName":"20 and 10","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 4":"MC40056","error message file -
     A                                      4":"FSMESG","error message library -
     A                                      4":"*LIBL","error condition 4":{"fi-
     A                                      eldName":"20 and 22","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                       id 5":"MC40145","error message fil-
     A                                      e 5":"FSMESG","error message librar-
     A                                      y 5":"*LIBL","error condition 5":{"-
     A                                      fieldName":"20 and 23","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 6":"MCR2397","error message f-
     A                                      ile 6":"FSMESG","error message libr-
     A                                      ary 6":"*LIBL","error condition 6":-
     A                                      {"fieldName":"20 and 25","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant90","field type":"output fiel-
     A                                      d","value":"Date bill sent to carri-
     A                                      er: ","css class":"constant","visib-
     A                                      ility":{"fieldName":"19","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"185px","cursor row":"7","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant94","field type":"outpu-
     A                                      t field","value":"Date recon sent t-
     A                                      o carrier:","css class":"constant",-
     A                                      "visibility":{"fieldName":"20","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"29px","cursor column-
     A                                      ":"2","top":"185px","cursor row":"7-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCCSDT","field type":"dat-
     A                                      e field","css class":"input","css c-
     A                                      lass 2":"date-field","value":{"fiel-
     A                                      dName":"SCCSDT","designValue":"[SCC-
     A                                      SDT]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","edtWrd-
     A                                      ":"''  /  /    ''","dateFormat":"m/-
     A                                      d/Y"},"visibility":{"')
     A                                  1  2HTML('fieldName":"19","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"225px","cursor column":"30","-
     A                                      top":"185px","cursor row":"7","widt-
     A                                      h":"71px","css class 3":{"fieldName-
     A                                      ":"19","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"error message id":"-
     A                                      MCR0500","error message file":"FSME-
     A                                      SG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"19-
     A                                       and 21","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"6 messag-
     A                                      es","error message id 2":"MC40202",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"19 an-
     A                                      d 08","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error message id 3":"MC40056-
     A                                      ","error message file 3":"FSMESG","-
     A                                      error message library 3":"*LIBL","e-
     A                                      rror condition 3":{"fieldName":"19 -
     A                                      and 13","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 4":"MC401-
     A                                      45","error message file 4":"FSMESG"-
     A                                      ,"error message library 4":"*LIBL",-
     A                                      "error condition 4":{"fieldName":"1-
     A                                      9 and 12","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 5":"MCR-
     A                                      2397","error message file 5":"FSMES-
     A                                      G","error message library 5":"*LIBL-
     A                                      ","error condition 5":{"fieldName":-
     A                                      "19 and 11","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error message id 6":"M-
     A                                      CR0500","error message file 6":"FSM-
     A                                      ESG","error message library 6":"*LI-
     A                                      BL","error condition 6":{"fieldName-
     A                                      ":"19 and 27","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"css class 4":"profou-
     A                                      nd-converted"},{"id":"SCRSDT","fiel-
     A                                      d type":"date field","css class":"i-
     A                                      nput","css class 2":"date-field","v-
     A                                      alue":{"fieldName":"SCRSDT","design-
     A                                      Value":"[SCRSDT]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","edtWrd":"''  /  /    ''","dat-
     A                                      eFormat":"m/d/Y"},"visibility":{"fi-
     A                                      eldName":"20","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"22-
     A                                      5px","cursor column":"31","top":"18-
     A                                      5px","cursor row":"7","width":"71px-
     A                                      ","css class 3":{"fieldName":"20","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"error message id":"MCR0500"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"20 and 21"-
     A                                      ,"dataType":"expressi')
     A                                  1  2HTML('on","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"6 messages","error message id 2-
     A                                      ":"MC40202","error message file 2":-
     A                                      "FSMESG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"20 and 08","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       3":"MC40056","error message file 3-
     A                                      ":"FSMESG","error message library 3-
     A                                      ":"*LIBL","error condition 3":{"fie-
     A                                      ldName":"20 and 13","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 4":"MC40145","error message file-
     A                                       4":"FSMESG","error message library-
     A                                       4":"*LIBL","error condition 4":{"f-
     A                                      ieldName":"20 and 12","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 5":"MCR2397","error message fi-
     A                                      le 5":"FSMESG","error message libra-
     A                                      ry 5":"*LIBL","error condition 5":{-
     A                                      "fieldName":"20 and 11","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 6":"MCR0500","error message -
     A                                      file 6":"FSMESG","error message lib-
     A                                      rary 6":"*LIBL","error condition 6"-
     A                                      :{"fieldName":"20 and 27","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"css clas-
     A                                      s 4":"profound-converted"},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"330px","width-
     A                                      ":"80px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF12","-
     A                                      field type":"button","value":"Cance-
     A                                      l","shortcut key":"F12","left":"104-
     A                                      px","top":"330px","width":"80px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCCRDT    R        H      REFFLD(DT8)
     A            SCCSDT    R        H      REFFLD(DT8)
     A            SCRRDT    R        H      REFFLD(DT8)
     A            SCRSDT    R        H      REFFLD(DT8)
     A          R WDW01
     A  41 09                               CA01(41 'Response Indicator *IN41')
     A                                  1  2HTML('QPUIREC3    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C6    SCFLG7C7    MCR0-
     A                                      501C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     41')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","set off":{-
     A                                      "fieldName":"*IN41","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"overlay range":-
     A                                      "1-10"},"items":[{"id":"WDW01","fie-
     A                                      ld type":"panel","panel style":"Tra-
     A                                      nsform Dialog","text align":"center-
     A                                      ","left":"5px","top":"5px","height"-
     A                                      :"350px","width":"534px","z index":-
     A                                      "8","locked in place":"true"},{"id"-
     A                                      :"constant95","field type":"output -
     A                                      field","left":"29px","cursor column-
     A                                      ":"2","top":"65px","cursor row":"1"-
     A                                      ,"value":"js: currentUser()","css c-
     A                                      lass":"output-field","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt96","field type":"output field","-
     A                                      value":"* * * ERROR * * *","css cla-
     A                                      ss":"constant","left":"190px","curs-
     A                                      or column":"25","top":"65px","curso-
     A                                      r row":"1","css class 2":"HI","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant97","field type":"output-
     A                                       field","value":"WDW01","css class"-
     A                                      :"constant","left":"477px","cursor -
     A                                      column":"66","top":"65px","cursor r-
     A                                      ow":"1","css class 2":"profound-con-
     A                                      verted"},{"id":"constant98","field -
     A                                      type":"output field","value":"The F-
     A                                      L License Number, that you have ent-
     A                                      ered, is not","css class":"constant-
     A                                      ","left":"85px","cursor column":"10-
     A                                      ","top":"125px","cursor row":"4","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant99","field type":"out-
     A                                      put field","value":"in the Provider-
     A                                       Database. Choose option F12=Cancel-
     A                                      , ","css class":"constant","left":"-
     A                                      85px","cursor column":"10","top":"1-
     A                                      45px","cursor row":"5","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant100","field type":"output field-
     A                                      ","value":"if you wish to change th-
     A                                      e License Number.  Would you","css -
     A                                      class":"constant","left":"85px","cu-
     A                                      rsor column":"10","top":"165px","cu-
     A                                      rsor row":"6","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant101",-
     A                                      "field type":"output field","value"-
     A                                      :"like to continue with this Licens-
     A                                      e Number?","css class":"constant","-
     A                                      left":"85px","cursor column":"10","-
     A                                      top":"185px","cursor row":"7","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCFLG7","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCFLG-
     A                                      7","designValue":"[SCFLG7]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"1"},"text transform":"u-
     A                                      ppercase","left":"386px","cursor co-
     A                                      lumn":"53","top":"185px","cursor ro-
     A                                      w":"7","width":"8px",')
     A                                  1  2HTML('"css class 3":"HI","css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"error message id":"MCR0501","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"41","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"1 message","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      102","field type":"output field","v-
     A                                      alue":"(Y/N)","css class":"constant-
     A                                      ","left":"400px","cursor column":"5-
     A                                      5","top":"185px","cursor row":"7","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"310px-
     A                                      ","width":"80px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF12","field type":"button","value-
     A                                      ":"Cancel","shortcut key":"F12","le-
     A                                      ft":"104px","top":"310px","width":"-
     A                                      80px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"}]}')
     A            SCFLG7         1A  H
     A          R WDW02
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C12   WDW02_SCTAPEC7  -
     A                                        MCR0503C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     17RERRMSGID  5    C1-
     A                                      2   WDW02_SCTAPEC7    MCR0999C6    -
     A                                      FSMESGC5    *LIBLC0    E1    3     -
     A                                      18')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN1-
     A                                      7","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-10"},"items":[{"i-
     A                                      d":"WDW02_HREC","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HREC","designValu-
     A                                      e":"[HREC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"WDW02_-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"WDW02","field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      m Dialog","text align":"center","le-
     A                                      ft":"5px","top":"5px","height":"370-
     A                                      px","width":"324px","z index":"8","-
     A                                      locked in place":"true"},{"id":"con-
     A                                      stant57","field type":"output field-
     A                                      ","value":"****** ERROR ******","cs-
     A                                      s class":"constant","left":"85px","-
     A                                      cursor column":"10","top":"65px","c-
     A                                      ursor row":"1","css class 2":"profo-
     A                                      und-converted"},{"id":"constant58",-
     A                                      "field type":"output field","value"-
     A                                      :"You have marked the data submissi-
     A                                      on","css class":"constant","left":"-
     A                                      29px","cursor column":"2","top":"85-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt59","field type":"output field","-
     A                                      value":"flag.  The Date of Service -
     A                                      is a","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      105px","cursor row":"3","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant60","field type":"output field-
     A                                      ","value":"future date and disquali-
     A                                      fies this","css class":"constant","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"125px","cursor row":"4","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant61","field')
     A                                  1  2HTML(' type":"output field","value"-
     A                                      :"claim for data submission.  Pleas-
     A                                      e","css class":"constant","left":"2-
     A                                      9px","cursor column":"2","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt62","field type":"output field","-
     A                                      value":"correct the flag.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant56","fiel-
     A                                      d type":"output field","value":"F03-
     A                                      61FFL-WDW02-JWALK TAG","css class":-
     A                                      "constant","left":"29px","cursor co-
     A                                      lumn":"2","top":"185px","cursor row-
     A                                      ":"7","visibility":"hidden","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant63","field type":"output f-
     A                                      ield","value":"Eligible for Data Su-
     A                                      bmission:","css class":"constant","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"205px","cursor row":"8","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"WDW02_SCTAPE","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCTAPE","designValue":"[SCTAPE]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"239px"-
     A                                      ,"cursor column":"32","top":"205px"-
     A                                      ,"cursor row":"8","width":"8px","cs-
     A                                      s class 3":"HI","set focus":{"field-
     A                                      Name":"17 or 18","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"MCR0503","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"17","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"MCR0999-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"18"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"css class 4":"profound-converted"-
     A                                      },{"id":"btnSubmit","field type":"b-
     A                                      utton","value":"Enter","shortcut ke-
     A                                      y":"Enter","left":"14px","top":"330-
     A                                      px","width":"80px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF12","field type":"button","val-
     A                                      ue":"Cancel","shortcut key":"F12","-
     A                                      left":"104px","top":"330px","width"-
     A                                      :"80px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCTAPE    R        H      REFFLD(FLAG)
