     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  04 05 06
     A  07 15 24
     A  25 28 29                            CA01(04 'Response Indicator *IN04')
     A  30 51 91
     A  92 93 94
     A  95 03 09                            CA02(05 'Response Indicator *IN05')
     A  43 96 14
     A  31 32 33
     A  34 35 36                            CA03(06 'Response Indicator *IN06')
     A  37 38 39
     A  40 46 44
     A  47 48 49                            CA04(07 'Response Indicator *IN07')
     A  50 55 56
     A  58 59 65
     A  68 69 70                            CA05(15 'Response Indicator *IN15')
     A  71 72 73
     A  74 75 76
     A  77 78 79                            CA06(24 'Response Indicator *IN24')
     A  80 81 82
     A  83 84 85
     A  86 87 88                            CA07(25 'Response Indicator *IN25')
     A  89 97 16                            CA08(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                      SETOF(92 'Response Indicator *IN92')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                      SETOF(94 'Response Indicator *IN94')
     A                                      SETOF(95 'Response Indicator *IN95')
     A                                  1  2HTML('QPUIREC51   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCCSCDC7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      CSCDC7    MCR2383C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     72RERRMSGID -
     A                                       5    C6    SCCSCDC7    MC40167C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        65RERRMSGID  5    C5    SCPOSC7  -
     A                                        MCR0503C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     76RERRMSGID  5    C5-
     A                                          SCPOSC7    MCR2383C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     77RERRM-
     A                                      SGID  5    C5    SCPOSC7    MCR2387-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     25RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR0556C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     73RERRMSGID  5 -
     A                                         C6    SCFDATC7    MCR0500C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     7-
     A                                      4RERRMSGID  5    C6    SCFDATC7    -
     A                                      MC40056C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     75RERRMSGID  5    C6  -
     A                                        SCFDATC7    MCR0466C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     85RERRMS-
     A                                      GID  5    C6    SCFDATC7    MC40157-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     86RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR2397C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     30RERRMSGID  5 -
     A                                         C6    SCFDATC7    MCR0676C6    F-
     A                                      SMESGC5    *LIBLC0    E1    12   N3-
     A                                      7 38 39 40RERRMSGID  5    C6    SCT-
     A                                      DATC7    MCR0500C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     07RERRMSGID  -
     A                                      5    C6    SCTDATC7    MC40307C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       28RERRMSGID  5    C6    SCTDATC7  -
     A                                        MCR2397C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     29RERRMSGID  5    C6-
     A                                          SCRVCDC7    MCR2387C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     87RERR-
     A                                      MSGID  5    C6    SCRVCDC7    MC404-
     A                                      44C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     91RERRMSGID  5    C6    SCR-
     A                                      VCDC7    MC40544C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     92RERRMSGID  -
     A                                      5    C6    SCRVCDC7    MC40545C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       93RERRMSGID  5    C6    SCRVCDC7  -
     A                                        MC40547C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     95RERRMSGID  5    C6-
     A                                          SCHCPCC7    MCR0503C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     78RERR-
     A                                      MSGID  5    C6    SCHCPCC7    MCR23-
     A                                      87C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     89RERRMSGID  5    C6    SCH-
     A                                      CPCC7    MC40546C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     94RERRMSGID  -
     A                                      5    C6    SCHCPCC7    MC40547C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       95RERRMSGID  5    C6    SCHCPCC7  -
     A                                        MC40549C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     51RERRMSGID  5    C6-
     A                                          SCPMODC7    MCR2434C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     15RERR-
     A                                      MSGID  5    C6    SCMOD2C7    MCR24-
     A                                      34C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     88RERRMSGID  5    C6    SCC-
     A                                      DDSC7    MCR0503C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     79R')
     A                                  1  2HTML('QPUIERRMSGID  5    C6    SCCD-
     A                                      DSC7    MCR0676C6    FSMESGC5    *L-
     A                                      IBLC0    E1    12    37N38N39N40RER-
     A                                      RMSGID  5    C6    SCUNTSC7    MCR0-
     A                                      676C6    FSMESGC5    *LIBLC0    E1 -
     A                                         12   N37 38N39N40RERRMSGID  5   -
     A                                       C6    SCCHRGC7    MCR0556C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     80R-
     A                                      ERRMSGID  5    C6    SCCHRGC7    MC-
     A                                      40116C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     58RERRMSGID  5    C6    -
     A                                      SCCHRGC7    MCR0676C6    FSMESGC5  -
     A                                        *LIBLC0    E1    12   N37N38 39N4-
     A                                      0RERRMSGID  5    C6    SCCHRGC7    -
     A                                      MC40011C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     04RERRMSGID  5    C6  -
     A                                        SCPAIDC7    MC40116C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     58RERRMS-
     A                                      GID  5    C6    SCPAIDC7    MCR0676-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      12   N37N38N39 40RERRMSGID  5    C5-
     A                                          SCMRAC7    MC40116C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     58RERRM-
     A                                      SGID  5    C5    SCMRAC7    MCR0676-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      12    37 38N39N40RERRMSGID  5    C6-
     A                                          SCNTWKC7    MC40116C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     58RERR-
     A                                      MSGID  5    C6    SCNTWKC7    MCR06-
     A                                      76C6    FSMESGC5    *LIBLC0    E1  -
     A                                        12   N37 38 39N40RERRMSGID  5    -
     A                                      C6    SCOTHRC7    MC40116C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     58RE-
     A                                      RRMSGID  5    C6    SCOTHRC7    MCR-
     A                                      0676C6    FSMESGC5    *LIBLC0    E1-
     A                                          12   N37N38 39 40RERRMSGID  5  -
     A                                        C6    SCOT1CC7    MC40072C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     81-
     A                                      RERRMSGID  5    C6    SCOT1CC7    M-
     A                                      CR0513C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     82RERRMSGID  5    C6   -
     A                                       SCOTH2C7    MC40116C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     58RERRMSG-
     A                                      ID  5    C6    SCOTH2C7    MCR0676C-
     A                                      6    FSMESGC5    *LIBLC0    E1    1-
     A                                      2    37N38N39 40RERRMSGID  5    C6 -
     A                                         SCOT2CC7    MC40072C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     83RERRM-
     A                                      SGID  5    C6    SCOT2CC7    MCR051-
     A                                      3C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     84')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","set off":{"fieldN-
     A                                      ame":"*IN04","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 2":{"fieldName-
     A                                      ":"*IN05","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 3":{"fieldName":"-
     A                                      *IN06","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 4":{"fieldName":"*IN-
     A                                      07","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 5":{"fieldName":"*IN15"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 6":{"fieldName":"*IN30","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 7":{"fieldName":"*IN24","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 8":{"fieldName":"*IN28","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      9":{"fieldName":"*IN29","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 10"-
     A                                      :{"fieldName":"*IN91","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 11":{-
     A                                      "fieldName":"*IN25","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 12":{"f-
     A                                      ieldName":"*IN92","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 13":{"fie-
     A                                      ldName":"*IN93","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 14":{"field-
     A                                      Name":"*IN94","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 15":{"fieldNa-
     A                                      me":"*IN95","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 16":{"fieldName-
     A                                      ":"*IN51","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"return cursor record":{"f-
     A                                      ieldName":"HREC","dataLength":"10",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none"}-
     A                                      ,"return cursor field":{"fieldName"-
     A                                      :"HFLD","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"overlay-
     A                                       range":"1-24"},"items":[{"id":"HFL-
     A                                      D","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"HFLD","designValue":"[HFLD]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"10"},"left":"0px","top-
     A                                      ":"-30px","css class"')
     A                                  1  2HTML(':"profound-converted"},{"id":-
     A                                      "HREC","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"HREC","designValue":"[HREC-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"10"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"F0363F_SCR01_av-
     A                                      Keys","field type":"output field","-
     A                                      value":{"fieldName":"AV_KEYS","data-
     A                                      Length":"1134","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[AV_KEYS]"},"left":"0px","top":"0p-
     A                                      x","visibility":"hidden"},{"id":"F0-
     A                                      363F_SCR01_action","field type":"ht-
     A                                      ml container","white space":"normal-
     A                                      ","left":"0px","top":"10px","width"-
     A                                      :"230px","css class":"action-panel--
     A                                      converted","height":"700px","html":-
     A                                      "<div class=\"top\"></div><div clas-
     A                                      s=\"imagetop\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_top.png\" />-
     A                                      </div><div class=\"menulinks\"></di-
     A                                      v><div class=\"imagebottom\"><img s-
     A                                      rc=\"/profoundui/userdata/images/ba-
     A                                      r_bottom.png\" /></div><div class=\-
     A                                      "bottom\"></div>"},{"field type":"i-
     A                                      con menu button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"32px","z index":"20","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1170px","id":"F0363F_SCR01_BtnIconM-
     A                                      enuSystemTools","tool tip":"System -
     A                                      Tools","icon source":"/profoundui/u-
     A                                      serdata/images/systool/systools.png-
     A                                      ","data function":"SystemToolbarSys-
     A                                      tools","show down arrow":"Yes"},{"f-
     A                                      ield type":"panel","panel style":"T-
     A                                      ransformButtonBar","id":"F0363F_SCR-
     A                                      01_ButtonBar","top":"35px","left":"-
     A                                      1036px","width":"187px","height":"2-
     A                                      8px","css class":"stationary","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true"},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1040p-
     A                                      x","id":"F0363F_SCR01_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","vis')
     A                                  1  2HTML('ibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "F0363F_SCR01_BtnRefresh","tool tip-
     A                                      ":"Refresh","onclick":"SystemToolba-
     A                                      rRefresh","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/refresh.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1092px","id":"F0363F_SCR01_Bt-
     A                                      nSearch","tool tip":"Search","oncli-
     A                                      ck":"SystemToolbarSearch","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/search.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1118px","id":"-
     A                                      F0363F_SCR01_BtnDiaryItems","tool t-
     A                                      ip":"Diary/Work Items - IDARTS","on-
     A                                      click":"SystemToolbarDiary","backgr-
     A                                      ound image":{"fieldName":"DryIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1144px","id":"F0363-
     A                                      F_SCR01_BtnSystemMessages","tool ti-
     A                                      p":"System Messages","onclick":"Sys-
     A                                      temToolbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0363F_SCR01_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoun')
     A                                  1  2HTML('dui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"F0363F_SCR01_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"F0363F_SCR01_Mai-
     A                                      nTabPanel","field type":"tab panel"-
     A                                      ,"tab panel style":"Transform","tab-
     A                                       names":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"active tab":"0","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0363F_S-
     A                                      CR01_BtnHiddenSave","value":"btnSav-
     A                                      e","top":"100px","response":{"field-
     A                                      Name":"btnSave","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant1","-
     A                                      field type":"output field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      10px","cursor row":"1","css class":-
     A                                      "top-line","value":"js: currentUser-
     A                                      ()","css class 2":"output-field","p-
     A                                      arent tab panel":"F0363F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCCONM","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCCONM","des-
     A                                      ignValue":"[SCCONM]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","css class-
     A                                       3":"HI","parent tab panel":"F0363F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"constant2","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0363F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F0363F_SCR0-
     A                                      1_fkeyMenu","field type":"menu","le-
     A                                      ft":"10px","top":"120px","height":"-
     A                                      350px","width":"230px","hover backg-
     A                                      round color":"#9AAA61","hover text -
     A                                      color":"#FFFFFF","border color":"#4-
     A                                      C6106","menu option indent":"10px",-
     A                                      "background color":"#758B27","css c-
     A                                      lass":"action-menu","css class 2":"-
     A                                      stationary","z index":"101"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width"')
     A                                  1  2HTML(':"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0363F_SCR01_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"Q1PGM","field type":"output -
     A                                      field","value":{"fieldName":"Q1PGM"-
     A                                      ,"designValue":"[Q1PGM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F0363F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCAST","field type":"output field",-
     A                                      "value":{"fieldName":"SCAST","desig-
     A                                      nValue":"[SCAST]","refField":"ST","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"358px","cursor column":"13","-
     A                                      top":"130px","cursor row":"2","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      0363F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCZIPA","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCZIPA","designValue":"[SCZIPA]-
     A                                      ","refField":"ZIPA","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"379px","-
     A                                      cursor column":"16","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "parent tab panel":"F0363F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCPRDS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCPRDS","d-
     A                                      esignValue":"[SCPRDS]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"130px","cursor row":"2-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F0363F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant4","field type":"-
     A                                      output field","value":"SCR01","css -
     A                                      class":"constant","left":"799px","c-
     A                                      ursor column":"76","top":"130px","c-
     A                                      ursor row":"2","parent tab panel":"-
     A                                      F0363F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant3","field -
     A                                      type":"output field","value":"SCR01-
     A                                      ","css class":"constant","left":"79-
     A                                      9px","cursor column":"76","top":"13-
     A                                      0px","cursor row":"2","parent tab p-
     A                                      anel":"F0363F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css')
     A                                  1  2HTML(' class 2":"profound-converted-
     A                                      "},{"id":"SCMODE","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MODE","designValue":"[SCMODE]","ref-
     A                                      Field":"PGM","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"764px","cursor -
     A                                      column":"71","top":"150px","cursor -
     A                                      row":"3","css class 2":"HI","parent-
     A                                       tab panel":"F0363F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0363F_SCR01_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"SCHD1","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCHD1","designValue":"[SCHD1]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none","da-
     A                                      taLength":"78"},"css class":"output-
     A                                      -field","left":"281px","cursor colu-
     A                                      mn":"2","top":"170px","cursor row":-
     A                                      "4","parent tab panel":"F0363F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0363F_SCR01_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCHD2","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCHD2","designValue":"-
     A                                      [SCHD2]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"78"},"css c-
     A                                      lass":"output-field","left":"281px"-
     A                                      ,"cursor column":"2","top":"190px",-
     A                                      "cursor row":"5","parent tab panel"-
     A                                      :"F0363F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0363F_SCR01_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"SCHD3","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CHD3","designValue":"[SCHD3]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransfor')
     A                                  1  2HTML('m":"none","dataLength":"74"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"2-
     A                                      10px","cursor row":"6","parent tab -
     A                                      panel":"F0363F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCZIPB","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCZIPB","designValue":-
     A                                      "[SCZIPB]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"3"},"css -
     A                                      class":"output-field","left":"806px-
     A                                      ","cursor column":"77","top":"210px-
     A                                      ","cursor row":"6","parent tab pane-
     A                                      l":"F0363F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0363F_SCR01_BtnHiddenWorkSubmitJ-
     A                                      ob","value":"btnWrksbmjob","top":"2-
     A                                      25px","response":{"fieldName":"btnW-
     A                                      rkJob","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant5","field typ-
     A                                      e":"output field","value":"EOMB#:",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"F0363F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCEOB#","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCEOB#","designValue":"[SC-
     A                                      EOB#]","refField":"EOB#","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00"},"css -
     A                                      class":"output-field","left":"330px-
     A                                      ","cursor column":"9","top":"230px"-
     A                                      ,"cursor row":"7","width":"63px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"F0363F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant6","fi-
     A                                      eld type":"output field","value":"L-
     A                                      ine#:","css class":"constant","left-
     A                                      ":"400px","cursor column":"19","top-
     A                                      ":"230px","cursor row":"7","parent -
     A                                      tab panel":"F0363F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCLIN#-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCLIN#","designVal-
     A                                      ue":"[SCLIN#]","refField":"A90","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"449px","cursor column":"26","top"-
     A                                      :"230px","cursor row":"7","width":"-
     A                                      63px","text align":"right","parent -
     A                                      tab panel":"F0363F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt7","field type":"ou')
     A                                  1  2HTML('tput field","value":"Seq#:","-
     A                                      css class":"constant","left":"519px-
     A                                      ","cursor column":"36","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"F0363F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCSEQ#","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCSEQ#","designValue":"[SC-
     A                                      SEQ#]","refField":"SEQ#","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00"},"css -
     A                                      class":"output-field","left":"561px-
     A                                      ","cursor column":"42","top":"230px-
     A                                      ","cursor row":"7","width":"35px","-
     A                                      text align":"right","parent tab pan-
     A                                      el":"F0363F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant8","f-
     A                                      ield type":"output field","value":"-
     A                                      Ntwk:","css class":"constant","visi-
     A                                      bility":{"fieldName":"68","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"603px","cursor column":"4-
     A                                      8","top":"230px","cursor row":"7","-
     A                                      parent tab panel":"F0363F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCNWCD","field type":"output field-
     A                                      ","value":{"fieldName":"SCNWCD","de-
     A                                      signValue":"[SCNWCD]","refField":"N-
     A                                      WCD","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","visibility":{"fieldName":"68",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"645px","cursor c-
     A                                      olumn":"54","top":"230px","cursor r-
     A                                      ow":"7","parent tab panel":"F0363F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant9","field type":"-
     A                                      output field","value":"Tot chrg:","-
     A                                      css class":"constant","left":"687px-
     A                                      ","cursor column":"60","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"F0363F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCTOTC","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCTOTC","designValue":"[SC-
     A                                      TOTC]","refField":"A92","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00"},"css c-
     A                                      lass":"output-field","left":"757px"-
     A                                      ,"cursor column":"70","top":"230px"-
     A                                      ,"cursor row":"7","width":"77px","t-
     A                                      ext align":"right","parent tab pane-
     A                                      l":"F0363F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant10","f-
     A                                      ield type":"output field","value":"-
     A                                      SELECTED NETWORK CONTRACT IS A MANU-
     A                                      AL FEE SCHEDULE","css class":"const-
     A                                      ant","visibility":{"f')
     A                                  1  2HTML('ieldName":"03","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"250px","cursor row":"8","css cl-
     A                                      ass 2":"HI","parent tab panel":"F03-
     A                                      63F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0363-
     A                                      F_SCR01_BtnHiddenWorkPrinterOutput"-
     A                                      ,"value":"btnWrkprtout","top":"250p-
     A                                      x","response":{"fieldName":"btnWrkP-
     A                                      rnt","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant11","field type-
     A                                      ":"output field","value":"Adjudicat-
     A                                      ion code     :","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"270px","cursor row":"9",-
     A                                      "parent tab panel":"F0363F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCCSCD","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCCSCD-
     A                                      ","designValue":"[SCCSCD]","refFiel-
     A                                      d":"CODE3","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"449px","cur-
     A                                      sor column":"26","top":"270px","cur-
     A                                      sor row":"9","width":"22px","css cl-
     A                                      ass 3":{"fieldName":"N09 and N46","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"46-
     A                                       or 44 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 4":-
     A                                      {"fieldName":"46 or 44 or 09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"css class 5":{"fieldName":"N46"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"set focus":{"fieldName":"-
     A                                      31","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"error message id":"MCR0-
     A                                      503","error message file":"FSMESG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"71","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"3 messages","error -
     A                                      message id 2":"MCR2383","error mess-
     A                                      age file 2":"FSMESG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"72","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 3":"MC40167","error message f-
     A                                      ile 3":"FSMESG","error message libr-
     A                                      ary 3":"*LIBL","error')
     A                                  1  2HTML(' condition 3":{"fieldName":"6-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"parent tab panel":"F0363F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      id":"SCCSDS","field type":"output f-
     A                                      ield","value":{"fieldName":"SCCSDS"-
     A                                      ,"designValue":"[SCCSDS]","refField-
     A                                      ":"DS25","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"477px","cursor colu-
     A                                      mn":"30","top":"270px","cursor row"-
     A                                      :"9","css class 2":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"parent tab panel":"F0363-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant13","field type-
     A                                      ":"output field","value":"EOB Code -
     A                                      Needed","css class":"constant","vis-
     A                                      ibility":{"fieldName":"14","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"673px","cursor column":"-
     A                                      58","top":"270px","cursor row":"9",-
     A                                      "css class 2":{"fieldName":"14","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"RI","customFalse"-
     A                                      :""},"parent tab panel":"F0363F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant12","field type":"ou-
     A                                      tput field","value":"EOB/Notes atta-
     A                                      ched","css class":"constant","visib-
     A                                      ility":{"fieldName":"69","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"673px","cursor column":"58-
     A                                      ","top":"270px","cursor row":"9","c-
     A                                      ss class 2":{"fieldName":"69","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"RI","customFalse":"-
     A                                      "},"parent tab panel":"F0363F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0363F_SCR01_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      14","field type":"output field","va-
     A                                      lue":"Place of Service      :","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"290px","c-
     A                                      ursor row":"10","parent tab panel":-
     A                                      "F0363F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPOS","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox"')
     A                                  1  2HTML(',"value":{"fieldName":"SCPOS"-
     A                                      ,"designValue":"[SCPOS]","dataType"-
     A                                      :"zoned","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00","dataLengt-
     A                                      h":"2","decPos":"0"},"left":"449px"-
     A                                      ,"cursor column":"26","top":"290px"-
     A                                      ,"cursor row":"10","width":"15px","-
     A                                      css class 3":{"fieldName":"N09 and -
     A                                      N46","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"46 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 4":-
     A                                      {"fieldName":"46 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 5":{"fieldName":"N46","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"set focus":{"fieldName":"32","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message id":"MCR0503","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"76","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"3 messages","error messag-
     A                                      e id 2":"MCR2383","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"77","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      3":"MCR2387","error message file 3"-
     A                                      :"FSMESG","error message library 3"-
     A                                      :"*LIBL","error condition 3":{"fiel-
     A                                      dName":"25","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F03-
     A                                      63F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"SCPODS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCPODS","designValue":"[SCPODS]",-
     A                                      "refField":"DS30","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"470px","cu-
     A                                      rsor column":"29","top":"290px","cu-
     A                                      rsor row":"10","css class 2":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F0363F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0363F_SCR01_BtnHiddenHelp","val-
     A                                      ue":"btnHelp","top":"')
     A                                  1  2HTML('300px","response":{"fieldName-
     A                                      ":"btnHelp","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant15","fie-
     A                                      ld type":"output field","value":"Fr-
     A                                      om Date of Service  :","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"310px","cursor ro-
     A                                      w":"11","parent tab panel":"F0363F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCFDAT","field type":"dat-
     A                                      e field","css class":"input","css c-
     A                                      lass 2":"date-field","value":{"fiel-
     A                                      dName":"SCFDAT","designValue":"[SCF-
     A                                      DAT]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","edtWrd-
     A                                      ":"''  /  /    ''","dateFormat":"m/-
     A                                      d/Y"},"left":"449px","cursor column-
     A                                      ":"26","top":"310px","cursor row":"-
     A                                      11","width":"71px","css class 3":{"-
     A                                      fieldName":"N09 and N46","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"46 or 09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 4":{"fieldName":"4-
     A                                      6 or 09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"N46","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"set focus":-
     A                                      {"fieldName":"33","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage id":"MCR0556","error message f-
     A                                      ile":"FSMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"73","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"7 mes-
     A                                      sages","error message id 2":"MCR050-
     A                                      0","error message file 2":"FSMESG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"74-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 3":"MC40056","e-
     A                                      rror message file 3":"FSMESG","erro-
     A                                      r message library 3":"*LIBL","error-
     A                                       condition 3":{"fieldName":"75","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 4":"MCR0466","error -
     A                                      message file 4":"FSMESG","error mes-
     A                                      sage library 4":"*LIBL","error cond-
     A                                      ition 4":{"fieldName":"85","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 5":"MC40157","error messa-
     A                                      ge file 5":"FSMESG","error message -
     A                                      library 5":"*LIBL","error condition-
     A                                       5":{"fieldName":"86","dataType":"e-
     A                                      xpression","formattin')
     A                                  1  2HTML('g":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 6":"MCR239-
     A                                      7","error message file 6":"FSMESG",-
     A                                      "error message library 6":"*LIBL","-
     A                                      error condition 6":{"fieldName":"30-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 7":"MCR0676","e-
     A                                      rror message file 7":"FSMESG","erro-
     A                                      r message library 7":"*LIBL","error-
     A                                       condition 7":{"fieldName":"N37 and-
     A                                       38 and 39 and 40","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"F0363F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"id":"constant16","f-
     A                                      ield type":"output field","value":"-
     A                                      To Date of Service       :","css cl-
     A                                      ass":"constant","left":"547px","cur-
     A                                      sor column":"40","top":"310px","cur-
     A                                      sor row":"11","parent tab panel":"F-
     A                                      0363F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCTDAT","field type-
     A                                      ":"date field","css class":"input",-
     A                                      "css class 2":"date-field","value":-
     A                                      {"fieldName":"SCTDAT","designValue"-
     A                                      :"[SCTDAT]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      edtWrd":"''  /  /    ''","dateForma-
     A                                      t":"m/d/Y"},"left":"758px","cursor -
     A                                      column":"67","top":"310px","cursor -
     A                                      row":"11","width":"71px","css class-
     A                                       3":{"fieldName":"N09 and N46","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"46 or-
     A                                       09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 4":{"fieldNa-
     A                                      me":"46 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"error messa-
     A                                      ge id":"MCR0500","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"07","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"3 messa-
     A                                      ges","error message id 2":"MC40307"-
     A                                      ,"error message file 2":"FSMESG","e-
     A                                      rror message library 2":"*LIBL","er-
     A                                      ror condition 2":{"fieldName":"28",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 3":"MCR2397","err-
     A                                      or message file 3":"FSMESG","error -
     A                                      message library 3":"*LIBL","error c-
     A                                      ondition 3":{"fieldName":"29","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"desc-
     A                                      ription":"To Date of Service","pare-
     A                                      nt tab panel":"F0363F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      5":"profound-converted"},{"id":"con-
     A                                      stant18","field type"')
     A                                  1  2HTML(':"output field","value":"Reve-
     A                                      nue code          :","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "97","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"281px","cur-
     A                                      sor column":"2","top":"330px","curs-
     A                                      or row":"12","parent tab panel":"F0-
     A                                      363F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant17","field t-
     A                                      ype":"output field","value":"Revenu-
     A                                      e code/DRG code :","css class":"con-
     A                                      stant","visibility":{"fieldName":"N-
     A                                      97","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"281px","curs-
     A                                      or column":"2","top":"330px","curso-
     A                                      r row":"12","parent tab panel":"F03-
     A                                      63F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCRVCD","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCRVCD","designValue":"[SCRVC-
     A                                      D]","refField":"RVCD","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"-999.00"},"left":-
     A                                      "449px","cursor column":"26","top":-
     A                                      "330px","cursor row":"12","width":"-
     A                                      22px","css class 3":{"fieldName":"N-
     A                                      09 and N46","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"46 or 09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 4":{"fieldName":"46 or 09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"css class 5":{"fieldName":"N46-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "34","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"MCR-
     A                                      2387","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"87","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"5 messages","error-
     A                                       message id 2":"MC40444","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"91","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 3":"MC40544","error message -
     A                                      file 3":"FSMESG","error message lib-
     A                                      rary 3":"*LIBL","error condition 3"-
     A                                      :{"fieldName":"92","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 4":"MC40545","error message file -
     A                                      4":"FSMESG","error me')
     A                                  1  2HTML('ssage library 4":"*LIBL","err-
     A                                      or condition 4":{"fieldName":"93","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 5":"MC40547","erro-
     A                                      r message file 5":"FSMESG","error m-
     A                                      essage library 5":"*LIBL","error co-
     A                                      ndition 5":{"fieldName":"95","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"F0363F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant19","field type":"output field"-
     A                                      ,"value":"Date Entered             -
     A                                      :","css class":"constant","left":"5-
     A                                      47px","cursor column":"40","top":"3-
     A                                      30px","cursor row":"12","parent tab-
     A                                       panel":"F0363F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCEDAT","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCEDAT","designValue"-
     A                                      :"[SCEDAT]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''"},"css class"-
     A                                      :"output-field","left":"736px","cur-
     A                                      sor column":"67","top":"330px","cur-
     A                                      sor row":"12","width":"70px","text -
     A                                      align":"right","css class 2":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F0363F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant20","-
     A                                      field type":"output field","value":-
     A                                      "HCPCS/CPT4/CMG-Mod 1 & 2:","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"N97","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"281-
     A                                      px","cursor column":"2","top":"350p-
     A                                      x","cursor row":"13","parent tab pa-
     A                                      nel":"F0363F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant21",-
     A                                      "field type":"output field","value"-
     A                                      :"HCPCS/CPT4/DRG/CMG-Mod :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"97","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"281p-
     A                                      x","cursor column":"2","top":"350px-
     A                                      ","cursor row":"13","parent tab pan-
     A                                      el":"F0363F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCHCPC","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCHCPC","designValue"-
     A                                      :"[SCHCPC]","refField":"CPT4","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"463px","cursor column":"28"-
     A                                      ,"top":"350px","curso')
     A                                  1  2HTML('r row":"13","width":"36px","c-
     A                                      ss class 3":{"fieldName":"N09 and N-
     A                                      46","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"46 or 09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 4":{-
     A                                      "fieldName":"46 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 5":{"fieldName":"N46 and N16-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"set focus":{"fieldName":-
     A                                      "35","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"MCR-
     A                                      0503","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"78","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"5 messages","error-
     A                                       message id 2":"MCR2387","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"89","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 3":"MC40546","error message -
     A                                      file 3":"FSMESG","error message lib-
     A                                      rary 3":"*LIBL","error condition 3"-
     A                                      :{"fieldName":"94","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 4":"MC40547","error message file -
     A                                      4":"FSMESG","error message library -
     A                                      4":"*LIBL","error condition 4":{"fi-
     A                                      eldName":"95","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error message id 5":-
     A                                      "MC40549","error message file 5":"F-
     A                                      SMESG","error message library 5":"*-
     A                                      LIBL","error condition 5":{"fieldNa-
     A                                      me":"51","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"F0363F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant22","field type"-
     A                                      :"output field","value":"-","css cl-
     A                                      ass":"constant","left":"505px","cur-
     A                                      sor column":"34","top":"350px","cur-
     A                                      sor row":"13","parent tab panel":"F-
     A                                      0363F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPMOD","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCPMOD","designValue":"[SCP-
     A                                      MOD]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase","dataLength":"2"},"text -
     A                                      transform":"uppercase","left":"519p-
     A                                      x","cursor column":"36","top":"350p-
     A                                      x","cursor row":"13","width":"15px"-
     A                                      ,"css class 3":{"fiel')
     A                                  1  2HTML('dName":"N09 and N46","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"46 or 09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "46 or 09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"set focus"-
     A                                      :{"fieldName":"05","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"MCR2434","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"15","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","description":"Procedure Cod-
     A                                      e Modifier","parent tab panel":"F03-
     A                                      63F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant23","field ty-
     A                                      pe":"output field","value":"-","css-
     A                                       class":"constant","left":"540px","-
     A                                      cursor column":"39","top":"350px","-
     A                                      cursor row":"13","parent tab panel"-
     A                                      :"F0363F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCMOD2","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCMOD2","designValue":"[-
     A                                      SCMOD2]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase","dataLength":"2"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      54px","cursor column":"41","top":"3-
     A                                      50px","cursor row":"13","width":"15-
     A                                      px","css class 3":{"fieldName":"N09-
     A                                       and N46","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"46 or 09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 4":{"fieldName":"46 or 09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"set focus":{"fieldName":"24-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"error message id":"MCR243-
     A                                      4","error message file":"FSMESG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"88","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat"')
     A                                  1  2HTML(':"1 / 0"},"error messages":"1-
     A                                       message","description":"Procedure -
     A                                      Code Modifier","parent tab panel":"-
     A                                      F0363F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"constant24","field-
     A                                       type":"output field","value":"Desc-
     A                                      ription           :","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"370px","cursor row"-
     A                                      :"14","parent tab panel":"F0363F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCCDDS","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCCDDS","designValue":"[SCCDDS]","r-
     A                                      efField":"DS25","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"449px"-
     A                                      ,"cursor column":"26","top":"370px"-
     A                                      ,"cursor row":"14","width":"176px",-
     A                                      "css class 3":{"fieldName":"N09 and-
     A                                       N46","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"46 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 4"-
     A                                      :{"fieldName":"46 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"06","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"MCR0503","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"79","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0676","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"37 and N38 and N39 and N40"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"F0363F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 5":"profound-converted"},{"id-
     A                                      ":"constant25","field type":"output-
     A                                       field","value":"Service units     -
     A                                          :","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"390px","cursor row":"15","parent -
     A                                      tab panel":"F0363F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCUNTS-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCUNTS","desig-
     A                                      nValue":"[SCUNTS]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00","dataLength":"3"-
     A                                      ,"decPos":"0","numBla')
     A                                  1  2HTML('nkFill":"true"},"left":"449px-
     A                                      ","cursor column":"26","top":"390px-
     A                                      ","cursor row":"15","width":"22px",-
     A                                      "text align":"right","css class 3":-
     A                                      {"fieldName":"N09 and N46","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"46 or 09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 4":{"fieldName":-
     A                                      "46 or 09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"set focus"-
     A                                      :{"fieldName":"36","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"MCR0676","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"N37 and 38 and N39 and N40-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"1 message","par-
     A                                      ent tab panel":"F0363F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant26","field type":"output fiel-
     A                                      d","value":"Total charges         :-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"410-
     A                                      px","cursor row":"16","parent tab p-
     A                                      anel":"F0363F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCHRG","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCCHRG","designValu-
     A                                      e":"[SCCHRG]","refField":"A92","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00"}-
     A                                      ,"left":"449px","cursor column":"26-
     A                                      ","top":"410px","cursor row":"16","-
     A                                      width":"78px","css class 3":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 4"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"css cla-
     A                                      ss 5":"HI","error message id":"MCR0-
     A                                      556","error message file":"FSMESG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"80","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"4 messages","error -
     A                                      message id 2":"MC40116","error mess-
     A                                      age file 2":"FSMESG",')
     A                                  1  2HTML('"error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"58","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 3":"MCR06-
     A                                      76","error message file 3":"FSMESG"-
     A                                      ,"error message library 3":"*LIBL",-
     A                                      "error condition 3":{"fieldName":"N-
     A                                      37 and N38 and 39 and N40","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 4":"MC40011","error messa-
     A                                      ge file 4":"FSMESG","error message -
     A                                      library 4":"*LIBL","error condition-
     A                                       4":{"fieldName":"04","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"parent tab p-
     A                                      anel":"F0363F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"constant27"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Payment                  :","css-
     A                                       class":"constant","left":"561px","-
     A                                      cursor column":"42","top":"410px","-
     A                                      cursor row":"16","parent tab panel"-
     A                                      :"F0363F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCPAID","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCPAID","designValue":"[-
     A                                      SCPAID]","refField":"A92","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"lef-
     A                                      t":"750px","cursor column":"69","to-
     A                                      p":"410px","cursor row":"16","width-
     A                                      ":"78px","css class 3":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"error m-
     A                                      essage id":"MC40116","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"58","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"2 m-
     A                                      essages","error message id 2":"MCR0-
     A                                      676","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      N37 and N38 and N39 and 40","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"F0363F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"SCHMR-
     A                                      1","field type":"output field","val-
     A                                      ue":{"fieldName":"SCH')
     A                                  1  2HTML('MR1","designValue":"[SCHMR1]"-
     A                                      ,"refField":"DS10","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"430px","cu-
     A                                      rsor row":"17","parent tab panel":"-
     A                                      F0363F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant28","field-
     A                                       type":"output field","value":"amou-
     A                                      nt        :","css class":"constant"-
     A                                      ,"left":"358px","cursor column":"13-
     A                                      ","top":"430px","cursor row":"17","-
     A                                      parent tab panel":"F0363F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCMRA","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCMRA","-
     A                                      designValue":"[SCMRA]","refField":"-
     A                                      A92","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00"},"left":"470px","cursor co-
     A                                      lumn":"29","top":"430px","cursor ro-
     A                                      w":"17","width":"78px","css class 3-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"set focus":{"fieldName":"55"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"MC40116-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"58","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"MCR0676","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"37 and 38 and N39 a-
     A                                      nd N40","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"F0363F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"SCHNTW","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      HNTW","designValue":"[SCHNTW]","ref-
     A                                      Field":"DS10","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","visibility":{"fieldNa-
     A                                      me":"47","dataType":"')
     A                                  1  2HTML('expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"561px","cursor column"-
     A                                      :"42","top":"430px","cursor row":"1-
     A                                      7","parent tab panel":"F0363F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant29","field type":"outp-
     A                                      ut field","value":"amount        :"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"47","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"638px","cursor column":"53","to-
     A                                      p":"430px","cursor row":"17","paren-
     A                                      t tab panel":"F0363F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCNT-
     A                                      WK","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCNTWK","des-
     A                                      ignValue":"[SCNTWK]","refField":"A9-
     A                                      2","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00"},"visibility":{"fieldName":"-
     A                                      47","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"750px","curs-
     A                                      or column":"69","top":"430px","curs-
     A                                      or row":"17","width":"78px","css cl-
     A                                      ass 3":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 4":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"error message id":"MC40-
     A                                      116","error message file":"FSMESG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"58","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"2 messages","error -
     A                                      message id 2":"MCR0676","error mess-
     A                                      age file 2":"FSMESG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"N37 and 38 and 3-
     A                                      9 and N40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab panel":"F036-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"id":"SCHO11","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCHO11","designValue":"[SCHO11]","-
     A                                      refField":"DS10","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top"')
     A                                  1  2HTML(':"450px","cursor row":"18","p-
     A                                      arent tab panel":"F0363F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant30","field type":"output fi-
     A                                      eld","value":"amount        :","css-
     A                                       class":"constant","left":"358px","-
     A                                      cursor column":"13","top":"450px","-
     A                                      cursor row":"18","parent tab panel"-
     A                                      :"F0363F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCOTHR","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCOTHR","designValue":"[-
     A                                      SCOTHR]","refField":"A92","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"lef-
     A                                      t":"470px","cursor column":"29","to-
     A                                      p":"450px","cursor row":"18","width-
     A                                      ":"78px","css class 3":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"error m-
     A                                      essage id":"MC40116","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"58","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"2 m-
     A                                      essages","error message id 2":"MCR0-
     A                                      676","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      N37 and N38 and 39 and 40","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"F0363F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"SCHO12-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCHO12","designVal-
     A                                      ue":"[SCHO12]","refField":"DS10","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"561px","cursor column":"42","t-
     A                                      op":"450px","cursor row":"18","pare-
     A                                      nt tab panel":"F0363F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant31","field type":"output field-
     A                                      ","value":"type code     :","css cl-
     A                                      ass":"constant","left":"638px","cur-
     A                                      sor column":"53","top":"450px","cur-
     A                                      sor row":"18","parent tab panel":"F-
     A                                      0363F_SCR01_MainTabPa')
     A                                  1  2HTML('nel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCOT1C","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCOT1C"-
     A                                      ,"designValue":"[SCOT1C]","refField-
     A                                      ":"CODE3","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"750px","curs-
     A                                      or column":"69","top":"450px","curs-
     A                                      or row":"18","width":"22px","css cl-
     A                                      ass 3":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 4":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"48","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"error message id":"MC-
     A                                      40072","error message file":"FSMESG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"81",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"MCR0513","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"82","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"F0363F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"SCHO21",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCHO21","designValue-
     A                                      ":"[SCHO21]","refField":"DS10","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"470px","cursor row":"19","parent -
     A                                      tab panel":"F0363F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt32","field type":"output field","-
     A                                      value":"amount        :","css class-
     A                                      ":"constant","left":"358px","cursor-
     A                                       column":"13","top":"470px","cursor-
     A                                       row":"19","parent tab panel":"F036-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCOTH2","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCOTH2","designValue":"[SCOTH2-
     A                                      ]","refField":"A92","dataType":"ref-
     A                                      erence","formatting":')
     A                                  1  2HTML('"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00"},"left":"470px","cursor co-
     A                                      lumn":"29","top":"470px","cursor ro-
     A                                      w":"19","width":"78px","css class 3-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 4":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"set focus":{"fieldName":"49"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"MC40116-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"58","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"MCR0676","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"37 and N38 and N39 -
     A                                      and 40","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"F0363F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"SCHO22","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      HO22","designValue":"[SCHO22]","ref-
     A                                      Field":"DS10","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"561px","cursor-
     A                                       column":"42","top":"470px","cursor-
     A                                       row":"19","parent tab panel":"F036-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant33","field typ-
     A                                      e":"output field","value":"type cod-
     A                                      e     :","css class":"constant","le-
     A                                      ft":"638px","cursor column":"53","t-
     A                                      op":"470px","cursor row":"19","pare-
     A                                      nt tab panel":"F0363F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCO-
     A                                      T2C","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCOT2C","de-
     A                                      signValue":"[SCOT2C]","refField":"C-
     A                                      ODE3","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"750px","cursor c-
     A                                      olumn":"69","top":"470px","cursor r-
     A                                      ow":"19","width":"22px","css class -
     A                                      3":{"fieldName":"N09"')
     A                                  1  2HTML(',"dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"set foc-
     A                                      us":{"fieldName":"50","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message id":"MC40072","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"83","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"MC-
     A                                      R0513","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"84","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"F0363F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant35","field type":"o-
     A                                      utput field","value":"Rule         -
     A                                                  :","css class":"constan-
     A                                      t","visibility":{"fieldName":"56","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"280px","cursor co-
     A                                      lumn":"65","top":"490px","cursor ro-
     A                                      w":"21","parent tab panel":"F0363F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      ","width":"150px"},{"id":"SCRULE","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCRULE","designValue"-
     A                                      :"[SCRULE]","refField":"A90","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00"},"-
     A                                      css class":"output-field","visibili-
     A                                      ty":{"fieldName":"56","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"470px","cursor column":"71","-
     A                                      top":"490px","cursor row":"21","wid-
     A                                      th":"63px","text align":"left","par-
     A                                      ent tab panel":"F0363F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant40","field type":"output fiel-
     A                                      d","value":" ","css class":"constan-
     A                                      t","visibility":{"fieldName":"09 an-
     A                                      d 43 and 96","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"281-
     A                                      px","cursor column":"2","top":"530p-
     A                                      x","cursor row":"22","css class 2":-
     A                                      "BLU","parent tab panel":"F0363F_SC-
     A                                      R01_MainTabPanel","pa')
     A                                  1  2HTML('rent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t39","field type":"output field","v-
     A                                      alue":" ","css class":"constant","v-
     A                                      isibility":{"fieldName":"09 and 43 -
     A                                      and N96","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"281px",-
     A                                      "cursor column":"2","top":"530px","-
     A                                      cursor row":"22","css class 2":"BLU-
     A                                      ","parent tab panel":"F0363F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant38","field type":"outpu-
     A                                      t field","value":" ","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "N09 and N43","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      1px","cursor column":"2","top":"530-
     A                                      px","cursor row":"22","css class 2"-
     A                                      :"BLU","parent tab panel":"F0363F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant37","field type":"-
     A                                      output field","value":" ","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"N09 and 43 and 96","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"530px","cursor row":"22","c-
     A                                      ss class 2":"BLU","parent tab panel-
     A                                      ":"F0363F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant36","fi-
     A                                      eld type":"output field","value":" -
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"N09 and 43 and N96-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"281px","cursor-
     A                                       column":"2","top":"530px","cursor -
     A                                      row":"22","css class 2":"BLU","pare-
     A                                      nt tab panel":"F0363F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant41","field type":"output field-
     A                                      ","value":" ","css class":"constant-
     A                                      ","visibility":{"fieldName":"N09 an-
     A                                      d 43 and N96","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      1px","cursor column":"2","top":"550-
     A                                      px","cursor row":"23","css class 2"-
     A                                      :"BLU","parent tab panel":"F0363F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant43","field type":"-
     A                                      output field","value":" ","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"N09 and N43","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"550px","cursor row":"23","css cla-
     A                                      ss 2":"BLU","parent tab panel":"F03-
     A                                      63F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant44","field ty-
     A                                      pe":"output field","value":" ","css-
     A                                       class":"constant","v')
     A                                  1  2HTML('isibility":{"fieldName":"09 a-
     A                                      nd N43","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"281px","-
     A                                      cursor column":"2","top":"550px","c-
     A                                      ursor row":"23","css class 2":"BLU"-
     A                                      ,"parent tab panel":"F0363F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant42","field type":"output-
     A                                       field","value":" ","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      N09 and 43 and 96","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"550px","cursor row":"23","css cla-
     A                                      ss 2":"BLU","parent tab panel":"F03-
     A                                      63F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant45","field ty-
     A                                      pe":"output field","value":"       -
     A                                            ","css class":"constant","vis-
     A                                      ibility":{"fieldName":"70","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"570px","cursor row":"24",-
     A                                      "parent tab panel":"F0363F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"btnSubmit","field type":"button",-
     A                                      "value":"Enter","shortcut key":"Ent-
     A                                      er","left":"14px","top":"150px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF0-
     A                                      1","field type":"button","visibilit-
     A                                      y":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"v-
     A                                      alue":"Repeat","shortcut key":"F1",-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF02","-
     A                                      field type":"button","visibility":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"value-
     A                                      ":"Process","shortcut key":"F2","le-
     A                                      ft":"14px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF05","fie-
     A                                      ld type":"button","visibility":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"value":"-
     A                                      Refresh","shortcut key":"F5","left"-
     A                                      :"14px","top":"249px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF07","field -
     A                                      type":"button","visibility":{"field-
     A                                      Name":"N09 and 43 and N96 or N09 an-
     A                                      d 43 and 96 or N09 and N43 or 09 an-
     A                                      d 43 and N96 or 09 and 43 and 96 or-
     A                                       09 and N43","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"value":"He-
     A                                      ader Info","shortcut')
     A                                  1  2HTML(' key":"F7","left":"14px","top-
     A                                      ":"282px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF09","field type":"butto-
     A                                      n","visibility":{"fieldName":"43 an-
     A                                      d N96","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"value":"Code inf-
     A                                      o","shortcut key":"F9","left":"14px-
     A                                      ","top":"315px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF10","field type":-
     A                                      "button","visibility":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":"Search","-
     A                                      shortcut key":"F10","left":"14px","-
     A                                      top":"348px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF11","field type":"bu-
     A                                      tton","visibility":{"fieldName":"43-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"value":"EOB/Notes","s-
     A                                      hortcut key":"F11","left":"14px","t-
     A                                      op":"381px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","visibility":{"fieldName":"09 -
     A                                      and 43 and N96 or 09 and 43 and 96 -
     A                                      or N09 and 43 and N96 or N09 and 43-
     A                                       and 96 or N09 and N43 or 09 and N4-
     A                                      3","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"Cancel","sho-
     A                                      rtcut key":"F12","left":"14px","top-
     A                                      ":"414px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF14","field type":"butto-
     A                                      n","visibility":{"fieldName":"09 an-
     A                                      d 43 and N96 or 09 and 43 and 96 or-
     A                                       N09 and 43 and N96 or N09 and 43 a-
     A                                      nd 96 or N09 and N43 or 09 and N43"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":"DART","shortcu-
     A                                      t key":"F14","left":"14px","top":"4-
     A                                      47px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF15","field type":"button","-
     A                                      visibility":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"value":"Display lines","sho-
     A                                      rtcut key":"F15","left":"14px","top-
     A                                      ":"480px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"constant42_copy","field type-
     A                                      ":"output field","css class":"const-
     A                                      ant","value":"EOB codes:","cursor r-
     A                                      ow":"21","cursor column":"37","left-
     A                                      ":"280px","top":"510px","css class -
     A                                      2":"profound-converted","visibility-
     A                                      ":{"fieldName":"59 or 09","dataType-
     A                                      ":"expression","forma')
     A                                  1  2HTML('tting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"parent tab p-
     A                                      anel":"F0363F_SCR01_MainTabPanel","-
     A                                      parent tab":"0"},{"id":"SCEOB1","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"output-field","value":{"fieldNam-
     A                                      e":"SCEOB1","trimLeading":"true","t-
     A                                      rimTrailing":"false","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "textTransform":"uppercase","design-
     A                                      Value":"[SCEOB1]","refField":"CODE3-
     A                                      ","keywords":[]},"cursor row":"21",-
     A                                      "cursor column":"48","left":"360px"-
     A                                      ,"top":"510px","width":"46PX","css -
     A                                      class 2":"profound-converted","visi-
     A                                      bility":{"fieldName":"59 or 09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"parent tab panel":"F0363F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      "},{"id":"SCEOB2","field type":"out-
     A                                      put field","css class":"output-fiel-
     A                                      d","value":{"fieldName":"SCEOB2","t-
     A                                      rimLeading":"true","trimTrailing":"-
     A                                      false","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"reference"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"uppercase","designValue":"[SCEOB-
     A                                      2]","refField":"CODE3","keywords":[-
     A                                      ]},"cursor row":"21","cursor column-
     A                                      ":"52","left":"410px","top":"510px"-
     A                                      ,"width":"46PX","css class 2":"prof-
     A                                      ound-converted","visibility":{"fiel-
     A                                      dName":"59 or 09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"paren-
     A                                      t tab panel":"F0363F_SCR01_MainTabP-
     A                                      anel","parent tab":"0"},{"id":"SCEO-
     A                                      B3","field type":"output field","cs-
     A                                      s class":"output-field","value":{"f-
     A                                      ieldName":"SCEOB3","trimLeading":"t-
     A                                      rue","trimTrailing":"false","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","textTransform":"uppercase",-
     A                                      "designValue":"[SCEOB3]","refField"-
     A                                      :"CODE3","keywords":[]},"cursor row-
     A                                      ":"21","cursor column":"56","left":-
     A                                      "460px","top":"510px","width":"46PX-
     A                                      ","css class 2":"profound-converted-
     A                                      ","visibility":{"fieldName":"59 or -
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"parent tab panel":"-
     A                                      F0363F_SCR01_MainTabPanel","parent -
     A                                      tab":"0"},{"id":"SCEOB4","field typ-
     A                                      e":"output field","css class":"outp-
     A                                      ut-field","value":{"fieldName":"SCE-
     A                                      OB4","trimLeading":"true","trimTrai-
     A                                      ling":"false","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"ref-
     A                                      erence","formatting":"Text","textTr-
     A                                      ansform":"uppercase","designValue":-
     A                                      "[SCEOB4]","refField":"CODE3","keyw-
     A                                      ords":[]},"cursor row":"21","cursor-
     A                                       column":"60","left":"510px","top":-
     A                                      "510px","width":"46PX","css class 2-
     A                                      ":"profound-converted","visibility"-
     A                                      :{"fieldName":"59 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visi')
     A                                  1  2HTML('ble / hidden"},"parent tab pa-
     A                                      nel":"F0363F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0"},{"id":"SCEOB5","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"SCEOB5","dataLength":"6","trimLe-
     A                                      ading":"true","trimTrailing":"false-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCEOB5]"},"curs-
     A                                      or row":"21","cursor column":"60","-
     A                                      left":"560px","top":"510px","width"-
     A                                      :"46PX","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      59 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"parent tab pa-
     A                                      nel":"F0363F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0"},{"id":"SCEOB6","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"SCEOB6","dataLength":"6","trimLe-
     A                                      ading":"true","trimTrailing":"false-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCEOB6]"},"curs-
     A                                      or row":"21","cursor column":"60","-
     A                                      left":"610px","top":"510px","width"-
     A                                      :"46PX","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      59 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"parent tab pa-
     A                                      nel":"F0363F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0"},{"id":"SCEOB7","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"SCEOB7","dataLength":"6","trimLe-
     A                                      ading":"true","trimTrailing":"false-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCEOB7]"},"curs-
     A                                      or row":"21","cursor column":"60","-
     A                                      left":"660px","top":"510px","width"-
     A                                      :"46PX","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      59 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"parent tab pa-
     A                                      nel":"F0363F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0"},{"id":"SCEOB8","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"SCEOB8","dataLength":"6","trimLe-
     A                                      ading":"true","trimTrailing":"false-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCEOB8]"},"curs-
     A                                      or row":"21","cursor column":"60","-
     A                                      left":"710px","top":"510px","width"-
     A                                      :"46PX","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      59 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"parent tab pa-
     A                                      nel":"F0363F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0"},{"id":"SCEOB9","fie-
     A                                      ld type":"output fiel')
     A                                  1  2HTML('d","css class":"output-field"-
     A                                      ,"value":{"fieldName":"SCEOB9","dat-
     A                                      aLength":"6","trimLeading":"true","-
     A                                      trimTrailing":"false","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"uppercase","designValu-
     A                                      e":"[SCEOB9]"},"cursor row":"21","c-
     A                                      ursor column":"60","left":"760px","-
     A                                      top":"510px","width":"46PX","css cl-
     A                                      ass 2":"profound-converted","visibi-
     A                                      lity":{"fieldName":"59 or 09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"parent tab panel":"F0363F_SC-
     A                                      R01_MainTabPanel","parent tab":"0"}-
     A                                      ,{"id":"SCEOB10","field type":"outp-
     A                                      ut field","css class":"output-field-
     A                                      ","value":{"fieldName":"SCEOB10","d-
     A                                      ataLength":"6","trimLeading":"true"-
     A                                      ,"trimTrailing":"false","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"uppercase","designVa-
     A                                      lue":"[SCEOB10]"},"cursor row":"21"-
     A                                      ,"cursor column":"60","left":"810px-
     A                                      ","top":"510px","width":"46PX","css-
     A                                       class 2":"profound-converted","vis-
     A                                      ibility":{"fieldName":"59 or 09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"parent tab panel":"F0363F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0"},{"id":"SCEOB11","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":{"fieldName":"SCEOB11"-
     A                                      ,"dataLength":"6","trimLeading":"tr-
     A                                      ue","trimTrailing":"false","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"uppercase","desig-
     A                                      nValue":"[SCEOB11]"},"cursor row":"-
     A                                      21","cursor column":"60","left":"86-
     A                                      0px","top":"510px","width":"46PX","-
     A                                      css class 2":"profound-converted","-
     A                                      visibility":{"fieldName":"59 or 09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"parent tab panel":"F03-
     A                                      63F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0"},{"id":"SCEOB12","field type"-
     A                                      :"output field","css class":"output-
     A                                      -field","value":{"fieldName":"SCEOB-
     A                                      12","dataLength":"6","trimLeading":-
     A                                      "true","trimTrailing":"false","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"uppercase","de-
     A                                      signValue":"[SCEOB12]"},"cursor row-
     A                                      ":"21","cursor column":"60","left":-
     A                                      "910px","top":"510px","width":"46PX-
     A                                      ","css class 2":"profound-converted-
     A                                      ","visibility":{"fieldName":"59 or -
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"parent tab panel":"-
     A                                      F0363F_SCR01_MainTabPanel","parent -
     A                                      tab":"0"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB10        6A  H
     A            SCEOB11        6A  H
     A            SCEOB12        6A  H
     A            SCEOB5         6A  H
     A            SCEOB6         6A  H
     A            SCEOB7         6A  H
     A            SCEOB8         6A  H
     A            SCEOB9         6A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         74A  H
     A            SCMOD2         2A  H
     A            SCPMOD         2A  H
     A            SCPOS          2S 0H
     A            SCUNTS         3S 0H
     A            SCZIPB         3A  H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCDDS    R        H      REFFLD(DS25)
     A            SCCHRG    R        H      REFFLD(A92)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCSCD    R        H      REFFLD(CODE3)
     A            SCCSDS    R        H      REFFLD(DS25)
     A            SCEDAT    R        H      REFFLD(DT8)
     A            SCEOB#    R        H      REFFLD(EOB#)
     A            SCEOB1    R        H      REFFLD(CODE3)
     A            SCEOB2    R        H      REFFLD(CODE3)
     A            SCEOB3    R        H      REFFLD(CODE3)
     A            SCEOB4    R        H      REFFLD(CODE3)
     A            SCFDAT    R        H      REFFLD(DT8)
     A            SCHCPC    R        H      REFFLD(CPT4)
     A            SCHMR1    R        H      REFFLD(DS10)
     A            SCHNTW    R        H      REFFLD(DS10)
     A            SCHO11    R        H      REFFLD(DS10)
     A            SCHO12    R        H      REFFLD(DS10)
     A            SCHO21    R        H      REFFLD(DS10)
     A            SCHO22    R        H      REFFLD(DS10)
     A            SCLIN#    R        H      REFFLD(A90)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A92)
     A            SCNTWK    R        H      REFFLD(A92)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOT1C    R        H      REFFLD(CODE3)
     A            SCOT2C    R        H      REFFLD(CODE3)
     A            SCOTH2    R        H      REFFLD(A92)
     A            SCOTHR    R        H      REFFLD(A92)
     A            SCPAID    R        H      REFFLD(A92)
     A            SCPODS    R        H      REFFLD(DS30)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRULE    R        H      REFFLD(A90)
     A            SCRVCD    R        H      REFFLD(RVCD)
     A            SCSEQ#    R        H      REFFLD(SEQ#)
     A            SCTDAT    R        H      REFFLD(DT8)
     A            SCTOTC    R        H      REFFLD(A92)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C5    SCEDIC7    MCR05-
     A                                      03C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     17RERRMSGID  5    C5    SCE-
     A                                      DIC7    MCR0999C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     18')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN1-
     A                                      7","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-10"},"items":[{"i-
     A                                      d":"SCR02_HREC","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HREC","designValu-
     A                                      e":"[HREC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCR02","field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      m Dialog","text align":"center","le-
     A                                      ft":"5px","top":"5px","height":"370-
     A                                      px","width":"324px","z index":"8","-
     A                                      locked in place":"true"},{"id":"con-
     A                                      stant46","field type":"output field-
     A                                      ","value":"****** ERROR ******","cs-
     A                                      s class":"constant","left":"85px","-
     A                                      cursor column":"10","top":"65px","c-
     A                                      ursor row":"1","css class 2":"profo-
     A                                      und-converted"},{"id":"constant47",-
     A                                      "field type":"output field","value"-
     A                                      :"You have marked the data submissi-
     A                                      on","css class":"constant","left":"-
     A                                      29px","cursor column":"2","top":"85-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt48","field type":"output field","-
     A                                      value":"flag.  The Date of Service -
     A                                      is a","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      105px","cursor row":"3","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant49","field type":"output field-
     A                                      ","value":"future date and disquali-
     A                                      fies this","css class":"constant","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"125px","cursor row":"4","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant50","field')
     A                                  1  2HTML(' type":"output field","value"-
     A                                      :"claim for data submission.  Pleas-
     A                                      e","css class":"constant","left":"2-
     A                                      9px","cursor column":"2","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt51","field type":"output field","-
     A                                      value":"correct the flag.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant52","fiel-
     A                                      d type":"output field","value":"Eli-
     A                                      gible for Data Submission:","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"205px","curso-
     A                                      r row":"8","css class 2":"profound--
     A                                      converted"},{"id":"SCEDI","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCEDI","designValue":"[SC-
     A                                      EDI]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"239px","cursor column":"32","top"-
     A                                      :"205px","cursor row":"8","width":"-
     A                                      8px","css class 3":"HI","set focus"-
     A                                      :{"fieldName":"17 or 18","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"17","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0999","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"18","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"css class 4":"profound-co-
     A                                      nverted"},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"330px","width":"80px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF12","field type":"butt-
     A                                      on","value":"Cancel","shortcut key"-
     A                                      :"F12","left":"104px","top":"330px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCEDI     R        H      REFFLD(FLAG)
     A          R SCR03
     A  08 10 11
     A  12 13 21
     A  22 23 25                            CA01(08 'Response Indicator *IN08')
     A  26 27 19
     A  20                                  CA02(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(12 'Response Indicator *IN12')
     A                                      SETOF(13 'Response Indicator *IN13')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC26   RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C6    SCCRDTC7    MC40-
     A                                      144C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     19 26RERRMSGID  5    C6   -
     A                                       SCCRDTC7    MCR0500C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     19 21RERR-
     A                                      MSGID  5    C6    SCCRDTC7    MCR05-
     A                                      56C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     19 10RERRMSGID  5    C6    -
     A                                      SCCRDTC7    MC40056C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     19 22RERRM-
     A                                      SGID  5    C6    SCCRDTC7    MC4014-
     A                                      5C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     19 23RERRMSGID  5    C6    S-
     A                                      CCRDTC7    MCR2397C6    FSMESGC5   -
     A                                       *LIBLC0    E1    6     19 25RERRMS-
     A                                      GID  5    C6    SCRRDTC7    MC40144-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      6     20 26RERRMSGID  5    C6    SC-
     A                                      RRDTC7    MCR0500C6    FSMESGC5    -
     A                                      *LIBLC0    E1    6     20 21RERRMSG-
     A                                      ID  5    C6    SCRRDTC7    MCR0556C-
     A                                      6    FSMESGC5    *LIBLC0    E1    6-
     A                                           20 10RERRMSGID  5    C6    SCR-
     A                                      RDTC7    MC40056C6    FSMESGC5    *-
     A                                      LIBLC0    E1    6     20 22RERRMSGI-
     A                                      D  5    C6    SCRRDTC7    MC40145C6-
     A                                          FSMESGC5    *LIBLC0    E1    6 -
     A                                          20 23RERRMSGID  5    C6    SCRR-
     A                                      DTC7    MCR2397C6    FSMESGC5    *L-
     A                                      IBLC0    E1    6     20 25RERRMSGID-
     A                                        5    C6    SCCSDTC7    MCR0500C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         19 21RERRMSGID  5    C6    SCCSD-
     A                                      TC7    MC40202C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     19 08RERRMSGID -
     A                                       5    C6    SCCSDTC7    MC40056C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        19 13RERRMSGID  5    C6    SCCSDT-
     A                                      C7    MC40145C6    FSMESGC5    *LIB-
     A                                      LC0    E1    6     19 12RERRMSGID  -
     A                                      5    C6    SCCSDTC7    MCR2397C6   -
     A                                       FSMESGC5    *LIBLC0    E1    6    -
     A                                       19 11RERRMSGID  5    C6    SCCSDTC-
     A                                      7    MCR0500C6    FSMESGC5    *LIBL-
     A                                      C0    E1    6     19 27RERRMSGID  5-
     A                                          C6    SCRSDTC7    MCR0500C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      20 21RERRMSGID  5    C6    SCRSDTC7-
     A                                          MC40202C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     20 08RERRMSGID  5 -
     A                                         C6    SCRSDTC7    MC40056C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     2-
     A                                      0 13RERRMSGID  5    C6    SCRSDTC7 -
     A                                         MC40145C6    FSMESGC5    *LIBLC0-
     A                                          E1    6     20 12RERRMSGID  5  -
     A                                        C6    SCRSDTC7    MCR2397C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     20-
     A                                       11RERRMSGID  5    C6    SCRSDTC7  -
     A                                        MCR0500C6    FSMESGC5    *LIBLC0 -
     A                                         E1    6     20 27')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN0-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN10",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 3":{"fieldName":"*IN11","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 4":{"fieldName":"*IN12","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 5":{"fieldName":"*IN13","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 6-
     A                                      ":{"fieldName":"*IN21","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 7":{-
     A                                      "fieldName":"*IN22","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 8":{"fi-
     A                                      eldName":"*IN23","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 9":{"field-
     A                                      Name":"*IN25","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 10":{"fieldNa-
     A                                      me":"*IN26","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 11":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-10"},"i-
     A                                      tems":[{"id":"SCR03_HREC","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"HREC","-
     A                                      designValue":"[HREC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCR03_HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR03"-
     A                                      ,"field type":"panel","panel style"-
     A                                      :"Transform Dialog","text align":"c-
     A                                      enter","left":"5px","top":"5px","he-
     A                                      ight":"370px","width"')
     A                                  1  2HTML(':"324px","z index":"8","locke-
     A                                      d in place":"true"},{"id":"constant-
     A                                      53","field type":"output field","va-
     A                                      lue":"****** ERROR ******","css cla-
     A                                      ss":"constant","left":"85px","curso-
     A                                      r column":"10","top":"65px","cursor-
     A                                       row":"1","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant58","fiel-
     A                                      d type":"output field","value":"Dat-
     A                                      e Recon rcvd/sent must be greater",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "85px","cursor row":"2","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant54","field type":"output field-
     A                                      ","value":"Date Bill rcvd/sent must-
     A                                       be greater","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"19","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"29px","cursor colum-
     A                                      n":"2","top":"85px","cursor row":"2-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant59","field type":-
     A                                      "output field","value":"than or equ-
     A                                      al to \"To date of Service\".","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      9px","cursor column":"2","top":"105-
     A                                      px","cursor row":"3","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt55","field type":"output field","-
     A                                      value":"than or equal to \"To date -
     A                                      of Service\".","css class":"constan-
     A                                      t","visibility":{"fieldName":"19","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"29px","cursor col-
     A                                      umn":"2","top":"105px","cursor row"-
     A                                      :"3","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant60","field typ-
     A                                      e":"output field","value":"Date rec-
     A                                      on rcvd by carrier: ","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"20","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"29px","cur-
     A                                      sor column":"2","top":"145px","curs-
     A                                      or row":"5","css class 2":"profound-
     A                                      -converted"},{"id":"constant56","fi-
     A                                      eld type":"output field","value":"D-
     A                                      ate bill rcvd by carrier: ","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"19","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"29px-
     A                                      ","cursor column":"2","top":"145px"-
     A                                      ,"cursor row":"5","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCRDT","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCCRDT","de-
     A                                      signValue":"[SCCRDT]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units"')
     A                                  1  2HTML(':"","negNum":"-999.00","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"visibility":{"fieldName":"1-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"225px","curso-
     A                                      r column":"30","top":"145px","curso-
     A                                      r row":"5","width":"71px","css clas-
     A                                      s 3":{"fieldName":"19","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"err-
     A                                      or message id":"MC40144","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"19 and 26","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"6 messages","error message -
     A                                      id 2":"MCR0500","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"19 and 21","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 3":"MCR0556","error message fi-
     A                                      le 3":"FSMESG","error message libra-
     A                                      ry 3":"*LIBL","error condition 3":{-
     A                                      "fieldName":"19 and 10","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 4":"MC40056","error message -
     A                                      file 4":"FSMESG","error message lib-
     A                                      rary 4":"*LIBL","error condition 4"-
     A                                      :{"fieldName":"19 and 22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 5":"MC40145","error messag-
     A                                      e file 5":"FSMESG","error message l-
     A                                      ibrary 5":"*LIBL","error condition -
     A                                      5":{"fieldName":"19 and 23","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 6":"MCR2397","error mess-
     A                                      age file 6":"FSMESG","error message-
     A                                       library 6":"*LIBL","error conditio-
     A                                      n 6":{"fieldName":"19 and 25","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"SCRRDT","field type":"date field-
     A                                      ","css class":"input","css class 2"-
     A                                      :"date-field","value":{"fieldName":-
     A                                      "SCRRDT","designValue":"[SCRRDT]","-
     A                                      refField":"DT8","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''","dateFormat":"m/d/Y"},"-
     A                                      visibility":{"fieldName":"20","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"254px","cursor column-
     A                                      ":"31","top":"145px","cursor row":"-
     A                                      5","width":"71px","css class 3":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"error messa-
     A                                      ge id":"MC40144","error message fil-
     A                                      e":"FSMESG","error me')
     A                                  1  2HTML('ssage library":"*LIBL","error-
     A                                       condition":{"fieldName":"20 and 26-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"6 messages","er-
     A                                      ror message id 2":"MCR0500","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"20 and 21","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 3":"MCR0556","erro-
     A                                      r message file 3":"FSMESG","error m-
     A                                      essage library 3":"*LIBL","error co-
     A                                      ndition 3":{"fieldName":"20 and 10"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 4":"MC40056","er-
     A                                      ror message file 4":"FSMESG","error-
     A                                       message library 4":"*LIBL","error -
     A                                      condition 4":{"fieldName":"20 and 2-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 5":"MC40145","-
     A                                      error message file 5":"FSMESG","err-
     A                                      or message library 5":"*LIBL","erro-
     A                                      r condition 5":{"fieldName":"20 and-
     A                                       23","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 6":"MCR2397"-
     A                                      ,"error message file 6":"FSMESG","e-
     A                                      rror message library 6":"*LIBL","er-
     A                                      ror condition 6":{"fieldName":"20 a-
     A                                      nd 25","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"css class 4":"profound-conv-
     A                                      erted"},{"id":"constant57","field t-
     A                                      ype":"output field","value":"Date b-
     A                                      ill sent to carrier: ","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"19","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"29px","cu-
     A                                      rsor column":"2","top":"185px","cur-
     A                                      sor row":"7","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant61","f-
     A                                      ield type":"output field","value":"-
     A                                      Date recon sent to carrier:","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"20","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"29p-
     A                                      x","cursor column":"2","top":"185px-
     A                                      ","cursor row":"7","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCCSDT",-
     A                                      "field type":"date field","css clas-
     A                                      s":"input","css class 2":"date-fiel-
     A                                      d","value":{"fieldName":"SCCSDT","d-
     A                                      esignValue":"[SCCSDT]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","edtWrd":"''  /  /    ''"-
     A                                      ,"dateFormat":"m/d/Y"},"visibility"-
     A                                      :{"fieldName":"19","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"225px","cursor column":"30","top-
     A                                      ":"185px","cursor row":"7","width":-
     A                                      "71px","css class 3":{"fieldName":"-
     A                                      19","dataType":"expre')
     A                                  1  2HTML('ssion","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"er-
     A                                      ror message id":"MCR0500","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"19 and 21","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"6 messages","error message-
     A                                       id 2":"MC40202","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"19 and 08","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 3":"MC40056","error message f-
     A                                      ile 3":"FSMESG","error message libr-
     A                                      ary 3":"*LIBL","error condition 3":-
     A                                      {"fieldName":"19 and 13","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 4":"MC40145","error message-
     A                                       file 4":"FSMESG","error message li-
     A                                      brary 4":"*LIBL","error condition 4-
     A                                      ":{"fieldName":"19 and 12","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 5":"MCR2397","error messa-
     A                                      ge file 5":"FSMESG","error message -
     A                                      library 5":"*LIBL","error condition-
     A                                       5":{"fieldName":"19 and 11","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 6":"MCR0500","error mes-
     A                                      sage file 6":"FSMESG","error messag-
     A                                      e library 6":"*LIBL","error conditi-
     A                                      on 6":{"fieldName":"19 and 27","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"SCRSDT","field type":"date fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"date-field","value":{"fieldName"-
     A                                      :"SCRSDT","designValue":"[SCRSDT]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "visibility":{"fieldName":"20","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"254px","cursor colum-
     A                                      n":"31","top":"185px","cursor row":-
     A                                      "7","width":"71px","css class 3":{"-
     A                                      fieldName":"20","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"error mess-
     A                                      age id":"MCR0500","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"20 and 21","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "6 messages","error message id 2":"-
     A                                      MC40202","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"20 and 08","dataT')
     A                                  1  2HTML('ype":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 3":"MC40056","err-
     A                                      or message file 3":"FSMESG","error -
     A                                      message library 3":"*LIBL","error c-
     A                                      ondition 3":{"fieldName":"20 and 13-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 4":"MC40145","e-
     A                                      rror message file 4":"FSMESG","erro-
     A                                      r message library 4":"*LIBL","error-
     A                                       condition 4":{"fieldName":"20 and -
     A                                      12","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 5":"MCR2397",-
     A                                      "error message file 5":"FSMESG","er-
     A                                      ror message library 5":"*LIBL","err-
     A                                      or condition 5":{"fieldName":"20 an-
     A                                      d 11","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error message id 6":"MCR0500-
     A                                      ","error message file 6":"FSMESG","-
     A                                      error message library 6":"*LIBL","e-
     A                                      rror condition 6":{"fieldName":"20 -
     A                                      and 27","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"css class 4":"profound-con-
     A                                      verted"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"330px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field type":"butto-
     A                                      n","value":"Cancel","shortcut key":-
     A                                      "F12","left":"104px","top":"330px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCCRDT    R        H      REFFLD(DT8)
     A            SCCSDT    R        H      REFFLD(DT8)
     A            SCRRDT    R        H      REFFLD(DT8)
     A            SCRSDT    R        H      REFFLD(DT8)
     A          R WDW01
     A  44 46 71
     A  72 73 76
     A  77 79 45                            CA01(44 'Response Indicator *IN44')
     A  57 61 62
     A  63 64 65
     A  67 41 74                            CA02(46 'Response Indicator *IN46')
     A  75 97                               CA03(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                  1  2HTML('QPUIREC30   ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    17 RERRMSGID  5    C5   -
     A                                       SCPCFC7    MCR1758C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     71RERRMSGI-
     A                                      D  5    C5    SCPCFC7    MCR0759C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         73RERRMSGID  5    C5    SCDRIC7 -
     A                                         MCR1758C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     71RERRMSGID  5    C-
     A                                      5    SCDRIC7    MCR0759C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     45RERR-
     A                                      MSGID  5    C5    SCAPCC7    MCR175-
     A                                      8C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     71RERRMSGID  5    C5    SCAP-
     A                                      CC7    MCR0759C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     62RERRMSGID  5 -
     A                                         C5    SCRVUC7    MCR1758C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     71-
     A                                      RERRMSGID  5    C5    SCRVUC7    MC-
     A                                      R0759C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     72RERRMSGID  5    C5    -
     A                                      SCRCFC7    MCR1758C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     44RERRMSGID-
     A                                        5    C5    SCRCFC7    MCR0759C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        46RERRMSGID  5    C5    SCSCFC7  -
     A                                        MCR1758C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     71RERRMSGID  5    C5-
     A                                          SCSCFC7    MCR0759C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     72RERRM-
     A                                      SGID  5    C5    SCIMPC7    MCR1758-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     71RERRMSGID  5    C5    SCIMP-
     A                                      C7    MCR0759C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     61RERRMSGID  5  -
     A                                        C5    SCLABC7    MCR1758C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     71R-
     A                                      ERRMSGID  5    C5    SCLABC7    MCR-
     A                                      0759C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     72RERRMSG    2    C5    S-
     A                                      CHHFC28   No Home Health Record Fou-
     A                                      nd.E1    3     75RERRMSGID  5    C5-
     A                                          SCHHFC7    MCR1758C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     71RERRM-
     A                                      SGID  5    C5    SCHHFC7    MCR0759-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     74RERRMSGID  5    C5    SCPPS-
     A                                      C7    MCR1758C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     71RERRMSGID  5  -
     A                                        C5    SCPPSC7    MCR0759C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     63R-
     A                                      ERRMSGID  5    C5    SCDRGC7    MCR-
     A                                      1758C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     71RERRMSGID  5    C5    S-
     A                                      CDRGC7    MCR0759C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     64RERRMSGID -
     A                                       5    C5    SCPPIC7    MCR1758C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       71RERRMSGID  5    C5    SCPPIC7   -
     A                                       MCR0759C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     65RERRMSGID  5    C5 -
     A                                         SCSNFC7    MCR1758C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C5    SCSNFC7    MCR0759C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           77')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"2","window left":"3","overlay":"-
     A                                      true","set off":{"fieldName":"*IN71-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 2":{"fieldName":"*IN72","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 3":{"fieldName":"*IN73","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 4":{"fieldName":"*IN44","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       5":{"fieldName":"*IN46","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 6"-
     A                                      :{"fieldName":"*IN76","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 7":{"-
     A                                      fieldName":"*IN77","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 8":{"fie-
     A                                      ldName":"*IN79","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"overlay range":"1-1-
     A                                      7"},"items":[{"id":"WDW01","field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rm Dialog","text align":"center","l-
     A                                      eft":"5px","top":"5px","height":"53-
     A                                      0px","width":"534px","z index":"8",-
     A                                      "locked in place":"true"},{"id":"SC-
     A                                      PGM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCPGM","designV-
     A                                      alue":"[SCPGM]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "29px","cursor column":"2","top":"6-
     A                                      5px","cursor row":"1","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant62","field type":"output field",-
     A                                      "value":"Service Code selection","c-
     A                                      ss class":"constant","left":"183px"-
     A                                      ,"cursor column":"24","top":"65px",-
     A                                      "cursor row":"1","css class 2":"HI"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant63","field type":"-
     A                                      output field","value":"WDW01","css -
     A                                      class":"constant","left":"463px","c-
     A                                      ursor column":"64","top":"65px","cu-
     A                                      rsor row":"1","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant64","-
     A                                      field type":"output field","value":-
     A                                      "Type option, press Enter.","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"105px","curso-
     A                                      r row":"3","css class 2":"BLU","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant65","field type":"outpu-
     A                                      t field","value":"1=Select","css cl-
     A                                      ass":"constant","left":"43px","curs-
     A                                      or column":"4","top":"125px","curso-
     A                                      r row":"4","css class 2":"BLU","css-
     A                                       class 3":"profound-c')
     A                                  1  2HTML('onverted"},{"id":"constant66"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Procedure code file  :","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPCF","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCPCF","designValue":"[SCP-
     A                                      CF]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","left":"190px-
     A                                      ","cursor column":"25","top":"165px-
     A                                      ","cursor row":"6","width":"8px","e-
     A                                      rror message id":"MCR1758","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"71","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0759","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"73","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"css class 3":"profound-c-
     A                                      onverted"},{"id":"constant67","fiel-
     A                                      d type":"output field","value":"DRG-
     A                                       Information   :","css class":"cons-
     A                                      tant","visibility":{"fieldName":"97-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"295px","cursor-
     A                                       column":"40","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCDRI","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCDRI","designValue":"[SCD-
     A                                      RI]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","visibility":-
     A                                      {"fieldName":"97","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"435px","cursor column":"60","top"-
     A                                      :"165px","cursor row":"6","width":"-
     A                                      8px","error message id":"MCR1758","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"71","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"2 messages","error messag-
     A                                      e id 2":"MCR0759","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"45","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"css class 3":"pro-
     A                                      found-converted"},{"id":"constant68-
     A                                      ","field type":"output field","valu-
     A                                      e":"Medicare APC file    :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"67 and 41","dataType":"expr-
     A                                      ession","formatting":')
     A                                  1  2HTML('"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"29px","curso-
     A                                      r column":"2","top":"185px","cursor-
     A                                       row":"7","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCAPC","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCAPC","designValue":"[SCA-
     A                                      PC]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","visibi-
     A                                      lity":{"fieldName":"67 and 41","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"190px","cursor colum-
     A                                      n":"25","top":"185px","cursor row":-
     A                                      "7","width":"8px","error message id-
     A                                      ":"MCR1758","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "71","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"2 messages",-
     A                                      "error message id 2":"MCR0759","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"62","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant70","field type":"output-
     A                                       field","value":"Medicare RVU table-
     A                                         :","css class":"constant","visib-
     A                                      ility":{"fieldName":"57","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"205px","cursor row":"8","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant69","field type":"outpu-
     A                                      t field","value":"R & C file       -
     A                                          :","css class":"constant","visi-
     A                                      bility":{"fieldName":"67","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"29px","cursor column":"2"-
     A                                      ,"top":"205px","cursor row":"8","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCRVU","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCRV-
     A                                      U","designValue":"[SCRVU]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","visibility":{"field-
     A                                      Name":"57","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"190px-
     A                                      ","cursor column":"25","top":"205px-
     A                                      ","cursor row":"8","width":"8px","e-
     A                                      rror message id":"MCR1758","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"71","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0759","error mes')
     A                                  1  2HTML('sage file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"72","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCRCF","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCRCF"-
     A                                      ,"designValue":"[SCRCF]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","visibility":{"fieldNa-
     A                                      me":"67","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"190px",-
     A                                      "cursor column":"25","top":"205px",-
     A                                      "cursor row":"8","width":"8px","err-
     A                                      or message id":"MCR1758","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"44","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "2 messages","error message id 2":"-
     A                                      MCR0759","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"46","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"css class 3":"profound-con-
     A                                      verted"},{"id":"constant71","field -
     A                                      type":"output field","value":"Servi-
     A                                      ce code file    :","css class":"con-
     A                                      stant","visibility":{"fieldName":"N-
     A                                      57","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"29px","curso-
     A                                      r column":"2","top":"225px","cursor-
     A                                       row":"9","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCSCF","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCSCF","designValue":"[SCS-
     A                                      CF]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","visibi-
     A                                      lity":{"fieldName":"N57","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"190px","cursor column":"25-
     A                                      ","top":"225px","cursor row":"9","w-
     A                                      idth":"8px","error message id":"MCR-
     A                                      1758","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"71","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"MCR0759","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"72","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant73","field type":"output field-
     A                                      ","value":"Medicare L')
     A                                  1  2HTML('ab FS      :","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      57","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"29px","curso-
     A                                      r column":"2","top":"245px","cursor-
     A                                       row":"10","css class 2":"profound--
     A                                      converted"},{"id":"constant72","fie-
     A                                      ld type":"output field","value":"OP-
     A                                      PS Prov Spec file  :","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"67","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"29px","cur-
     A                                      sor column":"2","top":"245px","curs-
     A                                      or row":"10","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCIMP","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCIMP","designValue":"[-
     A                                      SCIMP]","refField":"FLAG","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","vis-
     A                                      ibility":{"fieldName":"67","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"190px","cursor column":"-
     A                                      25","top":"245px","cursor row":"10"-
     A                                      ,"width":"8px","error message id":"-
     A                                      MCR1758","error message file":"FSME-
     A                                      SG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"71-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"2 messages","er-
     A                                      ror message id 2":"MCR0759","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"61","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCLAB","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCLAB","d-
     A                                      esignValue":"[SCLAB]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase"},"text transform":"u-
     A                                      ppercase","visibility":{"fieldName"-
     A                                      :"57","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"190px","cu-
     A                                      rsor column":"25","top":"245px","cu-
     A                                      rsor row":"10","width":"8px","error-
     A                                       message id":"MCR1758","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"71","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"MC-
     A                                      R0759","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"72","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"css class 3":"profound-conve-
     A                                      rted"},{"id":"constan')
     A                                  1  2HTML('t74","field type":"output fie-
     A                                      ld","value":"Home Health file     :-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"N57","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"29px","cursor column":"2","to-
     A                                      p":"265px","cursor row":"11","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCHHF","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCHHF",-
     A                                      "designValue":"[SCHHF]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase","dataL-
     A                                      ength":"1"},"text transform":"upper-
     A                                      case","visibility":{"fieldName":"N5-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"190px","curso-
     A                                      r column":"25","top":"265px","curso-
     A                                      r row":"11","width":"8px","error me-
     A                                      ssage":"No Home Health Record Found-
     A                                      .","error condition":{"fieldName":"-
     A                                      75","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"3 messages","-
     A                                      error message id 2":"MCR1758","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"71","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 3":"MCR0759","error mes-
     A                                      sage file 3":"FSMESG","error messag-
     A                                      e library 3":"*LIBL","error conditi-
     A                                      on 3":{"fieldName":"74","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant75","field type":"output field-
     A                                      ","value":"IPPS Prov. Spec. File:",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"67","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "285px","cursor row":"12","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPPS","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCPPS","de-
     A                                      signValue":"[SCPPS]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"1"},"text transform":"uppercas-
     A                                      e","visibility":{"fieldName":"67","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"190px","cursor co-
     A                                      lumn":"25","top":"285px","cursor ro-
     A                                      w":"12","width":"8px","error messag-
     A                                      e id":"MCR1758","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"71","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0759",-
     A                                      "error message file 2')
     A                                  1  2HTML('":"FSMESG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"63","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      76","field type":"output field","va-
     A                                      lue":"IPPS MS-DRG''s        :","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"67","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      9px","cursor column":"2","top":"305-
     A                                      px","cursor row":"13","css class 2"-
     A                                      :"profound-converted"},{"id":"SCDRG-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCDRG","design-
     A                                      Value":"[SCDRG]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase","dataLength":-
     A                                      "1"},"text transform":"uppercase","-
     A                                      visibility":{"fieldName":"67","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"190px","cursor column-
     A                                      ":"25","top":"305px","cursor row":"-
     A                                      13","width":"8px","error message id-
     A                                      ":"MCR1758","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "71","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"2 messages",-
     A                                      "error message id 2":"MCR0759","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"64","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant77","field type":"output-
     A                                       field","value":"IPPS Payment info -
     A                                         :","css class":"constant","visib-
     A                                      ility":{"fieldName":"67","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"325px","cursor row":"14","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCPPI","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCPP-
     A                                      I","designValue":"[SCPPI]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"1"},"text transform":"up-
     A                                      percase","visibility":{"fieldName":-
     A                                      "67","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"190px","cur-
     A                                      sor column":"25","top":"325px","cur-
     A                                      sor row":"14","width":"8px","error -
     A                                      message id":"MCR1758","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"71","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"2 -
     A                                      messages","error mess')
     A                                  1  2HTML('age id 2":"MCR0759","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"65","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant78","field type":"output fiel-
     A                                      d","value":"SNF Payment info     :"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"79","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"29px","cursor column":"2","top"-
     A                                      :"345px","cursor row":"15","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCSNF","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCSNF","d-
     A                                      esignValue":"[SCSNF]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase","dataLen-
     A                                      gth":"1"},"text transform":"upperca-
     A                                      se","visibility":{"fieldName":"79",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"190px","cursor c-
     A                                      olumn":"25","top":"345px","cursor r-
     A                                      ow":"15","width":"8px","error messa-
     A                                      ge id":"MCR1758","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"71","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"2 messa-
     A                                      ges","error message id 2":"MCR0759"-
     A                                      ,"error message file 2":"FSMESG","e-
     A                                      rror message library 2":"*LIBL","er-
     A                                      ror condition 2":{"fieldName":"77",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"btnSubmit","field type":"bu-
     A                                      tton","value":"Enter","shortcut key-
     A                                      ":"Enter","left":"14px","top":"490p-
     A                                      x","width":"80px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF12","field type":"button","valu-
     A                                      e":"Cancel  ","shortcut key":"F12",-
     A                                      "left":"104px","top":"490px","width-
     A                                      ":"80px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            SCDRG          1A  H
     A            SCDRI          1A  H
     A            SCHHF          1A  H
     A            SCPCF          1A  H
     A            SCPGM         10A  H
     A            SCPPI          1A  H
     A            SCPPS          1A  H
     A            SCSNF          1A  H
     A            SCAPC     R        H      REFFLD(FLAG)
     A            SCIMP     R        H      REFFLD(FLAG)
     A            SCLAB     R        H      REFFLD(FLAG)
     A            SCRCF     R        H      REFFLD(FLAG)
     A            SCRVU     R        H      REFFLD(FLAG)
     A            SCSCF     R        H      REFFLD(FLAG)
     A          R WDW02
     A  52 53 54
     A  51 96 71                            CA01(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                  1  2HTML('QPUIREC19   ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    16 RERRMSGID  5    C5   -
     A                                       SCIRFC7    MCR1758C6    FSMESGC5  -
     A                                        *LIBLC0    E1    12    71 52N53N5-
     A                                      4RERRMSGID  5    C5    SCIRFC7    M-
     A                                      CR0759C6    FSMESGC5    *LIBLC0    -
     A                                      E1    12    71N52N53 54RERRMSGID  5-
     A                                          C6    SCIPRVC7    MCR1758C6    -
     A                                      FSMESGC5    *LIBLC0    E1    12    -
     A                                      71 52N53N54RERRMSGID  5    C6    SC-
     A                                      IPRVC7    MCR0759C6    FSMESGC5    -
     A                                      *LIBLC0    E1    12    71 52 53N54R-
     A                                      ERRMSGID  5    C6    SCASCFC7    MC-
     A                                      R1758C6    FSMESGC5    *LIBLC0    E-
     A                                      1    9     52N53N54RERRMSGID  5    -
     A                                      C6    SCASCFC7    MCR0759C6    FSME-
     A                                      SGC5    *LIBLC0    E1    9    N52N5-
     A                                      3 54RERRMSGID  5    C6    SCAPCFC7 -
     A                                         MCR1758C6    FSMESGC5    *LIBLC0-
     A                                          E1    9     52N53N54RERRMSGID  -
     A                                      5    C6    SCAPCFC7    MCR0759C6   -
     A                                       FSMESGC5    *LIBLC0    E1    9    -
     A                                      N52N53 54RERRMSGID  5    C6    SCOP-
     A                                      PFC7    MCR1758C6    FSMESGC5    *L-
     A                                      IBLC0    E1    9     52N53N54RERRMS-
     A                                      GID  5    C6    SCOPPFC7    MCR0759-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      9     52 53N54RERRMSGID  5    C6   -
     A                                       SCASPFC7    MCR1758C6    FSMESGC5 -
     A                                         *LIBLC0    E1    9     52N53N54R-
     A                                      ERRMSGID  5    C6    SCASPFC7    MC-
     A                                      R0759C6    FSMESGC5    *LIBLC0    E-
     A                                      1    9     52 53N54RERRMSGID  5    -
     A                                      C6    SCPFPFC7    MCR1758C6    FSME-
     A                                      SGC5    *LIBLC0    E1    9    N52 5-
     A                                      3N54RERRMSGID  5    C6    SCPFPFC7 -
     A                                         MCR0759C6    FSMESGC5    *LIBLC0-
     A                                          E1    9    N52 53 54RERRMSGID  -
     A                                      5    C6    SCIPYFC7    MCR1758C6   -
     A                                       FSMESGC5    *LIBLC0    E1    9    -
     A                                      N52 53N54RERRMSGID  5    C6    SCIP-
     A                                      YFC7    MCR0759C6    FSMESGC5    *L-
     A                                      IBLC0    E1    9     52N53 54')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"2","window left":"3","overlay":"-
     A                                      true","set off":{"fieldName":"*IN52-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 2":{"fieldName":"*IN53","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 3":{"fieldName":"*IN54","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"over-
     A                                      lay range":"1-16"},"items":[{"id":"-
     A                                      WDW02","field type":"panel","panel -
     A                                      style":"Transform Dialog","text ali-
     A                                      gn":"center","left":"5px","top":"5p-
     A                                      x","height":"530px","width":"534px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue"},{"id":"WDW02_SCPGM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPGM","designValue":"[SCPGM]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"10"},"css class":"-
     A                                      output-field","left":"29px","cursor-
     A                                       column":"2","top":"65px","cursor r-
     A                                      ow":"1","css class 2":"profound-con-
     A                                      verted"},{"id":"constant79","field -
     A                                      type":"output field","value":"Servi-
     A                                      ce Code selection","css class":"con-
     A                                      stant","left":"183px","cursor colum-
     A                                      n":"24","top":"65px","cursor row":"-
     A                                      1","css class 2":"HI","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant80","field type":"output field",-
     A                                      "value":"WDW02","css class":"consta-
     A                                      nt","left":"463px","cursor column":-
     A                                      "64","top":"65px","cursor row":"1",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant81","field type":"o-
     A                                      utput field","value":"Type option, -
     A                                      press Enter.","css class":"constant-
     A                                      ","left":"29px","cursor column":"2"-
     A                                      ,"top":"105px","cursor row":"3","cs-
     A                                      s class 2":"BLU","css class 3":"pro-
     A                                      found-converted"},{"id":"constant82-
     A                                      ","field type":"output field","valu-
     A                                      e":"1=Select","css class":"constant-
     A                                      ","left":"43px","cursor column":"4"-
     A                                      ,"top":"125px","cursor row":"4","cs-
     A                                      s class 2":"BLU","css class 3":"pro-
     A                                      found-converted"},{"id":"constant91-
     A                                      ","field type":"output field","valu-
     A                                      e":"Inpatient Rehab Facility Info :-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"71","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"165px","cursor row":"6","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant83","field type":"output fi-
     A                                      eld","value":"Outpatient","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"51 and N96","dataType":"expre-
     A                                      ssion","formatting":"')
     A                                  1  2HTML('Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"29px","cursor-
     A                                       column":"2","top":"165px","cursor -
     A                                      row":"6","css class 2":"UL","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCIRF","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCIRF","-
     A                                      designValue":"[SCIRF]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","visibility":{"fieldName-
     A                                      ":"71","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"253px","c-
     A                                      ursor column":"34","top":"165px","c-
     A                                      ursor row":"6","width":"8px","error-
     A                                       message id":"MCR1758","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"71 and 52 and N53 and N-
     A                                      54","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"MCR0759","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"71 and N52-
     A                                       and N53 and 54","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"css class 3":"pro-
     A                                      found-converted"},{"id":"constant92-
     A                                      ","field type":"output field","valu-
     A                                      e":"Provider Specific File        :-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"71","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"185px","cursor row":"7","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCIPRV","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCIPRV",-
     A                                      "designValue":"[SCIPRV]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","visibility":{"fieldNa-
     A                                      me":"71","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"253px",-
     A                                      "cursor column":"34","top":"185px",-
     A                                      "cursor row":"7","width":"8px","err-
     A                                      or message id":"MCR1758","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"71 and 52 and N53 and-
     A                                       N54","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"MCR0759","er-
     A                                      ror message file 2":"FSMESG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"71 and 5-
     A                                      2 and 53 and N54","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"css class 3":"pr-
     A                                      ofound-converted"},{"')
     A                                  1  2HTML('id":"constant84","field type"-
     A                                      :"output field","value":"APC file  -
     A                                                 :","css class":"constant-
     A                                      ","visibility":{"fieldName":"51 and-
     A                                       N96","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"29px","cur-
     A                                      sor column":"2","top":"205px","curs-
     A                                      or row":"8","css class 2":"profound-
     A                                      -converted"},{"id":"constant89","fi-
     A                                      eld type":"output field","value":"A-
     A                                      SC file             :","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"96","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"29px","cu-
     A                                      rsor column":"2","top":"205px","cur-
     A                                      sor row":"8","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCASCF","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCASCF","designValue":-
     A                                      "[SCASCF]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      visibility":{"fieldName":"96","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"190px","cursor column-
     A                                      ":"25","top":"205px","cursor row":"-
     A                                      8","width":"8px","error message id"-
     A                                      :"MCR1758","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      52 and N53 and N54","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0759","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"N52 and N53 and 54","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CAPCF","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCAPCF","-
     A                                      designValue":"[SCAPCF]","refField":-
     A                                      "FLAG","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","visibility":{"fieldNam-
     A                                      e":"51 and N96","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      190px","cursor column":"25","top":"-
     A                                      205px","cursor row":"8","width":"8p-
     A                                      x","error message id":"MCR1758","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"52 and N53 and-
     A                                       N54","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"MCR0759","er-
     A                                      ror message file 2":"FSMESG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldN')
     A                                  1  2HTML('ame":"N52 and N53 and 54","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant90","field type":"outp-
     A                                      ut field","value":"ASC Payment Info-
     A                                           :","css class":"constant","vis-
     A                                      ibility":{"fieldName":"96","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"29px","cursor column":"2-
     A                                      ","top":"225px","cursor row":"9","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant85","field type":"out-
     A                                      put field","value":"OPPS Prov Spec -
     A                                      file  :","css class":"constant","vi-
     A                                      sibility":{"fieldName":"51 and N96"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"29px","cursor c-
     A                                      olumn":"2","top":"225px","cursor ro-
     A                                      w":"9","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCOPPF","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCOPPF","designValue":"[SCOP-
     A                                      PF]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","visibi-
     A                                      lity":{"fieldName":"51 and N96","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"190px","cursor colu-
     A                                      mn":"25","top":"225px","cursor row"-
     A                                      :"9","width":"8px","error message i-
     A                                      d":"MCR1758","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"52 and N53 and N54","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0759","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"52 and 53 and N54","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCASPF","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCASPF",-
     A                                      "designValue":"[SCASPF]","refField"-
     A                                      :"FLAG","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","visibility":{"fieldNa-
     A                                      me":"96","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"190px",-
     A                                      "cursor column":"25","top":"225px",-
     A                                      "cursor row":"9","width":"8px","err-
     A                                      or message id":"MCR1758","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"52 and N53 and N54","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 me')
     A                                  1  2HTML('ssages","error message id 2":-
     A                                      "MCR0759","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"52 and 53 and N54","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant86","field type":"output field-
     A                                      ","value":"Inpatient","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"N51 and N96 and N71","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"245px","cursor row":"10","css -
     A                                      class 2":"UL","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant87","-
     A                                      field type":"output field","value":-
     A                                      "IPPS Prov Spec file  :","css class-
     A                                      ":"constant","visibility":{"fieldNa-
     A                                      me":"N51 and N96 and N71","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"29px","cursor column":"2"-
     A                                      ,"top":"285px","cursor row":"12","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPFPF","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      PFPF","designValue":"[SCPFPF]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","visibility":{"f-
     A                                      ieldName":"N51 and N96 and N71","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"190px","cursor colu-
     A                                      mn":"25","top":"285px","cursor row"-
     A                                      :"12","width":"8px","error message -
     A                                      id":"MCR1758","error message file":-
     A                                      "FSMESG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"N52 and 53 and N54","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"2 messages","error message id-
     A                                       2":"MCR0759","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"N52 and 53 and 54","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant88","field type":"output f-
     A                                      ield","value":"IPPS Payment info   -
     A                                       :","css class":"constant","visibil-
     A                                      ity":{"fieldName":"N51 and N96 and -
     A                                      N71","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"29px","curs-
     A                                      or column":"2","top":"305px","curso-
     A                                      r row":"13","css class 2":"profound-
     A                                      -converted"},{"id":"SCIPYF","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCIPYF","designValue":"-
     A                                      [SCIPYF]","refField":"FLAG","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false')
     A                                  1  2HTML('","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","visibility":{"fi-
     A                                      eldName":"N51 and N96 and N71","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"190px","cursor colum-
     A                                      n":"25","top":"305px","cursor row":-
     A                                      "13","width":"8px","error message i-
     A                                      d":"MCR1758","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"N52 and 53 and N54","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0759","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"52 and N53 and 54","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"490px","widt-
     A                                      h":"80px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF12",-
     A                                      "field type":"button","value":"Canc-
     A                                      el  ","shortcut key":"F12","left":"-
     A                                      104px","top":"490px","width":"80px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"}]}')
     A            SCPGM         10A  H
     A            SCAPCF    R        H      REFFLD(FLAG)
     A            SCASCF    R        H      REFFLD(FLAG)
     A            SCASPF    R        H      REFFLD(FLAG)
     A            SCIPRV    R        H      REFFLD(FLAG)
     A            SCIPYF    R        H      REFFLD(FLAG)
     A            SCIRF     R        H      REFFLD(FLAG)
     A            SCOPPF    R        H      REFFLD(FLAG)
     A            SCPFPF    R        H      REFFLD(FLAG)
