     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  05 06 07
     A  15 25 28
     A  29 30 03                            CA01(05 'Response Indicator *IN05')
     A  09 43 14
     A  31 32 33
     A  34 35 36                            CA02(06 'Response Indicator *IN06')
     A  37 38 39
     A  40 46 44
     A  47 48 49                            CA03(07 'Response Indicator *IN07')
     A  50 55 56
     A  58 59 65
     A  68 69 70                            CA04(15 'Response Indicator *IN15')
     A  71 72 73
     A  74 75 76
     A  77 78 79                            CA05(25 'Response Indicator *IN25')
     A  80 81 82
     A  83 84 85
     A  86 87 88                            CA06(28 'Response Indicator *IN28')
     A  89                                  CA07(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                  1  2HTML('QPUIREC43   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCCSCDC7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      CSCDC7    MCR2383C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     72RERRMSGID -
     A                                       5    C6    SCCSCDC7    MC40167C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        65RERRMSGID  5    C5    SCPOSC7  -
     A                                        MCR0503C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     76RERRMSGID  5    C5-
     A                                          SCPOSC7    MCR2383C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     77RERRM-
     A                                      SGID  5    C5    SCPOSC7    MCR2387-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     25RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR0556C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     73RERRMSGID  5 -
     A                                         C6    SCFDATC7    MCR0500C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     7-
     A                                      4RERRMSGID  5    C6    SCFDATC7    -
     A                                      MC40056C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     75RERRMSGID  5    C6  -
     A                                        SCFDATC7    MCR0466C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     85RERRMS-
     A                                      GID  5    C6    SCFDATC7    MC40157-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     86RERRMSGID  5    C6    SCFDA-
     A                                      TC7    MCR2397C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     30RERRMSGID  5 -
     A                                         C6    SCFDATC7    MCR0676C6    F-
     A                                      SMESGC5    *LIBLC0    E1    12   N3-
     A                                      7 38 39 40RERRMSGID  5    C6    SCT-
     A                                      DATC7    MCR0500C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     07RERRMSGID  -
     A                                      5    C6    SCTDATC7    MC40307C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       28RERRMSGID  5    C6    SCTDATC7  -
     A                                        MCR2397C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     29RERRMSGID  5    C6-
     A                                          SCRVCDC7    MCR2387C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     87RERR-
     A                                      MSGID  5    C6    SCRVCDC7    MCR05-
     A                                      03C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     88RERRMSGID  5    C6    SCH-
     A                                      CPCC7    MCR0503C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     78RERRMSGID  -
     A                                      5    C6    SCHCPCC7    MCR2387C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       89RERRMSGID  5    C6    SCPMODC7  -
     A                                        MCR2434C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     15RERRMSGID  5    C6-
     A                                          SCCDDSC7    MCR0503C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     79RERR-
     A                                      MSGID  5    C6    SCCDDSC7    MCR06-
     A                                      76C6    FSMESGC5    *LIBLC0    E1  -
     A                                        12    37N38N39N40RERRMSGID  5    -
     A                                      C6    SCUNTSC7    MCR0676C6    FSME-
     A                                      SGC5    *LIBLC0    E1    12   N37 3-
     A                                      8N39N40RERRMSGID  5    C6    SCCHRG-
     A                                      C7    MCR0556C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     80RERRMSGID  5  -
     A                                        C6    SCCHRGC7    MC40116C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     58-
     A                                      RERRMSGID  5    C6    SCCHRGC7    M-
     A                                      CR0676C6    FSMESGC5    *LIBLC0    -
     A                                      E1    12   N37N38 39N40RERRMSGID  5-
     A                                          C6    SCPAIDC7    MC40116C6    -
     A                                      FSMESGC5    *LIBLC0    E1    3     -
     A                                      58RERRMSGID  5    C6    SCPAIDC7   -
     A                                       MCR0676C6    FSMESGC5')
     A                                  1  2HTML('QPUI    *LIBLC0    E1    12  -
     A                                       N37N38N39 40RERRMSGID  5    C5    -
     A                                      SCMRAC7    MC40116C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     58RERRMSGID-
     A                                        5    C5    SCMRAC7    MCR0676C6  -
     A                                        FSMESGC5    *LIBLC0    E1    12  -
     A                                        37 38N39N40RERRMSGID  5    C6    -
     A                                      SCNTWKC7    MC40116C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     58RERRMSGI-
     A                                      D  5    C6    SCNTWKC7    MCR0676C6-
     A                                          FSMESGC5    *LIBLC0    E1    12-
     A                                         N37 38 39N40RERRMSGID  5    C6  -
     A                                        SCOTHRC7    MC40116C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     58RERRMS-
     A                                      GID  5    C6    SCOTHRC7    MCR0676-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      12   N37N38 39 40RERRMSGID  5    C6-
     A                                          SCOT1CC7    MC40072C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     81RERR-
     A                                      MSGID  5    C6    SCOT1CC7    MCR05-
     A                                      13C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     82RERRMSGID  5    C6    SCO-
     A                                      TH2C7    MC40116C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     58RERRMSGID  -
     A                                      5    C6    SCOTH2C7    MCR0676C6   -
     A                                       FSMESGC5    *LIBLC0    E1    12   -
     A                                       37N38N39 40RERRMSGID  5    C6    S-
     A                                      COT2CC7    MC40072C6    FSMESGC5   -
     A                                       *LIBLC0    E1    3     83RERRMSGID-
     A                                        5    C6    SCOT2CC7    MCR0513C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         84')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","set off":{"fieldN-
     A                                      ame":"*IN05","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 2":{"fieldName-
     A                                      ":"*IN06","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 3":{"fieldName":"-
     A                                      *IN07","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 4":{"fieldName":"*IN-
     A                                      15","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 5":{"fieldName":"*IN30"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 6":{"fieldName":"*IN28","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 7":{"fieldName":"*IN29","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 8":{"fieldName":"*IN25","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"return c-
     A                                      ursor record":{"fieldName":"HREC","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"return cursor fi-
     A                                      eld":{"fieldName":"HFLD","dataLengt-
     A                                      h":"10","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none"},"overlay range":"1-24"},"i-
     A                                      tems":[{"id":"HFLD","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"HFLD","design-
     A                                      Value":"[HFLD]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "left":"0px","top":"-30px","css cla-
     A                                      ss":"profound-converted"},{"id":"HR-
     A                                      EC","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"HREC","designValue":"[HREC]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none",-
     A                                      "dataLength":"10"},"left":"0px","to-
     A                                      p":"-30px","css class":"profound-co-
     A                                      nverted"},{"id":"F0363FTN_SCR01_avK-
     A                                      eys","field type":"output field","v-
     A                                      alue":{"fieldName":"AV_KEYS","dataL-
     A                                      ength":"1134","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none","designValue":"-
     A                                      [AV_KEYS]"},"left":"0px","top":"0px-
     A                                      ","visibility":"hidden"},{"id":"F03-
     A                                      63FTN_SCR01_action","field type":"h-
     A                                      tml container","white space":"norma-
     A                                      l","left":"0px","top":"10px","width-
     A                                      ":"230px","css class":"action-panel-
     A                                      -converted","height":')
     A                                  1  2HTML('"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","id":"F0363FTN_SCR01_BtnIconMenu-
     A                                      SystemTools"},{"field type":"panel"-
     A                                      ,"panel style":"TransformButtonBar"-
     A                                      ,"id":"F0363FTN_SCR01_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"F0363FT-
     A                                      N_SCR01_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"F0363FTN_SCR01_BtnRefresh","tool -
     A                                      tip":"Refresh","onclick":"SystemToo-
     A                                      lbarRefresh","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/refresh.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1092px","id":"F0363FTN_SCR-
     A                                      01_BtnSearch","tool tip":"Search","-
     A                                      onclick":"SystemToolbarSearch","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/search.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1118px","-
     A                                      id":"F0363FTN_SCR01_BtnDiaryItems",-
     A                                      "tool tip":"Diary/Wor')
     A                                  1  2HTML('k Items - IDARTS","onclick":"-
     A                                      SystemToolbarDiary","background ima-
     A                                      ge":{"fieldName":"DryIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1144px","id":"F0363FTN_SCR0-
     A                                      1_BtnSystemMessages","tool tip":"Sy-
     A                                      stem Messages","onclick":"SystemToo-
     A                                      lbarMessages","background image":{"-
     A                                      fieldName":"MsgIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1196px","id":"F0363FTN_SCR01_BtnH-
     A                                      elp","tool tip":"Help","onclick":"S-
     A                                      ystemToolbarHelp","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/help.png'')"},{"id":"F036-
     A                                      3FTN_SCR01_ImgSysToolBottom","field-
     A                                       type":"image","image source":"/pro-
     A                                      foundui/userdata/images/systool/but-
     A                                      barbot.png","left":"1036px","top":"-
     A                                      64px","width":"187px","locked in pl-
     A                                      ace":"true","css class":"stationary-
     A                                      ","visibility":"hidden"},{"id":"F03-
     A                                      63FTN_SCR01_MainTabPanel","field ty-
     A                                      pe":"tab panel","tab panel style":"-
     A                                      Transform","tab names":{"fieldName"-
     A                                      :"SCPRDS","designValue":"[SCPRDS]",-
     A                                      "refField":"NAME","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"active ta-
     A                                      b":"0","left":"250px","top":"70px",-
     A                                      "width":"970px","height":"657px","z-
     A                                       index":"8","locked in place":"true-
     A                                      ","css class":"tab-panel","css clas-
     A                                      s 2":"stationary"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0363FTN_SCR01_BtnHiddenSave-
     A                                      ","value":"btnSave","top":"100px","-
     A                                      response":{"fieldName":"btnSave","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant1","field type":"outpu-
     A                                      t field","left":"281p')
     A                                  1  2HTML('x","cursor column":"2","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                      ":"top-line","value":"js: currentUs-
     A                                      er()","css class 2":"output-field",-
     A                                      "parent tab panel":"F0363FTN_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCCONM","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCCONM",-
     A                                      "designValue":"[SCCONM]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"110px","cursor row":-
     A                                      "1","css class 2":"top-line","css c-
     A                                      lass 3":"HI","parent tab panel":"F0-
     A                                      363FTN_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant2","field -
     A                                      type":"output field","left":"778px"-
     A                                      ,"cursor column":"73","top":"110px"-
     A                                      ,"cursor row":"1","css class":"top--
     A                                      line","value":"js: currentDate()","-
     A                                      css class 2":"output-field","parent-
     A                                       tab panel":"F0363FTN_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"F03-
     A                                      63FTN_SCR01_fkeyMenu","field type":-
     A                                      "menu","left":"10px","top":"120px",-
     A                                      "height":"350px","width":"230px","h-
     A                                      over background color":"#9AAA61","h-
     A                                      over text color":"#FFFFFF","border -
     A                                      color":"#4C6106","menu option inden-
     A                                      t":"10px","background color":"#758B-
     A                                      27","css class":"action-menu","css -
     A                                      class 2":"stationary","z index":"10-
     A                                      1"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0363FTN-
     A                                      _SCR01_BtnHiddenRefresh","value":"b-
     A                                      tnRefresh","top":"125px","response"-
     A                                      :{"fieldName":"btnRefresh","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F0363FTN_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCAST"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCAST","designValue-
     A                                      ":"[SCAST]","refField":"ST","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      358px","cursor column":"13","top":"-
     A                                      130px","cursor row":"2","css class -
     A                                      2":"HI","parent tab panel":"F0363FT-
     A                                      N_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"pr')
     A                                  1  2HTML('ofound-converted"},{"id":"SCZ-
     A                                      IPA","field type":"output field","v-
     A                                      alue":{"fieldName":"SCZIPA","design-
     A                                      Value":"[SCZIPA]","refField":"ZIPA"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"379px","cursor column":"16"-
     A                                      ,"top":"130px","cursor row":"2","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F0363FTN_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCPRDS","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"130p-
     A                                      x","cursor row":"2","css class 2":"-
     A                                      HI","parent tab panel":"F0363FTN_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant3","field type":"output field","-
     A                                      value":"SCR01","css class":"constan-
     A                                      t","left":"799px","cursor column":"-
     A                                      76","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"F0363FTN_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant4","field type":"output-
     A                                       field","value":"SCR01","css class"-
     A                                      :"constant","left":"799px","cursor -
     A                                      column":"76","top":"130px","cursor -
     A                                      row":"2","parent tab panel":"F0363F-
     A                                      TN_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCMODE","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCMODE","designValue":"[SCMODE]","-
     A                                      refField":"PGM","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"764px","curs-
     A                                      or column":"71","top":"150px","curs-
     A                                      or row":"3","css class 2":"HI","par-
     A                                      ent tab panel":"F0363FTN_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0363FTN_SCR01_BtnH-
     A                                      iddenSearch","value":"btnSearch","t-
     A                                      op":"150px","response":{"fieldName"-
     A                                      :"btnSearch","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCHD1","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCHD1","designValue":"[SCHD1-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"78"},"css class":-
     A                                      "output-field","left":"281px","curs-
     A                                      or column":"2","top":')
     A                                  1  2HTML('"170px","cursor row":"4","par-
     A                                      ent tab panel":"F0363FTN_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0363FTN_SCR01_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCHD2","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCHD2","designValue":"[SCH-
     A                                      D2]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"78"},"css class-
     A                                      ":"output-field","left":"281px","cu-
     A                                      rsor column":"2","top":"190px","cur-
     A                                      sor row":"5","parent tab panel":"F0-
     A                                      363FTN_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      363FTN_SCR01_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"SCHD3","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CHD3","designValue":"[SCHD3]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"74"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"210px","cursor row":"-
     A                                      6","parent tab panel":"F0363FTN_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCZIPB","field type":"output-
     A                                       field","value":{"fieldName":"SCZIP-
     A                                      B","designValue":"[SCZIPB]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"3"},"css class":"output-fie-
     A                                      ld","left":"806px","cursor column":-
     A                                      "77","top":"210px","cursor row":"6"-
     A                                      ,"parent tab panel":"F0363FTN_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0363FTN_SCR01-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant5","field type":"output fie-
     A                                      ld","value":"EOMB#:","css class":"c-
     A                                      onstant","left":"281p')
     A                                  1  2HTML('x","cursor column":"2","top":-
     A                                      "230px","cursor row":"7","parent ta-
     A                                      b panel":"F0363FTN_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCEOB#-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCEOB#","designVal-
     A                                      ue":"[SCEOB#]","refField":"EOB#","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"330px","cursor column":"9","top-
     A                                      ":"230px","cursor row":"7","parent -
     A                                      tab panel":"F0363FTN_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant6","field type":"output field",-
     A                                      "value":"Line#:","css class":"const-
     A                                      ant","left":"400px","cursor column"-
     A                                      :"19","top":"230px","cursor row":"7-
     A                                      ","parent tab panel":"F0363FTN_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCLIN#","field type":"output -
     A                                      field","value":{"fieldName":"SCLIN#-
     A                                      ","designValue":"[SCLIN#]","refFiel-
     A                                      d":"A90","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00"},"css class":"output--
     A                                      field","left":"449px","cursor colum-
     A                                      n":"26","top":"230px","cursor row":-
     A                                      "7","parent tab panel":"F0363FTN_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant7","field type":"ou-
     A                                      tput field","value":"Seq#:","css cl-
     A                                      ass":"constant","left":"519px","cur-
     A                                      sor column":"36","top":"230px","cur-
     A                                      sor row":"7","parent tab panel":"F0-
     A                                      363FTN_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSEQ#","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCSEQ#","designValue":"[SCSEQ#-
     A                                      ]","refField":"SEQ#","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00"},"css cla-
     A                                      ss":"output-field","left":"561px","-
     A                                      cursor column":"42","top":"230px","-
     A                                      cursor row":"7","parent tab panel":-
     A                                      "F0363FTN_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant8","fie-
     A                                      ld type":"output field","value":"Nt-
     A                                      wk:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"68","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"603px","cursor column":"48"-
     A                                      ,"top":"230px","cursor row":"7","pa-
     A                                      rent tab panel":"F0363FTN_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCNWCD","field type":"output field-
     A                                      ","value":{"fieldName":"SCNWCD","de-
     A                                      signValue":"[SCNWCD]"')
     A                                  1  2HTML(',"refField":"NWCD","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","visibility-
     A                                      ":{"fieldName":"68","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"645px","cursor column":"54","to-
     A                                      p":"230px","cursor row":"7","parent-
     A                                       tab panel":"F0363FTN_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant9","field type":"output field"-
     A                                      ,"value":"Tot chrg:","css class":"c-
     A                                      onstant","left":"687px","cursor col-
     A                                      umn":"60","top":"230px","cursor row-
     A                                      ":"7","parent tab panel":"F0363FTN_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCTOTC","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      TOTC","designValue":"[SCTOTC]","ref-
     A                                      Field":"A92","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00"},"css class":"out-
     A                                      put-field","left":"757px","cursor c-
     A                                      olumn":"70","top":"230px","cursor r-
     A                                      ow":"7","parent tab panel":"F0363FT-
     A                                      N_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant10","field type-
     A                                      ":"output field","value":"SELECTED -
     A                                      NETWORK CONTRACT IS A MANUAL FEE SC-
     A                                      HEDULE","css class":"constant","vis-
     A                                      ibility":{"fieldName":"03","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"250px","cursor row":"8","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0363FTN_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0363FTN_SCR01_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant11","-
     A                                      field type":"output field","value":-
     A                                      "Adjudication code     :","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"270px","cursor-
     A                                       row":"9","parent tab panel":"F0363-
     A                                      FTN_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCCSCD","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCCSCD","designValue":"[SCCSC-
     A                                      D]","refField":"CODE3","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppe')
     A                                  1  2HTML('rcase","left":"449px","cursor-
     A                                       column":"26","top":"270px","cursor-
     A                                       row":"9","css class 3":{"fieldName-
     A                                      ":"N09 and N46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"46 or 44 or 09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"46 o-
     A                                      r 44 or 09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 5":{-
     A                                      "fieldName":"N46","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"error me-
     A                                      ssage id":"MCR0503","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"71","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"3 me-
     A                                      ssages","error message id 2":"MCR23-
     A                                      83","error message file 2":"FSMESG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{"fieldName":"7-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 3":"MC40167","-
     A                                      error message file 3":"FSMESG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"65","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et focus":{"fieldName":"31","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "parent tab panel":"F0363FTN_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted","wid-
     A                                      th":"25px"},{"id":"SCCSDS","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCCSDS","designValue":"[SCCS-
     A                                      DS]","refField":"DS25","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"477px-
     A                                      ","cursor column":"30","top":"270px-
     A                                      ","cursor row":"9","css class 2":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"parent tab-
     A                                       panel":"F0363FTN_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t12","field type":"output field","v-
     A                                      alue":"EOB/Notes attached","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"69","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"673px-
     A                                      ","cursor column":"58","top":"270px-
     A                                      ","cursor row":"9","css class 2":{"-
     A                                      fieldName":"69","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"RI","customFalse":"')
     A                                  1  2HTML('"},"parent tab panel":"F0363F-
     A                                      TN_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant13","field typ-
     A                                      e":"output field","value":"EOB Code-
     A                                       Needed","css class":"constant","vi-
     A                                      sibility":{"fieldName":"14","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"673px","cursor column":-
     A                                      "58","top":"270px","cursor row":"9"-
     A                                      ,"css class 2":{"fieldName":"14","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"RI","customFalse-
     A                                      ":""},"parent tab panel":"F0363FTN_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0363FTN_-
     A                                      SCR01_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant14","field type":"output fie-
     A                                      ld","value":"Place of Service      -
     A                                      :","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"29-
     A                                      0px","cursor row":"10","parent tab -
     A                                      panel":"F0363FTN_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPOS","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCPOS","designVal-
     A                                      ue":"[SCPOS]","dataType":"zoned","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00","dataLength":"2","dec-
     A                                      Pos":"0"},"left":"449px","cursor co-
     A                                      lumn":"26","top":"290px","cursor ro-
     A                                      w":"10","width":"15px","css class 3-
     A                                      ":{"fieldName":"N09 and N46","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"read only":{"fieldName":"46 or 0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 4":{"fieldName-
     A                                      ":"46 or 09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 5":-
     A                                      {"fieldName":"N46","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"set foc-
     A                                      us":{"fieldName":"32","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message id":"MCR0503","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"76","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"erro')
     A                                  1  2HTML('r messages":"3 messages","err-
     A                                      or message id 2":"MCR2383","error m-
     A                                      essage file 2":"FSMESG","error mess-
     A                                      age library 2":"*LIBL","error condi-
     A                                      tion 2":{"fieldName":"77","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 3":"MCR2387","error messag-
     A                                      e file 3":"FSMESG","error message l-
     A                                      ibrary 3":"*LIBL","error condition -
     A                                      3":{"fieldName":"25","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"parent tab pa-
     A                                      nel":"F0363FTN_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted"},{"id":"SCPODS","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCPODS","designValue":-
     A                                      "[SCPODS]","refField":"DS30","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "470px","cursor column":"29","top":-
     A                                      "290px","cursor row":"10","css clas-
     A                                      s 2":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"par-
     A                                      ent tab panel":"F0363FTN_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0363FTN_SCR01_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant15","field ty-
     A                                      pe":"output field","value":"From Da-
     A                                      te of Service  :","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"310px","cursor row":"1-
     A                                      1","parent tab panel":"F0363FTN_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCFDAT","field type":"date f-
     A                                      ield","css class":"input","css clas-
     A                                      s 2":"date-field","value":{"fieldNa-
     A                                      me":"SCFDAT","designValue":"[SCFDAT-
     A                                      ]","refField":"DT8","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","edtWrd":"-
     A                                      ''  /  /    ''","dateFormat":"m/d/Y-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"449px","cursor column":"26","t-
     A                                      op":"310px","cursor row":"11","widt-
     A                                      h":"71px","css class 3":{"fieldName-
     A                                      ":"N09 and N46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"46 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 4":{"fieldName":"46 or 09",-
     A                                      "dataType":"expressio')
     A                                  1  2HTML('n","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"N46","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      set focus":{"fieldName":"33","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"error message id":"MCR0556","erro-
     A                                      r message file":"FSMESG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"73","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"7 messages","error message id-
     A                                       2":"MCR0500","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"74","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 3":"-
     A                                      MC40056","error message file 3":"FS-
     A                                      MESG","error message library 3":"*L-
     A                                      IBL","error condition 3":{"fieldNam-
     A                                      e":"75","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 4":"MCR04-
     A                                      66","error message file 4":"FSMESG"-
     A                                      ,"error message library 4":"*LIBL",-
     A                                      "error condition 4":{"fieldName":"8-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 5":"MC40157","-
     A                                      error message file 5":"FSMESG","err-
     A                                      or message library 5":"*LIBL","erro-
     A                                      r condition 5":{"fieldName":"86","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror message id 6":"MCR2397","error-
     A                                       message file 6":"FSMESG","error me-
     A                                      ssage library 6":"*LIBL","error con-
     A                                      dition 6":{"fieldName":"30","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 7":"MCR0676","error mess-
     A                                      age file 7":"FSMESG","error message-
     A                                       library 7":"*LIBL","error conditio-
     A                                      n 7":{"fieldName":"N37 and 38 and 3-
     A                                      9 and 40","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"F0363-
     A                                      FTN_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant16","field ty-
     A                                      pe":"output field","value":"To Date-
     A                                       of Service       :","css class":"c-
     A                                      onstant","left":"547px","cursor col-
     A                                      umn":"40","top":"310px","cursor row-
     A                                      ":"11","parent tab panel":"F0363FTN-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCTDAT","field type":"da-
     A                                      te field","css class":"input","css -
     A                                      class 2":"date-field","value":{"fie-
     A                                      ldName":"SCTDAT","designValue":"[SC-
     A                                      TDAT]","refField":"DT8","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-')
     A                                  1  2HTML('999.00","edtWrd":"''  /  /   -
     A                                       ''","dateFormat":"m/d/Y"},"text tr-
     A                                      ansform":"uppercase","left":"758px"-
     A                                      ,"cursor column":"67","top":"310px"-
     A                                      ,"cursor row":"11","width":"71px","-
     A                                      css class 3":{"fieldName":"N09 and -
     A                                      N46","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"46 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 4":-
     A                                      {"fieldName":"46 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"de-
     A                                      scription":"To Date of Service","er-
     A                                      ror message id":"MCR0500","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"07","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"3 messages","error message id 2":-
     A                                      "MC40307","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"28","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 3":"MCR2-
     A                                      397","error message file 3":"FSMESG-
     A                                      ","error message library 3":"*LIBL"-
     A                                      ,"error condition 3":{"fieldName":"-
     A                                      29","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"parent tab panel":"F0363FTN_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 5":"profound-converted"}-
     A                                      ,{"id":"constant17","field type":"o-
     A                                      utput field","value":"Revenue code/-
     A                                      DRG code :","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"330px","cursor row":"12","pa-
     A                                      rent tab panel":"F0363FTN_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCRVCD","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCRVCD"-
     A                                      ,"designValue":"[SCRVCD]","refField-
     A                                      ":"RVCD","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"449px","curso-
     A                                      r column":"26","top":"330px","curso-
     A                                      r row":"12","css class 3":{"fieldNa-
     A                                      me":"N09 and N46","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"46 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 4":{"fieldName":"46 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"N46","dataType":"expression","fo-
     A                                      rmatting":"Indicator"')
     A                                  1  2HTML(',"indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"set focus":{"fieldName":"34","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"error message id":"MCR2387","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"87","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"2 messages","error message -
     A                                      id 2":"MCR0503","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"88","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"parent tab panel":"-
     A                                      F0363FTN_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted","width":"25px"},{"id":"c-
     A                                      onstant18","field type":"output fie-
     A                                      ld","value":"Date Entered          -
     A                                         :","css class":"constant","left"-
     A                                      :"547px","cursor column":"40","top"-
     A                                      :"330px","cursor row":"12","parent -
     A                                      tab panel":"F0363FTN_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCED-
     A                                      AT","field type":"output field","va-
     A                                      lue":{"fieldName":"SCEDAT","designV-
     A                                      alue":"[SCEDAT]","refField":"DT8","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","edtWrd":"''  /  /    ''"},"css-
     A                                       class":"output-field","left":"736p-
     A                                      x","cursor column":"67","top":"330p-
     A                                      x","cursor row":"12","css class 2":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"parent t-
     A                                      ab panel":"F0363FTN_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant19","field type":"output field",-
     A                                      "value":"HCPCS/CPT4 - Mod      :","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"350px"-
     A                                      ,"cursor row":"13","parent tab pane-
     A                                      l":"F0363FTN_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCHCPC","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCHCPC","designValue-
     A                                      ":"[SCHCPC]","refField":"CPT4","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"449px","cursor column":"26-
     A                                      ","top":"350px","cursor row":"13","-
     A                                      css class 3":{"fieldName":"N09 and -
     A                                      N46","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"46 or 09","dataType":"expressio-
     A                                      n","formatting":"Indi')
     A                                  1  2HTML('cator","indFormat":"true / fa-
     A                                      lse"},"css class 4":{"fieldName":"4-
     A                                      6 or 09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"N46","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"set focus":-
     A                                      {"fieldName":"35","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage id":"MCR0503","error message f-
     A                                      ile":"FSMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"78","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"2 mes-
     A                                      sages","error message id 2":"MCR238-
     A                                      7","error message file 2":"FSMESG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"89-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"parent tab panel":"F0363FTN_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted","w-
     A                                      idth":"35px"},{"id":"constant20","f-
     A                                      ield type":"output field","value":"-
     A                                      -","css class":"constant","left":"4-
     A                                      91px","cursor column":"32","top":"3-
     A                                      50px","cursor row":"13","parent tab-
     A                                       panel":"F0363FTN_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCPMOD"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCPMOD","design-
     A                                      Value":"[SCPMOD]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase","dataLength"-
     A                                      :"2"},"text transform":"uppercase",-
     A                                      "left":"505px","cursor column":"34"-
     A                                      ,"top":"350px","cursor row":"13","w-
     A                                      idth":"15px","description":"Procedu-
     A                                      re Code Modifier","css class 3":{"f-
     A                                      ieldName":"N09 and N46","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"46 or 09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 4":{"fieldName":"46-
     A                                       or 09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"css class 5":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"set focus":{"-
     A                                      fieldName":"05","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"error messa-
     A                                      ge id":"MCR2434","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"15","dataType":"expression","-
     A                                      formatting":"Indicato')
     A                                  1  2HTML('r","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"F0363FTN_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 6":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t21","field type":"output field","v-
     A                                      alue":"Description           :","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"370px","-
     A                                      cursor row":"14","parent tab panel"-
     A                                      :"F0363FTN_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCCDDS","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCCDDS","designValue":-
     A                                      "[SCCDDS]","refField":"DS25","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"449px","cursor column":"26",-
     A                                      "top":"370px","cursor row":"14","cs-
     A                                      s class 3":{"fieldName":"N09 and N4-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"46 or 09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 4":{"-
     A                                      fieldName":"46 or 09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"06","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"79","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0676","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"37 and N38 and N39 and N40","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"p-
     A                                      arent tab panel":"F0363FTN_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 5":"profound-converted","width-
     A                                      ":"175px"},{"id":"constant22","fiel-
     A                                      d type":"output field","value":"Ser-
     A                                      vice units         :","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"F0363FTN-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCUNTS","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCUNTS","designValue":"[SCUNTS]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      ,"dataLength":"3","decPos":"0","num-
     A                                      BlankFill":"true"},"l')
     A                                  1  2HTML('eft":"449px","cursor column":-
     A                                      "26","top":"390px","cursor row":"15-
     A                                      ","width":"22px","text align":"righ-
     A                                      t","css class 3":{"fieldName":"N09 -
     A                                      and N46","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"46 or 09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       4":{"fieldName":"46 or 09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"set focus":{"fieldName":"36"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"error message id":"MCR0676-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"N37 and 3-
     A                                      8 and N39 and N40","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"F0-
     A                                      363FTN_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"constant23","field-
     A                                       type":"output field","value":"Tota-
     A                                      l charges         :","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"410px","cursor row"-
     A                                      :"16","parent tab panel":"F0363FTN_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCCHRG","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCCHRG","designValue":"[SCCHRG]",-
     A                                      "refField":"A92","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00"},"text transf-
     A                                      orm":"uppercase","left":"449px","cu-
     A                                      rsor column":"26","top":"410px","cu-
     A                                      rsor row":"16","width":"80px","css -
     A                                      class 3":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":"HI","error m-
     A                                      essage id":"MCR0556","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"80","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"3 m-
     A                                      essages","error message id 2":"MC40-
     A                                      116","error message f')
     A                                  1  2HTML('ile 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"58","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 3":"MCR0676","error message -
     A                                      file 3":"FSMESG","error message lib-
     A                                      rary 3":"*LIBL","error condition 3"-
     A                                      :{"fieldName":"N37 and N38 and 39 a-
     A                                      nd N40","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"F0363FT-
     A                                      N_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant24","field type-
     A                                      ":"output field","value":"Payment  -
     A                                                      :","css class":"con-
     A                                      stant","left":"561px","cursor colum-
     A                                      n":"42","top":"410px","cursor row":-
     A                                      "16","parent tab panel":"F0363FTN_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCPAID","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCPAID","designValue":"[SCPAID]","-
     A                                      refField":"A92","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00"},"text transfo-
     A                                      rm":"uppercase","left":"750px","cur-
     A                                      sor column":"69","top":"410px","cur-
     A                                      sor row":"16","width":"80px","css c-
     A                                      lass 3":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 4":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"error message id":"MC4-
     A                                      0116","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"58","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"MCR0676","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"N37 and N38 and-
     A                                       N39 and 40","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"parent tab panel":"F0-
     A                                      363FTN_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"SCHMR1","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCHMR1","designValue":"[SCHMR1-
     A                                      ]","refField":"DS10","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"')
     A                                  1  2HTML('none"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"430px","cursor row":"17-
     A                                      ","parent tab panel":"F0363FTN_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant25","field type":"out-
     A                                      put field","value":"amount        :-
     A                                      ","css class":"constant","left":"35-
     A                                      8px","cursor column":"13","top":"43-
     A                                      0px","cursor row":"17","parent tab -
     A                                      panel":"F0363FTN_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCMRA","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCMRA","designVal-
     A                                      ue":"[SCMRA]","refField":"A92","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"470px","cursor column":"29","to-
     A                                      p":"430px","cursor row":"17","width-
     A                                      ":"80px","css class 3":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"set foc-
     A                                      us":{"fieldName":"55","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message id":"MC40116","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"58","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"MC-
     A                                      R0676","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"37 and 38 and N39 and N40","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"F0363FTN_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"SC-
     A                                      HNTW","field type":"output field","-
     A                                      value":{"fieldName":"SCHNTW","desig-
     A                                      nValue":"[SCHNTW]","refField":"DS10-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"visibility":{"fieldName":"47","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"561px","cursor colu-
     A                                      mn":"42","top":"430px')
     A                                  1  2HTML('","cursor row":"17","parent t-
     A                                      ab panel":"F0363FTN_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant26","field type":"output field",-
     A                                      "value":"amount        :","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"47","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"638px"-
     A                                      ,"cursor column":"53","top":"430px"-
     A                                      ,"cursor row":"17","parent tab pane-
     A                                      l":"F0363FTN_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCNTWK","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCNTWK","designValue-
     A                                      ":"[SCNTWK]","refField":"A92","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00"}-
     A                                      ,"text transform":"uppercase","visi-
     A                                      bility":{"fieldName":"47","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"left":"750px","cursor column":"6-
     A                                      9","top":"430px","cursor row":"17",-
     A                                      "width":"80px","css class 3":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"e-
     A                                      rror message id":"MC40116","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"58","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0676","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"N37 and 38 and 39 and N40","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"p-
     A                                      arent tab panel":"F0363FTN_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"SCHO11","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCHO11","d-
     A                                      esignValue":"[SCHO11]","refField":"-
     A                                      DS10","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"450px","cursor row":"18-
     A                                      ","parent tab panel":"F0363FTN_SCR0-
     A                                      1_MainTabPanel","pare')
     A                                  1  2HTML('nt tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      7","field type":"output field","val-
     A                                      ue":"amount        :","css class":"-
     A                                      constant","left":"358px","cursor co-
     A                                      lumn":"13","top":"450px","cursor ro-
     A                                      w":"18","parent tab panel":"F0363FT-
     A                                      N_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCOTHR","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCOTHR","designValue":"[SCOTHR]-
     A                                      ","refField":"A92","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"text tran-
     A                                      sform":"uppercase","left":"470px","-
     A                                      cursor column":"29","top":"450px","-
     A                                      cursor row":"18","width":"80px","cs-
     A                                      s class 3":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 4":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"error message id":"-
     A                                      MC40116","error message file":"FSME-
     A                                      SG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"58-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"2 messages","er-
     A                                      ror message id 2":"MCR0676","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"N37 and N38 -
     A                                      and 39 and 40","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"parent tab panel":"-
     A                                      F0363FTN_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"SCHO12","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCHO12","designValue":"[SCHO-
     A                                      12]","refField":"DS10","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"561px-
     A                                      ","cursor column":"42","top":"450px-
     A                                      ","cursor row":"18","parent tab pan-
     A                                      el":"F0363FTN_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"constant28"-
     A                                      ,"field type":"output field","value-
     A                                      ":"type code     :","css class":"co-
     A                                      nstant","left":"638px","cursor colu-
     A                                      mn":"53","top":"450px","cursor row"-
     A                                      :"18","parent tab panel":"F0363FTN_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"prof')
     A                                  1  2HTML('ound-converted"},{"id":"SCOT1-
     A                                      C","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCOT1C","desi-
     A                                      gnValue":"[SCOT1C]","refField":"COD-
     A                                      E3","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"750px","cursor col-
     A                                      umn":"69","top":"450px","cursor row-
     A                                      ":"18","css class 3":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"set focus-
     A                                      ":{"fieldName":"48","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"MC40072","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"81","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"2 m-
     A                                      essages","error message id 2":"MCR0-
     A                                      513","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      82","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"parent tab panel":"F0363FTN_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted",-
     A                                      "width":"25px"},{"id":"SCHO21","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCHO21","designValue":"[-
     A                                      SCHO21]","refField":"DS10","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"2-
     A                                      81px","cursor column":"2","top":"47-
     A                                      0px","cursor row":"19","parent tab -
     A                                      panel":"F0363FTN_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      29","field type":"output field","va-
     A                                      lue":"amount        :","css class":-
     A                                      "constant","left":"358px","cursor c-
     A                                      olumn":"13","top":"470px","cursor r-
     A                                      ow":"19","parent tab panel":"F0363F-
     A                                      TN_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCOTH2","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCOTH2","designValue":"[SCOTH2-
     A                                      ]","refField":"A92","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBala')
     A                                  1  2HTML('nce":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00"},"text transform":"upperc-
     A                                      ase","left":"470px","cursor column"-
     A                                      :"29","top":"470px","cursor row":"1-
     A                                      9","width":"80px","css class 3":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 4":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"set focus":{"fieldName":"49","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"error message id":"MC40116","er-
     A                                      ror message file":"FSMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"58","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"2 messages","error message -
     A                                      id 2":"MCR0676","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"37 and N38 and N39 and 4-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"parent tab panel":"F0363FTN_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted"},-
     A                                      {"id":"SCHO22","field type":"output-
     A                                       field","value":{"fieldName":"SCHO2-
     A                                      2","designValue":"[SCHO22]","refFie-
     A                                      ld":"DS10","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"561px","cursor co-
     A                                      lumn":"42","top":"470px","cursor ro-
     A                                      w":"19","parent tab panel":"F0363FT-
     A                                      N_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant30","field type-
     A                                      ":"output field","value":"type code-
     A                                           :","css class":"constant","lef-
     A                                      t":"638px","cursor column":"53","to-
     A                                      p":"470px","cursor row":"19","paren-
     A                                      t tab panel":"F0363FTN_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      OT2C","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCOT2C","d-
     A                                      esignValue":"[SCOT2C]","refField":"-
     A                                      CODE3","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase"},"text transform":-
     A                                      "uppercase","left":"750px","cursor -
     A                                      column":"69","top":"470px","cursor -
     A                                      row":"19","css class 3":{"fieldName-
     A                                      ":"N09","dataType":"e')
     A                                  1  2HTML('xpression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"set focus":{"fieldNam-
     A                                      e":"50","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"error message id":"-
     A                                      MC40072","error message file":"FSME-
     A                                      SG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"83-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"2 messages","er-
     A                                      ror message id 2":"MCR0513","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"84","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"F0363FTN_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted","width":"25p-
     A                                      x"},{"id":"constant32","field type"-
     A                                      :"output field","value":"Rule      -
     A                                                     :","css class":"cons-
     A                                      tant","visibility":{"fieldName":"56-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"280px","cursor-
     A                                       column":"65","top":"490px","cursor-
     A                                       row":"21","parent tab panel":"F036-
     A                                      3FTN_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted","width":"150px"},{"id":"SCRU-
     A                                      LE","field type":"output field","va-
     A                                      lue":{"fieldName":"SCRULE","designV-
     A                                      alue":"[SCRULE]","refField":"A90","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00"},"css class":"output-field","vi-
     A                                      sibility":{"fieldName":"56","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"470px","cursor column":-
     A                                      "71","top":"490px","cursor row":"21-
     A                                      ","parent tab panel":"F0363FTN_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant35","field type":"out-
     A                                      put field","value":" ","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"09 and 43","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      1px","cursor column":"2","top":"530-
     A                                      px","cursor row":"22","css class 2"-
     A                                      :"BLU","parent tab panel":"F0363FTN-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"pro')
     A                                  1  2HTML('found-converted"},{"id":"cons-
     A                                      tant34","field type":"output field"-
     A                                      ,"value":" ","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"N09 and-
     A                                       N43","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"281px","cu-
     A                                      rsor column":"2","top":"530px","cur-
     A                                      sor row":"22","css class 2":"BLU","-
     A                                      parent tab panel":"F0363FTN_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant33","field type":"output-
     A                                       field","value":" ","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      N09 and 43","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"281p-
     A                                      x","cursor column":"2","top":"530px-
     A                                      ","cursor row":"22","css class 2":"-
     A                                      BLU","parent tab panel":"F0363FTN_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant36","field type":"-
     A                                      output field","value":" ","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"N09 and 43","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "550px","cursor row":"23","css clas-
     A                                      s 2":"BLU","parent tab panel":"F036-
     A                                      3FTN_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant38","field t-
     A                                      ype":"output field","value":" ","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"09 and N43","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"550px","cursor row":"23","cs-
     A                                      s class 2":"BLU","parent tab panel"-
     A                                      :"F0363FTN_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant37","f-
     A                                      ield type":"output field","value":"-
     A                                       ","css class":"constant","visibili-
     A                                      ty":{"fieldName":"N09 and N43","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"281px","cursor colum-
     A                                      n":"2","top":"550px","cursor row":"-
     A                                      23","css class 2":"BLU","parent tab-
     A                                       panel":"F0363FTN_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t39","field type":"output field","v-
     A                                      alue":"             ","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"70","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"281px","cu-
     A                                      rsor column":"2","top":"570px","cur-
     A                                      sor row":"24","parent tab panel":"F-
     A                                      0363FTN_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class"')
     A                                  1  2HTML(':"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      01","field type":"button","visibili-
     A                                      ty":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      value":"Repeat","shortcut key":"F1"-
     A                                      ,"left":"14px","top":"183px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF02",-
     A                                      "field type":"button","visibility":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"valu-
     A                                      e":"Process","shortcut key":"F2","l-
     A                                      eft":"14px","top":"216px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF05","fi-
     A                                      eld type":"button","visibility":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"value":-
     A                                      "Refresh","shortcut key":"F5","left-
     A                                      ":"14px","top":"249px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF07","field-
     A                                       type":"button","visibility":{"fiel-
     A                                      dName":"N09 and 43 or N09 and N43 o-
     A                                      r 09 and 43 or 09 and N43","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Header Info","shortcut -
     A                                      key":"F7","left":"14px","top":"282p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF09","field type":"button","vis-
     A                                      ibility":{"fieldName":"43","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Code info","shortcut ke-
     A                                      y":"F9","left":"14px","top":"315px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF10","field type":"button","visib-
     A                                      ility":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"value":"Search","shortcut key":"-
     A                                      F10","left":"14px","top":"348px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      11","field type":"button","visibili-
     A                                      ty":{"fieldName":"43","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"v-
     A                                      alue":"EOB/Notes","shortcut key":"F-
     A                                      11","left":"14px","top":"381px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","visibilit-
     A                                      y":{"fieldName":"09 and 43 or N09 a-
     A                                      nd 43 or N09 and N43 or 09 and N43"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"value":"')
     A                                  1  2HTML('Cancel","shortcut key":"F12",-
     A                                      "left":"14px","top":"414px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF14","-
     A                                      field type":"button","visibility":{-
     A                                      "fieldName":"09 and 43 or N09 and 4-
     A                                      3 or N09 and N43 or 09 and N43","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"value":"DART","shortcut ke-
     A                                      y":"F14","left":"14px","top":"447px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF15","field type":"button","visi-
     A                                      bility":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Display lines","shortcu-
     A                                      t key":"F15","left":"14px","top":"4-
     A                                      80px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"constant42","field type":"output-
     A                                       field","css class":"constant","val-
     A                                      ue":"EOB codes:","cursor row":"21",-
     A                                      "cursor column":"37","left":"280px"-
     A                                      ,"top":"510px","css class 2":"profo-
     A                                      und-converted","visibility":{"field-
     A                                      Name":"59 or 09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"parent-
     A                                       tab panel":"F0363FTN_SCR01_MainTab-
     A                                      Panel","parent tab":"0"},{"id":"SCE-
     A                                      OB1","field type":"output field","c-
     A                                      ss class":"output-field","value":{"-
     A                                      fieldName":"SCEOB1","trimLeading":"-
     A                                      true","trimTrailing":"false","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","textTransform":"uppercase"-
     A                                      ,"designValue":"[SCEOB1]","refField-
     A                                      ":"CODE3","keywords":[]},"cursor ro-
     A                                      w":"21","cursor column":"48","left"-
     A                                      :"360px","top":"510px","width":"46P-
     A                                      X","css class 2":"profound-converte-
     A                                      d","visibility":{"fieldName":"59 or-
     A                                       09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"parent tab panel":-
     A                                      "F0363FTN_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0"},{"id":"SCEOB2","field -
     A                                      type":"output field","css class":"o-
     A                                      utput-field","value":{"fieldName":"-
     A                                      SCEOB2","trimLeading":"true","trimT-
     A                                      railing":"false","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      reference","formatting":"Text","tex-
     A                                      tTransform":"uppercase","designValu-
     A                                      e":"[SCEOB2]","refField":"CODE3","k-
     A                                      eywords":[]},"cursor row":"21","cur-
     A                                      sor column":"52","left":"410px","to-
     A                                      p":"510px","width":"46PX","css clas-
     A                                      s 2":"profound-converted","visibili-
     A                                      ty":{"fieldName":"59 or 09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"parent tab panel":"F0363FTN_SC-
     A                                      R01_MainTabPanel","parent tab":"0"}-
     A                                      ,{"id":"SCEOB3","field type":"outpu-
     A                                      t field","css class":')
     A                                  1  2HTML('"output-field","value":{"fiel-
     A                                      dName":"SCEOB3","trimLeading":"true-
     A                                      ","trimTrailing":"false","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","textTransform":"uppercase","de-
     A                                      signValue":"[SCEOB3]","refField":"C-
     A                                      ODE3","keywords":[]},"cursor row":"-
     A                                      21","cursor column":"56","left":"46-
     A                                      0px","top":"510px","width":"46PX","-
     A                                      css class 2":"profound-converted","-
     A                                      visibility":{"fieldName":"59 or 09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"parent tab panel":"F03-
     A                                      63FTN_SCR01_MainTabPanel","parent t-
     A                                      ab":"0"},{"id":"SCEOB4","field type-
     A                                      ":"output field","css class":"outpu-
     A                                      t-field","value":{"fieldName":"SCEO-
     A                                      B4","trimLeading":"true","trimTrail-
     A                                      ing":"false","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"refe-
     A                                      rence","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [SCEOB4]","refField":"CODE3","keywo-
     A                                      rds":[]},"cursor row":"21","cursor -
     A                                      column":"60","left":"510px","top":"-
     A                                      510px","width":"46PX","css class 2"-
     A                                      :"profound-converted","visibility":-
     A                                      {"fieldName":"59 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "parent tab panel":"F0363FTN_SCR01_-
     A                                      MainTabPanel","parent tab":"0"},{"i-
     A                                      d":"SCEOB5","field type":"output fi-
     A                                      eld","css class":"output-field","va-
     A                                      lue":{"fieldName":"SCEOB5","dataLen-
     A                                      gth":"6","trimLeading":"true","trim-
     A                                      Trailing":"false","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [SCEOB5]"},"cursor row":"21","curso-
     A                                      r column":"60","left":"560px","top"-
     A                                      :"510px","width":"46PX","css class -
     A                                      2":"profound-converted","visibility-
     A                                      ":{"fieldName":"59 or 09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"visible / hidden"-
     A                                      },"parent tab panel":"F0363FTN_SCR0-
     A                                      1_MainTabPanel","parent tab":"0"},{-
     A                                      "id":"SCEOB6","field type":"output -
     A                                      field","css class":"output-field","-
     A                                      value":{"fieldName":"SCEOB6","dataL-
     A                                      ength":"6","trimLeading":"true","tr-
     A                                      imTrailing":"false","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"uppercase","designValue"-
     A                                      :"[SCEOB6]"},"cursor row":"21","cur-
     A                                      sor column":"60","left":"610px","to-
     A                                      p":"510px","width":"46PX","css clas-
     A                                      s 2":"profound-converted","visibili-
     A                                      ty":{"fieldName":"59 or 09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"parent tab panel":"F0363FTN_SC-
     A                                      R01_MainTabPanel","parent tab":"0"}-
     A                                      ,{"id":"SCEOB7","field type":"outpu-
     A                                      t field","css class":"output-field"-
     A                                      ,"value":{"fieldName":"SCEOB7","dat-
     A                                      aLength":"6","trimLea')
     A                                  1  2HTML('ding":"true","trimTrailing":"-
     A                                      false","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"up-
     A                                      percase","designValue":"[SCEOB7]"},-
     A                                      "cursor row":"21","cursor column":"-
     A                                      60","left":"660px","top":"510px","w-
     A                                      idth":"46PX","css class 2":"profoun-
     A                                      d-converted","visibility":{"fieldNa-
     A                                      me":"59 or 09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"parent t-
     A                                      ab panel":"F0363FTN_SCR01_MainTabPa-
     A                                      nel","parent tab":"0"},{"id":"SCEOB-
     A                                      8","field type":"output field","css-
     A                                       class":"output-field","value":{"fi-
     A                                      eldName":"SCEOB8","dataLength":"6",-
     A                                      "trimLeading":"true","trimTrailing"-
     A                                      :"false","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      uppercase","designValue":"[SCEOB8]"-
     A                                      },"cursor row":"21","cursor column"-
     A                                      :"60","left":"710px","top":"510px",-
     A                                      "width":"46PX","css class 2":"profo-
     A                                      und-converted","visibility":{"field-
     A                                      Name":"59 or 09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"parent-
     A                                       tab panel":"F0363FTN_SCR01_MainTab-
     A                                      Panel","parent tab":"0"},{"id":"SCE-
     A                                      OB9","field type":"output field","c-
     A                                      ss class":"output-field","value":{"-
     A                                      fieldName":"SCEOB9","dataLength":"6-
     A                                      ","trimLeading":"true","trimTrailin-
     A                                      g":"false","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"uppercase","designValue":"[SCEOB9-
     A                                      ]"},"cursor row":"21","cursor colum-
     A                                      n":"60","left":"760px","top":"510px-
     A                                      ","width":"46PX","css class 2":"pro-
     A                                      found-converted","visibility":{"fie-
     A                                      ldName":"59 or 09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"pare-
     A                                      nt tab panel":"F0363FTN_SCR01_MainT-
     A                                      abPanel","parent tab":"0"},{"id":"S-
     A                                      CEOB10","field type":"output field"-
     A                                      ,"css class":"output-field","value"-
     A                                      :{"fieldName":"SCEOB10","dataLength-
     A                                      ":"6","trimLeading":"true","trimTra-
     A                                      iling":"false","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SC-
     A                                      EOB10]"},"cursor row":"21","cursor -
     A                                      column":"60","left":"810px","top":"-
     A                                      510px","width":"46PX","css class 2"-
     A                                      :"profound-converted","visibility":-
     A                                      {"fieldName":"59 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "parent tab panel":"F0363FTN_SCR01_-
     A                                      MainTabPanel","parent tab":"0"},{"i-
     A                                      d":"SCEOB11","field type":"output f-
     A                                      ield","css class":"output-field","v-
     A                                      alue":{"fieldName":"SCEOB11","dataL-
     A                                      ength":"6","trimLeading":"true","tr-
     A                                      imTrailing":"false","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting"')
     A                                  1  2HTML(':"Text","textTransform":"uppe-
     A                                      rcase","designValue":"[SCEOB11]"},"-
     A                                      cursor row":"21","cursor column":"6-
     A                                      0","left":"860px","top":"510px","wi-
     A                                      dth":"46PX","css class 2":"profound-
     A                                      -converted","visibility":{"fieldNam-
     A                                      e":"59 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"parent ta-
     A                                      b panel":"F0363FTN_SCR01_MainTabPan-
     A                                      el","parent tab":"0"},{"id":"SCEOB1-
     A                                      2","field type":"output field","css-
     A                                       class":"output-field","value":{"fi-
     A                                      eldName":"SCEOB12","dataLength":"6"-
     A                                      ,"trimLeading":"true","trimTrailing-
     A                                      ":"false","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "uppercase","designValue":"[SCEOB12-
     A                                      ]"},"cursor row":"21","cursor colum-
     A                                      n":"60","left":"910px","top":"510px-
     A                                      ","width":"46PX","css class 2":"pro-
     A                                      found-converted","visibility":{"fie-
     A                                      ldName":"59 or 09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"pare-
     A                                      nt tab panel":"F0363FTN_SCR01_MainT-
     A                                      abPanel","parent tab":"0"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB10        6A  H
     A            SCEOB11        6A  H
     A            SCEOB12        6A  H
     A            SCEOB5         6A  H
     A            SCEOB6         6A  H
     A            SCEOB7         6A  H
     A            SCEOB8         6A  H
     A            SCEOB9         6A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         74A  H
     A            SCPMOD         2A  H
     A            SCPOS          2S 0H
     A            SCUNTS         3S 0H
     A            SCZIPB         3A  H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCDDS    R        H      REFFLD(DS25)
     A            SCCHRG    R        H      REFFLD(A92)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCSCD    R        H      REFFLD(CODE3)
     A            SCCSDS    R        H      REFFLD(DS25)
     A            SCEDAT    R        H      REFFLD(DT8)
     A            SCEOB#    R        H      REFFLD(EOB#)
     A            SCEOB1    R        H      REFFLD(CODE3)
     A            SCEOB2    R        H      REFFLD(CODE3)
     A            SCEOB3    R        H      REFFLD(CODE3)
     A            SCEOB4    R        H      REFFLD(CODE3)
     A            SCFDAT    R        H      REFFLD(DT8)
     A            SCHCPC    R        H      REFFLD(CPT4)
     A            SCHMR1    R        H      REFFLD(DS10)
     A            SCHNTW    R        H      REFFLD(DS10)
     A            SCHO11    R        H      REFFLD(DS10)
     A            SCHO12    R        H      REFFLD(DS10)
     A            SCHO21    R        H      REFFLD(DS10)
     A            SCHO22    R        H      REFFLD(DS10)
     A            SCLIN#    R        H      REFFLD(A90)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A92)
     A            SCNTWK    R        H      REFFLD(A92)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOT1C    R        H      REFFLD(CODE3)
     A            SCOT2C    R        H      REFFLD(CODE3)
     A            SCOTH2    R        H      REFFLD(A92)
     A            SCOTHR    R        H      REFFLD(A92)
     A            SCPAID    R        H      REFFLD(A92)
     A            SCPODS    R        H      REFFLD(DS30)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRULE    R        H      REFFLD(A90)
     A            SCRVCD    R        H      REFFLD(RVCD)
     A            SCSEQ#    R        H      REFFLD(SEQ#)
     A            SCTDAT    R        H      REFFLD(DT8)
     A            SCTOTC    R        H      REFFLD(A92)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C5    SCEDIC7    MCR05-
     A                                      03C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     17RERRMSGID  5    C5    SCE-
     A                                      DIC7    MCR0999C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     18')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN1-
     A                                      7","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-10"},"items":[{"i-
     A                                      d":"SCR02_HREC","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HREC","designValu-
     A                                      e":"[HREC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCR02","field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      m Dialog","text align":"center","le-
     A                                      ft":"5px","top":"5px","height":"370-
     A                                      px","width":"324px","z index":"8","-
     A                                      locked in place":"true"},{"id":"con-
     A                                      stant40","field type":"output field-
     A                                      ","value":"****** ERROR ******","cs-
     A                                      s class":"constant","left":"85px","-
     A                                      cursor column":"10","top":"65px","c-
     A                                      ursor row":"1","css class 2":"profo-
     A                                      und-converted"},{"id":"constant41",-
     A                                      "field type":"output field","value"-
     A                                      :"You have marked the data submissi-
     A                                      on","css class":"constant","left":"-
     A                                      29px","cursor column":"2","top":"85-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt42","field type":"output field","-
     A                                      value":"flag.  The Date of Service -
     A                                      is a","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      105px","cursor row":"3","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant43","field type":"output field-
     A                                      ","value":"future date and disquali-
     A                                      fies this","css class":"constant","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"125px","cursor row":"4","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant44","field')
     A                                  1  2HTML(' type":"output field","value"-
     A                                      :"claim for data submission.  Pleas-
     A                                      e","css class":"constant","left":"2-
     A                                      9px","cursor column":"2","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt45","field type":"output field","-
     A                                      value":"correct the flag.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant46","fiel-
     A                                      d type":"output field","value":"Eli-
     A                                      gible for Data Submission:","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"205px","curso-
     A                                      r row":"8","css class 2":"profound--
     A                                      converted"},{"id":"SCEDI","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCEDI","designValue":"[SC-
     A                                      EDI]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"239px","cursor column":"32","top"-
     A                                      :"205px","cursor row":"8","css clas-
     A                                      s 3":"HI","set focus":{"fieldName":-
     A                                      "17 or 18","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"MCR0503","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "17","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"2 messages",-
     A                                      "error message id 2":"MCR0999","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"18","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 4":"profound-converted","widt-
     A                                      h":"25px"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"330px","width":"80px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF12","field type":"but-
     A                                      ton","value":"Cancel","shortcut key-
     A                                      ":"F12","left":"104px","top":"330px-
     A                                      ","width":"80px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCEDI     R        H      REFFLD(FLAG)
     A          R SCR03
     A  08 10 11
     A  12 13 21
     A  22 23 25                            CA01(08 'Response Indicator *IN08')
     A  26 27 19
     A  20                                  CA02(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(12 'Response Indicator *IN12')
     A                                      SETOF(13 'Response Indicator *IN13')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC26   RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C6    SCCRDTC7    MC40-
     A                                      144C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     19 26RERRMSGID  5    C6   -
     A                                       SCCRDTC7    MCR0500C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     19 21RERR-
     A                                      MSGID  5    C6    SCCRDTC7    MCR05-
     A                                      56C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     19 10RERRMSGID  5    C6    -
     A                                      SCCRDTC7    MC40056C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     19 22RERRM-
     A                                      SGID  5    C6    SCCRDTC7    MC4014-
     A                                      5C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     19 23RERRMSGID  5    C6    S-
     A                                      CCRDTC7    MCR2397C6    FSMESGC5   -
     A                                       *LIBLC0    E1    6     19 25RERRMS-
     A                                      GID  5    C6    SCRRDTC7    MC40144-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      6     20 26RERRMSGID  5    C6    SC-
     A                                      RRDTC7    MCR0500C6    FSMESGC5    -
     A                                      *LIBLC0    E1    6     20 21RERRMSG-
     A                                      ID  5    C6    SCRRDTC7    MCR0556C-
     A                                      6    FSMESGC5    *LIBLC0    E1    6-
     A                                           20 10RERRMSGID  5    C6    SCR-
     A                                      RDTC7    MC40056C6    FSMESGC5    *-
     A                                      LIBLC0    E1    6     20 22RERRMSGI-
     A                                      D  5    C6    SCRRDTC7    MC40145C6-
     A                                          FSMESGC5    *LIBLC0    E1    6 -
     A                                          20 23RERRMSGID  5    C6    SCRR-
     A                                      DTC7    MCR2397C6    FSMESGC5    *L-
     A                                      IBLC0    E1    6     20 25RERRMSGID-
     A                                        5    C6    SCCSDTC7    MCR0500C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         19 21RERRMSGID  5    C6    SCCSD-
     A                                      TC7    MC40202C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     19 08RERRMSGID -
     A                                       5    C6    SCCSDTC7    MC40056C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        19 13RERRMSGID  5    C6    SCCSDT-
     A                                      C7    MC40145C6    FSMESGC5    *LIB-
     A                                      LC0    E1    6     19 12RERRMSGID  -
     A                                      5    C6    SCCSDTC7    MCR2397C6   -
     A                                       FSMESGC5    *LIBLC0    E1    6    -
     A                                       19 11RERRMSGID  5    C6    SCCSDTC-
     A                                      7    MCR0500C6    FSMESGC5    *LIBL-
     A                                      C0    E1    6     19 27RERRMSGID  5-
     A                                          C6    SCRSDTC7    MCR0500C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      20 21RERRMSGID  5    C6    SCRSDTC7-
     A                                          MC40202C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     20 08RERRMSGID  5 -
     A                                         C6    SCRSDTC7    MC40056C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     2-
     A                                      0 13RERRMSGID  5    C6    SCRSDTC7 -
     A                                         MC40145C6    FSMESGC5    *LIBLC0-
     A                                          E1    6     20 12RERRMSGID  5  -
     A                                        C6    SCRSDTC7    MCR2397C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     20-
     A                                       11RERRMSGID  5    C6    SCRSDTC7  -
     A                                        MCR0500C6    FSMESGC5    *LIBLC0 -
     A                                         E1    6     20 27')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN0-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN10",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 3":{"fieldName":"*IN11","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 4":{"fieldName":"*IN12","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 5":{"fieldName":"*IN13","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 6-
     A                                      ":{"fieldName":"*IN21","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 7":{-
     A                                      "fieldName":"*IN22","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 8":{"fi-
     A                                      eldName":"*IN23","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 9":{"field-
     A                                      Name":"*IN25","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 10":{"fieldNa-
     A                                      me":"*IN26","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 11":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-10"},"i-
     A                                      tems":[{"id":"SCR03_HREC","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"HREC","-
     A                                      designValue":"[HREC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCR03_HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR03"-
     A                                      ,"field type":"panel","panel style"-
     A                                      :"Transform Dialog","text align":"c-
     A                                      enter","left":"5px","top":"5px","he-
     A                                      ight":"370px","width"')
     A                                  1  2HTML(':"324px","z index":"8","locke-
     A                                      d in place":"true"},{"id":"constant-
     A                                      47","field type":"output field","va-
     A                                      lue":"****** ERROR ******","css cla-
     A                                      ss":"constant","left":"85px","curso-
     A                                      r column":"10","top":"65px","cursor-
     A                                       row":"1","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant52","fiel-
     A                                      d type":"output field","value":"Dat-
     A                                      e Recon rcvd/sent must be greater",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "85px","cursor row":"2","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant48","field type":"output field-
     A                                      ","value":"Date Bill rcvd/sent must-
     A                                       be greater","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"19","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"29px","cursor colum-
     A                                      n":"2","top":"85px","cursor row":"2-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant53","field type":-
     A                                      "output field","value":"than or equ-
     A                                      al to \"To date of Service\".","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      9px","cursor column":"2","top":"105-
     A                                      px","cursor row":"3","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt49","field type":"output field","-
     A                                      value":"than or equal to \"To date -
     A                                      of Service\".","css class":"constan-
     A                                      t","visibility":{"fieldName":"19","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"29px","cursor col-
     A                                      umn":"2","top":"105px","cursor row"-
     A                                      :"3","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant54","field typ-
     A                                      e":"output field","value":"Date rec-
     A                                      on rcvd by carrier: ","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"20","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"29px","cur-
     A                                      sor column":"2","top":"145px","curs-
     A                                      or row":"5","css class 2":"profound-
     A                                      -converted"},{"id":"constant50","fi-
     A                                      eld type":"output field","value":"D-
     A                                      ate bill rcvd by carrier: ","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"19","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"29px-
     A                                      ","cursor column":"2","top":"145px"-
     A                                      ,"cursor row":"5","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCRDT","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCCRDT","de-
     A                                      signValue":"[SCCRDT]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units"')
     A                                  1  2HTML(':"","negNum":"-999.00","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"text transform":"uppercase"-
     A                                      ,"visibility":{"fieldName":"19","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"225px","cursor colu-
     A                                      mn":"30","top":"145px","cursor row"-
     A                                      :"5","width":"71px","css class 3":{-
     A                                      "fieldName":"19","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"error mes-
     A                                      sage id":"MC40144","error message f-
     A                                      ile":"FSMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"19 and 26","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"6 messages","error message id 2":-
     A                                      "MCR0500","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"19 and 21","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error message id 3-
     A                                      ":"MCR0556","error message file 3":-
     A                                      "FSMESG","error message library 3":-
     A                                      "*LIBL","error condition 3":{"field-
     A                                      Name":"19 and 10","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       4":"MC40056","error message file 4-
     A                                      ":"FSMESG","error message library 4-
     A                                      ":"*LIBL","error condition 4":{"fie-
     A                                      ldName":"19 and 22","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 5":"MC40145","error message file-
     A                                       5":"FSMESG","error message library-
     A                                       5":"*LIBL","error condition 5":{"f-
     A                                      ieldName":"19 and 23","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 6":"MCR2397","error message fi-
     A                                      le 6":"FSMESG","error message libra-
     A                                      ry 6":"*LIBL","error condition 6":{-
     A                                      "fieldName":"19 and 25","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"css class -
     A                                      4":"profound-converted"},{"id":"SCR-
     A                                      RDT","field type":"date field","css-
     A                                       class":"input","css class 2":"date-
     A                                      -field","value":{"fieldName":"SCRRD-
     A                                      T","designValue":"[SCRRDT]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00","edtWrd":"''  /  /  -
     A                                        ''","dateFormat":"m/d/Y"},"text t-
     A                                      ransform":"uppercase","visibility":-
     A                                      {"fieldName":"20","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"254px","cursor column":"31","top"-
     A                                      :"145px","cursor row":"5","width":"-
     A                                      71px","css class 3":{"fieldName":"2-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"error mes')
     A                                  1  2HTML('sage id":"MC40144","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"20 and 26","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"6 messages","error message -
     A                                      id 2":"MCR0500","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"20 and 21","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 3":"MCR0556","error message fi-
     A                                      le 3":"FSMESG","error message libra-
     A                                      ry 3":"*LIBL","error condition 3":{-
     A                                      "fieldName":"20 and 10","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 4":"MC40056","error message -
     A                                      file 4":"FSMESG","error message lib-
     A                                      rary 4":"*LIBL","error condition 4"-
     A                                      :{"fieldName":"20 and 22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 5":"MC40145","error messag-
     A                                      e file 5":"FSMESG","error message l-
     A                                      ibrary 5":"*LIBL","error condition -
     A                                      5":{"fieldName":"20 and 23","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 6":"MCR2397","error mess-
     A                                      age file 6":"FSMESG","error message-
     A                                       library 6":"*LIBL","error conditio-
     A                                      n 6":{"fieldName":"20 and 25","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"constant51","field type":"output-
     A                                       field","value":"Date bill sent to -
     A                                      carrier: ","css class":"constant","-
     A                                      visibility":{"fieldName":"19","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"29px","cursor column"-
     A                                      :"2","top":"185px","cursor row":"7"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant55","field type":"-
     A                                      output field","value":"Date recon s-
     A                                      ent to carrier:","css class":"const-
     A                                      ant","visibility":{"fieldName":"20"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"29px","cursor c-
     A                                      olumn":"2","top":"185px","cursor ro-
     A                                      w":"7","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCCSDT","field type"-
     A                                      :"date field","css class":"input","-
     A                                      css class 2":"date-field","value":{-
     A                                      "fieldName":"SCCSDT","designValue":-
     A                                      "[SCCSDT]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"-999.00","e-
     A                                      dtWrd":"''  /  /    ''","dateFormat-
     A                                      ":"m/d/Y"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"19"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"225px","cursor -
     A                                      column":"30","top":"1')
     A                                  1  2HTML('85px","cursor row":"7","width-
     A                                      ":"71px","css class 3":{"fieldName"-
     A                                      :"19","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"error message id":"M-
     A                                      CR0500","error message file":"FSMES-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"19 -
     A                                      and 21","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"6 message-
     A                                      s","error message id 2":"MC40202","-
     A                                      error message file 2":"FSMESG","err-
     A                                      or message library 2":"*LIBL","erro-
     A                                      r condition 2":{"fieldName":"19 and-
     A                                       08","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 3":"MC40056"-
     A                                      ,"error message file 3":"FSMESG","e-
     A                                      rror message library 3":"*LIBL","er-
     A                                      ror condition 3":{"fieldName":"19 a-
     A                                      nd 13","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 4":"MC4014-
     A                                      5","error message file 4":"FSMESG",-
     A                                      "error message library 4":"*LIBL","-
     A                                      error condition 4":{"fieldName":"19-
     A                                       and 12","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 5":"MCR2-
     A                                      397","error message file 5":"FSMESG-
     A                                      ","error message library 5":"*LIBL"-
     A                                      ,"error condition 5":{"fieldName":"-
     A                                      19 and 11","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 6":"MC-
     A                                      R0500","error message file 6":"FSME-
     A                                      SG","error message library 6":"*LIB-
     A                                      L","error condition 6":{"fieldName"-
     A                                      :"19 and 27","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"css class 4":"profoun-
     A                                      d-converted"},{"id":"SCRSDT","field-
     A                                       type":"date field","css class":"in-
     A                                      put","css class 2":"date-field","va-
     A                                      lue":{"fieldName":"SCRSDT","designV-
     A                                      alue":"[SCRSDT]","refField":"DT8","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","edtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"text transform":"-
     A                                      uppercase","visibility":{"fieldName-
     A                                      ":"20","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"254px","c-
     A                                      ursor column":"31","top":"185px","c-
     A                                      ursor row":"7","width":"71px","css -
     A                                      class 3":{"fieldName":"20","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "error message id":"MCR0500","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"20 and 21","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"6 messages","error mess-
     A                                      age id 2":"MC40202","')
     A                                  1  2HTML('error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      20 and 08","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 3":"MC-
     A                                      40056","error message file 3":"FSME-
     A                                      SG","error message library 3":"*LIB-
     A                                      L","error condition 3":{"fieldName"-
     A                                      :"20 and 13","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 4":"-
     A                                      MC40145","error message file 4":"FS-
     A                                      MESG","error message library 4":"*L-
     A                                      IBL","error condition 4":{"fieldNam-
     A                                      e":"20 and 12","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 5"-
     A                                      :"MCR2397","error message file 5":"-
     A                                      FSMESG","error message library 5":"-
     A                                      *LIBL","error condition 5":{"fieldN-
     A                                      ame":"20 and 11","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      6":"MCR0500","error message file 6"-
     A                                      :"FSMESG","error message library 6"-
     A                                      :"*LIBL","error condition 6":{"fiel-
     A                                      dName":"20 and 27","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"css class 4":"p-
     A                                      rofound-converted"},{"id":"btnSubmi-
     A                                      t","field type":"button","value":"E-
     A                                      nter","shortcut key":"Enter","left"-
     A                                      :"14px","top":"330px","width":"80px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF12","field t-
     A                                      ype":"button","value":"Cancel","sho-
     A                                      rtcut key":"F12","left":"104px","to-
     A                                      p":"330px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"}]-
     A                                      }')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCCRDT    R        H      REFFLD(DT8)
     A            SCCSDT    R        H      REFFLD(DT8)
     A            SCRRDT    R        H      REFFLD(DT8)
     A            SCRSDT    R        H      REFFLD(DT8)
     A          R WDW01
     A  71 72 73
     A  54                                  CA01(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                  1  2HTML('QPUIREC9    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    12 RERRMSGID  5    C5   -
     A                                       SCPCFC7    MCR1758C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     71RERRMSGI-
     A                                      D  5    C5    SCPCFC7    MCR0759C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         73RERRMSGID  5    C5    SCAPCC7 -
     A                                         MCR1758C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     71RERRMSGID  5    C-
     A                                      5    SCAPCC7    MCR0759C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     73RERR-
     A                                      MSGID  5    C5    SCSCFC7    MCR175-
     A                                      8C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     71RERRMSGID  5    C5    SCSC-
     A                                      FC7    MCR0759C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     72')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"5","window left":"3","overlay":"-
     A                                      true","set off":{"fieldName":"*IN71-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 2":{"fieldName":"*IN72","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 3":{"fieldName":"*IN73","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"over-
     A                                      lay range":"1-12"},"items":[{"id":"-
     A                                      WDW01","field type":"panel","panel -
     A                                      style":"Transform Dialog","text ali-
     A                                      gn":"center","left":"5px","top":"5p-
     A                                      x","height":"390px","width":"534px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue"},{"id":"SCPGM","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPGM","designValue":"[SCPGM]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none","da-
     A                                      taLength":"10"},"css class":"output-
     A                                      -field","left":"29px","cursor colum-
     A                                      n":"2","top":"65px","cursor row":"1-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant56","field type":-
     A                                      "output field","value":"Service Cod-
     A                                      e selection","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"N54","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"183px","cursor col-
     A                                      umn":"24","top":"65px","cursor row"-
     A                                      :"1","css class 2":"HI","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant57","field type":"output field-
     A                                      ","value":"Procedure Code selection-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"54","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"183px","cursor column":"24","t-
     A                                      op":"65px","cursor row":"1","css cl-
     A                                      ass 2":"HI","css class 3":"profound-
     A                                      -converted"},{"id":"constant58","fi-
     A                                      eld type":"output field","value":"W-
     A                                      DW01","css class":"constant","left"-
     A                                      :"463px","cursor column":"64","top"-
     A                                      :"65px","cursor row":"1","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant59","field type":"output fiel-
     A                                      d","value":"Type option, press Ente-
     A                                      r.","css class":"constant","left":"-
     A                                      29px","cursor column":"2","top":"10-
     A                                      5px","cursor row":"3","css class 2"-
     A                                      :"BLU","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant60","field t-
     A                                      ype":"output field","value":"1=Sele-
     A                                      ct","css class":"constant","left":"-
     A                                      43px","cursor column":"4","top":"12-
     A                                      5px","cursor row":"4","css class 2"-
     A                                      :"BLU","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant63","field t-
     A                                      ype":"output field","')
     A                                  1  2HTML('value":"OPPS APC''s        :"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"54","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"29px","cursor column":"2","top"-
     A                                      :"165px","cursor row":"6","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant62","field type":"output fie-
     A                                      ld","value":"Procedure code file:",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"N54","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"29px","cursor column":"2","top"-
     A                                      :"165px","cursor row":"6","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPCF","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCPCF","de-
     A                                      signValue":"[SCPCF]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"1"},"text transform":"uppercas-
     A                                      e","visibility":{"fieldName":"N54",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"176px","cursor c-
     A                                      olumn":"23","top":"165px","cursor r-
     A                                      ow":"6","width":"8px","error messag-
     A                                      e id":"MCR1758","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"71","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0759",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"73","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCAPC","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      APC","designValue":"[SCAPC]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"1"},"text transform":"-
     A                                      uppercase","visibility":{"fieldName-
     A                                      ":"54","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"176px","c-
     A                                      ursor column":"23","top":"165px","c-
     A                                      ursor row":"6","width":"8px","error-
     A                                       message id":"MCR1758","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"71","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"MC-
     A                                      R0759","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"73","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"css class 3":"profound-conve-
     A                                      rted"},{"id":"constan')
     A                                  1  2HTML('t61","field type":"output fie-
     A                                      ld","value":"Service code file  :",-
     A                                      "css class":"constant","left":"29px-
     A                                      ","cursor column":"2","top":"205px"-
     A                                      ,"cursor row":"8","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSCF","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCSCF","designValu-
     A                                      e":"[SCSCF]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"176px","cursor column":"23-
     A                                      ","top":"205px","cursor row":"8","e-
     A                                      rror message id":"MCR1758","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"71","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0759","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"72","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"css class 3":"profound-c-
     A                                      onverted","width":"25px"},{"id":"bt-
     A                                      nSubmit","field type":"button","val-
     A                                      ue":"Enter","shortcut key":"Enter",-
     A                                      "left":"14px","top":"350px","width"-
     A                                      :"80px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF12","f-
     A                                      ield type":"button","value":"Cancel-
     A                                        ","shortcut key":"F12","left":"10-
     A                                      4px","top":"350px","width":"80px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"}]}')
     A            SCAPC          1A  H
     A            SCPCF          1A  H
     A            SCPGM         10A  H
     A            SCSCF     R        H      REFFLD(FLAG)
