     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  16 17 25
     A  30 33 35
     A  36 37 41                            CA01(16 'Response Indicator *IN16')
     A  43 48 49
     A  50 51 53
     A  54 55 57                            CA02(17 'Response Indicator *IN17')
     A  03 09 29
     A  14 28 31
     A  32 34 38                            CA03(25 'Response Indicator *IN25')
     A  39 45 46
     A  44 47 52
     A  56 58 59                            CA04(30 'Response Indicator *IN30')
     A  60 61 62
     A  63 64 65
     A  66 67 68                            CA05(33 'Response Indicator *IN33')
     A  69 70 71
     A  72 73 74
     A  75 76 77                            CA06(35 'Response Indicator *IN35')
     A  78 79 80
     A  81 82 83
     A  84 85 86                            CA07(36 'Response Indicator *IN36')
     A  87 88 89
     A  91 92 93
     A  94                                  CA08(37 'Response Indicator *IN37')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                      SETOF(48 'Response Indicator *IN48')
     A                                      SETOF(49 'Response Indicator *IN49')
     A                                      SETOF(50 'Response Indicator *IN50')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                      SETOF(55 'Response Indicator *IN55')
     A                                      SETOF(57 'Response Indicator *IN57')
     A                                  1  2HTML('QPUIREC50   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCCSCDC7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      CSCDC7    MCR2383C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     72RERRMSGID -
     A                                       5    C6    SCCSCDC7    MC40167C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        65RERRMSGID  5    C6    SCFDATC7 -
     A                                         MCR0556C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     73RERRMSGID  5    C-
     A                                      6    SCFDATC7    MCR0500C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     74RER-
     A                                      RMSGID  5    C6    SCFDATC7    MC40-
     A                                      056C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     75RERRMSGID  5    C6    SC-
     A                                      FDATC7    MCR0466C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     82RERRMSGID -
     A                                       5    C6    SCFDATC7    MCR2397C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        89RERRMSGID  5    C6    SCFDATC7 -
     A                                         MCR0676C6    FSMESGC5    *LIBLC0-
     A                                          E1    12   N35 36 37 43RERRMSGI-
     A                                      D  5    C5    SCPOSC7    MCR0513C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         77RERRMSGID  5    C5    SCPOSC7 -
     A                                         MCR2387C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     25RERRMSGID  5    C-
     A                                      6    SCPRCDC7    MCR0503C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     83RER-
     A                                      RMSGID  5    C6    SCPRCDC7    MCR0-
     A                                      759C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     84RERRMSGID  5    C6    SC-
     A                                      PRCDC7    MCR2387C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     76RERRMSGID -
     A                                       5    C6    SCPRCDC7    MCR2387C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        57RERRMSGID  5    C6    SCPRCDC7 -
     A                                         MC40412C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     87RERRMSGID  5    C-
     A                                      6    SCPRCDC7    MCR0466C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     30RER-
     A                                      RMSGID  5    C6    SCBLCDC7    MCR0-
     A                                      676C6    FSMESGC5    *LIBLC0    E1 -
     A                                         12    35N36N37N43RERRMSGID  5   -
     A                                       C6    SCBLCDC7    MCR0759C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     17R-
     A                                      ERRMSGID  5    C6    SCBLCDC7    MC-
     A                                      R2434C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     16RERRMSGID  5    C6    -
     A                                      SCBLCDC7    MC40412C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     88RERRMSGI-
     A                                      D  5    C6    SCPARTC7    MCR2434C6-
     A                                          FSMESGC5    *LIBLC0    E1    3 -
     A                                          51RERRMSGID  5    C6    SCDXR1C-
     A                                      7    MC40076C6    FSMESGC5    *LIBL-
     A                                      C0    E1    3     63RERRMSGID  5   -
     A                                       C6    SCDXR1C7    MC40075C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     66R-
     A                                      ERRMSGID  5    C6    SCDXR1C7    MC-
     A                                      R0676C6    FSMESGC5    *LIBLC0    E-
     A                                      1    12   N91 92N93N94RERRMSGID  5 -
     A                                         C6    SCDXR2C7    MC40076C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     6-
     A                                      4RERRMSGID  5    C6    SCDXR2C7    -
     A                                      MCR0676C6    FSMESGC5    *LIBLC0   -
     A                                       E1    12   N91N92 93N94RERRMSGID  -
     A                                      5    C6    SCDXR3C7    MC40076C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       85RERRMSGID  5    C6    SCDXR3C7  -
     A                                        MCR0676C6    FSMESGC5')
     A                                  1  2HTML('QPUI    *LIBLC0    E1    12  -
     A                                       N91N92N93 94RERRMSGID  5    C6    -
     A                                      SCDXR4C7    MC40076C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     86RERRMSGI-
     A                                      D  5    C6    SCDXR4C7    MCR0676C6-
     A                                          FSMESGC5    *LIBLC0    E1    12-
     A                                          91 92N93N94RERRMSGID  5    C6  -
     A                                        SCCHRGC7    MCR0556C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     67RERRMS-
     A                                      GID  5    C6    SCCHRGC7    MC40116-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     58RERRMSGID  5    C6    SCCHR-
     A                                      GC7    MCR0676C6    FSMESGC5    *LI-
     A                                      BLC0    E1    12   N35 36N37N43RERR-
     A                                      MSGID  5    C6    SCPAIDC7    MC401-
     A                                      16C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     58RERRMSGID  5    C6    SCP-
     A                                      AIDC7    MCR0676C6    FSMESGC5    *-
     A                                      LIBLC0    E1    12   N35N36 37N43RE-
     A                                      RRMSGID  5    C5    SCMRAC7    MC40-
     A                                      116C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     58RERRMSGID  5    C5    SC-
     A                                      MRAC7    MCR0676C6    FSMESGC5    *-
     A                                      LIBLC0    E1    12   N35N36N37 43RE-
     A                                      RRMSGID  5    C6    SCNTWKC7    MC4-
     A                                      0116C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     58RERRMSGID  5    C6    S-
     A                                      CNTWKC7    MCR0676C6    FSMESGC5   -
     A                                       *LIBLC0    E1    12    35 36N37N43-
     A                                      RERRMSGID  5    C6    SCOTHRC7    M-
     A                                      C40116C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     58RERRMSGID  5    C6   -
     A                                       SCOTHRC7    MCR0676C6    FSMESGC5 -
     A                                         *LIBLC0    E1    12   N35 36 37N-
     A                                      43RERRMSGID  5    C6    SCOT1CC7   -
     A                                       MC40072C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     78RERRMSGID  5    C6 -
     A                                         SCOT1CC7    MCR0513C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     79RERRM-
     A                                      SGID  5    C6    SCOTH2C7    MC4011-
     A                                      6C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     58RERRMSGID  5    C6    SCOT-
     A                                      H2C7    MCR0676C6    FSMESGC5    *L-
     A                                      IBLC0    E1    12   N35N36 37 43RER-
     A                                      RMSGID  5    C6    SCOT2CC7    MC40-
     A                                      072C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     80RERRMSGID  5    C6    SC-
     A                                      OT2CC7    MCR0513C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     81')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","set off":{"fieldN-
     A                                      ame":"*IN16","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 2":{"fieldName-
     A                                      ":"*IN17","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 3":{"fieldName":"-
     A                                      *IN30","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 4":{"fieldName":"*IN-
     A                                      35","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 5":{"fieldName":"*IN36"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 6":{"fieldName":"*IN37","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 7":{"fieldName":"*IN43","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 8":{"fieldName":"*IN54","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      9":{"fieldName":"*IN41","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 10"-
     A                                      :{"fieldName":"*IN53","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 11":{-
     A                                      "fieldName":"*IN33","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 12":{"f-
     A                                      ieldName":"*IN55","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 13":{"fie-
     A                                      ldName":"*IN57","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 14":{"field-
     A                                      Name":"*IN48","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 15":{"fieldNa-
     A                                      me":"*IN49","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 16":{"fieldName-
     A                                      ":"*IN50","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 17":{"fieldName":-
     A                                      "*IN51","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 18":{"fieldName":"*-
     A                                      IN25","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"return cursor record":{"field-
     A                                      Name":"HREC","dataLength":"10","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none"},"re-
     A                                      turn cursor field":{"fieldName":"HF-
     A                                      LD","dataLength":"10","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none"},"overlay ran-
     A                                      ge":"1-24"},"items":[{"id":"HFLD","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value"')
     A                                  1  2HTML(':{"fieldName":"HFLD","designV-
     A                                      alue":"[HFLD]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"10"},"-
     A                                      left":"0px","top":"-30px","css clas-
     A                                      s":"profound-converted"},{"id":"HRE-
     A                                      C","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"HREC","designValue":"[HREC]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none","-
     A                                      dataLength":"10"},"left":"0px","top-
     A                                      ":"-30px","css class":"profound-con-
     A                                      verted"},{"id":"F0383F_SCR01_avKeys-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"AV_KEYS","dataLeng-
     A                                      th":"1134","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[AV-
     A                                      _KEYS]"},"left":"0px","top":"0px","-
     A                                      visibility":"hidden"},{"id":"F0383F-
     A                                      _SCR01_action","field type":"html c-
     A                                      ontainer","white space":"normal","l-
     A                                      eft":"0px","top":"10px","width":"23-
     A                                      0px","css class":"action-panel-conv-
     A                                      erted","height":"700px","html":"<di-
     A                                      v class=\"top\"></div><div class=\"-
     A                                      imagetop\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_top.png\" /></di-
     A                                      v><div class=\"menulinks\"></div><d-
     A                                      iv class=\"imagebottom\"><img src=\-
     A                                      "/profoundui/userdata/images/bar_bo-
     A                                      ttom.png\" /></div><div class=\"bot-
     A                                      tom\"></div>"},{"field type":"icon -
     A                                      menu button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"32px","z index":"20","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1170-
     A                                      px","id":"F0383F_SCR01_BtnIconMenuS-
     A                                      ystemTools","tool tip":"System Tool-
     A                                      s","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"F0383F_SCR01_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"F0383F_SCR01_BtnSave","tool ti-
     A                                      p":"Save","onclick":"SystemToolbarS-
     A                                      ave","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sav-
     A                                      e.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","')
     A                                  1  2HTML('top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1066px","id":"F03-
     A                                      83F_SCR01_BtnRefresh","tool tip":"R-
     A                                      efresh","onclick":"SystemToolbarRef-
     A                                      resh","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/re-
     A                                      fresh.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1092px","id":"F0383F_SCR01_BtnSea-
     A                                      rch","tool tip":"Search","onclick":-
     A                                      "SystemToolbarSearch","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/search.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1118px","id":"F038-
     A                                      3F_SCR01_BtnDiaryItems","tool tip":-
     A                                      "Diary/Work Items - IDARTS","onclic-
     A                                      k":"SystemToolbarDiary","background-
     A                                       image":{"fieldName":"DryIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1144px","id":"F0383F_SC-
     A                                      R01_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left')
     A                                  1  2HTML(' style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1196px","i-
     A                                      d":"F0383F_SCR01_BtnHelp","tool tip-
     A                                      ":"Help","onclick":"SystemToolbarHe-
     A                                      lp","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/help-
     A                                      .png'')"},{"id":"F0383F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"F0383F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"active tab":"0","left":"250-
     A                                      px","top":"70px","width":"970px","h-
     A                                      eight":"657px","z index":"8","locke-
     A                                      d in place":"true","css class":"tab-
     A                                      -panel","css class 2":"stationary"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0383F_SCR0-
     A                                      1_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant1","fie-
     A                                      ld type":"output field","left":"281-
     A                                      px","cursor column":"2","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentUser()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"F0383F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F0383F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant2","field type":"ou-
     A                                      tput field","left":"778px","cursor -
     A                                      column":"73","top":"110px","cursor -
     A                                      row":"1","css class":"top-line","va-
     A                                      lue":"js: currentDate()","css class-
     A                                       2":"output-field","parent tab pane-
     A                                      l":"F0383F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"F0383F_SCR01_f-
     A                                      keyMenu","field type":"menu","left"-
     A                                      :"10px","top":"120px","height":"350-
     A                                      px","width":"230px","hover backgrou-
     A                                      nd color":"#9AAA61","hover text col-
     A                                      or":"#FFFFFF","border')
     A                                  1  2HTML(' color":"#4C6106","menu optio-
     A                                      n indent":"10px","background color"-
     A                                      :"#758B27","css class":"action-menu-
     A                                      ","css class 2":"stationary","z ind-
     A                                      ex":"101"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0383F_SCR01_BtnHiddenRefresh","valu-
     A                                      e":"btnRefresh","top":"125px","resp-
     A                                      onse":{"fieldName":"btnRefresh","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"Q1PGM","field type":"output fie-
     A                                      ld","value":{"fieldName":"Q1PGM","d-
     A                                      esignValue":"[Q1PGM]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"10"},"css class":"output-field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"130px","cursor row":"2","pare-
     A                                      nt tab panel":"F0383F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCA-
     A                                      ST","field type":"output field","va-
     A                                      lue":{"fieldName":"SCAST","designVa-
     A                                      lue":"[SCAST]","refField":"ST","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"358px","cursor column":"13","top-
     A                                      ":"130px","cursor row":"2","css cla-
     A                                      ss 2":"HI","parent tab panel":"F038-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCZIPA","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCZIPA","designValue":"[SCZIPA]","-
     A                                      refField":"ZIPA","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"379px","cur-
     A                                      sor column":"16","top":"130px","cur-
     A                                      sor row":"2","css class 2":"HI","pa-
     A                                      rent tab panel":"F0383F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0383F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant4","field type":"out-
     A                                      put field","value":"SCR01","css cla-
     A                                      ss":"constant","left":"799px","curs-
     A                                      or column":"76","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"F03-
     A                                      83F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constan')
     A                                  1  2HTML('t3","field type":"output fiel-
     A                                      d","value":"SCR01","css class":"con-
     A                                      stant","left":"799px","cursor colum-
     A                                      n":"76","top":"130px","cursor row":-
     A                                      "2","parent tab panel":"F0383F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCMODE","field type":"output -
     A                                      field","value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F0383F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0383F_SCR01_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCHD1","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCHD-
     A                                      1","designValue":"[SCHD1]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"78"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"170px","cursor row":"4",-
     A                                      "parent tab panel":"F0383F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0383F_SCR01_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCHD2","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCHD2","designValue":"[SCH-
     A                                      D2]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"78"},"css class-
     A                                      ":"output-field","left":"281px","cu-
     A                                      rsor column":"2","top":"190px","cur-
     A                                      sor row":"5","parent tab panel":"F0-
     A                                      383F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F038-
     A                                      3F_SCR01_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFor')
     A                                  1  2HTML('mat":"1 / 0"}},{"id":"SCHD3",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCHD3","designValue"-
     A                                      :"[SCHD3]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"74"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"210px-
     A                                      ","cursor row":"6","parent tab pane-
     A                                      l":"F0383F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCZIPB","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCZIPB","designValue":"[SC-
     A                                      ZIPB]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"3"},"css clas-
     A                                      s":"output-field","left":"806px","c-
     A                                      ursor column":"77","top":"210px","c-
     A                                      ursor row":"6","parent tab panel":"-
     A                                      F0383F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      383F_SCR01_BtnHiddenWorkSubmitJob",-
     A                                      "value":"btnWrksbmjob","top":"225px-
     A                                      ","response":{"fieldName":"btnWrkJo-
     A                                      b","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant5","field type":"-
     A                                      output field","value":"EOMB#:","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"230px","c-
     A                                      ursor row":"7","parent tab panel":"-
     A                                      F0383F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCEOB#","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCEOB#","designValue":"[SCEOB#-
     A                                      ]","refField":"EOB#","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"330px","c-
     A                                      ursor column":"9","top":"230px","cu-
     A                                      rsor row":"7","width":"63px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      F0383F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant6","field -
     A                                      type":"output field","value":"Line#-
     A                                      :","css class":"constant","left":"4-
     A                                      00px","cursor column":"19","top":"2-
     A                                      30px","cursor row":"7","parent tab -
     A                                      panel":"F0383F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCLIN#","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCLIN#","designValue":-
     A                                      "[SCLIN#]","refField":"A90","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"44-
     A                                      9px","cursor column":')
     A                                  1  2HTML('"26","top":"230px","cursor ro-
     A                                      w":"7","width":"63px","text align":-
     A                                      "right","parent tab panel":"F0383F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant7","field type":"-
     A                                      output field","value":"Seq#:","css -
     A                                      class":"constant","left":"519px","c-
     A                                      ursor column":"36","top":"230px","c-
     A                                      ursor row":"7","parent tab panel":"-
     A                                      F0383F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSEQ#","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCSEQ#","designValue":"[SCSEQ#-
     A                                      ]","refField":"SEQ#","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"561px","c-
     A                                      ursor column":"42","top":"230px","c-
     A                                      ursor row":"7","width":"35px","text-
     A                                       align":"right","parent tab panel":-
     A                                      "F0383F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant8","field-
     A                                       type":"output field","value":"Ntwk-
     A                                      :","css class":"constant","visibili-
     A                                      ty":{"fieldName":"68","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"603px","cursor column":"48","-
     A                                      top":"230px","cursor row":"7","pare-
     A                                      nt tab panel":"F0383F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCN-
     A                                      WCD","field type":"output field","v-
     A                                      alue":{"fieldName":"SCNWCD","design-
     A                                      Value":"[SCNWCD]","refField":"NWCD"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "visibility":{"fieldName":"68","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"645px","cursor colum-
     A                                      n":"54","top":"230px","cursor row":-
     A                                      "7","parent tab panel":"F0383F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant9","field type":"outp-
     A                                      ut field","value":"Tot chrg:","css -
     A                                      class":"constant","left":"687px","c-
     A                                      ursor column":"60","top":"230px","c-
     A                                      ursor row":"7","parent tab panel":"-
     A                                      F0383F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCTOTC","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCTOTC","designValue":"[SCTOTC-
     A                                      ]","refField":"A92","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"css class-
     A                                      ":"output-field","left":"757px","cu-
     A                                      rsor column":"70","top":"230px","cu-
     A                                      rsor row":"7","width":"77px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      F0383F_SCR01_MainTabP')
     A                                  1  2HTML('anel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant10","field type":"output -
     A                                      field","value":"PROVIDER HAS A MANU-
     A                                      AL FEE SCHEDULE CAP","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "03","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"281px","cur-
     A                                      sor column":"2","top":"250px","curs-
     A                                      or row":"8","css class 2":"HI","par-
     A                                      ent tab panel":"F0383F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0383F_SCR01_BtnHidde-
     A                                      nWorkPrinterOutput","value":"btnWrk-
     A                                      prtout","top":"250px","response":{"-
     A                                      fieldName":"btnWrkPrnt","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant11","field type":"output field"-
     A                                      ,"value":"Adjudication code        -
     A                                       :","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"2-
     A                                      70px","cursor row":"9","parent tab -
     A                                      panel":"F0383F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCCSCD","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCCSCD","designVal-
     A                                      ue":"[SCCSCD]","refField":"CODE3","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase"},"text transform":"upperca-
     A                                      se","left":"477px","cursor column":-
     A                                      "30","top":"270px","cursor row":"9"-
     A                                      ,"width":"22px","css class 3":{"fie-
     A                                      ldName":"N09 and N46","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"46 or 44 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"46 or 44 or 09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 5":{"fieldName":"N46","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"71","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"3 messages","error message id 2":-
     A                                      "MCR2383","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"72","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messa')
     A                                  1  2HTML('ge id 3":"MC40167","error mes-
     A                                      sage file 3":"FSMESG","error messag-
     A                                      e library 3":"*LIBL","error conditi-
     A                                      on 3":{"fieldName":"65","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"parent tab-
     A                                       panel":"F0383F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"SCCSDS","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCCSDS","designValue"-
     A                                      :"[SCCSDS]","refField":"DS25","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"505px","cursor column":"34","top"-
     A                                      :"270px","cursor row":"9","css clas-
     A                                      s 2":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"par-
     A                                      ent tab panel":"F0383F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant13","field type":"output fiel-
     A                                      d","value":"EOB Code Needed","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"14","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"701-
     A                                      px","cursor column":"62","top":"270-
     A                                      px","cursor row":"9","css class 2":-
     A                                      {"fieldName":"14","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"RI","customFalse":""},"parent t-
     A                                      ab panel":"F0383F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t12","field type":"output field","v-
     A                                      alue":"EOB/Notes attached","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"69","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"701px-
     A                                      ","cursor column":"62","top":"270px-
     A                                      ","cursor row":"9","css class 2":{"-
     A                                      fieldName":"69","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"RI","customFalse":""},"parent tab-
     A                                       panel":"F0383F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0383F_SCR01_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant14","field typ-
     A                                      e":"output field","value":"Service -
     A                                      date              :","css class":"c-
     A                                      onstant","left":"281px","cursor col-
     A                                      umn":"2","top":"290px","cursor row"-
     A                                      :"10","parent tab panel":"F0383F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profou')
     A                                  1  2HTML('nd-converted"},{"id":"SCFDAT"-
     A                                      ,"field type":"date field","css cla-
     A                                      ss":"input","css class 2":"date-fie-
     A                                      ld","value":{"fieldName":"SCFDAT","-
     A                                      designValue":"[SCFDAT]","refField":-
     A                                      "DT8","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","numBlankFill":"true","e-
     A                                      dtWrd":"''  /  /    ''","dateFormat-
     A                                      ":"m/d/Y"},"left":"477px","cursor c-
     A                                      olumn":"30","top":"290px","cursor r-
     A                                      ow":"10","width":"71px","text align-
     A                                      ":"right","css class 3":{"fieldName-
     A                                      ":"N09 and N46","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"46 or 09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 4":{"fieldName":"46 or 09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5":{"fieldName":-
     A                                      "N46","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"set focus":{"fieldNa-
     A                                      me":"41","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error messages":"6-
     A                                       messages","parent tab panel":"F038-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted","error message id":"MCR0556","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"73","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error e-
     A                                      nhanced mode":"0","error message id-
     A                                       2":"MCR0500","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"74","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error enhanced mode 2-
     A                                      ":"0","error message id 3":"MC40056-
     A                                      ","error message file 3":"FSMESG","-
     A                                      error message library 3":"*LIBL","e-
     A                                      rror condition 3":{"fieldName":"75"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode 3":"0","error-
     A                                       message id 4":"MCR0466","error mes-
     A                                      sage file 4":"FSMESG","error messag-
     A                                      e library 4":"*LIBL","error conditi-
     A                                      on 4":{"fieldName":"82","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error enha-
     A                                      nced mode 4":"0","error message id -
     A                                      5":"MCR2397","error message file 5"-
     A                                      :"FSMESG","error message library 5"-
     A                                      :"*LIBL","error condition 5":{"fiel-
     A                                      dName":"89","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error enhanced mode 5"-
     A                                      :"0","error message id 6":"MCR0676"-
     A                                      ,"error message file')
     A                                  1  2HTML(' 6":"FSMESG","error message l-
     A                                      ibrary 6":"*LIBL","error condition -
     A                                      6":{"fieldName":"N35 and 36 and 37 -
     A                                      and 43","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode 6":"0"-
     A                                      },{"id":"constant15","field type":"-
     A                                      output field","value":"Date Entered-
     A                                      :","css class":"constant","left":"5-
     A                                      85px","cursor column":"42","top":"2-
     A                                      95px","cursor row":"10","parent tab-
     A                                       panel":"F0383F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCEDAT","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCEDAT","designValue"-
     A                                      :"[SCEDAT]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''"},"css class"-
     A                                      :"output-field","left":"680px","cur-
     A                                      sor column":"57","top":"295px","cur-
     A                                      sor row":"10","width":"70px","text -
     A                                      align":"right","css class 2":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F0383F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0383F_SCR01_BtnHiddenHelp","val-
     A                                      ue":"btnHelp","top":"300px","respon-
     A                                      se":{"fieldName":"btnHelp","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant16","field type":"output fie-
     A                                      ld","value":"Place of service      -
     A                                          :","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"310px","cursor row":"11","parent -
     A                                      tab panel":"F0383F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPOS"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCPOS","designV-
     A                                      alue":"[SCPOS]","dataType":"zoned",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00","dataLength":"2","d-
     A                                      ecPos":"0"},"left":"477px","cursor -
     A                                      column":"30","top":"310px","cursor -
     A                                      row":"11","width":"15px","css class-
     A                                       3":{"fieldName":"N46","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"css-
     A                                       class 4":{"fieldName":"N09 and N46-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "46 or 09","dataType":"expression",-
     A                                      "formatting":"Indicat')
     A                                  1  2HTML('or","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"46 o-
     A                                      r 09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"set focus":{"fieldNa-
     A                                      me":"31","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error message id":-
     A                                      "MCR0513","error message file":"FSM-
     A                                      ESG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"7-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"2 messages","e-
     A                                      rror message id 2":"MCR2387","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"25","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"F0383F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"SCPOD-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCPODS","designVa-
     A                                      lue":"[SCPODS]","refField":"DS10","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"498px","cursor column":"33","-
     A                                      top":"310px","cursor row":"11","css-
     A                                       class 2":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"parent tab panel":"F0383F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant17","field type":"output-
     A                                       field","value":"Procedure code: CP-
     A                                      T/HCPCS :","css class":"constant","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"330px","cursor row":"12","par-
     A                                      ent tab panel":"F0383F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRCD","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCPRCD","d-
     A                                      esignValue":"[SCPRCD]","refField":"-
     A                                      CPT4","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"477px","cursor c-
     A                                      olumn":"30","top":"330px","cursor r-
     A                                      ow":"12","width":"36px","css class -
     A                                      3":{"fieldName":"N09 and N46","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"46 or -
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 4":{"fieldNam-
     A                                      e":"46 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"N46","')
     A                                  1  2HTML('dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"set focus":{"fieldNam-
     A                                      e":"32 or 54","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"error message-
     A                                      s":"6 messages","parent tab panel":-
     A                                      "F0383F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted","error message id":"MCR05-
     A                                      03","error message file":"FSMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"83","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror enhanced mode":"0","error messa-
     A                                      ge id 2":"MCR0759","error message f-
     A                                      ile 2":"FSMESG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"84","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode 2":"0","error message id 3":"MC-
     A                                      R2387","error message file 3":"FSME-
     A                                      SG","error message library 3":"*LIB-
     A                                      L","error condition 3":{"fieldName"-
     A                                      :"76","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode 3":"0","-
     A                                      error message id 4":"MCR2387","erro-
     A                                      r message file 4":"FSMESG","error m-
     A                                      essage library 4":"*LIBL","error co-
     A                                      ndition 4":{"fieldName":"57","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       enhanced mode 4":"0","error messag-
     A                                      e id 5":"MC40412","error message fi-
     A                                      le 5":"FSMESG","error message libra-
     A                                      ry 5":"*LIBL","error condition 5":{-
     A                                      "fieldName":"87","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de 5":"0","error message id 6":"MCR-
     A                                      0466","error message file 6":"FSMES-
     A                                      G","error message library 6":"*LIBL-
     A                                      ","error condition 6":{"fieldName":-
     A                                      "30","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode 6":"0"},{-
     A                                      "id":"constant18","field type":"out-
     A                                      put field","value":"Billed code:","-
     A                                      css class":"constant","left":"561px-
     A                                      ","cursor column":"42","top":"330px-
     A                                      ","cursor row":"12","parent tab pan-
     A                                      el":"F0383F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCBLCD","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCBLCD","designValue"-
     A                                      :"[SCBLCD]","refField":"CPT4","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"652px","cursor column":"55"-
     A                                      ,"top":"330px","cursor row":"12","w-
     A                                      idth":"36px","css class 3":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","cu')
     A                                  1  2HTML('stomTrue":"UL","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"set focus":{"fieldName":"-
     A                                      34","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 5":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"error message id-
     A                                      ":"MCR0676","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "35 and N36 and N37 and N43","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"4 messages","error mess-
     A                                      age id 2":"MCR0759","error message -
     A                                      file 2":"FSMESG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"17","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error message i-
     A                                      d 3":"MCR2434","error message file -
     A                                      3":"FSMESG","error message library -
     A                                      3":"*LIBL","error condition 3":{"fi-
     A                                      eldName":"16","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error message id 4":-
     A                                      "MC40412","error message file 4":"F-
     A                                      SMESG","error message library 4":"*-
     A                                      LIBL","error condition 4":{"fieldNa-
     A                                      me":"88","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"F0383F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant19","field type"-
     A                                      :"output field","value":"Procedure -
     A                                      code description:","css class":"con-
     A                                      stant","left":"281px","cursor colum-
     A                                      n":"2","top":"350px","cursor row":"-
     A                                      13","parent tab panel":"F0383F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCDESC","field type":"output -
     A                                      field","value":{"fieldName":"SCDESC-
     A                                      ","designValue":"[SCDESC]","refFiel-
     A                                      d":"DS25","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"477px","cursor col-
     A                                      umn":"30","top":"350px","cursor row-
     A                                      ":"13","css class 2":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"parent tab panel":"F03-
     A                                      83F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant20","field ty-
     A                                      pe":"output field","value":"Tooth n-
     A                                      umber              :","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"370p')
     A                                  1  2HTML('x","cursor row":"14","parent -
     A                                      tab panel":"F0383F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPART-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCPART","desig-
     A                                      nValue":"[SCPART]","refField":"CODE-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"477px","cursor colum-
     A                                      n":"30","top":"370px","cursor row":-
     A                                      "14","width":"15px","read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"set focus":{"fieldName":"39","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message id":"MCR2434","-
     A                                      error message file":"FSMESG","error-
     A                                       message library":"*LIBL","error co-
     A                                      ndition":{"fieldName":"51","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"1 message","parent tab pa-
     A                                      nel":"F0383F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"SCTDES","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCTDES","designValue":"[-
     A                                      SCTDES]","refField":"DS40","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      98px","cursor column":"33","top":"3-
     A                                      70px","cursor row":"14","css class -
     A                                      2":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"paren-
     A                                      t tab panel":"F0383F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant21","field type":"output field"-
     A                                      ,"value":"Diag code 1:","css class"-
     A                                      :"constant","visibility":{"fieldNam-
     A                                      e":"28","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"281px","-
     A                                      cursor column":"2","top":"390px","c-
     A                                      ursor row":"15","parent tab panel":-
     A                                      "F0383F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCDXR1","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox')
     A                                  1  2HTML('","value":{"fieldName":"SCDXR-
     A                                      1","designValue":"[SCDXR1]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","visibility":{"fiel-
     A                                      dName":"28","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"372p-
     A                                      x","cursor column":"15","top":"390p-
     A                                      x","cursor row":"15","width":"8px",-
     A                                      "css class 3":{"fieldName":"N09 and-
     A                                       N46","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"52 or 46 or 09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 4":{"fieldName":"52 or 46 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"60","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error message id"-
     A                                      :"MC40076","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      63","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"3 messages","-
     A                                      error message id 2":"MC40075","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"66","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 3":"MCR0676","error mes-
     A                                      sage file 3":"FSMESG","error messag-
     A                                      e library 3":"*LIBL","error conditi-
     A                                      on 3":{"fieldName":"N91 and 92 and -
     A                                      N93 and N94","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"parent tab panel":"F0-
     A                                      383F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"SCDIA1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCDIA1","refField":"DS7","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[SCDIA1]"},"css -
     A                                      class":"output-field","visibility":-
     A                                      {"fieldName":"28","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"386px","cursor column":"17","top"-
     A                                      :"390px","cursor row":"15","css cla-
     A                                      ss 2":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"pa-
     A                                      rent tab panel":"F038')
     A                                  1  2HTML('3F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"SCD1DS","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCD1DS","designValue":"[SCD1-
     A                                      DS]","refField":"DS15","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","visibility":-
     A                                      {"fieldName":"28","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"440px","cursor column":"23","top"-
     A                                      :"390px","cursor row":"15","css cla-
     A                                      ss 2":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"pa-
     A                                      rent tab panel":"F0383F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant22","field type":"output fie-
     A                                      ld","value":"Diag code 2:","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"61","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"561px-
     A                                      ","cursor column":"42","top":"390px-
     A                                      ","cursor row":"15","parent tab pan-
     A                                      el":"F0383F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCDXR2","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCDXR2","designValue"-
     A                                      :"[SCDXR2]","refField":"FLAG","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "visibility":{"fieldName":"61","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"652px","cursor colum-
     A                                      n":"55","top":"390px","cursor row":-
     A                                      "15","width":"8px","css class 3":{"-
     A                                      fieldName":"N09 and N46","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"46 or 09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 4":{"fieldName":"4-
     A                                      6 or 09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"error messag-
     A                                      e id":"MC40076","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"64","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0676",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2')
     A                                  1  2HTML('":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"N91 and N92 and 93 a-
     A                                      nd N94","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"F0383F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"SCDIA2","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      DIA2","refField":"DS7","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"reference","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[SCDIA2]"},"css class-
     A                                      ":"output-field","visibility":{"fie-
     A                                      ldName":"61","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"666-
     A                                      px","cursor column":"57","top":"390-
     A                                      px","cursor row":"15","css class 2"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"parent -
     A                                      tab panel":"F0383F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCD2DS-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCD2DS","designVal-
     A                                      ue":"[SCD2DS]","refField":"DS15","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","vi-
     A                                      sibility":{"fieldName":"61","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"720px","cursor column":-
     A                                      "63","top":"390px","cursor row":"15-
     A                                      ","css class 2":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"parent tab panel":"F0383F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant23","field type":"-
     A                                      output field","value":"Diag code 3:-
     A                                      ","css class":"constant","visibilit-
     A                                      y":{"fieldName":"62","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"410px","cursor row":"16","paren-
     A                                      t tab panel":"F0383F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCDX-
     A                                      R3","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCDXR3","des-
     A                                      ignValue":"[SCDXR3]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","visibility":{"fieldName":-
     A                                      "62","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"372px","cur-
     A                                      sor column":"15","top":"410px","cur-
     A                                      sor row":"16","width"')
     A                                  1  2HTML(':"8px","css class 3":{"fieldN-
     A                                      ame":"N09 and N46","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"46 or 09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 4":{"fieldName":"46 or 0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"error message id":-
     A                                      "MC40076","error message file":"FSM-
     A                                      ESG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"8-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"2 messages","e-
     A                                      rror message id 2":"MCR0676","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"N91 and N92-
     A                                       and N93 and 94","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"F0383F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"SCDIA3","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCDIA3","refField":"DS7","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"reference",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[SCDIA3]"},"-
     A                                      css class":"output-field","visibili-
     A                                      ty":{"fieldName":"62","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"386px","cursor column":"17","-
     A                                      top":"410px","cursor row":"16","css-
     A                                       class 2":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"parent tab panel":"F0383F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCD3DS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCD3DS","-
     A                                      designValue":"[SCD3DS]","refField":-
     A                                      "DS15","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","visibility":{"fieldName":"62-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"440px","cursor-
     A                                       column":"23","top":"410px","cursor-
     A                                       row":"16","css class 2":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"parent tab panel":-
     A                                      "F0383F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class')
     A                                  1  2HTML(' 3":"profound-converted"},{"i-
     A                                      d":"constant24","field type":"outpu-
     A                                      t field","value":"Diag code 4:","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"45","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      561px","cursor column":"42","top":"-
     A                                      410px","cursor row":"16","parent ta-
     A                                      b panel":"F0383F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCDXR4",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCDXR4","designV-
     A                                      alue":"[SCDXR4]","refField":"FLAG",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","visibility":{"fieldName":"45"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"652px","cursor -
     A                                      column":"55","top":"410px","cursor -
     A                                      row":"16","width":"8px","css class -
     A                                      3":{"fieldName":"N09 and N46","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"46 or -
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 4":{"fieldNam-
     A                                      e":"46 or 09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"error m-
     A                                      essage id":"MC40076","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"86","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"2 m-
     A                                      essages","error message id 2":"MCR0-
     A                                      676","error message file 2":"FSMESG-
     A                                      ","error message library 2":"*LIBL"-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      91 and 92 and N93 and N94","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"F0383F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"SCDIA4-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCDIA4","refField"-
     A                                      :"DS7","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"r-
     A                                      eference","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[S-
     A                                      CDIA4]"},"css class":"output-field"-
     A                                      ,"visibility":{"fieldName":"45","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"666px","cursor colu-
     A                                      mn":"57","top":"410px","cursor row"-
     A                                      :"16","css class 2":{')
     A                                  1  2HTML('"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"par-
     A                                      ent tab panel":"F0383F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      D4DS","field type":"output field","-
     A                                      value":{"fieldName":"SCD4DS","desig-
     A                                      nValue":"[SCD4DS]","refField":"DS15-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"visibility":{"fieldName":"45","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"720px","cursor colu-
     A                                      mn":"63","top":"410px","cursor row"-
     A                                      :"16","css class 2":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"parent tab panel":"F038-
     A                                      3F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant25","field typ-
     A                                      e":"output field","value":"$ Charge-
     A                                      s                :","css class":"co-
     A                                      nstant","left":"281px","cursor colu-
     A                                      mn":"2","top":"430px","cursor row":-
     A                                      "17","parent tab panel":"F0383F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted","-
     A                                      width":"180px"},{"id":"SCCHRG","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCCHRG","designValue-
     A                                      ":"[SCCHRG]","refField":"A92","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"true","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      numBlankFill":"true"},"left":"470px-
     A                                      ","cursor column":"26","top":"430px-
     A                                      ","cursor row":"17","width":"78px",-
     A                                      "text align":"right","css class 3":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 4":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 5":"HI","set focus":{"fie-
     A                                      ldName":"38 or 53","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage id":"MCR0556","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"67","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"3 me-
     A                                      ssages","error message id 2":"MC401-
     A                                      16","error message file 2":"FSMESG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{')
     A                                  1  2HTML('"fieldName":"58","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 3":"MCR0676","error message f-
     A                                      ile 3":"FSMESG","error message libr-
     A                                      ary 3":"*LIBL","error condition 3":-
     A                                      {"fieldName":"N35 and 36 and N37 an-
     A                                      d N43","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"parent tab panel":"F0383F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant26","field type":"-
     A                                      output field","value":"Payment     -
     A                                                   :","css class":"consta-
     A                                      nt","left":"561px","cursor column":-
     A                                      "42","top":"430px","cursor row":"17-
     A                                      ","parent tab panel":"F0383F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCPAID","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCPA-
     A                                      ID","designValue":"[SCPAID]","refFi-
     A                                      eld":"A92","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00","numBlankFill":"true-
     A                                      "},"left":"750px","cursor column":"-
     A                                      69","top":"430px","cursor row":"17"-
     A                                      ,"width":"78px","text align":"right-
     A                                      ","css class 3":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 4":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"33","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      e id":"MC40116","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"58","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0676",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"N35 a-
     A                                      nd N36 and 37 and N43","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"F0383F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted"},{"id":"SCHMR1","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCHMR1","designValue":-
     A                                      "[SCHMR1]","refField":"DS10","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"fals')
     A                                  1  2HTML('e","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"281px","cursor-
     A                                       column":"2","top":"450px","cursor -
     A                                      row":"18","parent tab panel":"F0383-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant27","field type-
     A                                      ":"output field","value":"amount   -
     A                                           :","css class":"constant","lef-
     A                                      t":"358px","cursor column":"13","to-
     A                                      p":"450px","cursor row":"18","paren-
     A                                      t tab panel":"F0383F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCMR-
     A                                      A","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCMRA","desig-
     A                                      nValue":"[SCMRA]","refField":"A92",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","numBlankFill":"true"},"left":"-
     A                                      470px","cursor column":"29","top":"-
     A                                      450px","cursor row":"18","width":"7-
     A                                      8px","text align":"right","css clas-
     A                                      s 3":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 4":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"css class 5":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"set focus":{"fieldName":"-
     A                                      55","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"error message id":"MC40-
     A                                      116","error message file":"FSMESG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"58","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"2 messages","error -
     A                                      message id 2":"MCR0676","error mess-
     A                                      age file 2":"FSMESG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"N35 and N36 and -
     A                                      N37 and 43","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F03-
     A                                      83F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"SCHNTW","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCHNTW","designValue":"[SCHNTW]",-
     A                                      "refField":"DS10","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","visibility":{"fie-
     A                                      ldName":"47","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden')
     A                                  1  2HTML('"},"left":"561px","cursor col-
     A                                      umn":"42","top":"450px","cursor row-
     A                                      ":"18","parent tab panel":"F0383F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant28","field type":"-
     A                                      output field","value":"amount      -
     A                                        :","css class":"constant","visibi-
     A                                      lity":{"fieldName":"47","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"638px","cursor column":"53"-
     A                                      ,"top":"450px","cursor row":"18","p-
     A                                      arent tab panel":"F0383F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCNTWK","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCNTWK",-
     A                                      "designValue":"[SCNTWK]","refField"-
     A                                      :"A92","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","numBlankFill":"true"},"-
     A                                      visibility":{"fieldName":"47","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"750px","cursor column-
     A                                      ":"69","top":"450px","cursor row":"-
     A                                      18","width":"78px","text align":"ri-
     A                                      ght","css class 3":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 4":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"error messa-
     A                                      ge id":"MC40116","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"58","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"2 messa-
     A                                      ges","error message id 2":"MCR0676"-
     A                                      ,"error message file 2":"FSMESG","e-
     A                                      rror message library 2":"*LIBL","er-
     A                                      ror condition 2":{"fieldName":"35 a-
     A                                      nd 36 and N37 and N43","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"F0383F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 6":"pro-
     A                                      found-converted"},{"id":"SCHO11","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCHO11","designValue":-
     A                                      "[SCHO11]","refField":"DS10","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      470px","cursor row":"')
     A                                  1  2HTML('19","parent tab panel":"F0383-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant29","field type-
     A                                      ":"output field","value":"amount   -
     A                                           :","css class":"constant","lef-
     A                                      t":"358px","cursor column":"13","to-
     A                                      p":"470px","cursor row":"19","paren-
     A                                      t tab panel":"F0383F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCOT-
     A                                      HR","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCOTHR","des-
     A                                      ignValue":"[SCOTHR]","refField":"A9-
     A                                      2","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","numBlankFill":"true"},"left-
     A                                      ":"470px","cursor column":"29","top-
     A                                      ":"470px","cursor row":"19","width"-
     A                                      :"78px","text align":"right","css c-
     A                                      lass 3":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 4":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"error message id":"MC4-
     A                                      0116","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"58","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"2 messages","error-
     A                                       message id 2":"MCR0676","error mes-
     A                                      sage file 2":"FSMESG","error messag-
     A                                      e library 2":"*LIBL","error conditi-
     A                                      on 2":{"fieldName":"N35 and 36 and -
     A                                      37 and N43","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F03-
     A                                      83F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"SCHO12","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCHO12","designValue":"[SCHO12]",-
     A                                      "refField":"DS10","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"561px","cu-
     A                                      rsor column":"42","top":"470px","cu-
     A                                      rsor row":"19","parent tab panel":"-
     A                                      F0383F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant30","field-
     A                                       type":"output field","value":"type-
     A                                       code     :","css class":"constant"-
     A                                      ,"left":"638px","cursor column":"53-
     A                                      ","top":"470px","cursor row":"19","-
     A                                      parent tab panel":"F0')
     A                                  1  2HTML('383F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCOT1C","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCOT1C","designValue":-
     A                                      "[SCOT1C]","refField":"CODE3","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"750px","cursor column":"69"-
     A                                      ,"top":"470px","cursor row":"19","w-
     A                                      idth":"22px","css class 3":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 4":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"set-
     A                                       focus":{"fieldName":"48","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"MC40072","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"78","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message id 2"-
     A                                      :"MCR0513","error message file 2":"-
     A                                      FSMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"79","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"F0383-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"SCHO21","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCHO21","designValue":"[SCHO21]","r-
     A                                      efField":"DS10","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"281px","curs-
     A                                      or column":"2","top":"490px","curso-
     A                                      r row":"20","parent tab panel":"F03-
     A                                      83F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant31","field ty-
     A                                      pe":"output field","value":"amount -
     A                                             :","css class":"constant","l-
     A                                      eft":"358px","cursor column":"13","-
     A                                      top":"490px","cursor row":"20","par-
     A                                      ent tab panel":"F0383F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      OTH2","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCOTH2","d-
     A                                      esignValue":"[SCOTH2]","refField":"-
     A                                      A92","dataType":"refe')
     A                                  1  2HTML('rence","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","numBl-
     A                                      ankFill":"true"},"left":"470px","cu-
     A                                      rsor column":"29","top":"490px","cu-
     A                                      rsor row":"20","width":"78px","text-
     A                                       align":"right","css class 3":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      4":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      set focus":{"fieldName":"49","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"error message id":"MC40116","erro-
     A                                      r message file":"FSMESG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"58","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"2 messages","error message id-
     A                                       2":"MCR0676","error message file 2-
     A                                      ":"FSMESG","error message library 2-
     A                                      ":"*LIBL","error condition 2":{"fie-
     A                                      ldName":"N35 and N36 and 37 and 43"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"F0383F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"SCHO22","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCHO22","-
     A                                      designValue":"[SCHO22]","refField":-
     A                                      "DS10","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"561px","cursor column-
     A                                      ":"42","top":"490px","cursor row":"-
     A                                      20","parent tab panel":"F0383F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant32","field type":"out-
     A                                      put field","value":"type code     :-
     A                                      ","css class":"constant","left":"63-
     A                                      8px","cursor column":"53","top":"49-
     A                                      0px","cursor row":"20","parent tab -
     A                                      panel":"F0383F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCOT2C","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCOT2C","designVal-
     A                                      ue":"[SCOT2C]","refField":"CODE3","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase"},"text transform":"upperca-
     A                                      se","left":"750px","cursor column":-
     A                                      "69","top":"490px","c')
     A                                  1  2HTML('ursor row":"20","width":"22px-
     A                                      ","css class 3":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 4":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"set focus":{"f-
     A                                      ieldName":"50","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"error messag-
     A                                      e id":"MC40072","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"80","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0513",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"81","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"F0383F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant34","field type":"output f-
     A                                      ield","value":"Rule                -
     A                                           :","css class":"constant","vis-
     A                                      ibility":{"fieldName":"56","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      65","top":"510px","cursor row":"21"-
     A                                      ,"parent tab panel":"F0383F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted","widt-
     A                                      h":"150px"},{"id":"SCRULE","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCRULE","designValue":"[SCRU-
     A                                      LE]","refField":"A90","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00"},"css cla-
     A                                      ss":"output-field","visibility":{"f-
     A                                      ieldName":"56","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"4-
     A                                      70px","cursor column":"71","top":"5-
     A                                      10px","cursor row":"21","width":"63-
     A                                      px","text align":"left","parent tab-
     A                                       panel":"F0383F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      7","field type":"output field","val-
     A                                      ue":" ","css class":"constant","vis-
     A                                      ibility":{"fieldName":"09 and 29","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"280px","cursor co-
     A                                      lumn":"2","top":"550px","cursor row-
     A                                      ":"22","css class 2":')
     A                                  1  2HTML('"BLU","parent tab panel":"F03-
     A                                      83F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant35","field ty-
     A                                      pe":"output field","value":" ","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"N09 and 29","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"280px","cursor column":"2","-
     A                                      top":"550px","cursor row":"22","css-
     A                                       class 2":"BLU","parent tab panel":-
     A                                      "F0383F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant36","fiel-
     A                                      d type":"output field","value":" ",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"N09 and N29","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"280px","cursor column":-
     A                                      "2","top":"550px","cursor row":"22"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"F0383F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"constant40",-
     A                                      "field type":"output field","value"-
     A                                      :" ","css class":"constant","visibi-
     A                                      lity":{"fieldName":"09 and N29","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"280px","cursor colu-
     A                                      mn":"2","top":"570px","cursor row":-
     A                                      "23","css class 2":"BLU","parent ta-
     A                                      b panel":"F0383F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      39","field type":"output field","va-
     A                                      lue":" ","css class":"constant","vi-
     A                                      sibility":{"fieldName":"N09 and N29-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"280px","cursor-
     A                                       column":"2","top":"570px","cursor -
     A                                      row":"23","css class 2":"BLU","pare-
     A                                      nt tab panel":"F0383F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant38","field type":"output field-
     A                                      ","value":" ","css class":"constant-
     A                                      ","visibility":{"fieldName":"N09 an-
     A                                      d 29","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"280px","cu-
     A                                      rsor column":"2","top":"570px","cur-
     A                                      sor row":"23","css class 2":"BLU","-
     A                                      parent tab panel":"F0383F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant41","field type":"output f-
     A                                      ield","value":"             ","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"70","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      0px","cursor column":"2","top":"590-
     A                                      px","cursor row":"24","parent tab p-
     A                                      anel":"F0383F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"En')
     A                                  1  2HTML('ter","left":"14px","top":"150-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF01","field type":"button","vi-
     A                                      sibility":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"value":"Repeat","shortcut key-
     A                                      ":"F1","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF02","field type":"button","visibi-
     A                                      lity":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"value":"Process","shortcut key":"-
     A                                      F2","left":"14px","top":"216px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF0-
     A                                      5","field type":"button","visibilit-
     A                                      y":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"v-
     A                                      alue":"Refresh","shortcut key":"F5"-
     A                                      ,"left":"14px","top":"249px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF07",-
     A                                      "field type":"button","visibility":-
     A                                      {"fieldName":"N09 and 29 or N09 and-
     A                                       N29 or 09 and 29 or 09 and N29","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"value":"Header Info","sho-
     A                                      rtcut key":"F7","left":"14px","top"-
     A                                      :"282px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF09","field type":"button-
     A                                      ","visibility":{"fieldName":"29","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"value":"Code Info","short-
     A                                      cut key":"F9","left":"14px","top":"-
     A                                      315px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF10","field type":"button",-
     A                                      "visibility":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"value":"Search","shortcut -
     A                                      key":"F10","left":"14px","top":"348-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF11","field type":"button","vi-
     A                                      sibility":{"fieldName":"29","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":"EOB/Notes","shortcut k-
     A                                      ey":"F11","left":"14px","top":"381p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF12","field type":"button","vis-
     A                                      ibility":{"fieldName":"09 and 29 or-
     A                                       N09 and 29 or N09 and N29 or 09 an-
     A                                      d N29","dataType":"ex')
     A                                  1  2HTML('pression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Cancel","shortcut key":-
     A                                      "F12","left":"14px","top":"414px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F14","field type":"button","visibil-
     A                                      ity":{"fieldName":"09 and 29 or N09-
     A                                       and 29 or N09 and N29 or 09 and N2-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"DARTS","shor-
     A                                      tcut key":"F14","left":"14px","top"-
     A                                      :"447px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF15","field type":"button-
     A                                      ","visibility":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":"Display Lines","-
     A                                      shortcut key":"F15","left":"14px","-
     A                                      top":"480px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"constant42","field type":-
     A                                      "output field","css class":"constan-
     A                                      t","value":"EOB codes:","cursor row-
     A                                      ":"21","cursor column":"37","left":-
     A                                      "280px","top":"530px","css class 2"-
     A                                      :"profound-converted","visibility":-
     A                                      {"fieldName":"59 or 09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "parent tab panel":"F0383F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0"},{"id"-
     A                                      :"SCEOB1","field type":"output fiel-
     A                                      d","css class":"output-field","valu-
     A                                      e":{"fieldName":"SCEOB1","trimLeadi-
     A                                      ng":"true","trimTrailing":"false","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"reference","format-
     A                                      ting":"Text","textTransform":"upper-
     A                                      case","designValue":"[SCEOB1]","ref-
     A                                      Field":"CODE3","keywords":[]},"curs-
     A                                      or row":"21","cursor column":"48","-
     A                                      left":"360px","top":"530px","width"-
     A                                      :"46PX","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      59 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"parent tab pa-
     A                                      nel":"F0383F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0"},{"id":"SCEOB2","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"SCEOB2","trimLeading":"true","tr-
     A                                      imTrailing":"false","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      textTransform":"uppercase","designV-
     A                                      alue":"[SCEOB2]","refField":"CODE3"-
     A                                      ,"keywords":[]},"cursor row":"21","-
     A                                      cursor column":"52","left":"410px",-
     A                                      "top":"530px","width":"46PX","css c-
     A                                      lass 2":"profound-converted","visib-
     A                                      ility":{"fieldName":"59 or 09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"parent tab panel":"F0383F_S-
     A                                      CR01_MainTabPanel","p')
     A                                  1  2HTML('arent tab":"0"},{"id":"SCEOB3-
     A                                      ","field type":"output field","css -
     A                                      class":"output-field","value":{"fie-
     A                                      ldName":"SCEOB3","trimLeading":"tru-
     A                                      e","trimTrailing":"false","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","textTransform":"uppercase","d-
     A                                      esignValue":"[SCEOB3]","refField":"-
     A                                      CODE3","keywords":[]},"cursor row":-
     A                                      "21","cursor column":"56","left":"4-
     A                                      60px","top":"530px","width":"46PX",-
     A                                      "css class 2":"profound-converted",-
     A                                      "visibility":{"fieldName":"59 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"parent tab panel":"F0-
     A                                      383F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0"},{"id":"SCEOB4","field type"-
     A                                      :"output field","css class":"output-
     A                                      -field","value":{"fieldName":"SCEOB-
     A                                      4","trimLeading":"true","trimTraili-
     A                                      ng":"false","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"refer-
     A                                      ence","formatting":"Text","textTran-
     A                                      sform":"uppercase","designValue":"[-
     A                                      SCEOB4]","refField":"CODE3","keywor-
     A                                      ds":[]},"cursor row":"21","cursor c-
     A                                      olumn":"60","left":"510px","top":"5-
     A                                      30px","width":"46PX","css class 2":-
     A                                      "profound-converted","visibility":{-
     A                                      "fieldName":"59 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      parent tab panel":"F0383F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0"},{"id":-
     A                                      "SCEOB5","field type":"output field-
     A                                      ","css class":"output-field","value-
     A                                      ":{"fieldName":"SCEOB5","dataLength-
     A                                      ":"6","trimLeading":"true","trimTra-
     A                                      iling":"false","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SC-
     A                                      EOB5]"},"cursor row":"21","cursor c-
     A                                      olumn":"60","left":"560px","top":"5-
     A                                      30px","width":"46PX","css class 2":-
     A                                      "profound-converted","visibility":{-
     A                                      "fieldName":"59 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      parent tab panel":"F0383F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0"},{"id":-
     A                                      "SCEOB6","field type":"output field-
     A                                      ","css class":"output-field","value-
     A                                      ":{"fieldName":"SCEOB6","dataLength-
     A                                      ":"6","trimLeading":"true","trimTra-
     A                                      iling":"false","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SC-
     A                                      EOB6]"},"cursor row":"21","cursor c-
     A                                      olumn":"60","left":"610px","top":"5-
     A                                      30px","width":"46PX","css class 2":-
     A                                      "profound-converted","visibility":{-
     A                                      "fieldName":"59 or 09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      parent tab panel":"F0383F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0"},{"id":-
     A                                      "SCEOB7","field type":"output field-
     A                                      ","css class":"output')
     A                                  1  2HTML('-field","value":{"fieldName":-
     A                                      "SCEOB7","dataLength":"6","trimLead-
     A                                      ing":"true","trimTrailing":"false",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"uppercase-
     A                                      ","designValue":"[SCEOB7]"},"cursor-
     A                                       row":"21","cursor column":"60","le-
     A                                      ft":"660px","top":"530px","width":"-
     A                                      46PX","css class 2":"profound-conve-
     A                                      rted","visibility":{"fieldName":"59-
     A                                       or 09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"parent tab pane-
     A                                      l":"F0383F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0"},{"id":"SCEOB8","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","value":{"fieldName":-
     A                                      "SCEOB8","dataLength":"6","trimLead-
     A                                      ing":"true","trimTrailing":"false",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"uppercase-
     A                                      ","designValue":"[SCEOB8]"},"cursor-
     A                                       row":"21","cursor column":"60","le-
     A                                      ft":"710px","top":"530px","width":"-
     A                                      46PX","css class 2":"profound-conve-
     A                                      rted","visibility":{"fieldName":"59-
     A                                       or 09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"parent tab pane-
     A                                      l":"F0383F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0"},{"id":"SCEOB9","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","value":{"fieldName":-
     A                                      "SCEOB9","dataLength":"6","trimLead-
     A                                      ing":"true","trimTrailing":"false",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"uppercase-
     A                                      ","designValue":"[SCEOB9]"},"cursor-
     A                                       row":"21","cursor column":"60","le-
     A                                      ft":"760px","top":"530px","width":"-
     A                                      46PX","css class 2":"profound-conve-
     A                                      rted","visibility":{"fieldName":"59-
     A                                       or 09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"parent tab pane-
     A                                      l":"F0383F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0"},{"id":"SCEOB10","fiel-
     A                                      d type":"output field","css class":-
     A                                      "output-field","value":{"fieldName"-
     A                                      :"SCEOB10","dataLength":"6","trimLe-
     A                                      ading":"true","trimTrailing":"false-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCEOB10]"},"cur-
     A                                      sor row":"21","cursor column":"60",-
     A                                      "left":"810px","top":"530px","width-
     A                                      ":"46PX","css class 2":"profound-co-
     A                                      nverted","visibility":{"fieldName":-
     A                                      "59 or 09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"parent tab p-
     A                                      anel":"F0383F_SCR01_MainTabPanel","-
     A                                      parent tab":"0"},{"id":"SCEOB11","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"output-field","value":{"fieldNa-
     A                                      me":"SCEOB11","dataLength":"6","tri-
     A                                      mLeading":"true","trimTrailing":"fa-
     A                                      lse","blankFill":"fal')
     A                                  1  2HTML('se","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"uppercase","designV-
     A                                      alue":"[SCEOB11]"},"cursor row":"21-
     A                                      ","cursor column":"60","left":"860p-
     A                                      x","top":"530px","width":"46PX","cs-
     A                                      s class 2":"profound-converted","vi-
     A                                      sibility":{"fieldName":"59 or 09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"parent tab panel":"F0383-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0"},{"id":"SCEOB12","field type":"-
     A                                      output field","css class":"output-f-
     A                                      ield","value":{"fieldName":"SCEOB12-
     A                                      ","dataLength":"6","trimLeading":"t-
     A                                      rue","trimTrailing":"false","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"uppercase","desi-
     A                                      gnValue":"[SCEOB12]"},"cursor row":-
     A                                      "21","cursor column":"60","left":"9-
     A                                      10px","top":"530px","width":"46PX",-
     A                                      "css class 2":"profound-converted",-
     A                                      "visibility":{"fieldName":"59 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"parent tab panel":"F0-
     A                                      383F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB10        6A  H
     A            SCEOB11        6A  H
     A            SCEOB12        6A  H
     A            SCEOB5         6A  H
     A            SCEOB6         6A  H
     A            SCEOB7         6A  H
     A            SCEOB8         6A  H
     A            SCEOB9         6A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         74A  H
     A            SCPOS          2S 0H
     A            SCZIPB         3A  H
     A            SCAST     R        H      REFFLD(ST)
     A            SCBLCD    R        H      REFFLD(CPT4)
     A            SCCHRG    R        H      REFFLD(A92)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCSCD    R        H      REFFLD(CODE3)
     A            SCCSDS    R        H      REFFLD(DS25)
     A            SCD1DS    R        H      REFFLD(DS15)
     A            SCD2DS    R        H      REFFLD(DS15)
     A            SCD3DS    R        H      REFFLD(DS15)
     A            SCD4DS    R        H      REFFLD(DS15)
     A            SCDESC    R        H      REFFLD(DS25)
     A            SCDIA1    R        H      REFFLD(DS7)
     A            SCDIA2    R        H      REFFLD(DS7)
     A            SCDIA3    R        H      REFFLD(DS7)
     A            SCDIA4    R        H      REFFLD(DS7)
     A            SCDXR1    R        H      REFFLD(FLAG)
     A            SCDXR2    R        H      REFFLD(FLAG)
     A            SCDXR3    R        H      REFFLD(FLAG)
     A            SCDXR4    R        H      REFFLD(FLAG)
     A            SCEDAT    R        H      REFFLD(DT8)
     A            SCEOB#    R        H      REFFLD(EOB#)
     A            SCEOB1    R        H      REFFLD(CODE3)
     A            SCEOB2    R        H      REFFLD(CODE3)
     A            SCEOB3    R        H      REFFLD(CODE3)
     A            SCEOB4    R        H      REFFLD(CODE3)
     A            SCFDAT    R        H      REFFLD(DT8)
     A            SCHMR1    R        H      REFFLD(DS10)
     A            SCHNTW    R        H      REFFLD(DS10)
     A            SCHO11    R        H      REFFLD(DS10)
     A            SCHO12    R        H      REFFLD(DS10)
     A            SCHO21    R        H      REFFLD(DS10)
     A            SCHO22    R        H      REFFLD(DS10)
     A            SCLIN#    R        H      REFFLD(A90)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A92)
     A            SCNTWK    R        H      REFFLD(A92)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOT1C    R        H      REFFLD(CODE3)
     A            SCOT2C    R        H      REFFLD(CODE3)
     A            SCOTH2    R        H      REFFLD(A92)
     A            SCOTHR    R        H      REFFLD(A92)
     A            SCPAID    R        H      REFFLD(A92)
     A            SCPART    R        H      REFFLD(CODE)
     A            SCPODS    R        H      REFFLD(DS10)
     A            SCPRCD    R        H      REFFLD(CPT4)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRULE    R        H      REFFLD(A90)
     A            SCSEQ#    R        H      REFFLD(SEQ#)
     A            SCTDES    R        H      REFFLD(DS40)
     A            SCTOTC    R        H      REFFLD(A92)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C5    SCEDIC7    MCR05-
     A                                      03C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     17RERRMSGID  5    C5    SCE-
     A                                      DIC7    MCR0999C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     18')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN1-
     A                                      7","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN18",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      overlay range":"1-10"},"items":[{"i-
     A                                      d":"SCR02_HREC","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HREC","designValu-
     A                                      e":"[HREC]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      HFLD","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HFLD","designValue":"[HFLD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCR02","field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      m Dialog","text align":"center","le-
     A                                      ft":"5px","top":"5px","height":"370-
     A                                      px","width":"324px","z index":"8","-
     A                                      locked in place":"true"},{"id":"con-
     A                                      stant42","field type":"output field-
     A                                      ","value":"****** ERROR ******","cs-
     A                                      s class":"constant","left":"85px","-
     A                                      cursor column":"10","top":"65px","c-
     A                                      ursor row":"1","css class 2":"profo-
     A                                      und-converted"},{"id":"constant43",-
     A                                      "field type":"output field","value"-
     A                                      :"You have marked the data submissi-
     A                                      on","css class":"constant","left":"-
     A                                      29px","cursor column":"2","top":"85-
     A                                      px","cursor row":"2","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt44","field type":"output field","-
     A                                      value":"flag.  The Date of Service -
     A                                      is a","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      105px","cursor row":"3","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant45","field type":"output field-
     A                                      ","value":"future date and disquali-
     A                                      fies this","css class":"constant","-
     A                                      left":"29px","cursor column":"2","t-
     A                                      op":"125px","cursor row":"4","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant46","field')
     A                                  1  2HTML(' type":"output field","value"-
     A                                      :"claim for data submission.  Pleas-
     A                                      e","css class":"constant","left":"2-
     A                                      9px","cursor column":"2","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt47","field type":"output field","-
     A                                      value":"correct the flag.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"165px","cursor-
     A                                       row":"6","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant48","fiel-
     A                                      d type":"output field","value":"Eli-
     A                                      gible for Data Submission:","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"205px","curso-
     A                                      r row":"8","css class 2":"profound--
     A                                      converted"},{"id":"SCEDI","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCEDI","designValue":"[SC-
     A                                      EDI]","refField":"FLAG","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"239px","cursor column":"32","top"-
     A                                      :"205px","cursor row":"8","width":"-
     A                                      8px","css class 3":"HI","set focus"-
     A                                      :{"fieldName":"17 or 18","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"17","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0999","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"18","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"css class 4":"profound-co-
     A                                      nverted"},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"330px","width":"80px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF12","field type":"butt-
     A                                      on","value":"Cancel","shortcut key"-
     A                                      :"F12","left":"104px","top":"330px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCEDI     R        H      REFFLD(FLAG)
     A          R SCR03
     A  08 10 11
     A  12 13 21
     A  22 23 25                            CA01(08 'Response Indicator *IN08')
     A  26 27 19
     A  20                                  CA02(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(12 'Response Indicator *IN12')
     A                                      SETOF(13 'Response Indicator *IN13')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC26   RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    10 RER-
     A                                      RMSGID  5    C6    SCCRDTC7    MC40-
     A                                      144C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     19 26RERRMSGID  5    C6   -
     A                                       SCCRDTC7    MCR0500C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     19 21RERR-
     A                                      MSGID  5    C6    SCCRDTC7    MCR05-
     A                                      56C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     19 10RERRMSGID  5    C6    -
     A                                      SCCRDTC7    MC40056C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     19 22RERRM-
     A                                      SGID  5    C6    SCCRDTC7    MC4014-
     A                                      5C6    FSMESGC5    *LIBLC0    E1   -
     A                                       6     19 23RERRMSGID  5    C6    S-
     A                                      CCRDTC7    MCR2397C6    FSMESGC5   -
     A                                       *LIBLC0    E1    6     19 25RERRMS-
     A                                      GID  5    C6    SCRRDTC7    MC40144-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      6     20 26RERRMSGID  5    C6    SC-
     A                                      RRDTC7    MCR0500C6    FSMESGC5    -
     A                                      *LIBLC0    E1    6     20 21RERRMSG-
     A                                      ID  5    C6    SCRRDTC7    MCR0556C-
     A                                      6    FSMESGC5    *LIBLC0    E1    6-
     A                                           20 10RERRMSGID  5    C6    SCR-
     A                                      RDTC7    MC40056C6    FSMESGC5    *-
     A                                      LIBLC0    E1    6     20 22RERRMSGI-
     A                                      D  5    C6    SCRRDTC7    MC40145C6-
     A                                          FSMESGC5    *LIBLC0    E1    6 -
     A                                          20 23RERRMSGID  5    C6    SCRR-
     A                                      DTC7    MCR2397C6    FSMESGC5    *L-
     A                                      IBLC0    E1    6     20 25RERRMSGID-
     A                                        5    C6    SCCSDTC7    MCR0500C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         19 21RERRMSGID  5    C6    SCCSD-
     A                                      TC7    MC40202C6    FSMESGC5    *LI-
     A                                      BLC0    E1    6     19 08RERRMSGID -
     A                                       5    C6    SCCSDTC7    MC40056C6  -
     A                                        FSMESGC5    *LIBLC0    E1    6   -
     A                                        19 13RERRMSGID  5    C6    SCCSDT-
     A                                      C7    MC40145C6    FSMESGC5    *LIB-
     A                                      LC0    E1    6     19 12RERRMSGID  -
     A                                      5    C6    SCCSDTC7    MCR2397C6   -
     A                                       FSMESGC5    *LIBLC0    E1    6    -
     A                                       19 11RERRMSGID  5    C6    SCCSDTC-
     A                                      7    MCR0500C6    FSMESGC5    *LIBL-
     A                                      C0    E1    6     19 27RERRMSGID  5-
     A                                          C6    SCRSDTC7    MCR0500C6    -
     A                                      FSMESGC5    *LIBLC0    E1    6     -
     A                                      20 21RERRMSGID  5    C6    SCRSDTC7-
     A                                          MC40202C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     20 08RERRMSGID  5 -
     A                                         C6    SCRSDTC7    MC40056C6    F-
     A                                      SMESGC5    *LIBLC0    E1    6     2-
     A                                      0 13RERRMSGID  5    C6    SCRSDTC7 -
     A                                         MC40145C6    FSMESGC5    *LIBLC0-
     A                                          E1    6     20 12RERRMSGID  5  -
     A                                        C6    SCRSDTC7    MCR2397C6    FS-
     A                                      MESGC5    *LIBLC0    E1    6     20-
     A                                       11RERRMSGID  5    C6    SCRSDTC7  -
     A                                        MCR0500C6    FSMESGC5    *LIBLC0 -
     A                                         E1    6     20 27')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"3","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"set off":{"fieldName":"*IN0-
     A                                      8","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 2":{"fieldName":"*IN10",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 3":{"fieldName":"*IN11","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 4":{"fieldName":"*IN12","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 5":{"fieldName":"*IN13","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 6-
     A                                      ":{"fieldName":"*IN21","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 7":{-
     A                                      "fieldName":"*IN22","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 8":{"fi-
     A                                      eldName":"*IN23","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 9":{"field-
     A                                      Name":"*IN25","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 10":{"fieldNa-
     A                                      me":"*IN26","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 11":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-10"},"i-
     A                                      tems":[{"id":"SCR03_HREC","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"HREC","-
     A                                      designValue":"[HREC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCR03_HFLD","field type":"outpu-
     A                                      t field","visibility":"hidden","val-
     A                                      ue":{"fieldName":"HFLD","designValu-
     A                                      e":"[HFLD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"10"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SCR03"-
     A                                      ,"field type":"panel","panel style"-
     A                                      :"Transform Dialog","text align":"c-
     A                                      enter","left":"5px","top":"5px","he-
     A                                      ight":"370px","width"')
     A                                  1  2HTML(':"324px","z index":"8","locke-
     A                                      d in place":"true"},{"id":"constant-
     A                                      49","field type":"output field","va-
     A                                      lue":"****** ERROR ******","css cla-
     A                                      ss":"constant","left":"85px","curso-
     A                                      r column":"10","top":"65px","cursor-
     A                                       row":"1","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant54","fiel-
     A                                      d type":"output field","value":"Dat-
     A                                      e Recon rcvd/sent must be greater",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "85px","cursor row":"2","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant50","field type":"output field-
     A                                      ","value":"Date Bill rcvd/sent must-
     A                                       be greater","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"19","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"29px","cursor colum-
     A                                      n":"2","top":"85px","cursor row":"2-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant55","field type":-
     A                                      "output field","value":"than or equ-
     A                                      al to \"To date of Service\".","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"2-
     A                                      9px","cursor column":"2","top":"105-
     A                                      px","cursor row":"3","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt51","field type":"output field","-
     A                                      value":"than or equal to \"To date -
     A                                      of Service\".","css class":"constan-
     A                                      t","visibility":{"fieldName":"19","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"29px","cursor col-
     A                                      umn":"2","top":"105px","cursor row"-
     A                                      :"3","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant56","field typ-
     A                                      e":"output field","value":"Date rec-
     A                                      on rcvd by carrier: ","css class":"-
     A                                      constant","visibility":{"fieldName"-
     A                                      :"20","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"29px","cur-
     A                                      sor column":"2","top":"145px","curs-
     A                                      or row":"5","css class 2":"profound-
     A                                      -converted"},{"id":"constant52","fi-
     A                                      eld type":"output field","value":"D-
     A                                      ate bill rcvd by carrier: ","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"19","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"29px-
     A                                      ","cursor column":"2","top":"145px"-
     A                                      ,"cursor row":"5","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCRDT","-
     A                                      field type":"date field","css class-
     A                                      ":"input","css class 2":"date-field-
     A                                      ","value":{"fieldName":"SCCRDT","de-
     A                                      signValue":"[SCCRDT]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units"')
     A                                  1  2HTML(':"","negNum":"-999.00","edtWr-
     A                                      d":"''  /  /    ''","dateFormat":"m-
     A                                      /d/Y"},"visibility":{"fieldName":"1-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"225px","curso-
     A                                      r column":"30","top":"145px","curso-
     A                                      r row":"5","width":"71px","css clas-
     A                                      s 3":{"fieldName":"19","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"err-
     A                                      or message id":"MC40144","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"19 and 26","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"6 messages","error message -
     A                                      id 2":"MCR0500","error message file-
     A                                       2":"FSMESG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"19 and 21","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 3":"MCR0556","error message fi-
     A                                      le 3":"FSMESG","error message libra-
     A                                      ry 3":"*LIBL","error condition 3":{-
     A                                      "fieldName":"19 and 10","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 4":"MC40056","error message -
     A                                      file 4":"FSMESG","error message lib-
     A                                      rary 4":"*LIBL","error condition 4"-
     A                                      :{"fieldName":"19 and 22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage id 5":"MC40145","error messag-
     A                                      e file 5":"FSMESG","error message l-
     A                                      ibrary 5":"*LIBL","error condition -
     A                                      5":{"fieldName":"19 and 23","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 6":"MCR2397","error mess-
     A                                      age file 6":"FSMESG","error message-
     A                                       library 6":"*LIBL","error conditio-
     A                                      n 6":{"fieldName":"19 and 25","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"SCRRDT","field type":"date field-
     A                                      ","css class":"input","css class 2"-
     A                                      :"date-field","value":{"fieldName":-
     A                                      "SCRRDT","designValue":"[SCRRDT]","-
     A                                      refField":"DT8","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''","dateFormat":"m/d/Y"},"-
     A                                      visibility":{"fieldName":"20","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"254px","cursor column-
     A                                      ":"31","top":"145px","cursor row":"-
     A                                      5","width":"71px","css class 3":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"error messa-
     A                                      ge id":"MC40144","error message fil-
     A                                      e":"FSMESG","error me')
     A                                  1  2HTML('ssage library":"*LIBL","error-
     A                                       condition":{"fieldName":"20 and 26-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"6 messages","er-
     A                                      ror message id 2":"MCR0500","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"20 and 21","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 3":"MCR0556","erro-
     A                                      r message file 3":"FSMESG","error m-
     A                                      essage library 3":"*LIBL","error co-
     A                                      ndition 3":{"fieldName":"20 and 10"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error message id 4":"MC40056","er-
     A                                      ror message file 4":"FSMESG","error-
     A                                       message library 4":"*LIBL","error -
     A                                      condition 4":{"fieldName":"20 and 2-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 5":"MC40145","-
     A                                      error message file 5":"FSMESG","err-
     A                                      or message library 5":"*LIBL","erro-
     A                                      r condition 5":{"fieldName":"20 and-
     A                                       23","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 6":"MCR2397"-
     A                                      ,"error message file 6":"FSMESG","e-
     A                                      rror message library 6":"*LIBL","er-
     A                                      ror condition 6":{"fieldName":"20 a-
     A                                      nd 25","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"css class 4":"profound-conv-
     A                                      erted"},{"id":"constant53","field t-
     A                                      ype":"output field","value":"Date b-
     A                                      ill sent to carrier: ","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"19","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"29px","cu-
     A                                      rsor column":"2","top":"185px","cur-
     A                                      sor row":"7","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant57","f-
     A                                      ield type":"output field","value":"-
     A                                      Date recon sent to carrier:","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"20","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"29p-
     A                                      x","cursor column":"2","top":"185px-
     A                                      ","cursor row":"7","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCCSDT",-
     A                                      "field type":"date field","css clas-
     A                                      s":"input","css class 2":"date-fiel-
     A                                      d","value":{"fieldName":"SCCSDT","d-
     A                                      esignValue":"[SCCSDT]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","edtWrd":"''  /  /    ''"-
     A                                      ,"dateFormat":"m/d/Y"},"visibility"-
     A                                      :{"fieldName":"19","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"225px","cursor column":"30","top-
     A                                      ":"185px","cursor row":"7","width":-
     A                                      "71px","css class 3":{"fieldName":"-
     A                                      19","dataType":"expre')
     A                                  1  2HTML('ssion","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"er-
     A                                      ror message id":"MCR0500","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"19 and 21","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"6 messages","error message-
     A                                       id 2":"MC40202","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"19 and 08","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 3":"MC40056","error message f-
     A                                      ile 3":"FSMESG","error message libr-
     A                                      ary 3":"*LIBL","error condition 3":-
     A                                      {"fieldName":"19 and 13","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sage id 4":"MC40145","error message-
     A                                       file 4":"FSMESG","error message li-
     A                                      brary 4":"*LIBL","error condition 4-
     A                                      ":{"fieldName":"19 and 12","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 5":"MCR2397","error messa-
     A                                      ge file 5":"FSMESG","error message -
     A                                      library 5":"*LIBL","error condition-
     A                                       5":{"fieldName":"19 and 11","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 6":"MCR0500","error mes-
     A                                      sage file 6":"FSMESG","error messag-
     A                                      e library 6":"*LIBL","error conditi-
     A                                      on 6":{"fieldName":"19 and 27","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"SCRSDT","field type":"date fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"date-field","value":{"fieldName"-
     A                                      :"SCRSDT","designValue":"[SCRSDT]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "visibility":{"fieldName":"20","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"254px","cursor colum-
     A                                      n":"31","top":"185px","cursor row":-
     A                                      "7","width":"71px","css class 3":{"-
     A                                      fieldName":"20","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"error mess-
     A                                      age id":"MCR0500","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"20 and 21","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "6 messages","error message id 2":"-
     A                                      MC40202","error message file 2":"FS-
     A                                      MESG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"20 and 08","dataT')
     A                                  1  2HTML('ype":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message id 3":"MC40056","err-
     A                                      or message file 3":"FSMESG","error -
     A                                      message library 3":"*LIBL","error c-
     A                                      ondition 3":{"fieldName":"20 and 13-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 4":"MC40145","e-
     A                                      rror message file 4":"FSMESG","erro-
     A                                      r message library 4":"*LIBL","error-
     A                                       condition 4":{"fieldName":"20 and -
     A                                      12","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error message id 5":"MCR2397",-
     A                                      "error message file 5":"FSMESG","er-
     A                                      ror message library 5":"*LIBL","err-
     A                                      or condition 5":{"fieldName":"20 an-
     A                                      d 11","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error message id 6":"MCR0500-
     A                                      ","error message file 6":"FSMESG","-
     A                                      error message library 6":"*LIBL","e-
     A                                      rror condition 6":{"fieldName":"20 -
     A                                      and 27","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"css class 4":"profound-con-
     A                                      verted"},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"330px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field type":"butto-
     A                                      n","value":"Cancel","shortcut key":-
     A                                      "F12","left":"104px","top":"330px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SCCRDT    R        H      REFFLD(DT8)
     A            SCCSDT    R        H      REFFLD(DT8)
     A            SCRRDT    R        H      REFFLD(DT8)
     A            SCRSDT    R        H      REFFLD(DT8)
     A          R EB1WDW
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    11 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"EB1WDW","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"show as window":"true","window to-
     A                                      p":"3","window left":"3","return cu-
     A                                      rsor record":{"fieldName":"HREC","d-
     A                                      ataLength":"10","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none"},"return cursor fie-
     A                                      ld":{"fieldName":"HFLD","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"set off":{"fieldName":"*IN-
     A                                      17","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 2":{"fieldName":"*IN18"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-11"},"items":[{"-
     A                                      id":"EB1WDW_HREC","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"HREC","designVa-
     A                                      lue":"[HREC]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none","dataLength":"10"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"EB1W-
     A                                      DW_HFLD","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"HFLD","designValue":"[HF-
     A                                      LD]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one","dataLength":"10"},"left":"0px-
     A                                      ","top":"-30px","css class":"profou-
     A                                      nd-converted"},{"id":"EB1WDW","fiel-
     A                                      d type":"panel","panel style":"Tran-
     A                                      sform Dialog","text align":"center"-
     A                                      ,"left":"5px","top":"5px","height":-
     A                                      "370px","width":"324px","z index":"-
     A                                      8","locked in place":"true"},{"id":-
     A                                      "constant58","field type":"output f-
     A                                      ield","value":"****** ERROR ******"-
     A                                      ,"css class":"constant","left":"85p-
     A                                      x","cursor column":"10","top":"65px-
     A                                      ","cursor row":"1","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      59","field type":"output field","va-
     A                                      lue":"You have set the payment to 0-
     A                                       but","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      105px","cursor row":"3","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant60","field type":"output field-
     A                                      ","value":"have not entered a denia-
     A                                      l EOBR code","css class":"constant"-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"125px","cursor row":"4","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant61","field type":"outpu-
     A                                      t field","value":"The state require-
     A                                      s that when payment","css class":"c-
     A                                      onstant","left":"29px","cursor colu-
     A                                      mn":"2","top":"145px","cursor row":-
     A                                      "5","css class 2":"profound-convert-
     A                                      ed"},{"id":"constant6')
     A                                  1  2HTML('2","field type":"output field-
     A                                      ","value":"is set to 0 you must ass-
     A                                      ign a denial","css class":"constant-
     A                                      ","left":"29px","cursor column":"2"-
     A                                      ,"top":"165px","cursor row":"6","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant63","field type":"outp-
     A                                      ut field","value":"EOBR code.","css-
     A                                       class":"constant","left":"29px","c-
     A                                      ursor column":"2","top":"185px","cu-
     A                                      rsor row":"7","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant64","-
     A                                      field type":"output field","value":-
     A                                      "Press Enter to continue","css clas-
     A                                      s":"constant","left":"29px","cursor-
     A                                       column":"2","top":"265px","cursor -
     A                                      row":"11","css class 2":"BLU","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"btnSubmit","field type":"button"-
     A                                      ,"value":"Enter","shortcut key":"En-
     A                                      ter","left":"14px","top":"330px","w-
     A                                      idth":"80px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","value":"C-
     A                                      ancel","shortcut key":"F12","left":-
     A                                      "104px","top":"330px","width":"80px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A          R EB2WDW
     A  17 18                               CA01(17 'Response Indicator *IN17')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    11 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"EB2WDW","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"show as window":"true","window to-
     A                                      p":"3","window left":"3","return cu-
     A                                      rsor record":{"fieldName":"HREC","d-
     A                                      ataLength":"10","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none"},"return cursor fie-
     A                                      ld":{"fieldName":"HFLD","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"set off":{"fieldName":"*IN-
     A                                      17","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 2":{"fieldName":"*IN18"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-11"},"items":[{"-
     A                                      id":"EB2WDW_HREC","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"HREC","designVa-
     A                                      lue":"[HREC]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none","dataLength":"10"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"EB2W-
     A                                      DW_HFLD","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"HFLD","designValue":"[HF-
     A                                      LD]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one","dataLength":"10"},"left":"0px-
     A                                      ","top":"-30px","css class":"profou-
     A                                      nd-converted"},{"id":"EB2WDW","fiel-
     A                                      d type":"panel","panel style":"Tran-
     A                                      sform Dialog","text align":"center"-
     A                                      ,"left":"5px","top":"5px","height":-
     A                                      "370px","width":"324px","z index":"-
     A                                      8","locked in place":"true"},{"id":-
     A                                      "constant65","field type":"output f-
     A                                      ield","value":"****** ERROR ******"-
     A                                      ,"css class":"constant","left":"85p-
     A                                      x","cursor column":"10","top":"65px-
     A                                      ","cursor row":"1","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      66","field type":"output field","va-
     A                                      lue":"You have set the payment < ch-
     A                                      arged","css class":"constant","left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "105px","cursor row":"3","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant67","field type":"output fiel-
     A                                      d","value":"and have not entered a -
     A                                      payment","css class":"constant","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"125px","cursor row":"4","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant68","field type":"output fi-
     A                                      eld","value":"adjustment EOBR code.-
     A                                        The state","css class":"constant"-
     A                                      ,"left":"29px","cursor column":"2",-
     A                                      "top":"145px","cursor row":"5","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant69","fiel')
     A                                  1  2HTML('d type":"output field","value-
     A                                      ":"requires that when payment < cha-
     A                                      rged","css class":"constant","left"-
     A                                      :"29px","cursor column":"2","top":"-
     A                                      165px","cursor row":"6","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant70","field type":"output field-
     A                                      ","value":"you must assign a paymen-
     A                                      t adjustment","css class":"constant-
     A                                      ","left":"29px","cursor column":"2"-
     A                                      ,"top":"185px","cursor row":"7","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant72","field type":"outp-
     A                                      ut field","value":"EOBR code.","css-
     A                                       class":"constant","left":"29px","c-
     A                                      ursor column":"2","top":"205px","cu-
     A                                      rsor row":"8","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant71","-
     A                                      field type":"output field","value":-
     A                                      "Press Enter to continue","css clas-
     A                                      s":"constant","left":"29px","cursor-
     A                                       column":"2","top":"265px","cursor -
     A                                      row":"11","css class 2":"BLU","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"btnSubmit","field type":"button"-
     A                                      ,"value":"Enter","shortcut key":"En-
     A                                      ter","left":"14px","top":"330px","w-
     A                                      idth":"80px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","value":"C-
     A                                      ancel","shortcut key":"F12","left":-
     A                                      "104px","top":"330px","width":"80px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
