     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  28 32 33
     A  35 36 38
     A  39 43 52                            CA01(28 'Response Indicator *IN28')
     A  53 54 64
     A  65 73 74
     A  75 76 78                            CA02(32 'Response Indicator *IN32')
     A  79 09 30
     A  25 29 34
     A  37 41 47                            CA03(33 'Response Indicator *IN33')
     A  68 69 71
     A  72 77 80
     A  81 82 83                            CA04(35 'Response Indicator *IN35')
     A  84 85 86
     A  87 88 89
     A  91 92 93                            CA05(36 'Response Indicator *IN36')
     A  94                                  CA06(38 'Response Indicator *IN38')
     A                                      SETOF(39 'Response Indicator *IN39')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                      SETOF(64 'Response Indicator *IN64')
     A                                      SETOF(65 'Response Indicator *IN65')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                  1  2HTML('QPUIREC30   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    22 RER-
     A                                      RMSGID  5    C6    SCSPCDC7    MCR0-
     A                                      441C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     83RERRMSGID  5    C6    SC-
     A                                      SVZPC7    MCR0503C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     81RERRMSGID -
     A                                       5    C6    SCSVZPC7    MCR0676C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        82RERRMSGID  5    C6    SCPOTXC7 -
     A                                         MCR0513C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     71RERRMSGID  5    C-
     A                                      6    SCDIA1C7    MCR2383C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     73RER-
     A                                      RMSGID  5    C6    SCDIA1C7    MC50-
     A                                      006C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     91RERRMSGID  5    C6    SC-
     A                                      DIA2C7    MCR2383C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     74RERRMSGID -
     A                                       5    C6    SCDIA2C7    MC50006C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        92RERRMSGID  5    C6    SCDIA3C7 -
     A                                         MCR2383C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     75RERRMSGID  5    C-
     A                                      6    SCDIA3C7    MC50006C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     93RER-
     A                                      RMSGID  5    C6    SCDIA4C7    MCR2-
     A                                      383C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     76RERRMSGID  5    C6    SC-
     A                                      DIA4C7    MC50006C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     94RERRMSGID -
     A                                       5    C5    SCEDIC7    MCR0503C6   -
     A                                       FSMESGC5    *LIBLC0    E1    6    -
     A                                       78 30RERRMSGID  5    C5    SCEDIC7-
     A                                          MCR0999C6    FSMESGC5    *LIBLC-
     A                                      0    E1    6     79 30RERRMSG    2 -
     A                                         C6    SCLIC#C36   The license # -
     A                                      must be ZZ99999999999.E1    3     8-
     A                                      9RERRMSGID  5    C6    SCLIC#C7    -
     A                                      MCR0503C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     72RERRMSGID  5    C6  -
     A                                        SCLIC#C7    MCR0676C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     80RERRMS-
     A                                      GID  5    C6    SCLIC#C7    MC40450-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     85RERRMSGID  5    C6    SCLIC-
     A                                      #C7    MC40451C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     86RERRMSGID  5 -
     A                                         C6    SCLIC#C7    MC40320C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     8-
     A                                      7RERRMSGID  5    C6    SCLIC#C7    -
     A                                      MC40246C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     88RERRMSGID  5    C6  -
     A                                        SCLIC#C7    MC40432C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     64RERRMS-
     A                                      GID  5    C6    SCLIC#C7    MC40433-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     65RERRMSGID  5    C6    SCPPL-
     A                                      NC7    MC40113C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     77RERRMSGID  5 -
     A                                         C6    SCPPLNC7    MCR2434C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     8-
     A                                      4RERRMSGID  5    C6    SCREVIC7    -
     A                                      MCR0503C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     52RERRMSGID  5    C6  -
     A                                        SCREVIC7    MCR0999C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     53RERRMS-
     A                                      GID  5    C6    SCSNPIFMSSNPI    C6-
     A                                          FSMESGC5    *LIBLC0    FERSNPI -
     A                                         ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","return cursor reco-
     A                                      rd":{"fieldName":"HREC","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"return cursor field":{"fie-
     A                                      ldName":"HFLD","dataLength":"10","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      set off":{"fieldName":"*IN28","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 2":{"fieldName":"*IN32","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      3":{"fieldName":"*IN33","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 4":-
     A                                      {"fieldName":"*IN35","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 5":{"f-
     A                                      ieldName":"*IN36","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 6":{"fiel-
     A                                      dName":"*IN38","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 7":{"fieldNa-
     A                                      me":"*IN39","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 8":{"fieldName"-
     A                                      :"*IN43","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 9":{"fieldName":"*-
     A                                      IN52","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 10":{"fieldName":"*IN-
     A                                      53","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 11":{"fieldName":"*IN54-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 12":{"fieldName":"*IN64",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 13":{"fieldName":"*IN65","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 14":{"fieldName":"*IN73","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 15":{"fieldName":"*IN74","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 16":{"fieldName":"*IN75","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      17":{"fieldName":"*IN76","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 18-
     A                                      ":{"fieldName":"*IN78","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 19":-
     A                                      {"fieldName":"*IN79","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"')
     A                                  1  2HTML('overlay range":"1-22"},"items-
     A                                      ":[{"id":"F0381FFL_SCR01_avKeys","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"AV_KEYS","dataLength":-
     A                                      "1134","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[AV_KEY-
     A                                      S]"},"left":"0px","top":"0px","visi-
     A                                      bility":"hidden"},{"id":"F0381FFL_S-
     A                                      CR01_action","field type":"html con-
     A                                      tainer","white space":"normal","lef-
     A                                      t":"0px","top":"10px","width":"230p-
     A                                      x","css class":"action-panel-conver-
     A                                      ted","height":"700px","html":"<div -
     A                                      class=\"top\"></div><div class=\"im-
     A                                      agetop\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_top.png\" /></div>-
     A                                      <div class=\"menulinks\"></div><div-
     A                                       class=\"imagebottom\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_bott-
     A                                      om.png\" /></div><div class=\"botto-
     A                                      m\"></div>"},{"field type":"icon me-
     A                                      nu button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"32px","z index":"20","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1170px-
     A                                      ","id":"F0381FFL_SCR01_BtnIconMenuS-
     A                                      ystemTools","tool tip":"System Tool-
     A                                      s","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"F0381FFL_SCR01-
     A                                      _ButtonBar","top":"35px","left":"10-
     A                                      36px","width":"187px","height":"28p-
     A                                      x","css class":"stationary","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1040px"-
     A                                      ,"id":"F0381FFL_SCR01_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1066px","id":"F0381FFL_SCR01_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width"')
     A                                  1  2HTML(':"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"F0381FFL_SCR0-
     A                                      1_BtnSearch","tool tip":"Search","o-
     A                                      nclick":"SystemToolbarSearch","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/search.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1118px","i-
     A                                      d":"F0381FFL_SCR01_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "F0381FFL_SCR01_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"F0381-
     A                                      FFL_SCR01_BtnHelp","tool tip":"Help-
     A                                      ","onclick":"SystemToolbarHelp","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/help.png'')-
     A                                      "},{"id":"F0381FFL_SCR01_ImgSysTool-
     A                                      Bottom","field type":"image","image-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/butbarbot.png","left":"1-
     A                                      036px","top":"64px","width":"187px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"stationary","visi')
     A                                  1  2HTML('bility":"hidden"},{"id":"F038-
     A                                      1FFL_SCR01_MainTabPanel","field typ-
     A                                      e":"tab panel","tab panel style":"T-
     A                                      ransform","tab names":{"fieldName":-
     A                                      "SCPRDS","designValue":"[SCPRDS]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"active tab-
     A                                      ":"0","left":"250px","top":"70px","-
     A                                      width":"970px","height":"657px","z -
     A                                      index":"8","locked in place":"true"-
     A                                      ,"css class":"tab-panel","css class-
     A                                       2":"stationary"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0381FFL_SCR01_BtnHiddenSave"-
     A                                      ,"value":"btnSave","top":"100px","r-
     A                                      esponse":{"fieldName":"btnSave","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant1","field type":"output-
     A                                       field","left":"281px","cursor colu-
     A                                      mn":"2","top":"110px","cursor row":-
     A                                      "1","css class":"top-line","value":-
     A                                      "js: currentUser()","css class 2":"-
     A                                      output-field","parent tab panel":"F-
     A                                      0381FFL_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCCONM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCONM","designValue":"[SCCON-
     A                                      M]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","css class 3":"HI","parent -
     A                                      tab panel":"F0381FFL_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant2","field type":"output field",-
     A                                      "left":"778px","cursor column":"73"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class":"top-line","value":"js: cu-
     A                                      rrentDate()","css class 2":"output--
     A                                      field","parent tab panel":"F0381FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"F0381FFL_SCR01_fkeyMenu"-
     A                                      ,"field type":"menu","left":"10px",-
     A                                      "top":"120px","height":"350px","wid-
     A                                      th":"230px","hover background color-
     A                                      ":"#9AAA61","hover text color":"#FF-
     A                                      FFFF","border color":"#4C6106","men-
     A                                      u option indent":"10px","background-
     A                                       color":"#758B27","css class":"acti-
     A                                      on-menu","css class 2":"stationary"-
     A                                      ,"z index":"101"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0381FFL_SCR01_BtnHiddenRefre-
     A                                      sh","value":"btnRefresh","top":"125-
     A                                      px","response":{"fieldName":"btnRef-
     A                                      resh","dataType":"indicator","forma-
     A                                      tting":"Indicator","i')
     A                                  1  2HTML('ndFormat":"1 / 0"}},{"id":"Q1-
     A                                      PGM","field type":"output field","v-
     A                                      alue":{"fieldName":"Q1PGM","designV-
     A                                      alue":"[Q1PGM]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F0381FFL_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCAST",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCAST","designValue"-
     A                                      :"[SCAST]","refField":"ST","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"3-
     A                                      58px","cursor column":"13","top":"1-
     A                                      30px","cursor row":"2","css class 2-
     A                                      ":"HI","parent tab panel":"F0381FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCZIPA","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CZIPA","designValue":"[SCZIPA]","re-
     A                                      fField":"ZIPA","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"379px","curso-
     A                                      r column":"16","top":"130px","curso-
     A                                      r row":"2","css class 2":"HI","pare-
     A                                      nt tab panel":"F0381FFL_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0381FFL_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","visibility":"hidden"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant3","field type":"o-
     A                                      utput field","value":"SCR01","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      0381FFL_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"SCMODE","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MODE","designValue":"[SCMODE]","ref-
     A                                      Field":"PGM","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"7')
     A                                  1  2HTML('64px","cursor column":"71","t-
     A                                      op":"150px","cursor row":"3","css c-
     A                                      lass 2":"HI","parent tab panel":"F0-
     A                                      381FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      381FFL_SCR01_BtnHiddenSearch","valu-
     A                                      e":"btnSearch","top":"150px","respo-
     A                                      nse":{"fieldName":"btnSearch","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCHD1","field type":"output field-
     A                                      ","value":{"fieldName":"SCHD1","des-
     A                                      ignValue":"[SCHD1]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      78"},"css class":"output-field","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"170px","cursor row":"4","parent-
     A                                       tab panel":"F0381FFL_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0381FFL_SCR01_BtnHidd-
     A                                      enDiaryItems","value":"btnDiary","t-
     A                                      op":"175px","response":{"fieldName"-
     A                                      :"btnDiary","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"btnCF03","field -
     A                                      type":"button","value":"Exit","shor-
     A                                      tcut key":"F3","left":"14px","top":-
     A                                      "183px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"SCHD2","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCHD2","-
     A                                      designValue":"[SCHD2]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"78"},"css class":"output-field",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"190px","cursor row":"5","par-
     A                                      ent tab panel":"F0381FFL_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0381FFL_SCR01_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCHD3-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCHD3","designValu-
     A                                      e":"[SCHD3]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none","dataLength":"78"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      1px","cursor column":')
     A                                  1  2HTML('"2","top":"210px","cursor row-
     A                                      ":"6","parent tab panel":"F0381FFL_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"btnCF10","field type":"bu-
     A                                      tton","value":"Search","shortcut ke-
     A                                      y":"F10","left":"14px","top":"216px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0381FFL_SCR01_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt4","field type":"output field","v-
     A                                      alue":"EOMB#:","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"230px","cursor row":"7","-
     A                                      parent tab panel":"F0381FFL_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCEOB#","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCEOB#","-
     A                                      designValue":"[SCEOB#]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","dataLength-
     A                                      ":"9","decPos":"0"},"css class":"ou-
     A                                      tput-field","left":"330px","cursor -
     A                                      column":"9","top":"230px","cursor r-
     A                                      ow":"7","width":"63px","text align"-
     A                                      :"right","parent tab panel":"F0381F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant5","field type-
     A                                      ":"output field","value":"SpCd:","c-
     A                                      ss class":"constant","left":"407px"-
     A                                      ,"cursor column":"20","top":"230px"-
     A                                      ,"cursor row":"7","parent tab panel-
     A                                      ":"F0381FFL_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCSPCD","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCSPCD","designValue"-
     A                                      :"[SCSPCD]","refField":"SPEC","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"449px","cursor column":"26"-
     A                                      ,"top":"230px","cursor row":"7","wi-
     A                                      dth":"22px","css class 3":{"fieldNa-
     A                                      me":"N29 and N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"29 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 4":{"fieldName":"29 or 09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"set focus"')
     A                                  1  2HTML(':{"fieldName":"36","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0441","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"83","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"F0-
     A                                      381FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 5":"profound-co-
     A                                      nverted","tab index":"1"},{"id":"SC-
     A                                      SCDS","field type":"output field","-
     A                                      value":{"fieldName":"SCSCDS","desig-
     A                                      nValue":"[SCSCDS]","refField":"DS15-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"484px","cursor column":"31-
     A                                      ","top":"230px","cursor row":"7","p-
     A                                      arent tab panel":"F0381FFL_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant6","field type":"output f-
     A                                      ield","value":"Svc Zip Code:","css -
     A                                      class":"constant","left":"603px","c-
     A                                      ursor column":"48","top":"230px","c-
     A                                      ursor row":"7","parent tab panel":"-
     A                                      F0381FFL_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCSVZP","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCSVZP","dataLength":"5"-
     A                                      ,"decPos":"0","numSep":"false","zer-
     A                                      oBalance":"false","numBlankFill":"f-
     A                                      alse","zeroFill":"false","noExtraSp-
     A                                      aces":"false","curSym":"","dataType-
     A                                      ":"zoned","formatting":"Number","ne-
     A                                      gNum":"999.00","units":"","designVa-
     A                                      lue":"[SCSVZP]"},"left":"701px","cu-
     A                                      rsor column":"62","top":"230px","cu-
     A                                      rsor row":"7","width":"36px","read -
     A                                      only":{"fieldName":"09 or 29","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 3":{"fieldName":"09 or-
     A                                       29","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"css class 4":{"fieldN-
     A                                      ame":"N09 and N29","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"set foc-
     A                                      us":{"fieldName":"35","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"error-
     A                                       message id":"MCR0503","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"81","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"MC-
     A                                      R0676","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"82","dataType":"expression","form-
     A                                      atting":"Indicator","')
     A                                  1  2HTML('indFormat":"1 / 0"},"parent t-
     A                                      ab panel":"F0381FFL_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 5"-
     A                                      :"profound-converted","tab index":"-
     A                                      2"},{"id":"constantdash","field typ-
     A                                      e":"output field","css class":"cons-
     A                                      tant","value":"-","cursor row":"7",-
     A                                      "cursor column":"68","left":"745px"-
     A                                      ,"top":"230px","css class 2":"profo-
     A                                      und-converted"},{"id":"SCZIP4","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","value":{"fieldName":"SCZIP","d-
     A                                      ataLength":"4","decPos":"0","numSep-
     A                                      ":"false","zeroBalance":"false","nu-
     A                                      mBlankFill":"false","zeroFill":"fal-
     A                                      se","noExtraSpaces":"false","curSym-
     A                                      ":"","dataType":"zoned","formatting-
     A                                      ":"Number","negNum":"999.00","units-
     A                                      ":"","designValue":"[SCZIP]"},"read-
     A                                       only":{"fieldName":"09 or 29","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"left":"755px","top":"230px","wi-
     A                                      dth":"32px","css class 2":"textbox"-
     A                                      ,"css class 3":{"fieldName":"09 or -
     A                                      29","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09 and N29","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"css clas-
     A                                      s 5":"profound-converted","tab inde-
     A                                      x":"2"},{"id":"constant7","field ty-
     A                                      pe":"output field","value":"Ntwk:",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"69","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"805px","cursor column":"69","top-
     A                                      ":"230px","cursor row":"7","parent -
     A                                      tab panel":"F0381FFL_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCNW-
     A                                      CD","field type":"output field","va-
     A                                      lue":{"fieldName":"SCNWCD","designV-
     A                                      alue":"[SCNWCD]","refField":"NWCD",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      visibility":{"fieldName":"69","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"845px","cursor column-
     A                                      ":"75","top":"230px","cursor row":"-
     A                                      7","parent tab panel":"F0381FFL_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCPOTX","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CPOTX","designValue":"[SCPOTX]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"2"},"text transform-
     A                                      ":"uppercase","left":"554px","curso-
     A                                      r column":"41","top":"270px","curso-
     A                                      r row":"9","width":"25px","css clas-
     A                                      s 3":"HI","read only"')
     A                                  1  2HTML(':{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 4":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"39","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 5":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"error message id":"MCR05-
     A                                      13","error message file":"FSMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"71","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","parent t-
     A                                      ab panel":"F0381FFL_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted","tab index":"-
     A                                      3"},{"id":"btnCF11","field type":"b-
     A                                      utton","value":"EOB/Notes","shortcu-
     A                                      t key":"F11","left":"14px","top":"2-
     A                                      49px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"constant8","field type":"output -
     A                                      field","value":"EOB/Notes attached"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"68","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"694px","cursor column":"61","to-
     A                                      p":"250px","cursor row":"8","css cl-
     A                                      ass 2":{"fieldName":"68","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"RI","customFalse":""},"p-
     A                                      arent tab panel":"F0381FFL_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F0381FFL_SCR01_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant9","field type":"output f-
     A                                      ield","value":"Place of treatment  -
     A                                                     :","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"270px","cursor row":"9-
     A                                      ","parent tab panel":"F0381FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCPXDS","field type":"output -
     A                                      field","value":{"fieldName":"SCPXDS-
     A                                      ","designValue":"[SCPXDS]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"30"},"css class":"output-fie-
     A                                      ld","left":"615px","cursor column":-
     A                                      "48","top":"270px","c')
     A                                  1  2HTML('ursor row":"9","parent tab pa-
     A                                      nel":"F0381FFL_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant51-
     A                                      ","field type":"output field","css -
     A                                      class":"constant","value":"ICD 10  -
     A                                         :","cursor row":"9","cursor colu-
     A                                      mn":"4","left":"695px","top":"270px-
     A                                      ","parent tab panel":"F0381FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"scICDind","field type":"check-
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"scICDind","dataLength":-
     A                                      "1","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scICDind]-
     A                                      "},"left":"780px","top":"270px","cs-
     A                                      s class 2":"checkbox","parent tab p-
     A                                      anel":"F0381FFL_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","text transform":-
     A                                      "uppercase","checked value":"Y","un-
     A                                      checked value":"N","disabled":{"fie-
     A                                      ldName":"dspICdind","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"tab inde-
     A                                      x":"4"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F038-
     A                                      1FFL_SCR01_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "visibility":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"value":"Cancel","shortcut k-
     A                                      ey":"F12","left":"14px","top":"282p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      constant10","field type":"output fi-
     A                                      eld","value":"Diagnosis code (1)   -
     A                                                    :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"290px","cursor row":"10-
     A                                      ","parent tab panel":"F0381FFL_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCDIA1","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      DIA1","refField":"DS7","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"reference","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCDIA1]"},"text-
     A                                       transform":"uppercase","left":"554-
     A                                      px","cursor column":"41","top":"290-
     A                                      px","cursor row":"10","width":"50px-
     A                                      ","css class 3":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{')
     A                                  1  2HTML('"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 4":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "set focus":{"fieldName":"34","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error messages":"2 messages","pa-
     A                                      rent tab panel":"F0381FFL_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 5":"profound-converted","tab in-
     A                                      dex":"5","text align":"left","error-
     A                                       message id":"MCR2383","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"73","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error enhanced mod-
     A                                      e":"0","error message id 2":"MC5000-
     A                                      6","error message file 2":"FSMESG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"91-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error enhanced mode 2":"0"},{"id-
     A                                      ":"SCD1DS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCD1DS","-
     A                                      designValue":"[SCD1DS]","refField":-
     A                                      "DS30","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"615px","cursor column-
     A                                      ":"48","top":"290px","cursor row":"-
     A                                      10","css class 2":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"parent tab panel":"F0381F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0381F-
     A                                      FL_SCR01_BtnHiddenHelp","value":"bt-
     A                                      nHelp","top":"300px","response":{"f-
     A                                      ieldName":"btnHelp","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      11","field type":"output field","va-
     A                                      lue":"Diagnosis code (2)           -
     A                                            :","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"310px","cursor row":"11","paren-
     A                                      t tab panel":"F0381FFL_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      DIA2","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCDIA2","r-
     A                                      efField":"DS7","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","textTransform":"uppercase","des-
     A                                      ignValue":"[SCDIA2]"},"text transfo-
     A                                      rm":"uppercase","left')
     A                                  1  2HTML('":"555px","cursor column":"41-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      width":"50px","css class 3":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 4"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"se-
     A                                      t focus":{"fieldName":"28","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error messages":"2 messages","paren-
     A                                      t tab panel":"F0381FFL_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted","tab index-
     A                                      ":"6","text align":"left","error me-
     A                                      ssage id":"MCR2383","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"74","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error enhanced mode":-
     A                                      "0","error message id 2":"MC50006",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"92","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error enhanced mode 2":"0"},{"id":"-
     A                                      SCD2DS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCD2DS","des-
     A                                      ignValue":"[SCD2DS]","refField":"DS-
     A                                      30","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"615px","cursor column":"-
     A                                      48","top":"310px","cursor row":"11"-
     A                                      ,"css class 2":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"parent tab panel":"F0381FFL_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant12","field type":-
     A                                      "output field","value":"Diagnosis c-
     A                                      ode (3)                 :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"330px","curso-
     A                                      r row":"12","parent tab panel":"F03-
     A                                      81FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCDIA3","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCDIA3","refField":"DS7","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"reference"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"uppercase","design')
     A                                  1  2HTML('Value":"[SCDIA3]"},"text tran-
     A                                      sform":"uppercase","left":"555px","-
     A                                      cursor column":"41","top":"330px","-
     A                                      cursor row":"12","width":"50px","cs-
     A                                      s class 3":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"read only":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"css class 4":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"set focus":{"fieldN-
     A                                      ame":"32","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"error messages":"-
     A                                      2 messages","parent tab panel":"F03-
     A                                      81FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted","tab index":"7","text align-
     A                                      ":"left","error message id":"MCR238-
     A                                      3","error message file":"FSMESG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"75","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or enhanced mode":"0","error messag-
     A                                      e id 2":"MC50006","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"93","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error enhanced mo-
     A                                      de 2":"0"},{"id":"SCD3DS","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCD3DS","designValue":"[SCD3D-
     A                                      S]","refField":"DS30","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"615px"-
     A                                      ,"cursor column":"48","top":"330px"-
     A                                      ,"cursor row":"12","css class 2":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"parent tab-
     A                                       panel":"F0381FFL_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t13","field type":"output field","v-
     A                                      alue":"Diagnosis code (4)          -
     A                                             :","css class":"constant","l-
     A                                      eft":"295px","cursor column":"4","t-
     A                                      op":"350px","cursor row":"13","pare-
     A                                      nt tab panel":"F0381FFL_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CDIA4","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCDIA4","-
     A                                      refField":"DS7","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"reference","f')
     A                                  1  2HTML('ormatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[SC-
     A                                      DIA4]"},"text transform":"uppercase-
     A                                      ","left":"555px","cursor column":"4-
     A                                      1","top":"350px","cursor row":"13",-
     A                                      "width":"50px","css class 3":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"s-
     A                                      et focus":{"fieldName":"33","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error messages":"2 messages","pare-
     A                                      nt tab panel":"F0381FFL_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted","tab inde-
     A                                      x":"8","text align":"left","error m-
     A                                      essage id":"MCR2383","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"76","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error enhanced mode"-
     A                                      :"0","error message id 2":"MC50006"-
     A                                      ,"error message file 2":"FSMESG","e-
     A                                      rror message library 2":"*LIBL","er-
     A                                      ror condition 2":{"fieldName":"94",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error enhanced mode 2":"0"},{"id":-
     A                                      "SCD4DS","field type":"output field-
     A                                      ","value":{"fieldName":"SCD4DS","de-
     A                                      signValue":"[SCD4DS]","refField":"D-
     A                                      S30","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"615px","cursor column":-
     A                                      "48","top":"350px","cursor row":"13-
     A                                      ","css class 2":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"parent tab panel":"F0381FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant14","field type"-
     A                                      :"output field","value":"Total char-
     A                                      ge                       :","css cl-
     A                                      ass":"constant","left":"295px","cur-
     A                                      sor column":"4","top":"370px","curs-
     A                                      or row":"14","parent tab panel":"F0-
     A                                      381FFL_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCCHRG","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCCHRG","designValue":"[SCCHRG-
     A                                      ]","refField":"A112","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBal')
     A                                  1  2HTML('ance":"true","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00"},"css class":"output-fiel-
     A                                      d","left":"554px","cursor column":"-
     A                                      41","top":"370px","cursor row":"14"-
     A                                      ,"width":"91px","text align":"right-
     A                                      ","css class 2":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"parent tab panel":"F0381FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant15","field type"-
     A                                      :"output field","value":"Reductions-
     A                                      ","css class":"constant","left":"29-
     A                                      5px","cursor column":"4","top":"390-
     A                                      px","cursor row":"15","parent tab p-
     A                                      anel":"F0381FFL_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCHMRA_DO-
     A                                      T","field type":"output field","val-
     A                                      ue":{"fieldName":"SCHMRA_DOT","desi-
     A                                      gnValue":"[SCHMRA_DOT]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"11"},"css class":"output-field"-
     A                                      ,"left":"372px","cursor column":"15-
     A                                      ","top":"390px","cursor row":"15","-
     A                                      parent tab panel":"F0381FFL_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCHMRA","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCHMRA","-
     A                                      designValue":"[SCHMRA]","refField":-
     A                                      "DS10","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"463px","cursor column-
     A                                      ":"28","top":"390px","cursor row":"-
     A                                      15","parent tab panel":"F0381FFL_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant16","field type":"o-
     A                                      utput field","value":":","css class-
     A                                      ":"constant","left":"540px","cursor-
     A                                       column":"39","top":"390px","cursor-
     A                                       row":"15","parent tab panel":"F038-
     A                                      1FFL_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCMRA","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCMRA","designValue":"[SCMRA]","r-
     A                                      efField":"A112","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00"},"css class":"o-
     A                                      utput-field","left":"554px","cursor-
     A                                       column":"41","top":"390px","cursor-
     A                                       row":"15","width":"91px","text ali-
     A                                      gn":"right","css class 2":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"F0381FFL_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCHNET","field-
     A                                       type":"output field"')
     A                                  1  2HTML(',"value":{"fieldName":"SCHNET-
     A                                      ","designValue":"[SCHNET]","refFiel-
     A                                      d":"DS10","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","visibility":{"fieldName":-
     A                                      "47","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"652px","cur-
     A                                      sor column":"55","top":"390px","cur-
     A                                      sor row":"15","parent tab panel":"F-
     A                                      0381FFL_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant17","fiel-
     A                                      d type":"output field","value":":",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"47","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"729px","cursor column":"66","top-
     A                                      ":"390px","cursor row":"15","parent-
     A                                       tab panel":"F0381FFL_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCN-
     A                                      TWK","field type":"output field","v-
     A                                      alue":{"fieldName":"SCNTWK","design-
     A                                      Value":"[SCNTWK]","refField":"A112"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"css class":"output-field","v-
     A                                      isibility":{"fieldName":"47","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"743px","cursor column"-
     A                                      :"68","top":"390px","cursor row":"1-
     A                                      5","width":"91px","text align":"rig-
     A                                      ht","css class 2":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"parent tab panel":"F0381F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant18","field typ-
     A                                      e":"output field","value":"Reductio-
     A                                      ns","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"4-
     A                                      10px","cursor row":"16","parent tab-
     A                                       panel":"F0381FFL_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCHOT1_-
     A                                      DOT","field type":"output field","v-
     A                                      alue":{"fieldName":"SCHOT1_DOT","de-
     A                                      signValue":"[SCHOT1_DOT]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"11"},"css class":"output-fiel-
     A                                      d","left":"372px","cursor column":"-
     A                                      15","top":"410px","cursor row":"16"-
     A                                      ,"parent tab panel":"F0381FFL_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCHOT1","field type":"output f-
     A                                      ield","value":{"fieldName":"SCHOT1"-
     A                                      ,"designValue":"[SCHOT1]","refField-
     A                                      ":"DS10","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"f')
     A                                  1  2HTML('alse","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "463px","cursor column":"28","top":-
     A                                      "410px","cursor row":"16","parent t-
     A                                      ab panel":"F0381FFL_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant19","field type":"output field",-
     A                                      "value":":","css class":"constant",-
     A                                      "left":"540px","cursor column":"39"-
     A                                      ,"top":"410px","cursor row":"16","p-
     A                                      arent tab panel":"F0381FFL_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCOTHR","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCOTHR","d-
     A                                      esignValue":"[SCOTHR]","refField":"-
     A                                      A112","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00"},"css class":"output-fiel-
     A                                      d","left":"554px","cursor column":"-
     A                                      41","top":"410px","cursor row":"16"-
     A                                      ,"width":"91px","text align":"right-
     A                                      ","css class 2":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"parent tab panel":"F0381FFL-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCHOT2","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CHOT2","designValue":"[SCHOT2]","re-
     A                                      fField":"DS10","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"652px","curso-
     A                                      r column":"55","top":"410px","curso-
     A                                      r row":"16","parent tab panel":"F03-
     A                                      81FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant20","field -
     A                                      type":"output field","value":":","c-
     A                                      ss class":"constant","left":"729px"-
     A                                      ,"cursor column":"66","top":"410px"-
     A                                      ,"cursor row":"16","parent tab pane-
     A                                      l":"F0381FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCOTH2","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCOTH2","designValue":"[-
     A                                      SCOTH2]","refField":"A112","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00"},"cs-
     A                                      s class":"output-field","left":"743-
     A                                      px","cursor column":"68","top":"410-
     A                                      px","cursor row":"16","width":"91px-
     A                                      ","text align":"right","css class 2-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"parent-
     A                                       tab panel":"F0381FFL_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant21","field type":"output field-
     A                                      ","value":"Total paid')
     A                                  1  2HTML('                         :","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"430px"-
     A                                      ,"cursor row":"17","parent tab pane-
     A                                      l":"F0381FFL_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCPAID","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCPAID","designValue":"[-
     A                                      SCPAID]","refField":"A112","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00"},"cs-
     A                                      s class":"output-field","left":"554-
     A                                      px","cursor column":"41","top":"430-
     A                                      px","cursor row":"17","width":"91px-
     A                                      ","text align":"right","css class 2-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"parent-
     A                                       tab panel":"F0381FFL_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant22","field type":"output field-
     A                                      ","value":"Eligible for data submis-
     A                                      sion       :","css class":"constant-
     A                                      ","visibility":{"fieldName":"30","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"left":"295px","cursor col-
     A                                      umn":"4","top":"450px","cursor row"-
     A                                      :"18","parent tab panel":"F0381FFL_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCEDI","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCEDI","designValue":"[SCEDI]","re-
     A                                      fField":"FLAG","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","visibility":{"-
     A                                      fieldName":"30","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      554px","cursor column":"41","top":"-
     A                                      450px","cursor row":"18","width":"8-
     A                                      px","css class 3":{"fieldName":"09 -
     A                                      or 30","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09 and 30 and N25","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09 and 3-
     A                                      0 or 25","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 5":{"fie-
     A                                      ldName":"09 and 30 or 25","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      set focus":{"fieldName":"38 or 30 a-
     A                                      nd 37","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"error message id":"M-
     A                                      CR0503","error messag')
     A                                  1  2HTML('e file":"FSMESG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"78 and 30","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"2 messages","error messa-
     A                                      ge id 2":"MCR0999","error message f-
     A                                      ile 2":"FSMESG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"79 and 30","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"parent ta-
     A                                      b panel":"F0381FFL_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted","tab index":"9-
     A                                      "},{"id":"SCDSDS","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      DSDS","designValue":"[SCDSDS]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none","da-
     A                                      taLength":"36"},"css class":"output-
     A                                      -field","left":"575px","cursor colu-
     A                                      mn":"44","top":"450px","cursor row"-
     A                                      :"18","parent tab panel":"F0381FFL_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant23","field type":-
     A                                      "output field","value":"License#   -
     A                                                              :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"470px","curso-
     A                                      r row":"19","parent tab panel":"F03-
     A                                      81FFL_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCLIC#","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCLIC#","designValue":"[SCL-
     A                                      IC#]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase","dataLength":"13"},"text-
     A                                       transform":"uppercase","left":"554-
     A                                      px","cursor column":"41","top":"470-
     A                                      px","cursor row":"19","width":"92px-
     A                                      ","css class 3":"HI","set focus":{"-
     A                                      fieldName":"41","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"error message":"The license # mus-
     A                                      t be ZZ99999999999.","error conditi-
     A                                      on":{"fieldName":"89","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"9 messages","error message id -
     A                                      2":"MCR0503","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"72","dataType":"expression"-
     A                                      ,"formatting":"Indica')
     A                                  1  2HTML('tor","indFormat":"1 / 0"},"er-
     A                                      ror message id 3":"MCR0676","error -
     A                                      message file 3":"FSMESG","error mes-
     A                                      sage library 3":"*LIBL","error cond-
     A                                      ition 3":{"fieldName":"80","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 4":"MC40450","error messa-
     A                                      ge file 4":"FSMESG","error message -
     A                                      library 4":"*LIBL","error condition-
     A                                       4":{"fieldName":"85","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 5":"MC40451","error message fi-
     A                                      le 5":"FSMESG","error message libra-
     A                                      ry 5":"*LIBL","error condition 5":{-
     A                                      "fieldName":"86","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error message id -
     A                                      6":"MC40320","error message file 6"-
     A                                      :"FSMESG","error message library 6"-
     A                                      :"*LIBL","error condition 6":{"fiel-
     A                                      dName":"87","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error message id 7":"M-
     A                                      C40246","error message file 7":"FSM-
     A                                      ESG","error message library 7":"*LI-
     A                                      BL","error condition 7":{"fieldName-
     A                                      ":"88","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error message id 8":"MC4043-
     A                                      2","error message file 8":"FSMESG",-
     A                                      "error message library 8":"*LIBL","-
     A                                      error condition 8":{"fieldName":"64-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 9":"MC40433","e-
     A                                      rror message file 9":"FSMESG","erro-
     A                                      r message library 9":"*LIBL","error-
     A                                       condition 9":{"fieldName":"65","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"pa-
     A                                      rent tab panel":"F0381FFL_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted","tab in-
     A                                      dex":"10"},{"id":"constant24","fiel-
     A                                      d type":"output field","value":"Mas-
     A                                      ter Lic#:","css class":"constant","-
     A                                      left":"652px","cursor column":"55",-
     A                                      "top":"470px","cursor row":"19","pa-
     A                                      rent tab panel":"F0381FFL_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCFLIC","field type":"output field-
     A                                      ","value":{"fieldName":"SCFLIC","de-
     A                                      signValue":"[SCFLIC]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"13"},"css class":"output-field","-
     A                                      left":"743px","cursor column":"68",-
     A                                      "top":"470px","cursor row":"19","pa-
     A                                      rent tab panel":"F0381FFL_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant25","field type":"output f-
     A                                      ield","value":"Payment code        -
     A                                                     :","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"490px","cursor row":"2-
     A                                      0","parent tab panel":"F0381FFL_SCR-
     A                                      01_MainTabPanel","par')
     A                                  1  2HTML('ent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPPLN",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCPPLN","designV-
     A                                      alue":"[SCPPLN]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase","dataLength":-
     A                                      "2"},"text transform":"uppercase","-
     A                                      left":"554px","cursor column":"41",-
     A                                      "top":"490px","cursor row":"20","wi-
     A                                      dth":"15px","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"43","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MC40113","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"77","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR2434","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"84","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"F0381F-
     A                                      FL_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted","tab index":"11"},{"id":"SCPPD-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCPPDS","designVa-
     A                                      lue":"[SCPPDS]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"36"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "575px","cursor column":"44","top":-
     A                                      "490px","cursor row":"20","parent t-
     A                                      ab panel":"F0381FFL_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant26","field type":"output field",-
     A                                      "value":"Revision Indicator        -
     A                                               :","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"510px","cursor row":"21","pa-
     A                                      rent tab panel":"F0381FFL_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCREVI","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCREVI"-
     A                                      ,"designValue":"[SCREVI]","dataType-
     A                                      ":"char","formatting"')
     A                                  1  2HTML(':"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase","dataLength":"1"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "554px","cursor column":"41","top":-
     A                                      "510px","cursor row":"21","width":"-
     A                                      8px","css class 3":"HI","css class -
     A                                      4":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"54","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":"MCR0503","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"52","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"MCR0999","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"53","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"parent tab panel":-
     A                                      "F0381FFL_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted","tab index":"12"},{"id"-
     A                                      :"SCREVD","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCREVD","d-
     A                                      esignValue":"[SCREVD]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"36"},"css class":"output-field",-
     A                                      "left":"575px","cursor column":"44"-
     A                                      ,"top":"510px","cursor row":"21","p-
     A                                      arent tab panel":"F0381FFL_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constantsnpi","field type":"outpu-
     A                                      t field","css class":"constant","va-
     A                                      lue":"Rendering Provider NPI#      -
     A                                            :","cursor row":"22","cursor -
     A                                      column":"4","left":"295px","top":"5-
     A                                      30px","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCSNPI","field type":-
     A                                      "textbox","css class":"input","valu-
     A                                      e":{"fieldName":"SCSNPI","refField"-
     A                                      :"PREF01/DS15 *LIBL/FSREFP","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"up-
     A                                      percase","designValue":"[SCSNPI]"},-
     A                                      "text align":"left","text transform-
     A                                      ":"uppercase","read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error messages":"1-
     A                                       message","error message id":{"fiel-
     A                                      dName":"mssnpi","dataLength":"10","-
     A                                      trimLeading":"false",')
     A                                  1  2HTML('"trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"},"error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"ersnpi","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error enhanced-
     A                                       mode":"0","left":"555px","top":"53-
     A                                      0px","width":"100px","css class 2":-
     A                                      "textbox","css class 3":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 5":-
     A                                      "profound-converted","tab index":"1-
     A                                      3"},{"id":"HFLD","field type":"outp-
     A                                      ut field","visibility":"hidden","va-
     A                                      lue":{"fieldName":"HFLD","designVal-
     A                                      ue":"[HFLD]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"10"},"le-
     A                                      ft":"0px","top":"-30px","css class"-
     A                                      :"profound-converted"},{"id":"HREC"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":"hidden","value":{"fieldName-
     A                                      ":"HREC","designValue":"[HREC]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none","da-
     A                                      taLength":"10"},"left":"0px","top":-
     A                                      "-30px","css class":"profound-conve-
     A                                      rted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            DSPICDIND      1A  H
     A            ERSNPI         1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            MSSNPI        10A  H
     A            Q1PGM         10A  H
     A            SCDSDS        36A  H
     A            SCEOB#         9S 0H
     A            SCFLIC        13A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCHMRA_DOT    11A  H
     A            SCHOT1_DOT    11A  H
     A            SCICDIND       1A  H
     A            SCLIC#        13A  H
     A            SCPOTX         2A  H
     A            SCPPDS        36A  H
     A            SCPPLN         2A  H
     A            SCPXDS        30A  H
     A            SCREVD        36A  H
     A            SCREVI         1A  H
     A            SCSVZP         5S 0H
     A            SCZIP          4S 0H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCHRG    R        H      REFFLD(A112)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCD1DS    R        H      REFFLD(DS30)
     A            SCD2DS    R        H      REFFLD(DS30)
     A            SCD3DS    R        H      REFFLD(DS30)
     A            SCD4DS    R        H      REFFLD(DS30)
     A            SCDIA1    R        H      REFFLD(DS7)
     A            SCDIA2    R        H      REFFLD(DS7)
     A            SCDIA3    R        H      REFFLD(DS7)
     A            SCDIA4    R        H      REFFLD(DS7)
     A            SCEDI     R        H      REFFLD(FLAG)
     A            SCHMRA    R        H      REFFLD(DS10)
     A            SCHNET    R        H      REFFLD(DS10)
     A            SCHOT1    R        H      REFFLD(DS10)
     A            SCHOT2    R        H      REFFLD(DS10)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A112)
     A            SCNTWK    R        H      REFFLD(A112)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOTH2    R        H      REFFLD(A112)
     A            SCOTHR    R        H      REFFLD(A112)
     A            SCPAID    R        H      REFFLD(A112)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCDS    R        H      REFFLD(DS15)
     A            SCSNPI    R        H      REFFLD(PREF01/DS15 *LIBL/FSREFP)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A  09 29 35
     A  36 68 69
     A  81 82 83                            CA01
     A                                  1  2HTML('QPUIREC4    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C11 -
     A                                        SCSPCD_copyC7    MCR0441C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     83R-
     A                                      ERRMSGID  5    C11   SCSVZP_copyC7 -
     A                                         MCR0503C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     81RERRMSGID  5    C-
     A                                      11   SCSVZP_copyC7    MCR0676C6    -
     A                                      FSMESGC5    *LIBLC0    E1    3     -
     A                                      82')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0381FFL_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0381FFL_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0381FFL_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F0381FFL_SCR02_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F0381FFL_SCR02_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F0381FFL_S')
     A                                  1  2HTML('CR02_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"F0381FFL_SCR02_Btn-
     A                                      Search","tool tip":"Search","onclic-
     A                                      k":"SystemToolbarSearch","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/search.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1118px","id":"F-
     A                                      0381FFL_SCR02_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"F038-
     A                                      1FFL_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"F0381FFL_S-
     A                                      CR02_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"F0381FFL_SCR02_I')
     A                                  1  2HTML('mgSysToolBottom","field type"-
     A                                      :"image","image source":"/profoundu-
     A                                      i/userdata/images/systool/butbarbot-
     A                                      .png","left":"1036px","top":"64px",-
     A                                      "width":"187px","locked in place":"-
     A                                      true","css class":"stationary","vis-
     A                                      ibility":"hidden"},{"id":"F0381FFL_-
     A                                      SCR02_MainTabPanel","field type":"t-
     A                                      ab panel","tab panel style":"Transf-
     A                                      orm","tab names":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0381FFL_SCR02_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant27","field type":"output fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentUser()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F0381-
     A                                      FFL_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCR02_SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","paren-
     A                                      t tab panel":"F0381FFL_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant28","field type":"output fiel-
     A                                      d","left":"778px","cursor column":"-
     A                                      73","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F0381-
     A                                      FFL_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"F0381FFL_SCR02_fkeyMe-
     A                                      nu","field type":"menu","left":"10p-
     A                                      x","top":"120px","height":"350px","-
     A                                      width":"230px","hover background co-
     A                                      lor":"#9AAA61","hover text color":"-
     A                                      #FFFFFF","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","css class":"a-
     A                                      ction-menu","css class 2":"stationa-
     A                                      ry","z index":"101"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class')
     A                                  1  2HTML('":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0381F-
     A                                      FL_SCR02_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCR02_Q1PGM","field type":"output -
     A                                      field","value":{"fieldName":"Q1PGM"-
     A                                      ,"designValue":"[Q1PGM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F0381FFL_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCPRDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"130px","cursor r-
     A                                      ow":"2","css class 2":"HI","parent -
     A                                      tab panel":"F0381FFL_SCR02_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant29","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      02","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F0381FFL_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR02_S-
     A                                      CMODE","field type":"output field",-
     A                                      "value":{"fieldName":"SCMODE","desi-
     A                                      gnValue":"[SCMODE]","refField":"PGM-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"764px","cursor column":"71-
     A                                      ","top":"150px","cursor row":"3","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F0381FFL_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0381FFL_SCR02_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0381FFL_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},')
     A                                  1  2HTML('{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0381F-
     A                                      FL_SCR02_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0381FFL_SC-
     A                                      R02_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0381FFL_SCR02_B-
     A                                      tnHiddenWorkPrinterOutput","value":-
     A                                      "btnWrkprtout","top":"250px","respo-
     A                                      nse":{"fieldName":"btnWrkPrnt","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0381FFL_SCR02_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0381FFL_SCR02_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"co-
     A                                      nstant6","field type":"output field-
     A                                      ","css class":"constant","value":"R-
     A                                      endering provider FEIN            :-
     A                                      ","left":"295px","top":"270px","par-
     A                                      ent tab panel":"F0381FFL_SCR02_Main-
     A                                      TabPanel","parent tab":"0","width":-
     A                                      "255px","height":"15px","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      FEI","field type":"textbox","css cl-
     A                                      ass":"input","value":{"fieldName":"-
     A                                      SCRFEI","refField":"FEIN","numSep":-
     A                                      "false","zeroBalance":"false","numB-
     A                                      lankFill":"false","zeroFill":"false-
     A                                      ","curSym":"","dataType":"reference-
     A                                      ","formatting":"Number","negNum":"9-
     A                                      99.00","units":"","designValue":"[S-
     A                                      CRFEI]"},"left":"560p')
     A                                  1  2HTML('x","top":"270px","css class 2-
     A                                      ":"textbox","parent tab panel":"F03-
     A                                      81FFL_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"width":"64px","css class-
     A                                       3":{"fieldName":"N09","customTrue"-
     A                                      :"UL","customFalse":"","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values"},"css-
     A                                       class 4":{"fieldName":"09","custom-
     A                                      True":"PR","customFalse":"","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values"}-
     A                                      },{"id":"SCRLSN","field type":"text-
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"SCRLSN","refField":"NAM-
     A                                      E","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"refer-
     A                                      ence","formatting":"Text","textTran-
     A                                      sform":"uppercase","designValue":"[-
     A                                      SCRLSN]"},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"left":"560px","top":"2-
     A                                      90px","width":"281px","parent tab p-
     A                                      anel":"F0381FFL_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"te-
     A                                      xtbox","css class 3":{"fieldName":"-
     A                                      N09","customTrue":"UL","customFalse-
     A                                      ":"","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values"},"css class 4":{"fieldN-
     A                                      ame":"09","customTrue":"PR","custom-
     A                                      False":"","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values"},"text transform":-
     A                                      "uppercase"},{"id":"constant7","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"constant","value":"Rendering prov-
     A                                      ider last/group name :","left":"295-
     A                                      px","top":"290px","height":"15px","-
     A                                      width":"255px","parent tab panel":"-
     A                                      F0381FFL_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCRFSN","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "value":{"fieldName":"SCRFSN","refF-
     A                                      ield":"FSN","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "textTransform":"uppercase","design-
     A                                      Value":"[SCRFSN]"},"text transform"-
     A                                      :"uppercase","read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"left":"560px","top"-
     A                                      :"310px","width":"106px","parent ta-
     A                                      b panel":"F0381FFL_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "textbox","css class 3":{"fieldName-
     A                                      ":"N09","customTrue":"UL","customFa-
     A                                      lse":"","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values"},"css class 4":{"fie-
     A                                      ldName":"09","customTrue":"PR","cus-
     A                                      tomFalse":"","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values"}}')
     A                                  1  2HTML(',{"id":"constant8","field typ-
     A                                      e":"output field","css class":"cons-
     A                                      tant","value":"Rendering provider f-
     A                                      irst name      :","left":"295px","t-
     A                                      op":"310px","height":"15px","width"-
     A                                      :"255px","parent tab panel":"F0381F-
     A                                      FL_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant9","field type-
     A                                      ":"output field","css class":"const-
     A                                      ant","value":"Rendering provider ad-
     A                                      dress 1       :","left":"295px","to-
     A                                      p":"330px","height":"15px","width":-
     A                                      "255px","parent tab panel":"F0381FF-
     A                                      L_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCRAD1","field type":"t-
     A                                      extbox","css class":"input","value"-
     A                                      :{"fieldName":"SCRAD1","refField":"-
     A                                      ADR1","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"re-
     A                                      ference","formatting":"Text","textT-
     A                                      ransform":"uppercase","designValue"-
     A                                      :"[SCRAD1]"},"text transform":"uppe-
     A                                      rcase","read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"left":"560px","top":"330p-
     A                                      x","width":"281px","parent tab pane-
     A                                      l":"F0381FFL_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"textb-
     A                                      ox","css class 3":{"fieldName":"N09-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values"},"css class 4":{"fieldName-
     A                                      ":"09","customTrue":"PR","customFal-
     A                                      se":"","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values"}},{"id":"SCRAD2","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","value":{"fieldName":"SCRAD2","-
     A                                      refField":"ADR1","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","textTransform":"uppercase","d-
     A                                      esignValue":"[SCRAD2]"},"text trans-
     A                                      form":"uppercase","read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"left":"560px",-
     A                                      "top":"350px","width":"281px","pare-
     A                                      nt tab panel":"F0381FFL_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"textbox","css class 3":{"fiel-
     A                                      dName":"N09","customTrue":"UL","cus-
     A                                      tomFalse":"","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values"},"css class 4":-
     A                                      {"fieldName":"09","customTrue":"PR"-
     A                                      ,"customFalse":"","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values"}},{"id":"c-
     A                                      onstant10","field type":"output fie-
     A                                      ld","css class":"constant","value":-
     A                                      "Rendering provider address 2      -
     A                                       :","left":"295px","top":"350px","h-
     A                                      eight":"15px","width":"255px","pare-
     A                                      nt tab panel":"F0381FFL_SCR02_MainT-
     A                                      abPanel","parent tab"')
     A                                  1  2HTML(':"0","css class 2":"profound--
     A                                      converted"},{"id":"SCRCTY","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "value":{"fieldName":"SCRCTY","refF-
     A                                      ield":"CTY","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "textTransform":"uppercase","design-
     A                                      Value":"[SCRCTY]"},"text transform"-
     A                                      :"uppercase","read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"left":"560px","top"-
     A                                      :"370px","width":"176px","parent ta-
     A                                      b panel":"F0381FFL_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "textbox","css class 3":{"fieldName-
     A                                      ":"N09","customTrue":"UL","customFa-
     A                                      lse":"","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values"},"css class 4":{"fie-
     A                                      ldName":"09","customTrue":"PR","cus-
     A                                      tomFalse":"","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values"}},{"id":"consta-
     A                                      nt11","field type":"output field","-
     A                                      css class":"constant","value":"Rend-
     A                                      ering provider city            :","-
     A                                      left":"295px","top":"370px","height-
     A                                      ":"15px","width":"255px","parent ta-
     A                                      b panel":"F0381FFL_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCRST"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"SCRS-
     A                                      T","refField":"ST","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","textTransform":"uppercase",-
     A                                      "designValue":"[SCRST]"},"text tran-
     A                                      sform":"uppercase","read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"left":"560px"-
     A                                      ,"top":"390px","width":"15px","pare-
     A                                      nt tab panel":"F0381FFL_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"textbox","css class 3":{"fiel-
     A                                      dName":"N09","customTrue":"UL","cus-
     A                                      tomFalse":"","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values"},"css class 4":-
     A                                      {"fieldName":"09","customTrue":"PR"-
     A                                      ,"customFalse":"","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values"}},{"id":"c-
     A                                      onstant12","field type":"output fie-
     A                                      ld","css class":"constant","value":-
     A                                      "Rendering provider state          -
     A                                       :","left":"295px","top":"390px","h-
     A                                      eight":"15px","width":"255px","pare-
     A                                      nt tab panel":"F0381FFL_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CRZIP","field type":"textbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"SCRZIP","refField":"ZIP","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","curSym":"","dataT')
     A                                  1  2HTML('ype":"reference","formatting"-
     A                                      :"Number","negNum":"999.00","units"-
     A                                      :"","designValue":"[SCRZIP]"},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"le-
     A                                      ft":"560px","top":"410px","width":"-
     A                                      64px","parent tab panel":"F0381FFL_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"textbox","css clas-
     A                                      s 3":{"fieldName":"N09","customTrue-
     A                                      ":"UL","customFalse":"","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values"},"cs-
     A                                      s class 4":{"fieldName":"09","custo-
     A                                      mTrue":"PR","customFalse":"","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      }},{"id":"constant13","field type":-
     A                                      "output field","css class":"constan-
     A                                      t","value":"Rendering provider zip -
     A                                                  :","left":"295px","top"-
     A                                      :"410px","height":"15px","width":"2-
     A                                      55px","parent tab panel":"F0381FFL_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR02_SCHD1","field type"-
     A                                      :"output field","css class":"output-
     A                                      -field","value":{"fieldName":"SCHD1-
     A                                      ","designValue":"[SCHD1]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"78"},"cursor row":"4","cursor-
     A                                       column":"2","left":"281px","top":"-
     A                                      170px","parent tab panel":"F0381FFL-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR02_SCHD2","field type-
     A                                      ":"output field","css class":"outpu-
     A                                      t-field","value":{"fieldName":"SCHD-
     A                                      2","designValue":"[SCHD2]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"78"},"cursor row":"5","curso-
     A                                      r column":"2","left":"280px","top":-
     A                                      "190px","parent tab panel":"F0381FF-
     A                                      L_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCR02_SCHD3","field typ-
     A                                      e":"output field","css class":"outp-
     A                                      ut-field","value":{"fieldName":"SCH-
     A                                      D3","designValue":"[SCHD3]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"78"},"cursor row":"6","curs-
     A                                      or column":"2","left":"280px","top"-
     A                                      :"210px","parent tab panel":"F0381F-
     A                                      FL_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant1","field type-
     A                                      ":"output field","css class":"const-
     A                                      ant","value":"EOMB#:","cursor row":-
     A                                      "7","cursor column":"2","left":"280-
     A                                      px","top":"230px","parent tab panel-
     A                                      ":"F0381FFL_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCEOB#_copy",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"output-field","')
     A                                  1  2HTML('value":{"fieldName":"SCEOB#",-
     A                                      "designValue":"[SCEOB#]","dataType"-
     A                                      :"zoned","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00","dataLengt-
     A                                      h":"9","decPos":"0"},"text align":"-
     A                                      right","cursor row":"7","cursor col-
     A                                      umn":"9","left":"330px","top":"230p-
     A                                      x","width":"63px","parent tab panel-
     A                                      ":"F0381FFL_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant2","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"constant","value":"SpCd:","curs-
     A                                      or row":"7","cursor column":"20","l-
     A                                      eft":"405px","top":"230px","parent -
     A                                      tab panel":"F0381FFL_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCSP-
     A                                      CD_copy","field type":"textbox","cs-
     A                                      s class":"input","value":{"fieldNam-
     A                                      e":"SCSPCD","designValue":"[SCSPCD]-
     A                                      ","refField":"SPEC","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","read only-
     A                                      ":{"fieldName":"29 or 09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"s-
     A                                      et focus":{"fieldName":"36","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "cursor row":"7","cursor column":"2-
     A                                      6","error messages":"1 message","er-
     A                                      ror message id":"MCR0441","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"83","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"left":"449px","-
     A                                      top":"230px","width":"22px","parent-
     A                                       tab panel":"F0381FFL_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"textbox","css class 3":{"fieldN-
     A                                      ame":"N29 and N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"29 or 09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"css class 5":"profound-converte-
     A                                      d"},{"id":"SCSCDS_copy","field type-
     A                                      ":"output field","css class":"outpu-
     A                                      t-field","value":{"fieldName":"SCSC-
     A                                      DS","designValue":"[SCSCDS]","refFi-
     A                                      eld":"DS15","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"cursor row":"7"-
     A                                      ,"cursor column":"31","left":"484px-
     A                                      ","top":"230px","parent tab panel":-
     A                                      "F0381FFL_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant3","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"constant","value":"Svc Zip Code:"-
     A                                      ,"cursor row":"7","cursor column":"-
     A                                      48","left":"605px","t')
     A                                  1  2HTML('op":"230px","parent tab panel-
     A                                      ":"F0381FFL_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCSVZP_copy",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","value":{"fieldName":"SCSVZ-
     A                                      P","designValue":"[SCSVZP]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"5","decPos":"0"},"read only-
     A                                      ":{"fieldName":"09 or 29","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"s-
     A                                      et focus":{"fieldName":"35","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "cursor row":"7","cursor column":"6-
     A                                      2","error messages":"2 messages","e-
     A                                      rror message id":"MCR0503","error m-
     A                                      essage id 2":"MCR0676","error messa-
     A                                      ge file":"FSMESG","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error message library -
     A                                      2":"*LIBL","error condition":{"fiel-
     A                                      dName":"81","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error condition 2":{"f-
     A                                      ieldName":"82","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"701px","top"-
     A                                      :"230px","width":"36px","parent tab-
     A                                       panel":"F0381FFL_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      textbox","css class 3":{"fieldName"-
     A                                      :"09 or 29","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"N09 and N29","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      css class 5":"profound-converted"},-
     A                                      {"id":"constant4","field type":"out-
     A                                      put field","css class":"constant","-
     A                                      value":"Ntwk:","cursor row":"7","cu-
     A                                      rsor column":"69","left":"750px","t-
     A                                      op":"230px","parent tab panel":"F03-
     A                                      81FFL_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      69","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"}},{"id":"SCNWCD_copy"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"output-field","value":{"fiel-
     A                                      dName":"SCNWCD","designValue":"[SCN-
     A                                      WCD]","refField":"NWCD","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"cur-
     A                                      sor row":"7","cursor column":"75","-
     A                                      left":"792px","top":"230px","parent-
     A                                       tab panel":"F0381FFL_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted","visibility-
     A                                      ":{"fieldName":"69","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"constant5","field')
     A                                  1  2HTML(' type":"output field","css cl-
     A                                      ass":"constant","value":"EOB/Notes -
     A                                      attached","cursor row":"8","cursor -
     A                                      column":"61","left":"695px","top":"-
     A                                      250px","parent tab panel":"F0381FFL-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":{"fieldName":"68",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"RI","customFal-
     A                                      se":""},"css class 3":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      68","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"}},{"id":"SCAST_copy",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"output-field","value":{"field-
     A                                      Name":"SCAST","designValue":"[SCAST-
     A                                      ]","refField":"ST","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"cursor r-
     A                                      ow":"2","cursor column":"13","left"-
     A                                      :"359px","top":"130px","parent tab -
     A                                      panel":"F0381FFL_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"H-
     A                                      I","css class 3":"profound-converte-
     A                                      d"},{"id":"SCZIPA_copy","field type-
     A                                      ":"output field","css class":"outpu-
     A                                      t-field","value":{"fieldName":"SCZI-
     A                                      PA","designValue":"[SCZIPA]","refFi-
     A                                      eld":"ZIPA","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"cursor row":"2"-
     A                                      ,"cursor column":"16","left":"379px-
     A                                      ","top":"130px","parent tab panel":-
     A                                      "F0381FFL_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"HI","css-
     A                                       class 3":"profound-converted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCSVZP         5S 0H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRAD1    R        H      REFFLD(ADR1)
     A            SCRAD2    R        H      REFFLD(ADR1)
     A            SCRCTY    R        H      REFFLD(CTY)
     A            SCRFEI    R        H      REFFLD(FEIN)
     A            SCRFSN    R        H      REFFLD(FSN)
     A            SCRLSN    R        H      REFFLD(NAME)
     A            SCRST     R        H      REFFLD(ST)
     A            SCRZIP    R        H      REFFLD(ZIP)
     A            SCSCDS    R        H      REFFLD(DS15)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0381FFL_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0381FFL_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0381FFL_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F0381FFL_SCR03_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F0381FFL_SCR03_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F0381FFL_S')
     A                                  1  2HTML('CR03_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"F0381FFL_SCR03_Btn-
     A                                      Search","tool tip":"Search","onclic-
     A                                      k":"SystemToolbarSearch","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/search.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1118px","id":"F-
     A                                      0381FFL_SCR03_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"F038-
     A                                      1FFL_SCR03_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"F0381FFL_S-
     A                                      CR03_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"F0381FFL_SCR03_I')
     A                                  1  2HTML('mgSysToolBottom","field type"-
     A                                      :"image","image source":"/profoundu-
     A                                      i/userdata/images/systool/butbarbot-
     A                                      .png","left":"1036px","top":"64px",-
     A                                      "width":"187px","locked in place":"-
     A                                      true","css class":"stationary","vis-
     A                                      ibility":"hidden"},{"id":"F0381FFL_-
     A                                      SCR03_MainTabPanel","field type":"t-
     A                                      ab panel","tab panel style":"Transf-
     A                                      orm","tab names":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0381FFL_SCR03_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant30","field type":"output fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentUser()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F0381-
     A                                      FFL_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCR03_SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","paren-
     A                                      t tab panel":"F0381FFL_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant31","field type":"output fiel-
     A                                      d","left":"778px","cursor column":"-
     A                                      73","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F0381-
     A                                      FFL_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"F0381FFL_SCR03_fkeyMe-
     A                                      nu","field type":"menu","left":"10p-
     A                                      x","top":"120px","height":"350px","-
     A                                      width":"230px","hover background co-
     A                                      lor":"#9AAA61","hover text color":"-
     A                                      #FFFFFF","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","css class":"a-
     A                                      ction-menu","css class 2":"stationa-
     A                                      ry","z index":"101"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class')
     A                                  1  2HTML('":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0381F-
     A                                      FL_SCR03_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCR03_Q1PGM","field type":"output -
     A                                      field","value":{"fieldName":"Q1PGM"-
     A                                      ,"designValue":"[Q1PGM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F0381FFL_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR03_SCPRDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"130px","cursor r-
     A                                      ow":"2","css class 2":"HI","parent -
     A                                      tab panel":"F0381FFL_SCR03_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant32","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      03","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F0381FFL_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR03_S-
     A                                      CMODE","field type":"output field",-
     A                                      "value":{"fieldName":"SCMODE","desi-
     A                                      gnValue":"[SCMODE]","refField":"PGM-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"764px","cursor column":"71-
     A                                      ","top":"150px","cursor row":"3","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F0381FFL_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0381FFL_SCR03_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0381FFL_SCR0-
     A                                      3_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},')
     A                                  1  2HTML('{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0381F-
     A                                      FL_SCR03_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0381FFL_SC-
     A                                      R03_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0381FFL_SCR03_B-
     A                                      tnHiddenWorkPrinterOutput","value":-
     A                                      "btnWrkprtout","top":"250px","respo-
     A                                      nse":{"fieldName":"btnWrkPrnt","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0381FFL_SCR03_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0381FFL_SCR03_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
