     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  42 50 51
     A  52 71 72                            CA01
     A                                  1  2HTML('QPUIREC6    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCNDATC7    MCR0-
     A                                      500C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     71 52RERRMSGID  5    C6   -
     A                                       SCNVALC7    MCR0355C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     71 51RERR-
     A                                      MSGID  5    C6    SCNVALC7    MCR07-
     A                                      59C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     72 51RERRMSGID  5    C6    -
     A                                      SCNVA#C7    MCR0355C6    FSMESGC5  -
     A                                        *LIBLC0    E1    6     71 50')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","return cursor reco-
     A                                      rd":{"fieldName":"HREC","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"return cursor field":{"fie-
     A                                      ldName":"HFLD","dataLength":"10","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      overlay range":"1-23"},"items":[{"i-
     A                                      d":"SCDBRR","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCDBRR","designValue"-
     A                                      :"[SCDBRR]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"9","decPos-
     A                                      ":"0"},"left":"0px","top":"-30px","-
     A                                      width":"63px","text align":"right",-
     A                                      "css class":"profound-converted"},{-
     A                                      "id":"HFLD","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"HFLD","designValue":"-
     A                                      [HFLD]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none","dataLength":"10"},"left":"-
     A                                      0px","top":"-30px","css class":"pro-
     A                                      found-converted"},{"id":"HREC","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"HR-
     A                                      EC","designValue":"[HREC]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none","dataLen-
     A                                      gth":"10"},"left":"0px","top":"-30p-
     A                                      x","css class":"profound-converted"-
     A                                      },{"id":"F0400F01_SCR01_avKeys","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"AV_KEYS","dataLength":"-
     A                                      1134","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[AV_KEYS-
     A                                      ]"},"left":"0px","top":"0px","visib-
     A                                      ility":"hidden"},{"id":"F0400F01_SC-
     A                                      R01_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"F0400F01_SCR01_BtnIconMenuSy-
     A                                      stemTools","tool tip":"System Tools-
     A                                      ","icon alignment":"middle left","i-
     A                                      con width":"16px","icon height":"24-
     A                                      px","icon source":"/profoundui/user-
     A                                      data/images/systool/systools.png","-
     A                                      data function":"SystemToolbarSystoo-
     A                                      ls","show down arrow":"Yes"},{"fiel-
     A                                      d type":"panel","panel style":"Tran-
     A                                      sformButtonBar","id":"F0400F01_SCR0-
     A                                      1_ButtonBar","top":"35px","left":"1-
     A                                      036px","width":"187px","height":"28-
     A                                      px","css class":"stationary","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1040px-
     A                                      ","id":"F0400F01_SCR01_BtnSave","to-
     A                                      ol tip":"Save","onclick":"SystemToo-
     A                                      lbarSave","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/save.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1066px","id":"F0400F01_SCR01_Btn-
     A                                      Refresh","tool tip":"Refresh","oncl-
     A                                      ick":"SystemToolbarRefresh","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/refresh.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1092px","id-
     A                                      ":"F0400F01_SCR01_BtnSearch","tool -
     A                                      tip":"Search","onclick":"SystemTool-
     A                                      barSearch","background ima')
     A                                  1  4HTML('ge":"url(''/profoundui/userda-
     A                                      ta/images/systool/search.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1118px","id":"-
     A                                      F0400F01_SCR01_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"F04-
     A                                      00F01_SCR01_BtnSystemMessages","too-
     A                                      l tip":"System Messages","onclick":-
     A                                      "SystemToolbarMessages","background-
     A                                       image":{"fieldName":"MsgIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1196px","id":"F0400F01_-
     A                                      SCR01_BtnHelp","tool tip":"Help","o-
     A                                      nclick":"SystemToolbarHelp","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/help.png'')"},{-
     A                                      "id":"F0400F01_SCR01_ImgSysToolBott-
     A                                      om","field type":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/butbarbot.png","left":"1036p-
     A                                      x","top":"64px","width":"187px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      stationary","visibility":"hidden"},-
     A                                      {"id":"F0400F01_SCR01_MainTabPanel"-
     A                                      ,"field type":"tab panel","tab pane-
     A                                      l style":"Transform","tab names":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "active tab":"0","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      "657px","z index":"8","locked in pl-
     A                                      ace":"true","css class":"tab-panel"-
     A                                      ,"css class 2":"stationary"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F0400F01_SCR01_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"SCUSER","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCUSER","designValue":"[SCUSER]"-
     A                                      ,"refField":"USER","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"110px","cu-
     A                                      rsor row":"1","css class 2":"top-li-
     A                                      ne","parent tab panel":"F0400F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCCONM","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCCO-
     A                                      NM","designValue":"[SCCONM]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"110px","cursor r-
     A                                      ow":"1","css class 2":"top-line","c-
     A                                      ss class 3":"HI","description":"COM-
     A                                      PANY NAME","parent tab panel":"F040-
     A                                      0F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 4":"profound-conv-
     A                                      erted"},{"id":"constant1","field ty-
     A                                      pe":"output field","left":"778px","-
     A                                      cursor column":"73","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"F0400F01_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"F0400-
     A                                      F01_SCR01_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","')
     A                                  1  5HTML('left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0400F01_SCR01_BtnHiddenRefres-
     A                                      h","value":"btnRefresh","top":"125p-
     A                                      x","response":{"fieldName":"btnRefr-
     A                                      esh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"Q1PGM","field type":"ou-
     A                                      tput field","value":{"fieldName":"Q-
     A                                      1PGM","designValue":"[Q1PGM]","refF-
     A                                      ield":"DS10","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"281px","cursor -
     A                                      column":"2","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"F0400F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPRDS","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"130px","curs-
     A                                      or row":"2","css class 2":"HI","des-
     A                                      cription":"PROGRAM NAME","parent ta-
     A                                      b panel":"F0400F01_SCR01_MainTabPan-
     A                                      el","parent tab":"0","visibility":"-
     A                                      hidden","css class 3":"profound-con-
     A                                      verted"},{"id":"constant2","field t-
     A                                      ype":"output field","value":"SCR01"-
     A                                      ,"css class":"constant","left":"799-
     A                                      px","cursor column":"76","top":"130-
     A                                      px","cursor row":"2","parent tab pa-
     A                                      nel":"F0400F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCMODE","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCMODE","designValue":-
     A                                      "[SCMODE]","refField":"NM10","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "764px","cursor column":"71","top":-
     A                                      "150px","cursor row":"3","css class-
     A                                       2":"HI","description":"ADD/UPDATE -
     A                                      MODE","parent tab panel":"F0400F01_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0400F01_-
     A                                      SCR01_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0400F01_SCR01_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      400F01_SCR01_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0400F0-
     A                                      1_SCR01_BtnHiddenWorkSubmitJob","va-
     A                                      lue":"btnWrksbmjob","top":"225px","-
     A                                      response":{"fieldName":"btnWrkJob",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant3","field type":"out-
     A                                      put field","value":"Type informatio-
     A                                      n, press Enter.","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"230px","cursor row":"7"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"F0400F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0400F01_SCR01_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant4"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Line number       :","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"4","top":"270px","cursor r-
     A                                      ow":"9","parent tab panel":"F0400F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCLIN#","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCLIN#","designValue":"[SCLIN#]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none","-
     A                                      dataLength":"4"},"css class":"outpu-
     A                                      t-field","left":"442px","c')
     A                                  1  6HTML('ursor column":"25","top":"270-
     A                                      px","cursor row":"9","parent tab pa-
     A                                      nel":"F0400F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0400F01_SCR01_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0400-
     A                                      F01_SCR01_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t5","field type":"output field","va-
     A                                      lue":"Field name        :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"310px","curso-
     A                                      r row":"11","parent tab panel":"F04-
     A                                      00F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCFLD","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCFLD","designValue":"[SCFLD]","-
     A                                      refField":"DS6","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"442px","curs-
     A                                      or column":"25","top":"310px","curs-
     A                                      or row":"11","parent tab panel":"F0-
     A                                      400F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCFLDD","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCFLDD","designValue":"[SCFLDD-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"30"},"css class":-
     A                                      "output-field","left":"491px","curs-
     A                                      or column":"32","top":"310px","curs-
     A                                      or row":"11","parent tab panel":"F0-
     A                                      400F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant6","field -
     A                                      type":"output field","value":"Error-
     A                                       code        :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"350px","cursor row":"13"-
     A                                      ,"parent tab panel":"F0400F01_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCCODE","field type":"output f-
     A                                      ield","value":{"fieldName":"SCCODE"-
     A                                      ,"designValue":"[SCCODE]","refField-
     A                                      ":"DS3","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"442px","cursor colum-
     A                                      n":"25","top":"350px","cursor row":-
     A                                      "13","parent tab panel":"F0400F01_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCDESC","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCD-
     A                                      ESC","designValue":"[SCDESC]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"50"},"css class":"output--
     A                                      field","left":"470px","cursor colum-
     A                                      n":"29","top":"350px","cursor row":-
     A                                      "13","parent tab panel":"F0400F01_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant7","field type":"o-
     A                                      utput field","value":"Current value-
     A                                           :","css class":"constant","lef-
     A                                      t":"295px","cursor column":"4","top-
     A                                      ":"390px","cursor row":"15","parent-
     A                                       tab panel":"F0400F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCV-
     A                                      DAT","field type":"output field","v-
     A                                      alue":{"fieldName":"SCVDAT","design-
     A                                      Value":"[SCVDAT]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","edtWrd":"''  /  /    ''"},"css -
     A                                      class":"output-field","visibility":-
     A                                      {"fieldName":"52","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"442px","cursor column":"25","top"-
     A                                      :"390px","cursor row":"15","width":-
     A                                      "70px","text align":"right","parent-
     A                                       tab panel":"F0400F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCV-
     A                                      AL#","field type":"output field","v-
     A                                      alue":{"fieldName":"SCVAL#","design-
     A                                      Value":"[SCVAL#]","refField":"A92",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"css class":"output-field","vis-
     A                                      ibility":{"fieldName":"50","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"442px","cursor column":"-
     A                                      25","top":"390px","cursor row":"15"-
     A                                      ,"width":"70px","text align":"right-
     A                                      ","parent tab panel":"F0400F01_SCR0-
     A                                      1_MainTabPanel","parent ta')
     A                                  1  7HTML('b":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCVALU","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCVALU","designValue":"[SC-
     A                                      VALU]","refField":"DS15","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","visibility-
     A                                      ":{"fieldName":"51","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"442px","cursor column":"25","to-
     A                                      p":"390px","cursor row":"15","paren-
     A                                      t tab panel":"F0400F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant8","field type":"output field-
     A                                      ","value":"New value         :","cs-
     A                                      s class":"constant","left":"295px",-
     A                                      "cursor column":"4","top":"430px","-
     A                                      cursor row":"17","parent tab panel"-
     A                                      :"F0400F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCNDAT","field-
     A                                       type":"date field","css class":"in-
     A                                      put","css class 2":"date-field","va-
     A                                      lue":{"fieldName":"SCNDAT","designV-
     A                                      alue":"[SCNDAT]","refField":"DT8","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","numBlankFill":"true","edtWrd":-
     A                                      "''  /  /    ''","dateFormat":"m/d/-
     A                                      Y"},"visibility":{"fieldName":"52",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"442px","cursor c-
     A                                      olumn":"25","top":"430px","cursor r-
     A                                      ow":"17","width":"71px","text align-
     A                                      ":"right","css class 3":{"fieldName-
     A                                      ":"N42","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"42","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 4":{"f-
     A                                      ieldName":"42","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 5-
     A                                      ":{"fieldName":"42","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"error -
     A                                      message id":"MCR0500","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"71 and 52","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "F0400F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"id":"SCNVAL","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCNVAL","designValue":"-
     A                                      [SCNVAL]","refField":"DS15","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","v-
     A                                      isibility":{"fieldName":"51","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"442px","cursor column"-
     A                                      :"25","top":"430px","cursor row":"1-
     A                                      7","width":"106px","css class 3":{"-
     A                                      fieldName":"N42","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"42","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 4":{"fieldName":"42","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 5":{"fieldName":"42","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"error message id":"MCR0355","err-
     A                                      or message file":"FSMESG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"71 and 51","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"2 messages","error me-
     A                                      ssage id 2":"MCR0759","error messag-
     A                                      e file 2":"FSMESG","error message l-
     A                                      ibrary 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"72 and 51","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"F0400F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted"},{"id":"SCN-
     A                                      VA#","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCNVA#","de-
     A                                      signValue":"[SCNVA#]","refField":"A-
     A                                      92","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00"},"visibility":{"fieldName":-
     A                                      "50","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"442px","cur-
     A                                      sor column":"25","top":"430px","cur-
     A                                      sor row":"17","width":"78px","css c-
     A                                      lass 3":{"fieldName":"N42","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom ')
     A                                  1  8HTML('Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"42","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 4":{"fi-
     A                                      eldName":"42","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 5"-
     A                                      :{"fieldName":"42","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"error m-
     A                                      essage id":"MCR0355","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"71 and 50","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      F0400F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF03","field type":"b-
     A                                      utton","value":"Exit","shortcut key-
     A                                      ":"F3","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF10","field type":"button","value"-
     A                                      :"Search","shortcut key":"F10","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF12","fiel-
     A                                      d type":"button","value":"Cancel","-
     A                                      shortcut key":"F12","left":"14px","-
     A                                      top":"249px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCDBRR         9S 0H
     A            SCDESC        50A  H
     A            SCFLDD        30A  H
     A            SCLIN#         4A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCCODE    R        H      REFFLD(DS3)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFLD     R        H      REFFLD(DS6)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNDAT    R        H      REFFLD(DT8)
     A            SCNVA#    R        H      REFFLD(A92)
     A            SCNVAL    R        H      REFFLD(DS15)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCVAL#    R        H      REFFLD(A92)
     A            SCVALU    R        H      REFFLD(DS15)
     A            SCVDAT    R        H      REFFLD(DT8)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0400F01_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0400F01_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0400F01_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F0400F01_SCR02_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F0400F01_SCR02_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F0400F01_SCR02_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      0400F01_SCR02_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F0400F01_SCR02_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F0400F01_SCR02_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0400F01_SCR0-
     A                                      2_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F0400F01_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F0400F01_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0400F01_SCR02_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant9","field type":-
     A                                      "output field","left":"281px","curs-
     A                                      or column":"2","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentUser()","css cla-
     A                                      ss 2":"output-field","parent tab pa-
     A                                      nel":"F0400F01_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"SCR02_SCCO-
     A                                      NM","field type":"output field","va-
     A                                      lue":{"fieldName":"SCCONM","designV-
     A                                      alue":"[SCCONM]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class 2":"top-line","css class 3":-
     A                                      "HI","parent tab panel":"F0400F01_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 4":"profound-converted"-
     A                                      },{"id":"constant10","field type":"-
     A                                      output field","left":"778px","curso-
     A                                      r column":"73","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentDate()","css cla-
     A                                      ss 2":"output-field","parent tab pa-
     A                                      nel":"F0400F01_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"F0400F01_S-
     A                                      CR02_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0400F01_SCR02_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"SCR02_Q1-
     A                                      PGM","field type":"output field","v-
     A                                      alue":{"fieldName":"Q1PGM","designV-
     A                                      alue":"[Q1PGM]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F0400F01_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR02_S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0400F01_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","visibility":"hidden"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant11","field type":"-
     A                                      output field","value":"SCR02","css -
     A                                      class":"constant","left":"799px","c-
     A                                      ursor column":"76","top":"130px","c-
     A                                      ursor row":"2","parent tab panel":"-
     A                                      F0400F01_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCR02_SCMODE","f-
     A                                      ield type":"output field",')
     A                                  1  5HTML('"value":{"fieldName":"SCMODE"-
     A                                      ,"designValue":"[SCMODE]","refField-
     A                                      ":"PGM","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"764px","cursor colum-
     A                                      n":"71","top":"150px","cursor row":-
     A                                      "3","css class 2":"HI","parent tab -
     A                                      panel":"F0400F01_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0400F01_SCR02_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0400F0-
     A                                      1_SCR02_BtnHiddenDiaryItems","value-
     A                                      ":"btnDiary","top":"175px","respons-
     A                                      e":{"fieldName":"btnDiary","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0400F01_SCR02_BtnHi-
     A                                      ddenSystemMessages","value":"btnMes-
     A                                      sage","top":"200px","response":{"fi-
     A                                      eldName":"btnMessage","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F0400F01_SCR02_BtnHiddenW-
     A                                      orkSubmitJob","value":"btnWrksbmjob-
     A                                      ","top":"225px","response":{"fieldN-
     A                                      ame":"btnWrkJob","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0400F01_SCR02_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0400F01_SCR02_BtnHiddenImageQ-
     A                                      ueue","value":"btnImgQue","top":"27-
     A                                      5px","response":{"fieldName":"btnIm-
     A                                      gQue","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0400F-
     A                                      01_SCR02_BtnHiddenHelp","value":"bt-
     A                                      nHelp","top":"300px","response":{"f-
     A                                      ieldName":"btnHelp","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"btnSubmi-
     A                                      t","field type":"button","value":"E-
     A                                      nter","shortcut key":"Enter","left"-
     A                                      :"14px","top":"150px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF03","field -
     A                                      type":"button","value":"Exit","shor-
     A                                      tcut key":"F3","left":"14px","top":-
     A                                      "183px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF10","field type":"button"-
     A                                      ,"value":"Search","shortcut key":"F-
     A                                      10","left":"14px","top":"216px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","value":"C-
     A                                      ancel","shortcut key":"F12","left":-
     A                                      "14px","top":"249px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0400F01_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0400F01_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0400F01_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F0400F01_SCR03_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F0400F01_SCR03_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F0400F01_SCR03_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      0400F01_SCR03_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F0400F01_SCR03_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F0400F01_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0400F01_SCR0-
     A                                      3_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F0400F01_SCR03_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F0400F01_SCR03_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0400F01_SCR03_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant12","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0400F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F0400F01_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant13","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0400F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"F0400F01_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0400F01_SCR03-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR03_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F0400F01_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F0400F01_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant14","field type":-
     A                                      "output field","value":"SCR03","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F0400F01_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR03_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F0400F01_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0400F01_SCR03_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0400F-
     A                                      01_SCR03_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0400F01_SCR03_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0400F01_SCR03_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0400F01_SCR03_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0400F01_SCR03_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0400-
     A                                      F01_SCR03_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF10","field type":"button-
     A                                      ","value":"Search","shortcut key":"-
     A                                      F10","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      12","field type":"button","value":"-
     A                                      Cancel","shortcut key":"F12","left"-
     A                                      :"14px","top":"249px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R MSGSFL                    SFL
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL001                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  10                                  CA01
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"F0400F01_MSGSFLC_avKeys","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"AV_KEYS","dataLength":-
     A                                      "1134","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[AV_KEY-
     A                                      S]"},"left":"0px","top":"0px","visi-
     A                                      bility":"hidden"},{"id":"F0400F01_M-
     A                                      SGSFLC_action","field type":"html c-
     A                                      ontainer","white space":"normal","l-
     A                                      eft":"0px","top":"10px","width":"23-
     A                                      0px","css class":"action-panel-conv-
     A                                      erted","height":"700px","html":"<di-
     A                                      v class=\"top\"></div><div class=\"-
     A                                      imagetop\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_top.png\" /></di-
     A                                      v><div class=\"menulinks\"></div><d-
     A                                      iv class=\"imagebottom\"><img src=\-
     A                                      "/profoundui/userdata/images/bar_bo-
     A                                      ttom.png\" /></div><div class=\"bot-
     A                                      tom\"></div>"},{"field type":"icon -
     A                                      menu button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"32px","z index":"20","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1170-
     A                                      px","id":"F0400F01_MSGSFLC_BtnIconM-
     A                                      enuSystemTools","tool tip":"System -
     A                                      Tools","icon alignment":"middle lef-
     A                                      t","icon width":"16px","icon height-
     A                                      ":"24px","icon source":"/profoundui-
     A                                      /userdata/images/systool/systools.p-
     A                                      ng","data function":"SystemToolbarS-
     A                                      ystools","show down arrow":"Yes"},{-
     A                                      "field type":"panel","panel style":-
     A                                      "TransformButtonBar","id":"F0400F01-
     A                                      _MSGSFLC_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"F0400F01_MSGSFLC_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"F0400F01_-
     A                                      MSGSFLC_BtnRefresh","tool tip":"Ref-
     A                                      resh","onclick":"SystemToolbarRefre-
     A                                      sh","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/refr-
     A                                      esh.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1092px","id":"F0400F01_MSGSFLC_BtnS-
     A                                      earch","tool tip":"Search","onclick-
     A                                      ":"SystemToolbarSearch","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/search.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1118px","id":"F0-
     A                                      400F01_MSGSFLC_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"F04-
     A                                      00F01_MSGSFLC_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":')
     A                                  1  4HTML('"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"F0400F01_MSGSFLC_BtnHelp","-
     A                                      tool tip":"Help","onclick":"SystemT-
     A                                      oolbarHelp","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/help.png'')"},{"id":"F0400F01_M-
     A                                      SGSFLC_ImgSysToolBottom","field typ-
     A                                      e":"image","image source":"/profoun-
     A                                      dui/userdata/images/systool/butbarb-
     A                                      ot.png","left":"1036px","top":"64px-
     A                                      ","width":"187px","locked in place"-
     A                                      :"true","css class":"stationary","v-
     A                                      isibility":"hidden"},{"id":"F0400F0-
     A                                      1_MSGSFLC_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":"Tab 1","activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0400F01_MSGSFLC_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"F0400F01_MSGSFLC_fkeyMen-
     A                                      u","field type":"menu","left":"10px-
     A                                      ","top":"120px","height":"350px","w-
     A                                      idth":"230px","hover background col-
     A                                      or":"#9AAA61","hover text color":"#-
     A                                      FFFFFF","border color":"#4C6106","m-
     A                                      enu option indent":"10px","backgrou-
     A                                      nd color":"#758B27","css class":"ac-
     A                                      tion-menu","css class 2":"stationar-
     A                                      y","z index":"101"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F0400F01_MSGSFLC_BtnHiddenR-
     A                                      efresh","value":"btnRefresh","top":-
     A                                      "125px","response":{"fieldName":"bt-
     A                                      nRefresh","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      400F01_MSGSFLC_BtnHiddenSearch","va-
     A                                      lue":"btnSearch","top":"150px","res-
     A                                      ponse":{"fieldName":"btnSearch","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0400F01_MSGSFL-
     A                                      C_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0400F01_MSGSFLC_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0400F01_MSGSFLC_BtnHiddenWor-
     A                                      kSubmitJob","value":"btnWrksbmjob",-
     A                                      "top":"225px","response":{"fieldNam-
     A                                      e":"btnWrkJob","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0400F01_MSGSFLC_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0400F01_MSGSFLC_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F040-
     A                                      0F01_MSGSFLC_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"')
     A                                  1  5HTML('id":"MSGSFL","field type":"gr-
     A                                      id","number of columns":"1","record-
     A                                       format name":"MSGSFL","display sub-
     A                                      file":"true","display control recor-
     A                                      d":"true","subfile size":"5","initi-
     A                                      alize subfile":"true","row height":-
     A                                      "20","css class":"subfilegrid","css-
     A                                       class 2":"profound-converted","par-
     A                                      ent tab panel":"F0400F01_MSGSFLC_Ma-
     A                                      inTabPanel","parent tab":"0","subfi-
     A                                      le end":{"fieldName":"N10","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      number of rows":"1","has header":"f-
     A                                      alse","subfile program message queu-
     A                                      e":{"fieldName":"Q1PGM","dataLength-
     A                                      ":"10","trimLeading":"false","trimT-
     A                                      railing":"true","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"},"subfile control program me-
     A                                      ssage queue":{"fieldName":"Q1PGM","-
     A                                      dataLength":"10","trimLeading":"fal-
     A                                      se","trimTrailing":"true","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"},"subfile message -
     A                                      key":{"fieldName":"MSGKEY","dataLen-
     A                                      gth":"4","trimLeading":"false","tri-
     A                                      mTrailing":"true","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"top":"570px","left":"269-
     A                                      px","column widths":"595"},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"150px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF03",-
     A                                      "field type":"button","value":"Exit-
     A                                      ","shortcut key":"F3","left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF10","field type":"-
     A                                      button","value":"Search","shortcut -
     A                                      key":"F10","left":"14px","top":"216-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF12","field type":"button","va-
     A                                      lue":"Cancel","shortcut key":"F12",-
     A                                      "left":"14px","top":"249px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
