     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  75 76 09
     A  29 36 37
     A  47 68 69                            CA01(75 'Response Indicator *IN75')
     A  77                                  CA02(76 'Response Indicator *IN76')
     A                                  1  2HTML('QPUIREC3    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    22 RER-
     A                                      RMSGID  5    C6    SCCHRGC7    MCR0-
     A                                      556C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     77')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","set off":{"fieldNa-
     A                                      me":"*IN75","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 2":{"fieldName"-
     A                                      :"*IN76","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"return cursor record":{"fi-
     A                                      eldName":"HREC","dataLength":"10","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none"},-
     A                                      "return cursor field":{"fieldName":-
     A                                      "HFLD","dataLength":"10","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none"},"overlay -
     A                                      range":"1-22"},"items":[{"id":"HFLD-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"HFLD","designValue":"[HFLD]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none","d-
     A                                      ataLength":"10"},"left":"0px","top"-
     A                                      :"-30px","css class":"profound-conv-
     A                                      erted"},{"id":"HREC","field type":"-
     A                                      output field","visibility":"hidden"-
     A                                      ,"value":{"fieldName":"HREC","desig-
     A                                      nValue":"[HREC]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"left":"0px","top":"-30px","css cl-
     A                                      ass":"profound-converted"},{"id":"F-
     A                                      0471FNC_SCR01_avKeys","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"AV_KEYS","dataLength":"1134","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[AV_KEYS]"},"left"-
     A                                      :"0px","top":"0px","visibility":"hi-
     A                                      dden"},{"id":"F0471FNC_SCR01_action-
     A                                      ","field type":"html container","wh-
     A                                      ite space":"normal","left":"0px","t-
     A                                      op":"10px","width":"230px","css cla-
     A                                      ss":"action-panel-converted","heigh-
     A                                      t":"700px","html":"<div class=\"top-
     A                                      \"></div><div class=\"imagetop\"><i-
     A                                      mg src=\"/profoundui/userdata/image-
     A                                      s/bar_top.png\" /></div><div class=-
     A                                      \"menulinks\"></div><div class=\"im-
     A                                      agebottom\"><img src=\"/profoundui/-
     A                                      userdata/images/bar_bottom.png\" />-
     A                                      </div><div class=\"bottom\"></div>"-
     A                                      },{"field type":"icon menu button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"32px","-
     A                                      z index":"20","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1170px","id":"F04-
     A                                      71FNC_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/systools.png","data functio-
     A                                      n":"SystemToolbarSystools","show do-
     A                                      wn arrow":"Yes"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"F0471FNC_SCR01_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"F047-
     A                                      1FNC_SCR01_BtnSave","tool tip":"Sav-
     A                                      e","onclick":"SystemToolbarSave","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/save.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1066px","-
     A                                      id":"F0471FNC_SCR01_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"F0471FNC_-
     A                                      SCR01_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right s')
     A                                  1  4HTML('tyle":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1118px","id":"F0471FNC_SCR-
     A                                      01_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1144px","id":"F0471FNC_SCR01_-
     A                                      BtnSystemMessages","tool tip":"Syst-
     A                                      em Messages","onclick":"SystemToolb-
     A                                      arMessages","background image":{"fi-
     A                                      eldName":"MsgIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1196px","id":"F0471FNC_SCR01_BtnHel-
     A                                      p","tool tip":"Help","onclick":"Sys-
     A                                      temToolbarHelp","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/help.png'')"},{"id":"F0471F-
     A                                      NC_SCR01_ImgSysToolBottom","field t-
     A                                      ype":"image","image source":"/profo-
     A                                      undui/userdata/images/systool/butba-
     A                                      rbot.png","left":"1036px","top":"64-
     A                                      px","width":"187px","locked in plac-
     A                                      e":"true","css class":"stationary",-
     A                                      "visibility":"hidden"},{"id":"F0471-
     A                                      FNC_SCR01_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"active tab"-
     A                                      :"0","left":"250px","top":"70px","w-
     A                                      idth":"970px","height":"657px","z i-
     A                                      ndex":"8","locked in place":"true",-
     A                                      "css class":"tab-panel","css class -
     A                                      2":"stationary"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0471FNC_SCR01_BtnHiddenSave",-
     A                                      "value":"btnSave","top":"100px","re-
     A                                      sponse":{"fieldName":"btnSave","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant1","field type":"output -
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"110px","cursor row":"-
     A                                      1","css class":"top-line","value":"-
     A                                      js: currentUser()","css class 2":"o-
     A                                      utput-field","parent tab panel":"F0-
     A                                      471FNC_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCCONM","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCCONM","designValue":"[SCCONM-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"414px",-
     A                                      "cursor column":"21","top":"110px",-
     A                                      "cursor row":"1","css class 2":"top-
     A                                      -line","css class 3":"HI","parent t-
     A                                      ab panel":"F0471FNC_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 4"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant2","field type":"output field","-
     A                                      left":"778px","cursor column":"73",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class":"top-line","value":"js: cur-
     A                                      rentDate()","css class 2":"output-f-
     A                                      ield","parent tab panel":"F0471FNC_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"F0471FNC_SCR01_fkeyMenu",-
     A                                      "field type":"menu","left":"10px","-
     A                                      top":"120px","height":"350px","widt-
     A                                      h":"230px","hover background color"-
     A                                      :"#9AAA61","hover text color":"#FFF-
     A                                      FFF","border color":"#4C6106","menu-
     A                                       option indent":"10px","background -
     A                                      color":"#758B27","css class":"actio-
     A                                      n-menu","css class 2":"stationary",-
     A                                      "z index":"101"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0471FNC_SCR01_BtnHiddenRefres-
     A                                      h","value":"btnRefresh","top":"125p-
     A                                      x","response":{"fieldName":"btnRefr-
     A                                      esh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"Q1PGM","field type":"ou-
     A                                      tput field","value":{"fieldName":"Q-
     A                                      1PGM","designValue":"[Q1PGM]","data-
     A                                      Type":"char","formatting":')
     A                                  1  5HTML('"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none","dataLength":"10"},"css -
     A                                      class":"output-field","left":"281px-
     A                                      ","cursor column":"2","top":"130px"-
     A                                      ,"cursor row":"2","parent tab panel-
     A                                      ":"F0471FNC_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCAST","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCAST","designValue":"[SCA-
     A                                      ST]","refField":"ST","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"358px",-
     A                                      "cursor column":"13","top":"130px",-
     A                                      "cursor row":"2","css class 2":"HI"-
     A                                      ,"parent tab panel":"F0471FNC_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"SCZIPA","field type":"output f-
     A                                      ield","value":{"fieldName":"SCZIPA"-
     A                                      ,"designValue":"[SCZIPA]","refField-
     A                                      ":"ZIPA","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"379px","cursor colu-
     A                                      mn":"16","top":"130px","cursor row"-
     A                                      :"2","css class 2":"HI","parent tab-
     A                                       panel":"F0471FNC_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCPRDS"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"130px","cursor row":"2","css cl-
     A                                      ass 2":"HI","parent tab panel":"F04-
     A                                      71FNC_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","visibility":"hidden","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant3","field type":"output -
     A                                      field","value":"SCR01","css class":-
     A                                      "constant","left":"799px","cursor c-
     A                                      olumn":"76","top":"130px","cursor r-
     A                                      ow":"2","parent tab panel":"F0471FN-
     A                                      C_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"SCMODE","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCMODE",-
     A                                      "designValue":"[SCMODE]","refField"-
     A                                      :"PGM","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"764px","cursor column-
     A                                      ":"71","top":"150px","cursor row":"-
     A                                      3","css class 2":"HI","parent tab p-
     A                                      anel":"F0471FNC_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0471FNC_SCR01_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCHD1","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      HD1","designValue":"[SCHD1]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"78"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"170px","cursor row":"4-
     A                                      ","parent tab panel":"F0471FNC_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0471FNC_SCR0-
     A                                      1_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnCF03-
     A                                      ","field type":"button","visibility-
     A                                      ":{"fieldName":"N09 or 09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":"Exit","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"SCHD2",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCHD2","designValue"-
     A                                      :"[SCHD2]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"78"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"190px-
     A                                      ","cursor row":"5","parent tab pane-
     A                                      l":"F0471FNC_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"h')
     A                                  1  6HTML('idden","id":"F0471FNC_SCR01_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"SC-
     A                                      HD3","field type":"output field","v-
     A                                      alue":{"fieldName":"SCHD3","designV-
     A                                      alue":"[SCHD3]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"78"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      210px","cursor row":"6","parent tab-
     A                                       panel":"F0471FNC_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"btnCF10-
     A                                      ","field type":"button","visibility-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"va-
     A                                      lue":"Search","shortcut key":"F10",-
     A                                      "left":"14px","top":"216px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0471FNC_SCR01_BtnHiddenWorkS-
     A                                      ubmitJob","value":"btnWrksbmjob","t-
     A                                      op":"225px","response":{"fieldName"-
     A                                      :"btnWrkJob","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant4","fie-
     A                                      ld type":"output field","value":"Sp-
     A                                      ecialty:","css class":"constant","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"230px","cursor row":"7","paren-
     A                                      t tab panel":"F0471FNC_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      SPCD","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCSPCD","d-
     A                                      esignValue":"[SCSPCD]","refField":"-
     A                                      SPEC","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"358px","cursor c-
     A                                      olumn":"13","top":"230px","cursor r-
     A                                      ow":"7","width":"22px","css class 3-
     A                                      ":{"fieldName":"N29 and N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"read only":{"fieldName":"29 or 0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 4":{"fieldName-
     A                                      ":"29 or 09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"set focus":{"-
     A                                      fieldName":"36","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"parent tab -
     A                                      panel":"F0471FNC_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 5":"p-
     A                                      rofound-converted"},{"id":"SCSCDS",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCSCDS","designValue-
     A                                      ":"[SCSCDS]","refField":"DS35","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"393px","cursor column":"18","top-
     A                                      ":"230px","cursor row":"7","parent -
     A                                      tab panel":"F0471FNC_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant5","field type":"output field",-
     A                                      "value":"Ntwk:","css class":"consta-
     A                                      nt","visibility":{"fieldName":"69",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"694px","cursor c-
     A                                      olumn":"61","top":"230px","cursor r-
     A                                      ow":"7","parent tab panel":"F0471FN-
     A                                      C_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCNWCD","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCNWCD","designValue":"[SCNWCD]","r-
     A                                      efField":"NWCD","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","visibility":{"field-
     A                                      Name":"69","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"736px-
     A                                      ","cursor column":"67","top":"230px-
     A                                      ","cursor row":"7","parent tab pane-
     A                                      l":"F0471FNC_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"btnCF11","fi-
     A                                      eld type":"button","visibility":{"f-
     A                                      ieldName":"N09 or 09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"v-
     A                                      alue":"EOB/Notes","shortcut key":"F-
     A                                      11","left":"14px","top":"249px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"consta-
     A                                      nt6","field type":"output field","v-
     A                                      alue":"EOB/Notes attached","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"68","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"694px-
     A                                      ","cursor column":"61","top":"250px-
     A                                      ","cursor row":"8","css class 2":{"-
     A                                      fieldName":"68","dataType"')
     A                                  1  7HTML(':"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"RI","customFalse":-
     A                                      ""},"parent tab panel":"F0471FNC_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0471FNC_SC-
     A                                      R01_BtnHiddenWorkPrinterOutput","va-
     A                                      lue":"btnWrkprtout","top":"250px","-
     A                                      response":{"fieldName":"btnWrkPrnt"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0471FNC_SC-
     A                                      R01_BtnHiddenImageQueue","value":"b-
     A                                      tnImgQue","top":"275px","response":-
     A                                      {"fieldName":"btnImgQue","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"btn-
     A                                      CF12","field type":"button","visibi-
     A                                      lity":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"282px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"constan-
     A                                      t7","field type":"output field","va-
     A                                      lue":"Pharmacy number              -
     A                                            :","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"290px","cursor row":"10","paren-
     A                                      t tab panel":"F0471FNC_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PHAR","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCPHAR","d-
     A                                      esignValue":"[SCPHAR]","refField":"-
     A                                      DS15","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"554px","cursor c-
     A                                      olumn":"41","top":"290px","cursor r-
     A                                      ow":"10","width":"106px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 4":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR-UL","customFalse"-
     A                                      :""},"set focus":{"fieldName":"37",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"parent tab panel":"F0471FNC-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 5":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F0471FNC-
     A                                      _SCR01_BtnHiddenHelp","value":"btnH-
     A                                      elp","top":"300px","response":{"fie-
     A                                      ldName":"btnHelp","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant8"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Total charge                    -
     A                                         :","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "310px","cursor row":"11","parent t-
     A                                      ab panel":"F0471FNC_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCCHR-
     A                                      G","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCHRG","designVa-
     A                                      lue":"[SCCHRG]","refField":"A112","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"554px","cursor column":"41","to-
     A                                      p":"310px","cursor row":"11","width-
     A                                      ":"91px","text align":"right","css -
     A                                      class 2":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "error message id":"MCR0556","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"77","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","parent tab panel":-
     A                                      "F0471FNC_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant9","fie-
     A                                      ld type":"output field","value":"Re-
     A                                      ductions . . . . . .","css class":"-
     A                                      constant","left":"295px","cursor co-
     A                                      lumn":"4","top":"330px","cursor row-
     A                                      ":"12","parent tab panel":"F0471FNC-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCHMRA","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CHMRA","designValue":"[SCHMRA]","re-
     A                                      fField":"DS10","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"463p')
     A                                  1  8HTML('x","cursor column":"28","top"-
     A                                      :"330px","cursor row":"12","parent -
     A                                      tab panel":"F0471FNC_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant10","field type":"output field"-
     A                                      ,"value":":","css class":"constant"-
     A                                      ,"left":"540px","cursor column":"39-
     A                                      ","top":"330px","cursor row":"12","-
     A                                      parent tab panel":"F0471FNC_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCMRA","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCMRA","de-
     A                                      signValue":"[SCMRA]","refField":"A1-
     A                                      12","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"554px","cursor column":"41-
     A                                      ","top":"330px","cursor row":"12","-
     A                                      width":"91px","text align":"right",-
     A                                      "css class 2":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"parent tab panel":"F0471FNC_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCHNET","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCH-
     A                                      NET","designValue":"[SCHNET]","refF-
     A                                      ield":"DS10","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","visibility":{"fieldNam-
     A                                      e":"47","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"652px","-
     A                                      cursor column":"55","top":"330px","-
     A                                      cursor row":"12","parent tab panel"-
     A                                      :"F0471FNC_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant11","f-
     A                                      ield type":"output field","value":"-
     A                                      :","css class":"constant","visibili-
     A                                      ty":{"fieldName":"47","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"729px","cursor column":"66","-
     A                                      top":"330px","cursor row":"12","par-
     A                                      ent tab panel":"F0471FNC_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCNTWK","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCNTWK","des-
     A                                      ignValue":"[SCNTWK]","refField":"A1-
     A                                      12","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"visibility":{"fieldName":"47","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"743px","cursor colu-
     A                                      mn":"68","top":"330px","cursor row"-
     A                                      :"12","width":"91px","text align":"-
     A                                      right","css class 2":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"parent tab panel":"F04-
     A                                      71FNC_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant12","field -
     A                                      type":"output field","value":"Reduc-
     A                                      tions . . . . . .","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"350px","cursor row":"-
     A                                      13","parent tab panel":"F0471FNC_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCHOT1","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCHO-
     A                                      T1","designValue":"[SCHOT1]","refFi-
     A                                      eld":"DS10","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"463px","cursor c-
     A                                      olumn":"28","top":"350px","cursor r-
     A                                      ow":"13","parent tab panel":"F0471F-
     A                                      NC_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant13","field typ-
     A                                      e":"output field","value":":","css -
     A                                      class":"constant","left":"540px","c-
     A                                      ursor column":"39","top":"350px","c-
     A                                      ursor row":"13","parent tab panel":-
     A                                      "F0471FNC_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCOTHR","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCOTHR","designValue":"[SCO-
     A                                      THR]","refField":"A112","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00"},"css c-
     A                                      lass":"output-field","left":"554px"-
     A                                      ,"cursor column":"41","top":"350px"-
     A                                      ,"cursor row":"13","width":"91px","-
     A                                      text align":"right","css class 2":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"parent ta-
     A                                      b panel":"F0471FNC_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCHOT2-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCHOT2","designVal-
     A                                      ue":"[SCHOT2]","refField":"DS10","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTrans')
     A                                  1  9HTML('form":"none"},"css class":"ou-
     A                                      tput-field","left":"652px","cursor -
     A                                      column":"55","top":"350px","cursor -
     A                                      row":"13","parent tab panel":"F0471-
     A                                      FNC_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant14","field ty-
     A                                      pe":"output field","value":":","css-
     A                                       class":"constant","left":"729px","-
     A                                      cursor column":"66","top":"350px","-
     A                                      cursor row":"13","parent tab panel"-
     A                                      :"F0471FNC_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCOTH2","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCOTH2","designValue":"[SC-
     A                                      OTH2]","refField":"A112","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00"},"css -
     A                                      class":"output-field","left":"743px-
     A                                      ","cursor column":"68","top":"350px-
     A                                      ","cursor row":"13","width":"91px",-
     A                                      "text align":"right","css class 2":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"parent t-
     A                                      ab panel":"F0471FNC_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant15","field type":"output field",-
     A                                      "value":"Total paid                -
     A                                               :","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"370px","cursor row":"14","pa-
     A                                      rent tab panel":"F0471FNC_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCPAID","field type":"output field-
     A                                      ","value":{"fieldName":"SCPAID","de-
     A                                      signValue":"[SCPAID]","refField":"A-
     A                                      112","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00"},"css class":"output-field-
     A                                      ","left":"554px","cursor column":"4-
     A                                      1","top":"370px","cursor row":"14",-
     A                                      "width":"91px","text align":"right"-
     A                                      ,"css class 2":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"parent tab panel":"F0471FNC_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant20","field type":-
     A                                      "output field","css class":"constan-
     A                                      t","value":"Rend prov last/group na-
     A                                      me  . . . . :","cursor row":"16","c-
     A                                      ursor column":"4","left":"295px","t-
     A                                      op":"390px","parent tab panel":"F04-
     A                                      71FNC_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted","width":"255px"},{"id":"SCR-
     A                                      LSN","field type":"textbox","css cl-
     A                                      ass":"input","value":{"fieldName":"-
     A                                      SCRLSN","refField":"NAME","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"reference","forma-
     A                                      tting":"Text","textTransform":"uppe-
     A                                      rcase","designValue":"[SCRLSN]"},"t-
     A                                      ext transform":"uppercase","read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"set f-
     A                                      ocus":{"fieldName":"37","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"cur-
     A                                      sor row":"10","cursor column":"41",-
     A                                      "left":"555px","top":"390px","width-
     A                                      ":"100px","parent tab panel":"F0471-
     A                                      FNC_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"textbox","css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"HI","customFalse":""},-
     A                                      "css class 4":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR-UL","customFal-
     A                                      se":""},"css class 5":"profound-con-
     A                                      verted"},{"id":"constant21","field -
     A                                      type":"output field","css class":"c-
     A                                      onstant","value":"Rend prov first n-
     A                                      ame . . . :","cursor row":"16","cur-
     A                                      sor column":"4","left":"665px","top-
     A                                      ":"390px","width":"195px","parent t-
     A                                      ab panel":"F0471FNC_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCRFS-
     A                                      N","field type":"textbox","css clas-
     A                                      s":"input","value":{"fieldName":"SC-
     A                                      RFSN","refField":"FSN","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"reference","formatti-
     A                                      ng":"Text","textTransform":"upperca-
     A                                      se","designValue":"[SCRFSN]"},"text-
     A                                       transform":"uppercase","read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"set focu-
     A                                      s":{"fieldName":"37","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"cursor-
     A                                       row":"10","cursor column":"41","le-
     A                                      ft":"865px","top":"390px","width":"-
     A                                      100px","parent tab panel":"F0471FNC-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"textbox","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse')
     A                                  1 10HTML('":""},"css class 4":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR-UL-
     A                                      ","customFalse":""},"css class 5":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t22","field type":"output field","c-
     A                                      ss class":"constant","value":"Rend -
     A                                      prov FEIN . . . . . . . . . . :","c-
     A                                      ursor row":"16","cursor column":"4"-
     A                                      ,"left":"295px","top":"410px","widt-
     A                                      h":"255px","parent tab panel":"F047-
     A                                      1FNC_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCRFEI","field type"-
     A                                      :"textbox","css class":"input","val-
     A                                      ue":{"fieldName":"SCRFEI","refField-
     A                                      ":"FEIN","numSep":"false","zeroBala-
     A                                      nce":"false","numBlankFill":"false"-
     A                                      ,"zeroFill":"false","curSym":"","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","negNum":"999.00","units":""-
     A                                      ,"designValue":"[SCRFEI]"},"text tr-
     A                                      ansform":"uppercase","read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"set focus":-
     A                                      {"fieldName":"37","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"cursor ro-
     A                                      w":"10","cursor column":"41","left"-
     A                                      :"555px","top":"410px","width":"100-
     A                                      px","parent tab panel":"F0471FNC_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"textbox","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR-UL","customFalse":""-
     A                                      },"css class 5":"profound-converted-
     A                                      "},{"id":"constant23","field type":-
     A                                      "output field","css class":"constan-
     A                                      t","value":"Patients account number-
     A                                          :","cursor row":"16","cursor co-
     A                                      lumn":"4","left":"665px","top":"410-
     A                                      px","width":"195px","parent tab pan-
     A                                      el":"F0471FNC_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCACCT","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","value":{"fieldName":"SCACCT",-
     A                                      "refField":"DS30","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","textTransform":"uppercase","-
     A                                      designValue":"[SCACCT]"},"text tran-
     A                                      sform":"uppercase","read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"set focus":{"-
     A                                      fieldName":"37","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"cursor row"-
     A                                      :"10","cursor column":"41","left":"-
     A                                      865px","top":"410px","width":"100px-
     A                                      ","parent tab panel":"F0471FNC_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"textbox","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR-UL","customFalse":""},-
     A                                      "css class 5":"profound-converted",-
     A                                      "css class 6":"HI"},{"id":"constant-
     A                                      17","field type":"output field","va-
     A                                      lue":" ","css class":"constant","vi-
     A                                      sibility":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"281px","cursor column"-
     A                                      :"2","top":"530px","cursor row":"22-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"F0471FNC_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant1-
     A                                      8","field type":"output field","val-
     A                                      ue":" ","css class":"constant","vis-
     A                                      ibility":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"281px","cursor column":"-
     A                                      2","top":"530px","cursor row":"22",-
     A                                      "css class 2":"BLU","parent tab pan-
     A                                      el":"F0471FNC_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCACCT    R        H      REFFLD(DS30)
     A            SCAST     R        H      REFFLD(ST)
     A            SCCHRG    R        H      REFFLD(A112)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCHMRA    R        H      REFFLD(DS10)
     A            SCHNET    R        H      REFFLD(DS10)
     A            SCHOT1    R        H      REFFLD(DS10)
     A            SCHOT2    R        H      REFFLD(DS10)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A112)
     A            SCNTWK    R        H      REFFLD(A112)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOTH2    R        H      REFFLD(A112)
     A            SCOTHR    R        H      REFFLD(A112)
     A            SCPAID    R        H      REFFLD(A112)
     A            SCPHAR    R        H      REFFLD(DS15)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRFEI    R        H      REFFLD(FEIN)
     A            SCRFSN    R        H      REFFLD(FSN)
     A            SCRLSN    R        H      REFFLD(NAME)
     A            SCSCDS    R        H      REFFLD(DS35)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0471FNC_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0471FNC_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0471FNC_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F0471FNC_SCR02_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F0471FNC_SCR02_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F0471FNC_SCR02_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F04-
     A                                      71FNC_SCR02_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"F0471FNC_SCR02_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F0471FNC_SCR02_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button"')
     A                                  1  4HTML(',"css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F0471FNC_SCR02_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F0471FNC_SCR02_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F0471FNC_SCR02_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0471FNC_SCR02_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant20","field type":"-
     A                                      output field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentUser()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F0471FNC_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCR02_SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","parent tab panel":"F0471FNC_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant21","field type":"o-
     A                                      utput field","left":"778px","cursor-
     A                                       column":"73","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentDate()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F0471FNC_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F0471FNC_SC-
     A                                      R02_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0471FNC_SCR02_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCR02_Q1P-
     A                                      GM","field type":"output field","va-
     A                                      lue":{"fieldName":"Q1PGM","designVa-
     A                                      lue":"[Q1PGM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F0471FNC_NSCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR02_S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0471FNC_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","visibility":"hidden"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant22","field type":"-
     A                                      output field","value":"SCR02","css -
     A                                      class":"constant","left":"799px","c-
     A                                      ursor column":"76","top":"130px","c-
     A                                      ursor row":"2","parent tab panel":"-
     A                                      F0471FNC_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"btnSubmit","fiel-
     A                                      d type":"button","value":"Enter","s-
     A                                      hortcut key":"Enter","left":"14px",-
     A                                      "top":"150px","width":"100')
     A                                  1  5HTML('px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"SCR02_SCM-
     A                                      ODE","field type":"output field","v-
     A                                      alue":{"fieldName":"SCMODE","design-
     A                                      Value":"[SCMODE]","refField":"PGM",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"764px","cursor column":"71",-
     A                                      "top":"150px","cursor row":"3","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F0471FNC_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F0471FNC_SCR02_BtnHiddenSearch","va-
     A                                      lue":"btnSearch","top":"150px","res-
     A                                      ponse":{"fieldName":"btnSearch","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0471FNC_SCR02_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0471FNC_SCR02_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F0471FNC_SCR02_BtnHiddenWorkSubmi-
     A                                      tJob","value":"btnWrksbmjob","top":-
     A                                      "225px","response":{"fieldName":"bt-
     A                                      nWrkJob","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F04-
     A                                      71FNC_SCR02_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F04-
     A                                      71FNC_SCR02_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"275px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0471FNC_SCR02-
     A                                      _BtnHiddenHelp","value":"btnHelp","-
     A                                      top":"300px","response":{"fieldName-
     A                                      ":"btnHelp","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0471FNC_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0471FNC_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0471FNC_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F0471FNC_SCR03_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F0471FNC_SCR03_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F0471FNC_SCR03_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F04-
     A                                      71FNC_SCR03_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"F0471FNC_SCR03_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F0471FNC_SCR03_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button"')
     A                                  1  4HTML(',"css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F0471FNC_SCR03_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F0471FNC_SCR03_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F0471FNC_SCR03_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0471FNC_SCR03_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant23","field type":"-
     A                                      output field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentUser()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F0471FNC_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCR03_SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","parent tab panel":"F0471FNC_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant24","field type":"o-
     A                                      utput field","left":"778px","cursor-
     A                                       column":"73","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentDate()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F0471FNC_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F0471FNC_SC-
     A                                      R03_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0471FNC_SCR03_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCR03_Q1P-
     A                                      GM","field type":"output field","va-
     A                                      lue":{"fieldName":"Q1PGM","designVa-
     A                                      lue":"[Q1PGM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F0471FNC_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR03_SC-
     A                                      PRDS","field type":"output field","-
     A                                      value":{"fieldName":"SCPRDS","desig-
     A                                      nValue":"[SCPRDS]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F0471FNC_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","visibility":"hidden",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant25","field type":"o-
     A                                      utput field","value":"SCR03","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      0471FNC_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100p')
     A                                  1  5HTML('x","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"SCR03_SCMO-
     A                                      DE","field type":"output field","va-
     A                                      lue":{"fieldName":"SCMODE","designV-
     A                                      alue":"[SCMODE]","refField":"PGM","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"764px","cursor column":"71","-
     A                                      top":"150px","cursor row":"3","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      0471FNC_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0471FNC_SCR03_BtnHiddenSearch","val-
     A                                      ue":"btnSearch","top":"150px","resp-
     A                                      onse":{"fieldName":"btnSearch","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0471FNC_SCR03_B-
     A                                      tnHiddenDiaryItems","value":"btnDia-
     A                                      ry","top":"175px","response":{"fiel-
     A                                      dName":"btnDiary","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0471FNC_SCR03_BtnHiddenSyste-
     A                                      mMessages","value":"btnMessage","to-
     A                                      p":"200px","response":{"fieldName":-
     A                                      "btnMessage","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F0471FNC_SCR03_BtnHiddenWorkSubmit-
     A                                      Job","value":"btnWrksbmjob","top":"-
     A                                      225px","response":{"fieldName":"btn-
     A                                      WrkJob","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F047-
     A                                      1FNC_SCR03_BtnHiddenWorkPrinterOutp-
     A                                      ut","value":"btnWrkprtout","top":"2-
     A                                      50px","response":{"fieldName":"btnW-
     A                                      rkPrnt","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F047-
     A                                      1FNC_SCR03_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0471FNC_SCR03_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
