     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  27 28 32
     A  33 35 36
     A  38 73 74                            CA01(27 'Response Indicator *IN27')
     A  75 76 77
     A  78 79 09
     A  30 29 31                            CA02(28 'Response Indicator *IN28')
     A  34 37 40
     A  42 47 68
     A  69 80 81                            CA03(32 'Response Indicator *IN32')
     A  82 83 84                            CA04(33 'Response Indicator *IN33')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(38 'Response Indicator *IN38')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(77 'Response Indicator *IN77')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                  1  2HTML('QPUIREC16   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    22 RER-
     A                                      RMSGID  5    C6    SCSPCDC7    MCR0-
     A                                      441C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     83RERRMSGID  5    C6    SC-
     A                                      SVZPC7    MCR0503C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     81RERRMSGID -
     A                                       5    C6    SCSVZPC7    MCR0676C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        82RERRMSGID  5    C6    SCFLICC7 -
     A                                         MCR0503C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     42RERRMSGID  5    C-
     A                                      6    SCFLICC7    MCR0676C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     27RER-
     A                                      RMSGID  5    C6    SCDIA1C7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     80RERRMSGID  5    C6    SC-
     A                                      DIA1C7    MCR2383C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     73RERRMSGID -
     A                                       5    C6    SCDIA2C7    MCR2383C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        74RERRMSGID  5    C6    SCDIA3C7 -
     A                                         MCR2383C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     75RERRMSGID  5    C-
     A                                      6    SCDIA4C7    MCR2383C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     76RER-
     A                                      RMSGID  5    C6    SCCHRGC7    MCR0-
     A                                      556C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     77RERRMSGID  5    C5    SC-
     A                                      EDIC7    MCR0503C6    FSMESGC5    *-
     A                                      LIBLC0    E1    6     78 30RERRMSGI-
     A                                      D  5    C5    SCEDIC7    MCR0999C6 -
     A                                         FSMESGC5    *LIBLC0    E1    6  -
     A                                         79 30RERRMSGID  5    C5    SCEDI-
     A                                      C7    MCR0676C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     31')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","return cursor reco-
     A                                      rd":{"fieldName":"HREC","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"return cursor field":{"fie-
     A                                      ldName":"HFLD","dataLength":"10","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      set off":{"fieldName":"*IN27","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 2":{"fieldName":"*IN28","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      3":{"fieldName":"*IN32","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 4":-
     A                                      {"fieldName":"*IN33","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 5":{"f-
     A                                      ieldName":"*IN35","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 6":{"fiel-
     A                                      dName":"*IN36","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"set off 7":{"fieldNa-
     A                                      me":"*IN38","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 8":{"fieldName"-
     A                                      :"*IN73","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 9":{"fieldName":"*-
     A                                      IN74","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 10":{"fieldName":"*IN-
     A                                      75","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 11":{"fieldName":"*IN76-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 12":{"fieldName":"*IN77",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 13":{"fieldName":"*IN78","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 14":{"fieldName":"*IN79","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"over-
     A                                      lay range":"1-22"},"items":[{"id":"-
     A                                      HREC","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"HREC","designValue":"[HREC]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"10"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"HFLD","field typ-
     A                                      e":"output field","visibility":"hid-
     A                                      den","value":{"fieldName":"HFLD","d-
     A                                      esignValue":"[HFLD]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      10"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"F0481FCA_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"F0481FCA_SCR01_ac-
     A                                      tion","field type":"html container"-
     A                                      ,"white space":"normal","left":"0px-
     A                                      ","top":"10px","width":"230px","css-
     A                                       class":"action-panel-converted","h-
     A                                      eight":"700px","html":"<div class=\-
     A                                      "top\"></div><div class=\"imagetop\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_top.png\" /></div><div cl-
     A                                      ass=\"menulinks\"></div><div class=-
     A                                      \"imagebottom\"><img src=\"/profoun-
     A                                      dui/userdata/images/bar_bottom.png\-
     A                                      " /></div><div class=\"bottom\"></d-
     A                                      iv>"},{"field type":"icon menu butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"32p-
     A                                      x","z index":"20","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1170px","id":-
     A                                      "F0481FCA_SCR01_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F0481FCA_SCR01_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F0481FCA_SCR01_BtnSave","tool tip-
     A                                      ":"Save","onclick":"System')
     A                                  1  4HTML('ToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"F0481FCA_-
     A                                      SCR01_BtnRefresh","tool tip":"Refre-
     A                                      sh","onclick":"SystemToolbarRefresh-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/refres-
     A                                      h.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      92px","id":"F0481FCA_SCR01_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"F0481F-
     A                                      CA_SCR01_BtnDiaryItems","tool tip":-
     A                                      "Diary/Work Items - IDARTS","onclic-
     A                                      k":"SystemToolbarDiary","background-
     A                                       image":{"fieldName":"DryIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"}},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1144px","id":"F0481FCA_-
     A                                      SCR01_BtnSystemMessages","tool tip"-
     A                                      :"System Messages","onclick":"Syste-
     A                                      mToolbarMessages","background image-
     A                                      ":{"fieldName":"MsgIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F0481FCA_SCR01_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F0481FCA_SCR01_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F0481FCA_SCR01_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0481FCA_SCR01_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant1","field type":"o-
     A                                      utput field","left":"281px","cursor-
     A                                       column":"2","top":"110px","cursor -
     A                                      row":"1","css class":"top-line","va-
     A                                      lue":"js: currentUser()","css class-
     A                                       2":"output-field","parent tab pane-
     A                                      l":"F0481FCA_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SCCONM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCCONM","designValue":"[-
     A                                      SCCONM]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field",')
     A                                  1  5HTML('"left":"414px","cursor column-
     A                                      ":"21","top":"110px","cursor row":"-
     A                                      1","css class 2":"top-line","css cl-
     A                                      ass 3":"HI","parent tab panel":"F04-
     A                                      81FCA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 4":"profound-con-
     A                                      verted"},{"id":"constant2","field t-
     A                                      ype":"output field","left":"778px",-
     A                                      "cursor column":"73","top":"110px",-
     A                                      "cursor row":"1","css class":"top-l-
     A                                      ine","value":"js: currentDate()","c-
     A                                      ss class 2":"output-field","parent -
     A                                      tab panel":"F0481FCA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"F048-
     A                                      1FCA_SCR01_fkeyMenu","field type":"-
     A                                      menu","left":"10px","top":"120px","-
     A                                      height":"350px","width":"230px","ho-
     A                                      ver background color":"#9AAA61","ho-
     A                                      ver text color":"#FFFFFF","border c-
     A                                      olor":"#4C6106","menu option indent-
     A                                      ":"10px","background color":"#758B2-
     A                                      7","css class":"action-menu","css c-
     A                                      lass 2":"stationary","z index":"101-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0481FCA_-
     A                                      SCR01_BtnHiddenRefresh","value":"bt-
     A                                      nRefresh","top":"125px","response":-
     A                                      {"fieldName":"btnRefresh","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"Q1-
     A                                      PGM","field type":"output field","v-
     A                                      alue":{"fieldName":"Q1PGM","designV-
     A                                      alue":"[Q1PGM]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"10"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F0481FCA_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCAST",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCAST","designValue"-
     A                                      :"[SCAST]","refField":"ST","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"3-
     A                                      58px","cursor column":"13","top":"1-
     A                                      30px","cursor row":"2","css class 2-
     A                                      ":"HI","parent tab panel":"F0481FCA-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCZIPA","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CZIPA","designValue":"[SCZIPA]","re-
     A                                      fField":"ZIPA","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"379px","curso-
     A                                      r column":"16","top":"130px","curso-
     A                                      r row":"2","css class 2":"HI","pare-
     A                                      nt tab panel":"F0481FCA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CPRDS","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRDS","desi-
     A                                      gnValue":"[SCPRDS]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"130px","cursor row":"2","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F0481FCA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","visibility":"hidden"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant3","field type":"o-
     A                                      utput field","value":"SCR01","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      0481FCA_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCMODE","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCMODE","designValue":"[SCMOD-
     A                                      E]","refField":"PGM","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"764px",-
     A                                      "cursor column":"71","top":"150px",-
     A                                      "cursor row":"3","css class 2":"HI"-
     A                                      ,"parent tab panel":"F0481FCA_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0481FCA_SCR01-
     A                                      _BtnHiddenSearch","value":"btnSearc-
     A                                      h","top":"150px","response":{"field-
     A                                      Name":"btnSearch","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCHD1","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCHD1","designValue":"[-
     A                                      SCHD1]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"78"},"css cl-
     A                                      ass":"output-field","left":"281px",-
     A                                      "cursor column":"2","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "F0481FCA_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","c')
     A                                  1  6HTML('ursor":"default","visibility"-
     A                                      :"hidden","id":"F0481FCA_SCR01_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"SCHD2","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCHD2","designValue":"[SCH-
     A                                      D2]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"78"},"css class-
     A                                      ":"output-field","left":"281px","cu-
     A                                      rsor column":"2","top":"190px","cur-
     A                                      sor row":"5","parent tab panel":"F0-
     A                                      481FCA_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      481FCA_SCR01_BtnHiddenSystemMessage-
     A                                      s","value":"btnMessage","top":"200p-
     A                                      x","response":{"fieldName":"btnMess-
     A                                      age","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"SCHD3","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CHD3","designValue":"[SCHD3]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none","dat-
     A                                      aLength":"78"},"css class":"output--
     A                                      field","left":"281px","cursor colum-
     A                                      n":"2","top":"210px","cursor row":"-
     A                                      6","parent tab panel":"F0481FCA_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0481FCA_SCR-
     A                                      01_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant4","field type":"output f-
     A                                      ield","value":"EOMB#:","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"230px","cursor ro-
     A                                      w":"7","parent tab panel":"F0481FCA-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCEOB#","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CEOB#","designValue":"[SCEOB#]","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00","da-
     A                                      taLength":"9","decPos":"0"},"css cl-
     A                                      ass":"output-field","left":"330px",-
     A                                      "cursor column":"9","top":"230px","-
     A                                      cursor row":"7","width":"63px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"F0481FCA_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant5","fi-
     A                                      eld type":"output field","value":"S-
     A                                      pCd:","css class":"constant","left"-
     A                                      :"407px","cursor column":"20","top"-
     A                                      :"230px","cursor row":"7","parent t-
     A                                      ab panel":"F0481FCA_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCSPC-
     A                                      D","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCSPCD","desi-
     A                                      gnValue":"[SCSPCD]","refField":"SPE-
     A                                      C","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"449px","cursor colu-
     A                                      mn":"26","top":"230px","cursor row"-
     A                                      :"7","width":"22px","css class 3":{-
     A                                      "fieldName":"N29 and N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"29 or 09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      29 or 09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"36","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"error message -
     A                                      id":"MCR0441","error message file":-
     A                                      "FSMESG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"83","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"1 message"-
     A                                      ,"parent tab panel":"F0481FCA_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 5":"profound-converted"},{"-
     A                                      id":"SCSCDS","field type":"output f-
     A                                      ield","value":{"fieldName":"SCSCDS"-
     A                                      ,"designValue":"[SCSCDS]","refField-
     A                                      ":"DS15","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"484px","cursor colu-
     A                                      mn":"31","top":"230px","cursor row"-
     A                                      :"7","parent tab panel":"F0481FCA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant6","field type":"o-
     A                                      utput field","value":"Svc Zip Code:-
     A                                      ","css class":"constant","')
     A                                  1  7HTML('left":"603px","cursor column"-
     A                                      :"48","top":"230px","cursor row":"7-
     A                                      ","parent tab panel":"F0481FCA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCSVZP","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      SVZP","designValue":"[SCSVZP]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00","dat-
     A                                      aLength":"5","decPos":"0"},"left":"-
     A                                      701px","cursor column":"62","top":"-
     A                                      230px","cursor row":"7","width":"36-
     A                                      px","read only":{"fieldName":"09 or-
     A                                       29","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 3":{"fieldNa-
     A                                      me":"09 or 29","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09 and N29","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"set focus":{"fieldName":"35","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 5":{"fieldName":"84 -
     A                                      and N29","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"error message id"-
     A                                      :"MCR0503","error message file":"FS-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      81","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"2 messages","-
     A                                      error message id 2":"MCR0676","erro-
     A                                      r message file 2":"FSMESG","error m-
     A                                      essage library 2":"*LIBL","error co-
     A                                      ndition 2":{"fieldName":"82","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"paren-
     A                                      t tab panel":"F0481FCA_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant7","field type":"output field-
     A                                      ","value":"Ntwk:","css class":"cons-
     A                                      tant","visibility":{"fieldName":"69-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"750px","cursor-
     A                                       column":"69","top":"230px","cursor-
     A                                       row":"7","parent tab panel":"F0481-
     A                                      FCA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCNWCD","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCNWCD","designValue":"[SCNWCD]",-
     A                                      "refField":"NWCD","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","visibility":{"fie-
     A                                      ldName":"69","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"792-
     A                                      px","cursor column":"75","top":"230-
     A                                      px","cursor row":"7","parent tab pa-
     A                                      nel":"F0481FCA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant8"-
     A                                      ,"field type":"output field","value-
     A                                      ":"EOB/Notes attached","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"68","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"left":"694px","c-
     A                                      ursor column":"61","top":"250px","c-
     A                                      ursor row":"8","css class 2":{"fiel-
     A                                      dName":"68","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"RI-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F0481FCA_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F0481FCA_SCR01_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant9",-
     A                                      "field type":"output field","value"-
     A                                      :"Rendering provider state license#-
     A                                        :","css class":"constant","left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      270px","cursor row":"9","parent tab-
     A                                       panel":"F0481FCA_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCFLIC"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCFLIC","design-
     A                                      Value":"[SCFLIC]","refField":"LIC#"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"554px","cursor column-
     A                                      ":"41","top":"270px","cursor row":"-
     A                                      9","width":"92px","css class 3":"HI-
     A                                      ","css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"')
     A                                  1  8HTML('fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"set -
     A                                      focus":{"fieldName":"40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"42","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0676","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"27","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"F0481F-
     A                                      CA_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0481F-
     A                                      CA_SCR01_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant10","field type":"output -
     A                                      field","value":"Diagnosis code (1) -
     A                                                      :","css class":"con-
     A                                      stant","left":"295px","cursor colum-
     A                                      n":"4","top":"290px","cursor row":"-
     A                                      10","parent tab panel":"F0481FCA_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCDIA1","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCDIA1","designValue":"[SCDIA1]","r-
     A                                      efField":"DIA","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","left":"554px",-
     A                                      "cursor column":"41","top":"290px",-
     A                                      "cursor row":"10","width":"36px","c-
     A                                      ss class 3":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 4":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"34","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"MCR0503","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "80","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"2 messages",-
     A                                      "error message id 2":"MCR2383","err-
     A                                      or message file 2":"FSMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"73","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"pare-
     A                                      nt tab panel":"F0481FCA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"S-
     A                                      CD1DS","field type":"output field",-
     A                                      "value":{"fieldName":"SCD1DS","desi-
     A                                      gnValue":"[SCD1DS]","refField":"DS3-
     A                                      0","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"603px","cursor column":"4-
     A                                      8","top":"290px","cursor row":"10",-
     A                                      "css class 2":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"parent tab panel":"F0481FCA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F0481FCA_S-
     A                                      CR01_BtnHiddenHelp","value":"btnHel-
     A                                      p","top":"300px","response":{"field-
     A                                      Name":"btnHelp","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant11",-
     A                                      "field type":"output field","value"-
     A                                      :"Diagnosis code (2)               -
     A                                        :","css class":"constant","left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      310px","cursor row":"11","parent ta-
     A                                      b panel":"F0481FCA_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCDIA2-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCDIA2","desig-
     A                                      nValue":"[SCDIA2]","refField":"DIA"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","left":"554px","cursor column-
     A                                      ":"41","top":"310px","curs')
     A                                  1  9HTML('or row":"11","width":"36px","-
     A                                      css class 3":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"set focus":{"fiel-
     A                                      dName":"28","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"error message i-
     A                                      d":"MCR2383","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"74","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"1 message",-
     A                                      "parent tab panel":"F0481FCA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"SCD2DS","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCD2DS",-
     A                                      "designValue":"[SCD2DS]","refField"-
     A                                      :"DS30","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"603px","cursor colum-
     A                                      n":"48","top":"310px","cursor row":-
     A                                      "11","css class 2":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"parent tab panel":"F0481-
     A                                      FCA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant12","field ty-
     A                                      pe":"output field","value":"Diagnos-
     A                                      is code (3)                 :","css-
     A                                       class":"constant","left":"295px","-
     A                                      cursor column":"4","top":"330px","c-
     A                                      ursor row":"12","parent tab panel":-
     A                                      "F0481FCA_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCDIA3","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCDIA3","designValue":"-
     A                                      [SCDIA3]","refField":"DIA","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"554px","cursor column":"41","t-
     A                                      op":"330px","cursor row":"12","widt-
     A                                      h":"36px","css class 3":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 4":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"32","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message id":"MCR2383","error mess-
     A                                      age file":"FSMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"75","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","parent tab panel":"F048-
     A                                      1FCA_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"SCD3DS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCD3DS","designValue":"[SCD3DS]"-
     A                                      ,"refField":"DS30","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"603px","c-
     A                                      ursor column":"48","top":"330px","c-
     A                                      ursor row":"12","css class 2":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"parent tab pa-
     A                                      nel":"F0481FCA_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant13-
     A                                      ","field type":"output field","valu-
     A                                      e":"Diagnosis code (4)             -
     A                                          :","css class":"constant","left-
     A                                      ":"295px","cursor column":"4","top"-
     A                                      :"350px","cursor row":"13","parent -
     A                                      tab panel":"F0481FCA_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCDI-
     A                                      A4","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCDIA4","des-
     A                                      ignValue":"[SCDIA4]","refField":"DI-
     A                                      A","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"554px","cursor colu-
     A                                      mn":"41","top":"350px","cursor row"-
     A                                      :"13","width":"36px","css class 3":-
     A                                      {"fieldName":"N09","dataTy')
     A                                  1 10HTML('pe":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"set focus":{"fi-
     A                                      eldName":"33","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"error message-
     A                                       id":"MCR2383","error message file"-
     A                                      :"FSMESG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"76","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"1 message-
     A                                      ","parent tab panel":"F0481FCA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"SCD4DS","field type":"output -
     A                                      field","value":{"fieldName":"SCD4DS-
     A                                      ","designValue":"[SCD4DS]","refFiel-
     A                                      d":"DS30","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"603px","cursor col-
     A                                      umn":"48","top":"350px","cursor row-
     A                                      ":"13","css class 2":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"parent tab panel":"F04-
     A                                      81FCA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant14","field -
     A                                      type":"output field","value":"Total-
     A                                       charge                       :","c-
     A                                      ss class":"constant","left":"295px"-
     A                                      ,"cursor column":"4","top":"390px",-
     A                                      "cursor row":"15","parent tab panel-
     A                                      ":"F0481FCA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCCHRG","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCHRG","designValue":"[S-
     A                                      CCHRG]","refField":"A112","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"css-
     A                                       class":"output-field","left":"554p-
     A                                      x","cursor column":"41","top":"390p-
     A                                      x","cursor row":"15","width":"91px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"error m-
     A                                      essage id":"MCR0556","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"77","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"F0481FC-
     A                                      A_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant15","field type-
     A                                      ":"output field","value":"Reduction-
     A                                      s . . . . . .","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"410px","cursor row":"16",-
     A                                      "parent tab panel":"F0481FCA_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCHMRA","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCHMRA",-
     A                                      "designValue":"[SCHMRA]","refField"-
     A                                      :"DS10","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"463px","cursor colum-
     A                                      n":"28","top":"410px","cursor row":-
     A                                      "16","parent tab panel":"F0481FCA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant16","field type":"-
     A                                      output field","value":":","css clas-
     A                                      s":"constant","left":"540px","curso-
     A                                      r column":"39","top":"410px","curso-
     A                                      r row":"16","parent tab panel":"F04-
     A                                      81FCA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCMRA","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCMRA","designValue":"[SCMRA]","-
     A                                      refField":"A112","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00"},"css class":"-
     A                                      output-field","left":"554px","curso-
     A                                      r column":"41","top":"410px","curso-
     A                                      r row":"16","width":"91px","text al-
     A                                      ign":"right","css class 2":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"parent tab panel-
     A                                      ":"F0481FCA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCHNET","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCHNET","designValue":"[S-
     A                                      CHNET]","refField":"DS10","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","')
     A                                  1 11HTML('visibility":{"fieldName":"47"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"652px","cursor -
     A                                      column":"55","top":"410px","cursor -
     A                                      row":"16","parent tab panel":"F0481-
     A                                      FCA_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant17","field ty-
     A                                      pe":"output field","value":":","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"47","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"7-
     A                                      29px","cursor column":"66","top":"4-
     A                                      10px","cursor row":"16","parent tab-
     A                                       panel":"F0481FCA_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCNTWK"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCNTWK","designValu-
     A                                      e":"[SCNTWK]","refField":"A112","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      },"css class":"output-field","visib-
     A                                      ility":{"fieldName":"47","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"743px","cursor column":"68-
     A                                      ","top":"410px","cursor row":"16","-
     A                                      width":"91px","text align":"right",-
     A                                      "css class 2":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"parent tab panel":"F0481FCA_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant18","field type":"-
     A                                      output field","value":"Reductions .-
     A                                       . . . . .","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"430px","cursor row":"17","pa-
     A                                      rent tab panel":"F0481FCA_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCHOT1","field type":"output field-
     A                                      ","value":{"fieldName":"SCHOT1","de-
     A                                      signValue":"[SCHOT1]","refField":"D-
     A                                      S10","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"463px","cursor column":-
     A                                      "28","top":"430px","cursor row":"17-
     A                                      ","parent tab panel":"F0481FCA_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant19","field type":"out-
     A                                      put field","value":":","css class":-
     A                                      "constant","left":"540px","cursor c-
     A                                      olumn":"39","top":"430px","cursor r-
     A                                      ow":"17","parent tab panel":"F0481F-
     A                                      CA_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCOTHR","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCOTHR","designValue":"[SCOTHR]","-
     A                                      refField":"A112","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00"},"css class":"-
     A                                      output-field","left":"554px","curso-
     A                                      r column":"41","top":"430px","curso-
     A                                      r row":"17","width":"91px","text al-
     A                                      ign":"right","css class 2":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"parent tab panel-
     A                                      ":"F0481FCA_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCHOT2","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCHOT2","designValue":"[S-
     A                                      CHOT2]","refField":"DS10","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"65-
     A                                      2px","cursor column":"55","top":"43-
     A                                      0px","cursor row":"17","parent tab -
     A                                      panel":"F0481FCA_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      20","field type":"output field","va-
     A                                      lue":":","css class":"constant","le-
     A                                      ft":"729px","cursor column":"66","t-
     A                                      op":"430px","cursor row":"17","pare-
     A                                      nt tab panel":"F0481FCA_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      COTH2","field type":"output field",-
     A                                      "value":{"fieldName":"SCOTH2","desi-
     A                                      gnValue":"[SCOTH2]","refField":"A11-
     A                                      2","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00"},"css class":"output-field",-
     A                                      "left":"743px","cursor column":"68"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"91px","text align":"right","-
     A                                      css class 2":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"parent tab panel":"F0481FCA_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant21","field type":"o-
     A                                      utput field","value":"Total paid   -
     A                                                            :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"450px","cursor -
     A                                      row":"18","parent tab pane')
     A                                  1 12HTML('l":"F0481FCA_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPAID-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPAID","designVal-
     A                                      ue":"[SCPAID]","refField":"A112","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      "},"css class":"output-field","left-
     A                                      ":"554px","cursor column":"41","top-
     A                                      ":"450px","cursor row":"18","width"-
     A                                      :"91px","text align":"right","css c-
     A                                      lass 2":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      parent tab panel":"F0481FCA_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant22","field type":"output-
     A                                       field","value":"Eligible for data -
     A                                      submission       :","css class":"co-
     A                                      nstant","visibility":{"fieldName":"-
     A                                      30","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"295px","curs-
     A                                      or column":"4","top":"470px","curso-
     A                                      r row":"19","parent tab panel":"F04-
     A                                      81FCA_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCEDI","field type"-
     A                                      :"checkbox","css class":"input","cs-
     A                                      s class 2":"checkbox","value":{"fie-
     A                                      ldName":"SCEDI","designValue":"[SCE-
     A                                      DI]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","visibi-
     A                                      lity":{"fieldName":"30","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"554px","top":"470px","width-
     A                                      ":"8px","css class 3":{"fieldName":-
     A                                      "09 or 30","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09 and 30","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09 and 30","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9 and 30","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"38 or 30 and 37","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"MCR0503","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"78 and 30","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"3 messages","error messag-
     A                                      e id 2":"MCR0999","error message fi-
     A                                      le 2":"FSMESG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"79 and 30","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 3":"MCR0676","error message -
     A                                      file 3":"FSMESG","error message lib-
     A                                      rary 3":"*LIBL","error condition 3"-
     A                                      :{"fieldName":"31","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"F0481FCA_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted","checked value":"Y",-
     A                                      "unchecked value":"N"},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF03","fie-
     A                                      ld type":"button","value":"Exit","s-
     A                                      hortcut key":"F3","left":"14px","to-
     A                                      p":"183px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF10","field type":"butt-
     A                                      on","value":"Search","shortcut key"-
     A                                      :"F10","left":"14px","top":"216px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF11","field type":"button","value"-
     A                                      :"EOB/Notes","shortcut key":"F11","-
     A                                      left":"14px","top":"249px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF12","f-
     A                                      ield type":"button","visibility":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"value":-
     A                                      "Cancel","shortcut key":"F12","left-
     A                                      ":"14px","top":"282px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEOB#         9S 0H
     A            SCHD1         78A  H
     A            SCHD2         78A  H
     A            SCHD3         78A  H
     A            SCSVZP         5S 0H
     A            SCAST     R        H      REFFLD(ST)
     A            SCCHRG    R        H      REFFLD(A112)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCD1DS    R        H      REFFLD(DS30)
     A            SCD2DS    R        H      REFFLD(DS30)
     A            SCD3DS    R        H      REFFLD(DS30)
     A            SCD4DS    R        H      REFFLD(DS30)
     A            SCDIA1    R        H      REFFLD(DIA)
     A            SCDIA2    R        H      REFFLD(DIA)
     A            SCDIA3    R        H      REFFLD(DIA)
     A            SCDIA4    R        H      REFFLD(DIA)
     A            SCEDI     R        H      REFFLD(FLAG)
     A            SCFLIC    R        H      REFFLD(LIC#)
     A            SCHMRA    R        H      REFFLD(DS10)
     A            SCHNET    R        H      REFFLD(DS10)
     A            SCHOT1    R        H      REFFLD(DS10)
     A            SCHOT2    R        H      REFFLD(DS10)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMRA     R        H      REFFLD(A112)
     A            SCNTWK    R        H      REFFLD(A112)
     A            SCNWCD    R        H      REFFLD(NWCD)
     A            SCOTH2    R        H      REFFLD(A112)
     A            SCOTHR    R        H      REFFLD(A112)
     A            SCPAID    R        H      REFFLD(A112)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSCDS    R        H      REFFLD(DS15)
     A            SCSPCD    R        H      REFFLD(SPEC)
     A            SCZIPA    R        H      REFFLD(ZIPA)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0481FCA_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0481FCA_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0481FCA_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F0481FCA_SCR02_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F0481FCA_SCR02_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F0481FCA_SCR02_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      0481FCA_SCR02_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F0481FCA_SCR02_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F0481FCA_SCR02_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0481FCA_SCR0-
     A                                      2_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F0481FCA_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F0481FCA_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0481FCA_SCR02_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant23","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0481FCA_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F0481FCA_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant24","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0481FCA_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"F0481FCA_-
     A                                      SCR02_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0481FCA_SCR02-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR02_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F0481FCA_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F0481FCA_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant25","field type":-
     A                                      "output field","value":"SCR02","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F0481FCA_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR02_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F0481FCA_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0481FCA_SCR02_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0481F-
     A                                      CA_SCR02_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0481FCA_SCR02_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0481FCA_SCR02_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0481FCA_SCR02_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0481FCA_SCR02_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0481-
     A                                      FCA_SCR02_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0481FCA_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F0481FCA_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0481FCA_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F0481FCA_SCR03_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F0481FCA_SCR03_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F0481FCA_SCR03_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      0481FCA_SCR03_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F0481FCA_SCR03_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F0481FCA_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F0481FCA_SCR0-
     A                                      3_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F0481FCA_SCR03_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F0481FCA_SCR03_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F0481FCA_SCR03_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant26","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0481FCA_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F0481FCA_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant27","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F0481FCA_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"F0481FCA_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0481FCA_SCR03-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR03_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F0481FCA_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F0481FCA_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant28","field type":-
     A                                      "output field","value":"SCR03","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F0481FCA_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR03_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F0481FCA_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0481FCA_SCR03_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0481F-
     A                                      CA_SCR03_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F0481FCA_SCR03_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F0481FCA_SCR03_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0481FCA_SCR03_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F0481FCA_SCR03_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F0481-
     A                                      FCA_SCR03_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
