     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A*PUI                                  SFLDEFINE(18)
     A*PUI                                  SFLDEFINE(19)
     A          R SCR01
     A  10 11 18
     A  19 20                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCFL01C7    MCR0600C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F0527F_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"F0527F_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"F-
     A                                      0527F_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon al-
     A                                      ignment":"middle left","icon width"-
     A                                      :"16px","icon height":"24px","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"F0527F_SCR01_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"F052-
     A                                      7F_SCR01_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"F0527F_SCR01_BtnRefresh","tool t-
     A                                      ip":"Refresh","onclick":"SystemTool-
     A                                      barRefresh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"F0527F_SCR01_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"F0527F_SCR01_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"F05-
     A                                      27F_SCR01_BtnSystemMessages","tool -
     A                                      tip":"System Messages","on')
     A                                  1  4HTML('click":"SystemToolbarMessages-
     A                                      ","background image":{"fieldName":"-
     A                                      MsgIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1196px","i-
     A                                      d":"F0527F_SCR01_BtnHelp","tool tip-
     A                                      ":"Help","onclick":"SystemToolbarHe-
     A                                      lp","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/help-
     A                                      .png'')"},{"id":"F0527F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"F0527F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"active tab":"0","left":"250-
     A                                      px","top":"70px","width":"970px","h-
     A                                      eight":"657px","z index":"8","locke-
     A                                      d in place":"true","css class":"tab-
     A                                      -panel","css class 2":"stationary"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0527F_SCR0-
     A                                      1_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCUSER","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCUSER","designValue":"[SCU-
     A                                      SER]","refField":"USER","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"281p-
     A                                      x","cursor column":"2","top":"110px-
     A                                      ","cursor row":"1","css class 2":"t-
     A                                      op-line","parent tab panel":"F0527F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCCONM","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCONM","designValue":"[SCCONM]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"414px","curso-
     A                                      r column":"21","top":"110px","curso-
     A                                      r row":"1","css class 2":"top-line"-
     A                                      ,"description":"COMPANY NAME","pare-
     A                                      nt tab panel":"F0527F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant1","field type":"output field"-
     A                                      ,"left":"778px","cursor column":"73-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class":"top-line","value":"js: c-
     A                                      urrentDate()","css class 2":"output-
     A                                      -field","parent tab panel":"F0527F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"F0527F_SCR01_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0527F_SCR01_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant2","field type":"ou-
     A                                      tput field","value":"F0527F","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"F0-
     A                                      527F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCPRDS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"414px","c-
     A                                      ursor column":"21","top":"130px","c-
     A                                      ursor row":"2","description":"PROGR-
     A                                      AM NAME","parent tab panel":"F0527F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","visibility":"hidden","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant3","field type":"output field-
     A                                      ","value":"SCR01","css class":"cons-
     A                                      tant","left":"799px","cursor column-
     A                                      ":"76","top":"130px","curs')
     A                                  1  5HTML('or row":"2","parent tab panel-
     A                                      ":"F0527F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant13","fi-
     A                                      eld type":"output field","value":"R-
     A                                      &C PROCEDURE CODE SEARCH","css clas-
     A                                      s":"constant","left":"463px","curso-
     A                                      r column":"28","top":"150px","curso-
     A                                      r row":"3","parent tab panel":"F052-
     A                                      7F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0527F-
     A                                      _SCR01_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCNA-
     A                                      ME","field type":"output field","va-
     A                                      lue":{"fieldName":"SCNAME","designV-
     A                                      alue":"[SCNAME]","refField":"NM60",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"351px","cursor column":"12",-
     A                                      "top":"170px","cursor row":"4","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F0527F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F0-
     A                                      527F_SCR01_BtnHiddenDiaryItems","va-
     A                                      lue":"btnDiary","top":"175px","resp-
     A                                      onse":{"fieldName":"btnDiary","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant4","field type":"output f-
     A                                      ield","value":"Geographic Zip Area:-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"190-
     A                                      px","cursor row":"5","parent tab pa-
     A                                      nel":"F0527F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCZIPA","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCZIPA","designValue-
     A                                      ":"[SCZIPA]","refField":"RCZIPA *LI-
     A                                      BL/FMRCP","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"428px","curs-
     A                                      or column":"23","top":"190px","curs-
     A                                      or row":"5","width":"22px","css cla-
     A                                      ss 3":"UL","description":"Geographi-
     A                                      c Zip Area","parent tab panel":"F05-
     A                                      27F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant5","field typ-
     A                                      e":"output field","value":"CPT-4:",-
     A                                      "css class":"constant","left":"477p-
     A                                      x","cursor column":"30","top":"190p-
     A                                      x","cursor row":"5","parent tab pan-
     A                                      el":"F0527F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCCPT4","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCCPT4","designValue"-
     A                                      :"[SCCPT4]","refField":"CPT4","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"533px","cursor column":"38"-
     A                                      ,"top":"190px","cursor row":"5","wi-
     A                                      dth":"36px","css class 3":"UL","par-
     A                                      ent tab panel":"F0527F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant6","field type":"output field-
     A                                      ","value":"Effective Date:","css cl-
     A                                      ass":"constant","left":"603px","cur-
     A                                      sor column":"48","top":"190px","cur-
     A                                      sor row":"5","parent tab panel":"F0-
     A                                      527F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCEFDT","field type"-
     A                                      :"date field","css class":"input","-
     A                                      css class 2":"date-field","value":{-
     A                                      "fieldName":"SCEFDT","designValue":-
     A                                      "[SCEFDT]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"-999.00","e-
     A                                      dtWrd":"''  /  /    ''","dateFormat-
     A                                      ":"m/d/Y"},"left":"722px","cursor c-
     A                                      olumn":"65","top":"190px","cursor r-
     A                                      ow":"5","width":"71px","css class 3-
     A                                      ":"UL","description":"EFFECTIVE DAT-
     A                                      E","parent tab panel":"F0527F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0527F_SCR01_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant7","field type":"output field-
     A                                      ","value":"Zip","css class":"consta-
     A                                      nt","left":"288px","cursor column":-
     A                                      "3","top":"210px","cursor row":"6",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F0527F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3"')
     A                                  1  6HTML(':"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F0527F_SCR01_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt8","field type":"output field","v-
     A                                      alue":"Area","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"230px","cursor row":"7","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F0527F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant9","field-
     A                                       type":"output field","value":"CPT--
     A                                      4","css class":"constant","left":"3-
     A                                      23px","cursor column":"8","top":"23-
     A                                      0px","cursor row":"7","css class 2"-
     A                                      :"HI","parent tab panel":"F0527F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant12","field type":"o-
     A                                      utput field","value":"EF Date","css-
     A                                       class":"constant","left":"365px","-
     A                                      cursor column":"14","top":"230px","-
     A                                      cursor row":"7","css class 2":"HI",-
     A                                      "parent tab panel":"F0527F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant10","field type":"output -
     A                                      field","value":"Description","css c-
     A                                      lass":"constant","left":"442px","cu-
     A                                      rsor column":"25","top":"230px","cu-
     A                                      rsor row":"7","css class 2":"HI","p-
     A                                      arent tab panel":"F0527F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant11","field type":"output fi-
     A                                      eld","value":"Stat","css class":"co-
     A                                      nstant","left":"799px","cursor colu-
     A                                      mn":"76","top":"230px","cursor row"-
     A                                      :"7","css class 2":"HI","parent tab-
     A                                       panel":"F0527F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCFL01","-
     A                                      field type":"password field","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCFL01","d-
     A                                      esignValue":"[SCFL01]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"274px","cursor c-
     A                                      olumn":"1","top":"250px","cursor ro-
     A                                      w":"8","width":"8px","error message-
     A                                       id":"MCR0600","error message file"-
     A                                      :"FSMESG","error message library":"-
     A                                      *LIBL","error condition":{"fieldNam-
     A                                      e":"20","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"1 message-
     A                                      ","parent tab panel":"F0527F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCGZ01","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCGZ-
     A                                      01","designValue":"[SCGZ01]","refFi-
     A                                      eld":"RCZIPA *LIBL/FMRCP","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"288px","cursor column":"3","top-
     A                                      ":"250px","cursor row":"8","width":-
     A                                      "22px","description":"Geographic Zi-
     A                                      p Area","parent tab panel":"F0527F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCRC01","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      RC01","designValue":"[SCRC01]","ref-
     A                                      Field":"CPT4","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"323px","cursor-
     A                                       column":"8","top":"250px","cursor -
     A                                      row":"8","parent tab panel":"F0527F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCED01","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CED01","designValue":"[SCED01]","re-
     A                                      fField":"DT8","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00","edtWrd":"''  /  /-
     A                                          ''"},"css class":"output-field"-
     A                                      ,"left":"365px","cursor column":"14-
     A                                      ","top":"250px","cursor row":"8","w-
     A                                      idth":"70px","text align":"right","-
     A                                      description":"EFFEC. DATE","parent -
     A                                      tab panel":"F0527F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCNM01-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCNM01","designVal-
     A                                      ue":"[SCNM01]","refField":"DS50","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"442px","cursor column":"25","t-
     A                                      op":"250px","cursor row":"8","paren-
     A                                      t tab panel":"F0527F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCST-
     A                                      01","field type":"output field","va-
     A                                      lue":{"fieldName":"SCST01","designV-
     A                                      alue":"[SCST01]","refField":"STAT",-
     A                                      "dataType":"reference","fo')
     A                                  1  7HTML('rmatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"css class":"-
     A                                      output-field","left":"813px","curso-
     A                                      r column":"78","top":"250px","curso-
     A                                      r row":"8","parent tab panel":"F052-
     A                                      7F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0527F-
     A                                      _SCR01_BtnHiddenWorkPrinterOutput",-
     A                                      "value":"btnWrkprtout","top":"250px-
     A                                      ","response":{"fieldName":"btnWrkPr-
     A                                      nt","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCFL02","field type":"pa-
     A                                      ssword field","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCFL02","designValue":"[S-
     A                                      CFL02]","refField":"FLAG","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"274px","cursor column":"1","top-
     A                                      ":"270px","cursor row":"9","width":-
     A                                      "8px","parent tab panel":"F0527F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCGZ02","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCGZ02","designValue":"[SCGZ02]","r-
     A                                      efField":"RCZIPA *LIBL/FMRCP","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"288px","cursor column":"3",-
     A                                      "top":"270px","cursor row":"9","wid-
     A                                      th":"22px","parent tab panel":"F052-
     A                                      7F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCRC02","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCRC02","designValue":"[SCRC02]","-
     A                                      refField":"CPT4","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"323px","cur-
     A                                      sor column":"8","top":"270px","curs-
     A                                      or row":"9","parent tab panel":"F05-
     A                                      27F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCED02","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCED02","designValue":"[SCED02]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"true","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","edtWrd":"''  /-
     A                                        /    ''"},"css class":"output-fie-
     A                                      ld","left":"365px","cursor column":-
     A                                      "14","top":"270px","cursor row":"9"-
     A                                      ,"width":"70px","text align":"right-
     A                                      ","parent tab panel":"F0527F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCNM02","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCNM02",-
     A                                      "designValue":"[SCNM02]","refField"-
     A                                      :"DS50","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"442px","cursor colum-
     A                                      n":"25","top":"270px","cursor row":-
     A                                      "9","parent tab panel":"F0527F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCST02","field type":"output -
     A                                      field","value":{"fieldName":"SCST02-
     A                                      ","designValue":"[SCST02]","refFiel-
     A                                      d":"STAT","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"813px","cursor col-
     A                                      umn":"78","top":"270px","cursor row-
     A                                      ":"9","parent tab panel":"F0527F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F0527F_SCR0-
     A                                      1_BtnHiddenImageQueue","value":"btn-
     A                                      ImgQue","top":"275px","response":{"-
     A                                      fieldName":"btnImgQue","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCFL0-
     A                                      3","field type":"password field","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCFL03-
     A                                      ","designValue":"[SCFL03]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"274px","curs-
     A                                      or column":"1","top":"290px","curso-
     A                                      r row":"10","width":"8px","parent t-
     A                                      ab panel":"F0527F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCGZ03"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCGZ03","design-
     A                                      Value":"[SCGZ03]","refField":"RCZIP-
     A                                      A *LIBL/FMRCP","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},')
     A                                  1  8HTML('"text transform":"uppercase",-
     A                                      "left":"288px","cursor column":"3",-
     A                                      "top":"290px","cursor row":"10","wi-
     A                                      dth":"22px","parent tab panel":"F05-
     A                                      27F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCRC03","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCRC03","designValue":"[SCRC03]",-
     A                                      "refField":"CPT4","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"323px","cu-
     A                                      rsor column":"8","top":"290px","cur-
     A                                      sor row":"10","parent tab panel":"F-
     A                                      0527F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCED03","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCED03","designValue":"[SCED03]-
     A                                      ","refField":"DT8","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"true","curSym":"","units":-
     A                                      "","negNum":"-999.00","edtWrd":"'' -
     A                                       /  /    ''"},"css class":"output-f-
     A                                      ield","left":"365px","cursor column-
     A                                      ":"14","top":"290px","cursor row":"-
     A                                      10","width":"70px","text align":"ri-
     A                                      ght","parent tab panel":"F0527F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCNM03","field type":"output-
     A                                       field","value":{"fieldName":"SCNM0-
     A                                      3","designValue":"[SCNM03]","refFie-
     A                                      ld":"DS50","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"442px","cursor co-
     A                                      lumn":"25","top":"290px","cursor ro-
     A                                      w":"10","parent tab panel":"F0527F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCST03","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      ST03","designValue":"[SCST03]","ref-
     A                                      Field":"STAT","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"813px","cursor-
     A                                       column":"78","top":"290px","cursor-
     A                                       row":"10","parent tab panel":"F052-
     A                                      7F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0527F-
     A                                      _SCR01_BtnHiddenHelp","value":"btnH-
     A                                      elp","top":"300px","response":{"fie-
     A                                      ldName":"btnHelp","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCFL04","f-
     A                                      ield type":"password field","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCFL04","de-
     A                                      signValue":"[SCFL04]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase"},"text transform":"u-
     A                                      ppercase","left":"274px","cursor co-
     A                                      lumn":"1","top":"310px","cursor row-
     A                                      ":"11","width":"8px","parent tab pa-
     A                                      nel":"F0527F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SCGZ04","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCGZ04","designValue-
     A                                      ":"[SCGZ04]","refField":"RCZIPA *LI-
     A                                      BL/FMRCP","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"288px","curs-
     A                                      or column":"3","top":"310px","curso-
     A                                      r row":"11","width":"22px","parent -
     A                                      tab panel":"F0527F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCRC04-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCRC04","designVal-
     A                                      ue":"[SCRC04]","refField":"CPT4","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"323px","cursor column":"8","to-
     A                                      p":"310px","cursor row":"11","paren-
     A                                      t tab panel":"F0527F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCED-
     A                                      04","field type":"output field","va-
     A                                      lue":{"fieldName":"SCED04","designV-
     A                                      alue":"[SCED04]","refField":"DT8","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"true","zeroFill":"true","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      ","edtWrd":"''  /  /    ''"},"css c-
     A                                      lass":"output-field","left":"365px"-
     A                                      ,"cursor column":"14","top":"310px"-
     A                                      ,"cursor row":"11","width":"70px","-
     A                                      text align":"right","parent tab pan-
     A                                      el":"F0527F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCNM04","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCNM04","designValue":"[S-
     A                                      CNM04]","refField":"DS50","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","')
     A                                  1  9HTML('left":"442px","cursor column"-
     A                                      :"25","top":"310px","cursor row":"1-
     A                                      1","parent tab panel":"F0527F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCST04","field type":"output f-
     A                                      ield","value":{"fieldName":"SCST04"-
     A                                      ,"designValue":"[SCST04]","refField-
     A                                      ":"STAT","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"813px","cursor colu-
     A                                      mn":"78","top":"310px","cursor row"-
     A                                      :"11","parent tab panel":"F0527F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCFL05","field type":"passw-
     A                                      ord field","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCFL05","designValue":"[SCFL-
     A                                      05]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "274px","cursor column":"1","top":"-
     A                                      330px","cursor row":"12","width":"8-
     A                                      px","parent tab panel":"F0527F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCGZ05","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      GZ05","designValue":"[SCGZ05]","ref-
     A                                      Field":"RCZIPA *LIBL/FMRCP","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"288px","cursor column":"3","t-
     A                                      op":"330px","cursor row":"12","widt-
     A                                      h":"22px","parent tab panel":"F0527-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCRC05","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCRC05","designValue":"[SCRC05]","r-
     A                                      efField":"CPT4","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"323px","curs-
     A                                      or column":"8","top":"330px","curso-
     A                                      r row":"12","parent tab panel":"F05-
     A                                      27F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCED05","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCED05","designValue":"[SCED05]",-
     A                                      "refField":"DT8","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"true","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","edtWrd":"''  /-
     A                                        /    ''"},"css class":"output-fie-
     A                                      ld","left":"365px","cursor column":-
     A                                      "14","top":"330px","cursor row":"12-
     A                                      ","width":"70px","text align":"righ-
     A                                      t","parent tab panel":"F0527F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCNM05","field type":"output f-
     A                                      ield","value":{"fieldName":"SCNM05"-
     A                                      ,"designValue":"[SCNM05]","refField-
     A                                      ":"DS50","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"442px","cursor colu-
     A                                      mn":"25","top":"330px","cursor row"-
     A                                      :"12","parent tab panel":"F0527F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCST05","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCST-
     A                                      05","designValue":"[SCST05]","refFi-
     A                                      eld":"STAT","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"813px","cursor c-
     A                                      olumn":"78","top":"330px","cursor r-
     A                                      ow":"12","parent tab panel":"F0527F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCFL06","field type":"pa-
     A                                      ssword field","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCFL06","designValue":"[S-
     A                                      CFL06]","refField":"FLAG","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"274px","cursor column":"1","top-
     A                                      ":"350px","cursor row":"13","width"-
     A                                      :"8px","parent tab panel":"F0527F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCGZ06","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCGZ06","designValue":"[SCGZ06]","-
     A                                      refField":"RCZIPA *LIBL/FMRCP","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"288px","cursor column":"3"-
     A                                      ,"top":"350px","cursor row":"13","w-
     A                                      idth":"22px","parent tab panel":"F0-
     A                                      527F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"SCRC06","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCRC06","designValue":"[SCRC06]"-
     A                                      ,"refField":"CPT4","dataType":"refe-
     A                                      rence","formatting":"Text"')
     A                                  1 10HTML(',"trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"323px","cursor column":"8","t-
     A                                      op":"350px","cursor row":"13","pare-
     A                                      nt tab panel":"F0527F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCE-
     A                                      D06","field type":"output field","v-
     A                                      alue":{"fieldName":"SCED06","design-
     A                                      Value":"[SCED06]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","edtWrd":"''  /  /    ''"},"css -
     A                                      class":"output-field","left":"365px-
     A                                      ","cursor column":"14","top":"350px-
     A                                      ","cursor row":"13","width":"70px",-
     A                                      "text align":"right","parent tab pa-
     A                                      nel":"F0527F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCNM06","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCNM06","designValue":"[-
     A                                      SCNM06]","refField":"DS50","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      42px","cursor column":"25","top":"3-
     A                                      50px","cursor row":"13","parent tab-
     A                                       panel":"F0527F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCST06","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCST06","designValue"-
     A                                      :"[SCST06]","refField":"STAT","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"813px","cursor column":"78","top"-
     A                                      :"350px","cursor row":"13","parent -
     A                                      tab panel":"F0527F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCFL07-
     A                                      ","field type":"password field","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCFL07"-
     A                                      ,"designValue":"[SCFL07]","refField-
     A                                      ":"FLAG","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"274px","curso-
     A                                      r column":"1","top":"370px","cursor-
     A                                       row":"14","width":"8px","parent ta-
     A                                      b panel":"F0527F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCGZ07",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCGZ07","designV-
     A                                      alue":"[SCGZ07]","refField":"RCZIPA-
     A                                       *LIBL/FMRCP","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"288px","-
     A                                      cursor column":"3","top":"370px","c-
     A                                      ursor row":"14","width":"22px","par-
     A                                      ent tab panel":"F0527F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"SC-
     A                                      RC07","field type":"output field","-
     A                                      value":{"fieldName":"SCRC07","desig-
     A                                      nValue":"[SCRC07]","refField":"CPT4-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"323px","cursor column":"8"-
     A                                      ,"top":"370px","cursor row":"14","p-
     A                                      arent tab panel":"F0527F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCED07","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCED07","des-
     A                                      ignValue":"[SCED07]","refField":"DT-
     A                                      8","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","edtWrd":"''  /  /    ''"},"c-
     A                                      ss class":"output-field","left":"36-
     A                                      5px","cursor column":"14","top":"37-
     A                                      0px","cursor row":"14","width":"70p-
     A                                      x","text align":"right","parent tab-
     A                                       panel":"F0527F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCNM07","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCNM07","designValue"-
     A                                      :"[SCNM07]","refField":"DS50","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"442px","cursor column":"25","top"-
     A                                      :"370px","cursor row":"14","parent -
     A                                      tab panel":"F0527F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCST07-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCST07","designVal-
     A                                      ue":"[SCST07]","refField":"STAT","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"813px","cursor column":"78","t-
     A                                      op":"370px","cursor row":"14","pare-
     A                                      nt tab panel":"F0527F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCF-
     A                                      L08","field type":"password field",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldNa')
     A                                  1 11HTML('me":"SCFL08","designValue":"[-
     A                                      SCFL08]","refField":"FLAG","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"274px","cursor column":"1","to-
     A                                      p":"390px","cursor row":"15","width-
     A                                      ":"8px","parent tab panel":"F0527F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCGZ08","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCGZ08","designValue":"[SCGZ08]",-
     A                                      "refField":"RCZIPA *LIBL/FMRCP","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"288px","cursor column":"3-
     A                                      ","top":"390px","cursor row":"15","-
     A                                      width":"22px","parent tab panel":"F-
     A                                      0527F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCRC08","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCRC08","designValue":"[SCRC08]-
     A                                      ","refField":"CPT4","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"323px","-
     A                                      cursor column":"8","top":"390px","c-
     A                                      ursor row":"15","parent tab panel":-
     A                                      "F0527F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCED08","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCED08","designValue":"[SCED0-
     A                                      8]","refField":"DT8","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"true","curSym":"","units-
     A                                      ":"","negNum":"-999.00","edtWrd":"'-
     A                                      '  /  /    ''"},"css class":"output-
     A                                      -field","left":"365px","cursor colu-
     A                                      mn":"14","top":"390px","cursor row"-
     A                                      :"15","width":"70px","text align":"-
     A                                      right","parent tab panel":"F0527F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCNM08","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCN-
     A                                      M08","designValue":"[SCNM08]","refF-
     A                                      ield":"DS50","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"442px","cursor -
     A                                      column":"25","top":"390px","cursor -
     A                                      row":"15","parent tab panel":"F0527-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCST08","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCST08","designValue":"[SCST08]","r-
     A                                      efField":"STAT","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"813px","curs-
     A                                      or column":"78","top":"390px","curs-
     A                                      or row":"15","parent tab panel":"F0-
     A                                      527F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCFL09","field type"-
     A                                      :"password field","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCFL09","designValue"-
     A                                      :"[SCFL09]","refField":"FLAG","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"274px","cursor column":"1",-
     A                                      "top":"410px","cursor row":"16","wi-
     A                                      dth":"8px","parent tab panel":"F052-
     A                                      7F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCGZ09","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCGZ09","designValue":"[SCGZ09-
     A                                      ]","refField":"RCZIPA *LIBL/FMRCP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","left":"288px","cursor column"-
     A                                      :"3","top":"410px","cursor row":"16-
     A                                      ","width":"22px","parent tab panel"-
     A                                      :"F0527F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"SCRC09","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCRC09","designValue":"[SCRC-
     A                                      09]","refField":"CPT4","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"323px-
     A                                      ","cursor column":"8","top":"410px"-
     A                                      ,"cursor row":"16","parent tab pane-
     A                                      l":"F0527F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCED09","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCED09","designValue":"[SC-
     A                                      ED09]","refField":"DT8","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00","edtWrd"-
     A                                      :"''  /  /    ''"},"css class":"out-
     A                                      put-field","left":"365px","cursor c-
     A                                      olumn":"14","top":"410px","cursor r-
     A                                      ow":"16","width":"70px","text align-
     A                                      ":"right","parent tab pane')
     A                                  1 12HTML('l":"F0527F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCNM09",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCNM09","designValue-
     A                                      ":"[SCNM09]","refField":"DS50","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"442px","cursor column":"25","top-
     A                                      ":"410px","cursor row":"16","parent-
     A                                       tab panel":"F0527F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCST0-
     A                                      9","field type":"output field","val-
     A                                      ue":{"fieldName":"SCST09","designVa-
     A                                      lue":"[SCST09]","refField":"STAT","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"813px","cursor column":"78","-
     A                                      top":"410px","cursor row":"16","par-
     A                                      ent tab panel":"F0527F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      FL10","field type":"password field"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCF-
     A                                      L10","designValue":"[SCFL10]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"274px","c-
     A                                      ursor column":"1","top":"430px","cu-
     A                                      rsor row":"17","width":"8px","paren-
     A                                      t tab panel":"F0527F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCGZ-
     A                                      10","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCGZ10","des-
     A                                      ignValue":"[SCGZ10]","refField":"RC-
     A                                      ZIPA *LIBL/FMRCP","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"288p-
     A                                      x","cursor column":"3","top":"430px-
     A                                      ","cursor row":"17","width":"22px",-
     A                                      "parent tab panel":"F0527F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"SCRC10","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCRC10","d-
     A                                      esignValue":"[SCRC10]","refField":"-
     A                                      CPT4","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"323px","cursor column"-
     A                                      :"8","top":"430px","cursor row":"17-
     A                                      ","parent tab panel":"F0527F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCED10","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCED10",-
     A                                      "designValue":"[SCED10]","refField"-
     A                                      :"DT8","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","zeroFill":"tru-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","edtWrd":"''  /  /    ''"-
     A                                      },"css class":"output-field","left"-
     A                                      :"365px","cursor column":"14","top"-
     A                                      :"430px","cursor row":"17","width":-
     A                                      "70px","text align":"right","parent-
     A                                       tab panel":"F0527F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCNM1-
     A                                      0","field type":"output field","val-
     A                                      ue":{"fieldName":"SCNM10","designVa-
     A                                      lue":"[SCNM10]","refField":"DS50","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"442px","cursor column":"25","-
     A                                      top":"430px","cursor row":"17","par-
     A                                      ent tab panel":"F0527F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      ST10","field type":"output field","-
     A                                      value":{"fieldName":"SCST10","desig-
     A                                      nValue":"[SCST10]","refField":"STAT-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"813px","cursor column":"78-
     A                                      ","top":"430px","cursor row":"17","-
     A                                      parent tab panel":"F0527F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCFL11","field type":"password fie-
     A                                      ld","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCFL11","designValue":"[SCFL11]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"274px"-
     A                                      ,"cursor column":"1","top":"450px",-
     A                                      "cursor row":"18","width":"8px","pa-
     A                                      rent tab panel":"F0527F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CGZ11","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCGZ11","-
     A                                      designValue":"[SCGZ11]","refField":-
     A                                      "RCZIPA *LIBL/FMRCP","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase",')
     A                                  1 13HTML('"left":"288px","cursor column-
     A                                      ":"3","top":"450px","cursor row":"1-
     A                                      8","width":"22px","parent tab panel-
     A                                      ":"F0527F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCRC11","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCRC11","designValue":"[SCR-
     A                                      C11]","refField":"CPT4","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"323p-
     A                                      x","cursor column":"8","top":"450px-
     A                                      ","cursor row":"18","parent tab pan-
     A                                      el":"F0527F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCED11","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCED11","designValue":"[S-
     A                                      CED11]","refField":"DT8","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","edtWrd-
     A                                      ":"''  /  /    ''"},"css class":"ou-
     A                                      tput-field","left":"365px","cursor -
     A                                      column":"14","top":"450px","cursor -
     A                                      row":"18","width":"70px","text alig-
     A                                      n":"right","parent tab panel":"F052-
     A                                      7F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCNM11","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCNM11","designValue":"[SCNM11]","-
     A                                      refField":"DS50","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"442px","cur-
     A                                      sor column":"25","top":"450px","cur-
     A                                      sor row":"18","parent tab panel":"F-
     A                                      0527F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCST11","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCST11","designValue":"[SCST11]-
     A                                      ","refField":"STAT","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"813px","-
     A                                      cursor column":"78","top":"450px","-
     A                                      cursor row":"18","parent tab panel"-
     A                                      :"F0527F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCFL12","field t-
     A                                      ype":"password field","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCFL12","designVa-
     A                                      lue":"[SCFL12]","refField":"FLAG","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase"},"text transform":"upperca-
     A                                      se","left":"274px","cursor column":-
     A                                      "1","top":"470px","cursor row":"19"-
     A                                      ,"width":"8px","parent tab panel":"-
     A                                      F0527F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCGZ12","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCGZ12","designValue":"[SC-
     A                                      GZ12]","refField":"RCZIPA *LIBL/FMR-
     A                                      CP","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"288px","cursor col-
     A                                      umn":"3","top":"470px","cursor row"-
     A                                      :"19","width":"22px","parent tab pa-
     A                                      nel":"F0527F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SCRC12","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCRC12","designValue":"[-
     A                                      SCRC12]","refField":"CPT4","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"3-
     A                                      23px","cursor column":"8","top":"47-
     A                                      0px","cursor row":"19","parent tab -
     A                                      panel":"F0527F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCED12","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCED12","designValue":-
     A                                      "[SCED12]","refField":"DT8","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"true","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","edt-
     A                                      Wrd":"''  /  /    ''"},"css class":-
     A                                      "output-field","left":"365px","curs-
     A                                      or column":"14","top":"470px","curs-
     A                                      or row":"19","width":"70px","text a-
     A                                      lign":"right","parent tab panel":"F-
     A                                      0527F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCNM12","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCNM12","designValue":"[SCNM12]-
     A                                      ","refField":"DS50","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"442px","-
     A                                      cursor column":"25","top":"470px","-
     A                                      cursor row":"19","parent tab panel"-
     A                                      :"F0527F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCST12","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCST12","designValue":"[SCST-
     A                                      12]","refField":"STAT","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTra')
     A                                  1 14HTML('iling":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"813px","cursor column":"7-
     A                                      8","top":"470px","cursor row":"19",-
     A                                      "parent tab panel":"F0527F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCFL13","field type":"password fi-
     A                                      eld","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCFL13","designValue":"[SCFL13]","-
     A                                      refField":"FLAG","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"274px-
     A                                      ","cursor column":"1","top":"490px"-
     A                                      ,"cursor row":"20","width":"8px","p-
     A                                      arent tab panel":"F0527F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      SCGZ13","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCGZ13",-
     A                                      "designValue":"[SCGZ13]","refField"-
     A                                      :"RCZIPA *LIBL/FMRCP","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      288px","cursor column":"3","top":"4-
     A                                      90px","cursor row":"20","width":"22-
     A                                      px","parent tab panel":"F0527F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCRC13","field type":"output -
     A                                      field","value":{"fieldName":"SCRC13-
     A                                      ","designValue":"[SCRC13]","refFiel-
     A                                      d":"CPT4","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"323px","cursor col-
     A                                      umn":"8","top":"490px","cursor row"-
     A                                      :"20","parent tab panel":"F0527F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCED13","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCED-
     A                                      13","designValue":"[SCED13]","refFi-
     A                                      eld":"DT8","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "true","curSym":"","units":"","negN-
     A                                      um":"-999.00","edtWrd":"''  /  /   -
     A                                       ''"},"css class":"output-field","l-
     A                                      eft":"365px","cursor column":"14","-
     A                                      top":"490px","cursor row":"20","wid-
     A                                      th":"70px","text align":"right","pa-
     A                                      rent tab panel":"F0527F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CNM13","field type":"output field",-
     A                                      "value":{"fieldName":"SCNM13","desi-
     A                                      gnValue":"[SCNM13]","refField":"DS5-
     A                                      0","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"442px","cursor column":"2-
     A                                      5","top":"490px","cursor row":"20",-
     A                                      "parent tab panel":"F0527F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCST13","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCST13","d-
     A                                      esignValue":"[SCST13]","refField":"-
     A                                      STAT","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"813px","cursor column"-
     A                                      :"78","top":"490px","cursor row":"2-
     A                                      0","parent tab panel":"F0527F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCFL14","field type":"password-
     A                                       field","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCFL14","designValue":"[SCFL14]-
     A                                      ","refField":"FLAG","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","left":"27-
     A                                      4px","cursor column":"1","top":"510-
     A                                      px","cursor row":"21","width":"8px"-
     A                                      ,"parent tab panel":"F0527F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCGZ14","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCGZ1-
     A                                      4","designValue":"[SCGZ14]","refFie-
     A                                      ld":"RCZIPA *LIBL/FMRCP","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"510px","cursor row":"21","width":-
     A                                      "22px","parent tab panel":"F0527F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCRC14","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCR-
     A                                      C14","designValue":"[SCRC14]","refF-
     A                                      ield":"CPT4","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"323px","cursor -
     A                                      column":"8","top":"510px","cursor r-
     A                                      ow":"21","parent tab panel":"F0527F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCED14","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CED14","designValue":"[SCE')
     A                                  1 15HTML('D14]","refField":"DT8","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''"},"css class"-
     A                                      :"output-field","left":"365px","cur-
     A                                      sor column":"14","top":"510px","cur-
     A                                      sor row":"21","width":"70px","text -
     A                                      align":"right","parent tab panel":"-
     A                                      F0527F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCNM14","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCNM14","designValue":"[SCNM14-
     A                                      ]","refField":"DS50","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"442px",-
     A                                      "cursor column":"25","top":"510px",-
     A                                      "cursor row":"21","parent tab panel-
     A                                      ":"F0527F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCST14","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCST14","designValue":"[SCS-
     A                                      T14]","refField":"STAT","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"813p-
     A                                      x","cursor column":"78","top":"510p-
     A                                      x","cursor row":"21","parent tab pa-
     A                                      nel":"F0527F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCUP","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCUP","designValue":"[SCUP-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"9"},"css class":"-
     A                                      output-field","left":"631px","curso-
     A                                      r column":"52","top":"550px","curso-
     A                                      r row":"23","parent tab panel":"F05-
     A                                      27F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCDOWN","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCDOWN","designValue":"[SCDOWN]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"9"},"css class":"out-
     A                                      put-field","left":"736px","cursor c-
     A                                      olumn":"67","top":"550px","cursor r-
     A                                      ow":"23","parent tab panel":"F0527F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF05","f-
     A                                      ield type":"button","value":"Det in-
     A                                      quiry","shortcut key":"F5","left":"-
     A                                      14px","top":"216px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF12","field ty-
     A                                      pe":"button","value":"Cancel  ","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"249px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnHELP","field type":"butt-
     A                                      on","shortcut key":"Alt-F1","bypass-
     A                                       validation":"true","value":"HELP",-
     A                                      "response":{"fieldName":"*IN10","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"lef-
     A                                      t":"14px","top":"282px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnROLLDOWN","-
     A                                      field type":"button","value":"Page -
     A                                      Up","shortcut key":"PageUp","respon-
     A                                      se":{"fieldName":"*IN19","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"left":"14p-
     A                                      x","top":"315px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnROLLUP","field typ-
     A                                      e":"button","value":"Page Down","sh-
     A                                      ortcut key":"PageDown","response":{-
     A                                      "fieldName":"*IN18","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"left":"14px","t-
     A                                      op":"348px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCDOWN         9A  H
     A            SCUP           9A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCPT4    R        H      REFFLD(CPT4)
     A            SCED01    R        H      REFFLD(DT8)
     A            SCED02    R        H      REFFLD(DT8)
     A            SCED03    R        H      REFFLD(DT8)
     A            SCED04    R        H      REFFLD(DT8)
     A            SCED05    R        H      REFFLD(DT8)
     A            SCED06    R        H      REFFLD(DT8)
     A            SCED07    R        H      REFFLD(DT8)
     A            SCED08    R        H      REFFLD(DT8)
     A            SCED09    R        H      REFFLD(DT8)
     A            SCED10    R        H      REFFLD(DT8)
     A            SCED11    R        H      REFFLD(DT8)
     A            SCED12    R        H      REFFLD(DT8)
     A            SCED13    R        H      REFFLD(DT8)
     A            SCED14    R        H      REFFLD(DT8)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCFL01    R        H      REFFLD(FLAG)
     A            SCFL02    R        H      REFFLD(FLAG)
     A            SCFL03    R        H      REFFLD(FLAG)
     A            SCFL04    R        H      REFFLD(FLAG)
     A            SCFL05    R        H      REFFLD(FLAG)
     A            SCFL06    R        H      REFFLD(FLAG)
     A            SCFL07    R        H      REFFLD(FLAG)
     A            SCFL08    R        H      REFFLD(FLAG)
     A            SCFL09    R        H      REFFLD(FLAG)
     A            SCFL10    R        H      REFFLD(FLAG)
     A            SCFL11    R        H      REFFLD(FLAG)
     A            SCFL12    R        H      REFFLD(FLAG)
     A            SCFL13    R        H      REFFLD(FLAG)
     A            SCFL14    R        H      REFFLD(FLAG)
     A            SCGZ01    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ02    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ03    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ04    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ05    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ06    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ07    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ08    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ09    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ10    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ11    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ12    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ13    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCGZ14    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A            SCNAME    R        H      REFFLD(NM60)
     A            SCNM01    R        H      REFFLD(DS50)
     A            SCNM02    R        H      REFFLD(DS50)
     A            SCNM03    R        H      REFFLD(DS50)
     A            SCNM04    R        H      REFFLD(DS50)
     A            SCNM05    R        H      REFFLD(DS50)
     A            SCNM06    R        H      REFFLD(DS50)
     A            SCNM07    R        H      REFFLD(DS50)
     A            SCNM08    R        H      REFFLD(DS50)
     A            SCNM09    R        H      REFFLD(DS50)
     A            SCNM10    R        H      REFFLD(DS50)
     A            SCNM11    R        H      REFFLD(DS50)
     A            SCNM12    R        H      REFFLD(DS50)
     A            SCNM13    R        H      REFFLD(DS50)
     A            SCNM14    R        H      REFFLD(DS50)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRC01    R        H      REFFLD(CPT4)
     A            SCRC02    R        H      REFFLD(CPT4)
     A            SCRC03    R        H      REFFLD(CPT4)
     A            SCRC04    R        H      REFFLD(CPT4)
     A            SCRC05    R        H      REFFLD(CPT4)
     A            SCRC06    R        H      REFFLD(CPT4)
     A            SCRC07    R        H      REFFLD(CPT4)
     A            SCRC08    R        H      REFFLD(CPT4)
     A            SCRC09    R        H      REFFLD(CPT4)
     A            SCRC10    R        H      REFFLD(CPT4)
     A            SCRC11    R        H      REFFLD(CPT4)
     A            SCRC12    R        H      REFFLD(CPT4)
     A            SCRC13    R        H      REFFLD(CPT4)
     A            SCRC14    R        H      REFFLD(CPT4)
     A            SCST01    R        H      REFFLD(STAT)
     A            SCST02    R        H      REFFLD(STAT)
     A            SCST03    R        H      REFFLD(STAT)
     A            SCST04    R        H      REFFLD(STAT)
     A            SCST05    R        H      REFFLD(STAT)
     A            SCST06    R        H      REFFLD(STAT)
     A            SCST07    R        H      REFFLD(STAT)
     A            SCST08    R        H      REFFLD(STAT)
     A            SCST09    R        H      REFFLD(STAT)
     A            SCST10    R        H      REFFLD(STAT)
     A            SCST11    R        H      REFFLD(STAT)
     A            SCST12    R        H      REFFLD(STAT)
     A            SCST13    R        H      REFFLD(STAT)
     A            SCST14    R        H      REFFLD(STAT)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCZIPA    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A          R SCR02
     A  10 11 18
     A  19 09                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"1-23"},"items-
     A                                      ":[{"id":"F0527F_SCR02_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"F0527F_SCR02-
     A                                      _action","field type":"html contain-
     A                                      er","white space":"normal","left":"-
     A                                      0px","top":"10px","width":"230px","-
     A                                      css class":"action-panel-converted"-
     A                                      ,"height":"700px","html":"<div clas-
     A                                      s=\"top\"></div><div class=\"imaget-
     A                                      op\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_top.png\" /></div><div-
     A                                       class=\"menulinks\"></div><div cla-
     A                                      ss=\"imagebottom\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_bottom.p-
     A                                      ng\" /></div><div class=\"bottom\">-
     A                                      </div>"},{"field type":"icon menu b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      32px","z index":"20","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1170px","i-
     A                                      d":"F0527F_SCR02_BtnIconMenuSystemT-
     A                                      ools","tool tip":"System Tools","ic-
     A                                      on alignment":"middle left","icon w-
     A                                      idth":"16px","icon height":"24px","-
     A                                      icon source":"/profoundui/userdata/-
     A                                      images/systool/systools.png","data -
     A                                      function":"SystemToolbarSystools","-
     A                                      show down arrow":"Yes"},{"field typ-
     A                                      e":"panel","panel style":"Transform-
     A                                      ButtonBar","id":"F0527F_SCR02_Butto-
     A                                      nBar","top":"35px","left":"1036px",-
     A                                      "width":"187px","height":"28px","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden","locked in place":"true"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1040px","id":-
     A                                      "F0527F_SCR02_BtnSave","tool tip":"-
     A                                      Save","onclick":"SystemToolbarSave"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/save.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1066px-
     A                                      ","id":"F0527F_SCR02_BtnRefresh","t-
     A                                      ool tip":"Refresh","onclick":"Syste-
     A                                      mToolbarRefresh","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/refresh.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1092px","id":"F0527F_S-
     A                                      CR02_BtnSearch","tool tip":"Search"-
     A                                      ,"onclick":"SystemToolbarSearch","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/search.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1118px"-
     A                                      ,"id":"F0527F_SCR02_BtnDiaryItems",-
     A                                      "tool tip":"Diary/Work Items - IDAR-
     A                                      TS","onclick":"SystemToolbarDiary",-
     A                                      "background image":{"fieldName":"Dr-
     A                                      yIcnURL","dataLength":"128","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"}}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1144px","id"-
     A                                      :"F0527F_SCR02_BtnSystemMessages","-
     A                                      tool tip":"System Messages","onclic-
     A                                      k":"SystemToolbarMessages","backgro-
     A                                      und image":{"fieldName":"MsgIcnURL"-
     A                                      ,"dataLength":"128","trimL')
     A                                  1  4HTML('eading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1196p-
     A                                      x","id":"F0527F_SCR02_BtnHelp","too-
     A                                      l tip":"Help","onclick":"SystemTool-
     A                                      barHelp","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /help.png'')"},{"id":"F0527F_SCR02_-
     A                                      ImgSysToolBottom","field type":"ima-
     A                                      ge","image source":"/profoundui/use-
     A                                      rdata/images/systool/butbarbot.png"-
     A                                      ,"left":"1036px","top":"64px","widt-
     A                                      h":"187px","locked in place":"true"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden"},{"id":"F0527F_SCR02_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0527F-
     A                                      _SCR02_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCR02_SCUS-
     A                                      ER","field type":"output field","va-
     A                                      lue":{"fieldName":"SCUSER","designV-
     A                                      alue":"[SCUSER]","refField":"USER",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","parent tab pan-
     A                                      el":"F0527F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCR02_SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","description":"CO-
     A                                      MPANY NAME","parent tab panel":"F05-
     A                                      27F_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant14","field ty-
     A                                      pe":"output field","left":"778px","-
     A                                      cursor column":"73","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"F0527F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"F0527F_-
     A                                      SCR02_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F0527F_SCR02_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant1-
     A                                      5","field type":"output field","val-
     A                                      ue":"F0527F","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"F0527F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR02_SCPRDS","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPRDS"-
     A                                      ,"designValue":"[SCPRDS]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"130px","cursor row"-
     A                                      :"2","description":"PROGRAM NAME","-
     A                                      parent tab panel":"F0527F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","visibi-
     A                                      lity":"hidden","css class 2":"profo-
     A                                      und-converted"},{"id":"constant16",-
     A                                      "field type":"output field","value"-
     A                                      :"SCR02","css class":"constant","le-
     A                                      ft":"799px","cursor column":"76","t-
     A                                      op":"130px","cursor row":"2","paren-
     A                                      t tab panel":"F0527F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","cs')
     A                                  1  5HTML('s class 2":"profound-converte-
     A                                      d"},{"id":"constant30","field type"-
     A                                      :"output field","value":"R&C PROCED-
     A                                      URE CODE SEARCH","css class":"const-
     A                                      ant","left":"463px","cursor column"-
     A                                      :"28","top":"150px","cursor row":"3-
     A                                      ","parent tab panel":"F0527F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0527F_SCR02_Bt-
     A                                      nHiddenSearch","value":"btnSearch",-
     A                                      "top":"150px","response":{"fieldNam-
     A                                      e":"btnSearch","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F0527F_SCR02_BtnHiddenDiaryItems-
     A                                      ","value":"btnDiary","top":"175px",-
     A                                      "response":{"fieldName":"btnDiary",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant17","field type":"ou-
     A                                      tput field","value":"Status:","css -
     A                                      class":"constant","left":"736px","c-
     A                                      ursor column":"67","top":"190px","c-
     A                                      ursor row":"5","parent tab panel":"-
     A                                      F0527F_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSTAT","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCSTAT","designValue":"[SCSTAT-
     A                                      ]","refField":"STAT","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"792px",-
     A                                      "cursor column":"75","top":"190px",-
     A                                      "cursor row":"5","css class 2":"HI"-
     A                                      ,"parent tab panel":"F0527F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F0527F_SCR02_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px","response":{"-
     A                                      fieldName":"btnMessage","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant29","field type":"output field"-
     A                                      ,"value":"Geographic Zip Area:","cs-
     A                                      s class":"constant","left":"288px",-
     A                                      "cursor column":"3","top":"210px","-
     A                                      cursor row":"6","parent tab panel":-
     A                                      "F0527F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCZIPA","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCZIPA","designValue":"-
     A                                      [SCZIPA]","refField":"RCZIPA *LIBL/-
     A                                      FMRCP","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"435px","cursor column-
     A                                      ":"24","top":"210px","cursor row":"-
     A                                      6","css class 2":"HI","description"-
     A                                      :"Geographic Zip Area","parent tab -
     A                                      panel":"F0527F_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant28-
     A                                      ","field type":"output field","valu-
     A                                      e":"R&C CPT-4 Code:","css class":"c-
     A                                      onstant","left":"470px","cursor col-
     A                                      umn":"29","top":"210px","cursor row-
     A                                      ":"6","parent tab panel":"F0527F_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCR02_SCCPT4","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCCPT4","designValue":"[SCCPT4]",-
     A                                      "refField":"CPT4","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"582px","cu-
     A                                      rsor column":"45","top":"210px","cu-
     A                                      rsor row":"6","css class 2":"HI","p-
     A                                      arent tab panel":"F0527F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant27","field type":"output fi-
     A                                      eld","value":"Effective Date:","css-
     A                                       class":"constant","left":"631px","-
     A                                      cursor column":"52","top":"210px","-
     A                                      cursor row":"6","parent tab panel":-
     A                                      "F0527F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCEFDT","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCEFDT","designValue":"-
     A                                      [SCEFDT]","refField":"DT8","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","edtW-
     A                                      rd":"''  /  /    ''"},"css class":"-
     A                                      output-field","left":"743px","curso-
     A                                      r column":"68","top":"210px","curso-
     A                                      r row":"6","width":"70px","text ali-
     A                                      gn":"right","css class 2":"HI","par-
     A                                      ent tab panel":"F0527F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F0527F_SCR02_BtnHidde-
     A                                      nWorkSubmitJob","value":"b')
     A                                  1  6HTML('tnWrksbmjob","top":"225px","r-
     A                                      esponse":{"fieldName":"btnWrkJob","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0527F_SCR02_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F0527F_SCR02_Bt-
     A                                      nHiddenImageQueue","value":"btnImgQ-
     A                                      ue","top":"275px","response":{"fiel-
     A                                      dName":"btnImgQue","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F0527F_SCR02_BtnHiddenHelp",-
     A                                      "value":"btnHelp","top":"300px","re-
     A                                      sponse":{"fieldName":"btnHelp","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant18","field type":"output-
     A                                       field","value":"Description:","css-
     A                                       class":"constant","left":"309px","-
     A                                      cursor column":"6","top":"310px","c-
     A                                      ursor row":"11","parent tab panel":-
     A                                      "F0527F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCDSC1","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCDSC1","designValue":"[SCDSC-
     A                                      1]","refField":"DS50","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"442px"-
     A                                      ,"cursor column":"25","top":"310px"-
     A                                      ,"cursor row":"11","description":"D-
     A                                      ESCRIPTION","parent tab panel":"F05-
     A                                      27F_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCDSC2","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCDSC2","designValue":"[SCDSC2]",-
     A                                      "refField":"DS50","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"442px","cu-
     A                                      rsor column":"25","top":"330px","cu-
     A                                      rsor row":"12","parent tab panel":"-
     A                                      F0527F_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"constant19","field-
     A                                       type":"output field","value":"MRA -
     A                                      Amount:","css class":"constant","le-
     A                                      ft":"309px","cursor column":"6","to-
     A                                      p":"370px","cursor row":"14","paren-
     A                                      t tab panel":"F0527F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCMR-
     A                                      A","field type":"output field","val-
     A                                      ue":{"fieldName":"SCMRA","designVal-
     A                                      ue":"[SCMRA]","refField":"A92","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "442px","cursor column":"25","top":-
     A                                      "370px","cursor row":"14","width":"-
     A                                      70px","text align":"right","descrip-
     A                                      tion":"MRA AMOUNT","parent tab pane-
     A                                      l":"F0527F_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant20","f-
     A                                      ield type":"output field","value":"-
     A                                      Follow-up Days:","css class":"const-
     A                                      ant","left":"582px","cursor column"-
     A                                      :"45","top":"370px","cursor row":"1-
     A                                      4","parent tab panel":"F0527F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCFOLU","field type":"output f-
     A                                      ield","value":{"fieldName":"SCFOLU"-
     A                                      ,"designValue":"[SCFOLU]","refField-
     A                                      ":"DYS","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00"},"css class":"output-fie-
     A                                      ld","left":"722px","cursor column":-
     A                                      "65","top":"370px","cursor row":"14-
     A                                      ","width":"21px","text align":"righ-
     A                                      t","description":"FOLLOW UP","paren-
     A                                      t tab panel":"F0527F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant21","field type":"output field"-
     A                                      ,"value":"Anesthesia:","css class":-
     A                                      "constant","left":"309px","cursor c-
     A                                      olumn":"6","top":"410px","cursor ro-
     A                                      w":"16","parent tab panel":"F0527F_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCANAM","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      ANAM","designValue":"[SCANAM]","ref-
     A                                      Field":"A92","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"442px","cursor co-
     A                                      lumn":"25","top":"410px","cursor ro-
     A                                      w":"16","width":"70px","text align"-
     A                                      :"right","description":"AN')
     A                                  1  7HTML('ESTHESIA","parent tab panel":-
     A                                      "F0527F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"constant23","fiel-
     A                                      d type":"output field","value":"By -
     A                                      Report:","css class":"constant","le-
     A                                      ft":"582px","cursor column":"45","t-
     A                                      op":"410px","cursor row":"16","pare-
     A                                      nt tab panel":"F0527F_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      PT","field type":"output field","va-
     A                                      lue":{"fieldName":"SCRPT","designVa-
     A                                      lue":"[SCRPT]","refField":"FLAG","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"722px","cursor column":"65","t-
     A                                      op":"410px","cursor row":"16","desc-
     A                                      ription":"BY REPORT","parent tab pa-
     A                                      nel":"F0527F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant22",-
     A                                      "field type":"output field","value"-
     A                                      :"Prof. Component:","css class":"co-
     A                                      nstant","left":"309px","cursor colu-
     A                                      mn":"6","top":"450px","cursor row":-
     A                                      "18","parent tab panel":"F0527F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCPROF","field type":"output-
     A                                       field","value":{"fieldName":"SCPRO-
     A                                      F","designValue":"[SCPROF]","refFie-
     A                                      ld":"A92","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"442px","cursor colum-
     A                                      n":"25","top":"450px","cursor row":-
     A                                      "18","width":"70px","text align":"r-
     A                                      ight","description":"PROF COMP.","p-
     A                                      arent tab panel":"F0527F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant25","field type":"output fi-
     A                                      eld","value":"Asterisk (*) Procedur-
     A                                      e:","css class":"constant","left":"-
     A                                      554px","cursor column":"41","top":"-
     A                                      450px","cursor row":"18","parent ta-
     A                                      b panel":"F0527F_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCSUPP",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCSUPP","designValue-
     A                                      ":"[SCSUPP]","refField":"FLAG","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"722px","cursor column":"65","top-
     A                                      ":"450px","cursor row":"18","descri-
     A                                      ption":"* Procedure","parent tab pa-
     A                                      nel":"F0527F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant24",-
     A                                      "field type":"output field","value"-
     A                                      :"Assisting Surgeon:","css class":"-
     A                                      constant","left":"309px","cursor co-
     A                                      lumn":"6","top":"490px","cursor row-
     A                                      ":"20","parent tab panel":"F0527F_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCSURG","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCS-
     A                                      URG","designValue":"[SCSURG]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"442px","cursor -
     A                                      column":"25","top":"490px","cursor -
     A                                      row":"20","description":"ASS SURGEO-
     A                                      N","parent tab panel":"F0527F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant26","field type":"outp-
     A                                      ut field","value":"Fee Schedule Rei-
     A                                      mb:","css class":"constant","left":-
     A                                      "582px","cursor column":"45","top":-
     A                                      "490px","cursor row":"20","parent t-
     A                                      ab panel":"F0527F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCFSR",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCFSR","designValue"-
     A                                      :"[SCFSR]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "722px","cursor column":"65","top":-
     A                                      "490px","cursor row":"20","css clas-
     A                                      s 2":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"par-
     A                                      ent tab panel":"F0527F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"bt-
     A                                      nSubmit","field type":"button","val-
     A                                      ue":"Enter","shortcut key":"Enter",-
     A                                      "left":"14px","top":"150px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF03","-
     A                                      field type":"button","value":"Exit"-
     A                                      ,"shortcut key":"F3","left":"14px",-
     A                                      "top":"183px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF12","field type":"b-
     A                                      utton","value":"Cancel  ","shortcut-
     A                                       key":"F12","left":"14px","top":"21-
     A                                      6px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnHELP","field type":"b')
     A                                  1  8HTML('utton","shortcut key":"Alt-F1-
     A                                      ","bypass validation":"true","value-
     A                                      ":"HELP","response":{"fieldName":"*-
     A                                      IN10","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"left":"14px","top":"249px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnRO-
     A                                      LLDOWN","field type":"button","valu-
     A                                      e":"Page Up","shortcut key":"PageUp-
     A                                      ","response":{"fieldName":"*IN19","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"l-
     A                                      eft":"14px","top":"282px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnROLLUP","-
     A                                      field type":"button","value":"Page -
     A                                      Down","shortcut key":"PageDown","re-
     A                                      sponse":{"fieldName":"*IN18","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"left":-
     A                                      "14px","top":"315px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCANAM    R        H      REFFLD(A92)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCPT4    R        H      REFFLD(CPT4)
     A            SCDSC1    R        H      REFFLD(DS50)
     A            SCDSC2    R        H      REFFLD(DS50)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCFOLU    R        H      REFFLD(DYS)
     A            SCFSR     R        H      REFFLD(FLAG)
     A            SCMRA     R        H      REFFLD(A92)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPROF    R        H      REFFLD(A92)
     A            SCRPT     R        H      REFFLD(FLAG)
     A            SCSTAT    R        H      REFFLD(STAT)
     A            SCSUPP    R        H      REFFLD(FLAG)
     A            SCSURG    R        H      REFFLD(FLAG)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCZIPA    R        H      REFFLD(RCZIPA *LIBL/FMRCP)
     A          R SCR99
     A  10 11 18
     A  19                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(19 'Response Indicator *IN19')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"F0527F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"F0527F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F0527F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F0527F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      F0527F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"F0527F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"F0527F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"F0527F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "F0527F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"F0527F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"F0527F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"F0527F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      0527F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"F0527-
     A                                      F_SCR99_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F0527F_SCR99-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCERR",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","input only":"true","value":{"f-
     A                                      ieldName":"SCERR","designValue":"[S-
     A                                      CERR]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      8px","read only":"true","css class -
     A                                      3":"PR","parent tab panel":"F0527F_-
     A                                      SCR99_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F0527F_SC-
     A                                      R99_BtnHiddenSearch","value":"btnSe-
     A                                      arch","top":"150px","response":{"fi-
     A                                      eldName":"btnSearch","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F0527F_SCR99_BtnHiddenDiar-
     A                                      yItems","value":"btnDiary","top":"1-
     A                                      75px","response":{"fieldName":"btnD-
     A                                      iary","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F0527F-
     A                                      _SCR99_BtnHiddenSystemMessages","va-
     A                                      lue":"btnMessage","top":"200px","re-
     A                                      sponse":{"fieldName":"btnMessage","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F0527F_SCR99_-
     A                                      BtnHiddenWorkSubmitJob","value":"bt-
     A                                      nWrksbmjob","top":"225px","response-
     A                                      ":{"fieldName":"btnWrkJob","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0527F_SCR99_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class"')
     A                                  1  5HTML(':"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F0527F_-
     A                                      SCR99_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F0527F_SCR99_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnHELP","f-
     A                                      ield type":"button","shortcut key":-
     A                                      "Alt-F1","bypass validation":"true"-
     A                                      ,"value":"HELP","response":{"fieldN-
     A                                      ame":"*IN10","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"left":"14px","top":"21-
     A                                      6px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnROLLDOWN","field type":"button-
     A                                      ","value":"Page Up","shortcut key":-
     A                                      "PageUp","response":{"fieldName":"*-
     A                                      IN19","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"left":"14px","top":"249px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnRO-
     A                                      LLUP","field type":"button","value"-
     A                                      :"Page Down","shortcut key":"PageDo-
     A                                      wn","response":{"fieldName":"*IN18"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"14px","top":"282px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
