     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RASSUME    0     -
     A                                      RROWS      2    C1    1C1    1 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","valid command key"-
     A                                      :{"fieldName":"*IN11","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"overlay range-
     A                                      ":"1-1"},"items":[{"id":"F2017F_SCR-
     A                                      01_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"F2017F_SCR01_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"F2017F_SCR01_Btn-
     A                                      IconMenuSystemTools","tool tip":"Sy-
     A                                      stem Tools","icon alignment":"middl-
     A                                      e left","icon width":"16px","icon h-
     A                                      eight":"24px","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"F20-
     A                                      17F_SCR01_ButtonBar","top":"35px","-
     A                                      left":"1036px","width":"187px","hei-
     A                                      ght":"28px","css class":"stationary-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1040px","id":"F2017F_SCR01_BtnSav-
     A                                      e","tool tip":"Save","onclick":"Sys-
     A                                      temToolbarSave","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/save.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1066px","id":"F2017F_SCR01-
     A                                      _BtnRefresh","tool tip":"Refresh","-
     A                                      onclick":"SystemToolbarRefresh","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/refresh.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1092px"-
     A                                      ,"id":"F2017F_SCR01_BtnSearch","too-
     A                                      l tip":"Search","onclick":"SystemTo-
     A                                      olbarSearch","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/search.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1118px","id":"F2017F_SCR01_-
     A                                      BtnDiaryItems","tool tip":"Diary/Wo-
     A                                      rk Items - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"F2017F_SCR01_BtnSy-
     A                                      stemMessages","tool tip":"System Me-
     A                                      ssages","onclick":"SystemToolbarMes-
     A                                      sages","background image":{"fieldNa-
     A                                      me":"MsgIcnURL","dataLengt')
     A                                  1  4HTML('h":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1196px","id":"F2017F_SCR0-
     A                                      1_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F2017F_SCR01_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F2017F_SCR01_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":"Tab 1","a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F2017F_SCR01_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCPGM","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      PGM","designValue":"[SCPGM]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"10"},"css class":"output-f-
     A                                      ield","left":"281px","cursor column-
     A                                      ":"2","top":"110px","cursor row":"1-
     A                                      ","css class 2":"top-line","parent -
     A                                      tab panel":"F2017F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"F2017F-
     A                                      _SCR01_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F2017F_SCR01_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F2017F_SCR01_BtnHiddenSearc-
     A                                      h","value":"btnSearch","top":"150px-
     A                                      ","response":{"fieldName":"btnSearc-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F2017F_SC-
     A                                      R01_BtnHiddenDiaryItems","value":"b-
     A                                      tnDiary","top":"175px","response":{-
     A                                      "fieldName":"btnDiary","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2017F_SCR01_BtnHiddenSy-
     A                                      stemMessages","value":"btnMessage",-
     A                                      "top":"200px","response":{"fieldNam-
     A                                      e":"btnMessage","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2017F_SCR01_BtnHiddenWorkSubmi-
     A                                      tJob","value":"btnWrksbmjob","top":-
     A                                      "225px","response":{"fieldName":"bt-
     A                                      nWrkJob","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F20-
     A                                      17F_SCR01_BtnHiddenWorkPrinterOutpu-
     A                                      t","value":"btnWrkprtout","top":"25-
     A                                      0px","response":{"fieldName":"btnWr-
     A                                      kPrnt","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2017-
     A                                      F_SCR01_BtnHiddenImageQueu')
     A                                  1  5HTML('e","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F20-
     A                                      17F_SCR01_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnHELP","field-
     A                                       type":"button","shortcut key":"Alt-
     A                                      -F1","bypass validation":"true","va-
     A                                      lue":"HELP","response":{"fieldName"-
     A                                      :"*IN10","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"left":"14px","top":"183px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPGM         10A  H
     A          R WDW01
     A  10 11 71
     A  72 74                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC7    ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    12 RERRMSGID  5    C5   -
     A                                       SCCPFC7    MCR1758C6    FSMESGC5  -
     A                                        *LIBLC0    E1    3     71RERRMSGI-
     A                                      D  5    C5    SCCPFC7    MCR0759C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         74RERRMSGID  5    C6    SCSVOFC7-
     A                                          MCR1758C6    FSMESGC5    *LIBLC-
     A                                      0    E1    3     71RERRMSGID  5    -
     A                                      C6    SCSVOFC7    MCR0759C6    FSME-
     A                                      SGC5    *LIBLC0    E1    3     72')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"5","window left":"3","overlay":"-
     A                                      true","valid command key":{"fieldNa-
     A                                      me":"*IN11","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"overlay range":"1-12"},-
     A                                      "items":[{"id":"WDW01","field type"-
     A                                      :"panel","panel style":"Transform D-
     A                                      ialog","text align":"center","left"-
     A                                      :"5px","top":"5px","height":"390px"-
     A                                      ,"width":"534px","z index":"8","loc-
     A                                      ked in place":"true"},{"id":"WDW01_-
     A                                      SCPGM","field type":"output field",-
     A                                      "value":{"fieldName":"SCPGM","desig-
     A                                      nValue":"[SCPGM]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"10-
     A                                      "},"css class":"output-field","left-
     A                                      ":"29px","cursor column":"2","top":-
     A                                      "65px","cursor row":"1","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant1","field type":"output field"-
     A                                      ,"value":"Service Code selection","-
     A                                      css class":"constant","left":"183px-
     A                                      ","cursor column":"24","top":"65px"-
     A                                      ,"cursor row":"1","css class 2":"HI-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant2","field type":"-
     A                                      output field","value":"WDW01","css -
     A                                      class":"constant","left":"463px","c-
     A                                      ursor column":"64","top":"65px","cu-
     A                                      rsor row":"1","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant3","f-
     A                                      ield type":"output field","value":"-
     A                                      Type option, press Enter.","css cla-
     A                                      ss":"constant","left":"29px","curso-
     A                                      r column":"2","top":"105px","cursor-
     A                                       row":"3","css class 2":"BLU","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"1=Select","css clas-
     A                                      s":"constant","left":"43px","cursor-
     A                                       column":"4","top":"125px","cursor -
     A                                      row":"4","css class 2":"BLU","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant6","field type":"output f-
     A                                      ield","value":"Procedure code file:-
     A                                      ","css class":"constant","left":"29-
     A                                      px","cursor column":"2","top":"165p-
     A                                      x","cursor row":"6","css class 2":"-
     A                                      profound-converted"},{"id":"SCCPF",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCCPF","designVa-
     A                                      lue":"[SCCPF]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase","dataLength":"1-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"176px","cursor column":"23","t-
     A                                      op":"165px","cursor row":"6","width-
     A                                      ":"8px","error message id":"MCR1758-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"71","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"MCR0759","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"74","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t5","field type":"output field","va-
     A                                      lue":"Service code file  :","css cl-
     A                                      ass":"constant","left":"29px","curs-
     A                                      or column":"2","top":"205px","curso-
     A                                      r row":"8","css class 2":"profound--
     A                                      converted"},{"id":"SCSVOF","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCSVOF","designValue":"[-
     A                                      SCSVOF]","refField":"FLAG","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"176px","cursor column":"23","t-
     A                                      op":"205px","cursor row":"8","width-
     A                                      ":"8px","error message id":"MCR1758-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"71","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"MCR0759","error message-
     A                                       file 2":"FSMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"72","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"css class 3":"-
     A                                      profound-converted"},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"350px","width":"80p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel  ","-
     A                                      shortcut key":"F12","left":"104px",-
     A                                      "top":"350px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnHELP","field type":"bu-
     A                                      tton","shortcut key":"Alt-F1","bypa-
     A                                      ss validation":"true","value":"HELP-
     A                                      ","response":{"fieldName":"*IN10","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1')
     A                                  1  4HTML(' / 0"},"left":"194px","top":"-
     A                                      350px","width":"80px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","visibility":"hidden","c-
     A                                      ursor":"default"}]}')
     A            SCCPF          1A  H
     A            SCPGM         10A  H
     A            SCSVOF    R        H      REFFLD(FLAG)
