     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  53 09 30
     A  40 76 82
     A  77                                  CA01(53 'Response Indicator *IN53')
     A                                  1  2HTML('QPUIREC4    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSGID  5    C6    SCEFDTC7    MCR0-
     A                                      500C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     76 82RERRMSGID  5    C6   -
     A                                       SCEFDTC7    MCR0900C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     77 82')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","set off":{"fieldNa-
     A                                      me":"*IN53","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"return cursor record":{-
     A                                      "fieldName":"HREC","dataLength":"10-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      "},"return cursor field":{"fieldNam-
     A                                      e":"HFLD","dataLength":"10","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"none"},"overl-
     A                                      ay range":"1-24"},"items":[{"id":"H-
     A                                      FLD","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"HFLD","designValue":"[HFLD]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"10"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"HREC","field type-
     A                                      ":"output field","visibility":"hidd-
     A                                      en","value":{"fieldName":"HREC","de-
     A                                      signValue":"[HREC]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"F2353F01_SCR01_avKeys","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"AV_KEYS","dataLength":"1134","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[AV_KEYS]"},"le-
     A                                      ft":"0px","top":"0px","visibility":-
     A                                      "hidden"},{"id":"F2353F01_SCR01_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      F2353F01_SCR01_BtnIconMenuSystemToo-
     A                                      ls","tool tip":"System Tools","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"F2353F01_SCR01_ButtonB-
     A                                      ar","top":"35px","left":"1036px","w-
     A                                      idth":"187px","height":"28px","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden","locked in place":"true"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"F-
     A                                      2353F01_SCR01_BtnSave","tool tip":"-
     A                                      Save","onclick":"SystemToolbarSave"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/save.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1066px-
     A                                      ","id":"F2353F01_SCR01_BtnRefresh",-
     A                                      "tool tip":"Refresh","onclick":"Sys-
     A                                      temToolbarRefresh","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/refresh.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1092px","id":"F2353F-
     A                                      01_SCR01_BtnSearch","tool tip":"Sea-
     A                                      rch","onclick":"SystemToolbarSearch-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/search-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"')
     A                                  1  4HTML('hidden","locked in place":"tr-
     A                                      ue","left":"1118px","id":"F2353F01_-
     A                                      SCR01_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1144px","id":"F2353F01_SCR-
     A                                      01_BtnSystemMessages","tool tip":"S-
     A                                      ystem Messages","onclick":"SystemTo-
     A                                      olbarMessages","background image":{-
     A                                      "fieldName":"MsgIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1196px","id":"F2353F01_SCR01_Btn-
     A                                      Help","tool tip":"Help","onclick":"-
     A                                      SystemToolbarHelp","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/help.png'')"},{"id":"F23-
     A                                      53F01_SCR01_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"F2-
     A                                      353F01_SCR01_MainTabPanel","field t-
     A                                      ype":"tab panel","tab panel style":-
     A                                      "Transform","tab names":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"active t-
     A                                      ab":"0","left":"250px","top":"70px"-
     A                                      ,"width":"970px","height":"657px","-
     A                                      z index":"8","locked in place":"tru-
     A                                      e","css class":"tab-panel","css cla-
     A                                      ss 2":"stationary"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F2353F01_SCR01_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SCUSER","field type":"output -
     A                                      field","value":{"fieldName":"SCUSER-
     A                                      ","designValue":"[SCUSER]","refFiel-
     A                                      d":"USER","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"281px","cursor col-
     A                                      umn":"2","top":"110px","cursor row"-
     A                                      :"1","css class 2":"top-line","pare-
     A                                      nt tab panel":"F2353F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CCONM","field type":"output field",-
     A                                      "value":{"fieldName":"SCCONM","desi-
     A                                      gnValue":"[SCCONM]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"110px","cursor row":"1","-
     A                                      css class 2":"top-line","css class -
     A                                      3":"HI","description":"COMPANY NAME-
     A                                      ","parent tab panel":"F2353F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 4":"profound-converted"},{-
     A                                      "id":"constant1","field type":"outp-
     A                                      ut field","left":"778px","cursor co-
     A                                      lumn":"73","top":"110px","cursor ro-
     A                                      w":"1","css class":"top-line","valu-
     A                                      e":"js: currentDate()","css class 2-
     A                                      ":"output-field","parent tab panel"-
     A                                      :"F2353F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"F2353F01_SCR01-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F2353F01_SCR01_BtnH-
     A                                      iddenRefresh","value":"btnRefresh",-
     A                                      "top":"125px","response":{"fieldNam-
     A                                      e":"btnRefresh","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"Q1PGM","fiel-
     A                                      d type":"output field","va')
     A                                  1  5HTML('lue":{"fieldName":"Q1PGM","de-
     A                                      signValue":"[Q1PGM]","refField":"DS-
     A                                      10","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"281px","cursor column":"-
     A                                      2","top":"130px","cursor row":"2","-
     A                                      parent tab panel":"F2353F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCPRDS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPRDS","-
     A                                      designValue":"[SCPRDS]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"414px","cursor column-
     A                                      ":"21","top":"130px","cursor row":"-
     A                                      2","css class 2":"HI","description"-
     A                                      :"PROGRAM NAME","parent tab panel":-
     A                                      "F2353F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant2","field type":"out-
     A                                      put field","value":"SCR01","css cla-
     A                                      ss":"constant","left":"799px","curs-
     A                                      or column":"76","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"F23-
     A                                      53F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCMODE","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCMODE","designValue":"[SCMODE]-
     A                                      ","refField":"NM10","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"764px","-
     A                                      cursor column":"71","top":"150px","-
     A                                      cursor row":"3","css class 2":"HI",-
     A                                      "description":"ADD/UPDATE MODE","pa-
     A                                      rent tab panel":"F2353F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F2353F01_SCR01_Btn-
     A                                      HiddenSearch","value":"btnSearch","-
     A                                      top":"150px","response":{"fieldName-
     A                                      ":"btnSearch","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"SCSTNM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCSTNM","designValue":"[SC-
     A                                      STNM]","refField":"DS40","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"365-
     A                                      px","cursor column":"14","top":"170-
     A                                      px","cursor row":"4","description":-
     A                                      "State Id","parent tab panel":"F235-
     A                                      3F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F235-
     A                                      3F01_SCR01_BtnHiddenDiaryItems","va-
     A                                      lue":"btnDiary","top":"175px","resp-
     A                                      onse":{"fieldName":"btnDiary","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant3","field type":"output f-
     A                                      ield","value":"Type information, pr-
     A                                      ess Enter.","css class":"constant",-
     A                                      "visibility":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"274px","cursor colu-
     A                                      mn":"1","top":"190px","cursor row":-
     A                                      "5","css class 2":"BLU","parent tab-
     A                                       panel":"F2353F01_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2353F01_SCR01_BtnHiddenSy-
     A                                      stemMessages","value":"btnMessage",-
     A                                      "top":"200px","response":{"fieldNam-
     A                                      e":"btnMessage","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant4","-
     A                                      field type":"output field","value":-
     A                                      "Provider number    :","css class":-
     A                                      "constant","left":"274px","cursor c-
     A                                      olumn":"1","top":"210px","cursor ro-
     A                                      w":"6","parent tab panel":"F2353F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPROV","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CPROV","designValue":"[SCPROV]","re-
     A                                      fField":"PII01/IIPROV *LIBL/FTIIP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"428px","cursor column":"23",-
     A                                      "top":"210px","cursor row":"6","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F2353F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F2353F01_SCR01_BtnHiddenWorkSubmitJ-
     A                                      ob","value":"btnWrksbmjob","top":"2-
     A                                      25px","response":{"fieldName":"btnW-
     A                                      rkJob","dataType":"indicat')
     A                                  1  6HTML('or","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt6","field type":"output field","v-
     A                                      alue":"Effective date     :","css c-
     A                                      lass":"constant","left":"274px","cu-
     A                                      rsor column":"1","top":"230px","cur-
     A                                      sor row":"7","parent tab panel":"F2-
     A                                      353F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCEFDT","field typ-
     A                                      e":"date field","css class":"input"-
     A                                      ,"css class 2":"date-field","value"-
     A                                      :{"fieldName":"SCEFDT","designValue-
     A                                      ":"[SCEFDT]","refField":"DT8","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "numBlankFill":"true","edtWrd":"'' -
     A                                       /  /    ''","dateFormat":"m/d/Y"},-
     A                                      "left":"428px","cursor column":"23"-
     A                                      ,"top":"230px","cursor row":"7","wi-
     A                                      dth":"71px","text align":"right","c-
     A                                      ss class 3":{"fieldName":"09 or 30 -
     A                                      or 40","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09 and 40 or N09 and 30","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"N4-
     A                                      0 and N30","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"N40 and N30","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"er-
     A                                      ror message id":"MCR0500","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"76 and 82","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"MCR0900","error message fil-
     A                                      e 2":"FSMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"77 and 82","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"F2353F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      5","field type":"output field","val-
     A                                      ue":"Status:","css class":"constant-
     A                                      ","left":"736px","cursor column":"6-
     A                                      7","top":"230px","cursor row":"7","-
     A                                      parent tab panel":"F2353F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSTAT","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCSTAT","-
     A                                      designValue":"[SCSTAT]","refField":-
     A                                      "STAT","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"792px","cursor column-
     A                                      ":"75","top":"230px","cursor row":"-
     A                                      7","css class 2":"HI","parent tab p-
     A                                      anel":"F2353F01_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant7-
     A                                      ","field type":"output field","valu-
     A                                      e":"Name               :","css clas-
     A                                      s":"constant","left":"274px","curso-
     A                                      r column":"1","top":"250px","cursor-
     A                                       row":"8","parent tab panel":"F2353-
     A                                      F01_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCNAME","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCNAME","designValue":"[SCNAME]",-
     A                                      "refField":"PII01/IINAME *LIBL/FTII-
     A                                      P","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"428px","cursor column":"2-
     A                                      3","top":"250px","cursor row":"8","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F2353F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F2353F01_SCR01_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F2353F01_SCR01_BtnHiddenImageQue-
     A                                      ue","value":"btnImgQue","top":"275p-
     A                                      x","response":{"fieldName":"btnImgQ-
     A                                      ue","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant11","field type"-
     A                                      :"output field","value":"Geo Lab mk-
     A                                      t ara:","css class":"constant","lef-
     A                                      t":"274px","cursor column":"1","top-
     A                                      ":"290px","cursor row":"10","parent-
     A                                       tab panel":"F2353F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCG-
     A                                      LMA","field type":"output field","v-
     A                                      alue":{"fieldName":"SCGLMA","design-
     A                                      Value":"[SCGLMA]","refField":"PII01-
     A                                      /IIGLMA *LIBL/FTIIP","dataType":"re-
     A                                      ference","formatting":"Tex')
     A                                  1  7HTML('t","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"393px","cursor column":"18"-
     A                                      ,"top":"290px","cursor row":"10","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2353F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant19","f-
     A                                      ield type":"output field","value":"-
     A                                      PC lb mkt ara:","css class":"consta-
     A                                      nt","left":"470px","cursor column":-
     A                                      "29","top":"290px","cursor row":"10-
     A                                      ","parent tab panel":"F2353F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCCLMA","field type":"output -
     A                                      field","value":{"fieldName":"SCCLMA-
     A                                      ","designValue":"[SCCLMA]","refFiel-
     A                                      d":"PII01/IICLMA *LIBL/FTIIP","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"575px","cursor column":"44","top"-
     A                                      :"290px","cursor row":"10","css cla-
     A                                      ss 2":"HI","parent tab panel":"F235-
     A                                      3F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant23","field t-
     A                                      ype":"output field","value":"Pmt la-
     A                                      b mk ara :","css class":"constant",-
     A                                      "left":"652px","cursor column":"55"-
     A                                      ,"top":"290px","cursor row":"10","p-
     A                                      arent tab panel":"F2353F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCPLMA","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCPLMA","d-
     A                                      esignValue":"[SCPLMA]","refField":"-
     A                                      PII01/IIPLMA *LIBL/FTIIP","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"77-
     A                                      8px","cursor column":"73","top":"29-
     A                                      0px","cursor row":"10","css class 2-
     A                                      ":"HI","parent tab panel":"F2353F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F2353F01-
     A                                      _SCR01_BtnHiddenHelp","value":"btnH-
     A                                      elp","top":"300px","response":{"fie-
     A                                      ldName":"btnHelp","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant12-
     A                                      ","field type":"output field","valu-
     A                                      e":"Wage adj sc 505:","css class":"-
     A                                      constant","left":"274px","cursor co-
     A                                      lumn":"1","top":"310px","cursor row-
     A                                      ":"11","parent tab panel":"F2353F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCW505","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CW505","designValue":"[SCW505]","re-
     A                                      fField":"PII01/IIW505 *LIBL/FTIIP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"true","zeroBala-
     A                                      nce":"true","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"393px","cursor column":"18","to-
     A                                      p":"310px","cursor row":"11","width-
     A                                      ":"56px","text align":"right","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      2353F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant20","fiel-
     A                                      d type":"output field","value":"Sec-
     A                                       505 elig :","css class":"constant"-
     A                                      ,"left":"470px","cursor column":"29-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      parent tab panel":"F2353F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCE505","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCE505","-
     A                                      designValue":"[SCE505]","refField":-
     A                                      "PII01/IIE505 *LIBL/FTIIP","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"5-
     A                                      75px","cursor column":"44","top":"3-
     A                                      10px","cursor row":"11","css class -
     A                                      2":"HI","parent tab panel":"F2353F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant33","field type-
     A                                      ":"output field","value":"Sec 401 h-
     A                                      osp   :","css class":"constant","le-
     A                                      ft":"652px","cursor column":"55","t-
     A                                      op":"310px","cursor row":"11","pare-
     A                                      nt tab panel":"F2353F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CH401","field type":"output field",-
     A                                      "value":{"fieldName":"SCH401","desi-
     A                                      gnValue":"[SCH401]","refField":"PII-
     A                                      01/IIH401 *LIBL/FTIIP","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"778px-
     A                                      ","cursor column":"73","top":"310px-
     A                                      ","cursor row":"11","css class 2":"-
     A                                      HI","parent tab panel":"F2353F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant13","field type":"o-
     A                                      utput field","value":"Pst rc wage i-
     A                                      nd:","css class":"constant","left":-
     A                                      "274px","cursor column":"1","top":"-
     A                                      330px","cursor row":"12","')
     A                                  1  8HTML('parent tab panel":"F2353F01_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCPRWI","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCP-
     A                                      RWI","designValue":"[SCPRWI]","refF-
     A                                      ield":"PII01/IIPRWI *LIBL/FTIIP","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"true","zeroBalanc-
     A                                      e":"true","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"393px","cursor column":"18","top"-
     A                                      :"330px","cursor row":"12","width":-
     A                                      "56px","text align":"right","css cl-
     A                                      ass 2":"HI","parent tab panel":"F23-
     A                                      53F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant21","field -
     A                                      type":"output field","value":"COLA -
     A                                              :","css class":"constant","-
     A                                      left":"470px","cursor column":"29",-
     A                                      "top":"330px","cursor row":"12","pa-
     A                                      rent tab panel":"F2353F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCCOLA","field type":"output field-
     A                                      ","value":{"fieldName":"SCCOLA","de-
     A                                      signValue":"[SCCOLA]","refField":"P-
     A                                      II01/IICOLA *LIBL/FTIIP","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"true","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00"},"css c-
     A                                      lass":"output-field","left":"575px"-
     A                                      ,"cursor column":"44","top":"330px"-
     A                                      ,"cursor row":"12","width":"35px","-
     A                                      text align":"right","css class 2":"-
     A                                      HI","parent tab panel":"F2353F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant34","field type":"o-
     A                                      utput field","value":"Res beds     -
     A                                        :","css class":"constant","left":-
     A                                      "652px","cursor column":"55","top":-
     A                                      "330px","cursor row":"12","parent t-
     A                                      ab panel":"F2353F01_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCRBE-
     A                                      D","field type":"output field","val-
     A                                      ue":{"fieldName":"SCRBED","designVa-
     A                                      lue":"[SCRBED]","refField":"PII01/I-
     A                                      IRBED *LIBL/FTIIP","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"true","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00"},"css class":-
     A                                      "output-field","left":"771px","curs-
     A                                      or column":"72","top":"330px","curs-
     A                                      or row":"12","width":"56px","text a-
     A                                      lign":"right","css class 2":"HI","p-
     A                                      arent tab panel":"F2353F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant14","field type":"output -
     A                                      field","value":"SSA cntry code :","-
     A                                      css class":"constant","left":"274px-
     A                                      ","cursor column":"1","top":"350px"-
     A                                      ,"cursor row":"13","parent tab pane-
     A                                      l":"F2353F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCSCC","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCSCC","designValue":"[SC-
     A                                      SCC]","refField":"PII01/IISCC *LIBL-
     A                                      /FTIIP","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"393px","cursor colum-
     A                                      n":"18","top":"350px","cursor row":-
     A                                      "13","css class 2":"HI","parent tab-
     A                                       panel":"F2353F01_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t46","field type":"output field","v-
     A                                      alue":"Hst spec rate:","css class":-
     A                                      "constant","left":"470px","cursor c-
     A                                      olumn":"29","top":"350px","cursor r-
     A                                      ow":"13","parent tab panel":"F2353F-
     A                                      01_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCHRAT","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCHRAT","designValue":"[SCHRAT]","-
     A                                      refField":"PII01/IIHRAT *LIBL/FTIIP-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"true","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"575px","cursor column":"44","-
     A                                      top":"350px","cursor row":"13","wid-
     A                                      th":"70px","text align":"right","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F2353F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant35","fi-
     A                                      eld type":"output field","value":"R-
     A                                      es  days      :","css class":"const-
     A                                      ant","left":"652px","cursor column"-
     A                                      :"55","top":"350px","cursor row":"1-
     A                                      3","parent tab panel":"F2353F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCRDAY","field type":"output-
     A                                       field","value":{"fieldName":"SCRDA-
     A                                      Y","designValue":"[SCRDAY]","refFie-
     A                                      ld":"PII01/IIRDAY *LIBL/FTIIP","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"true","zeroBalance"-
     A                                      :"true","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"-999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      771px","cursor column":"72","top":"-
     A                                      350px","cursor row":"13","width":"5-
     A                                      6px","text align":"right","css clas-
     A                                      s 2":"HI","parent tab panel":"F2353-
     A                                      F01_SCR01_MainTabPanel","p')
     A                                  1  9HTML('arent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt10","field type":"output field","-
     A                                      value":"Number of beds :","css clas-
     A                                      s":"constant","left":"274px","curso-
     A                                      r column":"1","top":"370px","cursor-
     A                                       row":"14","parent tab panel":"F235-
     A                                      3F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCBEDS","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCBEDS","designValue":"[SCBEDS]"-
     A                                      ,"refField":"PII01/IIBEDS *LIBL/FTI-
     A                                      IP","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00"},"css class":"output-field",-
     A                                      "left":"393px","cursor column":"18"-
     A                                      ,"top":"370px","cursor row":"14","w-
     A                                      idth":"42px","text align":"right","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F2353F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant24","-
     A                                      field type":"output field","value":-
     A                                      "Avg daily cns:","css class":"const-
     A                                      ant","left":"470px","cursor column"-
     A                                      :"29","top":"370px","cursor row":"1-
     A                                      4","parent tab panel":"F2353F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCADC","field type":"output -
     A                                      field","value":{"fieldName":"SCADC"-
     A                                      ,"designValue":"[SCADC]","refField"-
     A                                      :"PII01/IIADC *LIBL/FTIIP","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"css-
     A                                       class":"output-field","left":"575p-
     A                                      x","cursor column":"44","top":"370p-
     A                                      x","cursor row":"14","width":"42px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :"HI","parent tab panel":"F2353F01_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant36","field type":-
     A                                      "output field","value":"Oper CCR   -
     A                                          :","css class":"constant","left-
     A                                      ":"652px","cursor column":"55","top-
     A                                      ":"370px","cursor row":"14","parent-
     A                                       tab panel":"F2353F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCO-
     A                                      CCR","field type":"output field","v-
     A                                      alue":{"fieldName":"SCOCCR","design-
     A                                      Value":"[SCOCCR]","refField":"PII01-
     A                                      /IICCCR *LIBL/FTIIP","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"true","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"css class-
     A                                      ":"output-field","left":"778px","cu-
     A                                      rsor column":"73","top":"370px","cu-
     A                                      rsor row":"14","width":"49px","text-
     A                                       align":"right","css class 2":"HI",-
     A                                      "parent tab panel":"F2353F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant15","field type":"outpu-
     A                                      t field","value":"Capital CCR    :"-
     A                                      ,"css class":"constant","left":"274-
     A                                      px","cursor column":"1","top":"390p-
     A                                      x","cursor row":"15","parent tab pa-
     A                                      nel":"F2353F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCCCCR","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCCCCR","designValue":-
     A                                      "[SCCCCR]","refField":"PII01/IIOCCR-
     A                                       *LIBL/FTIIP","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"t-
     A                                      rue","zeroBalance":"true","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00"},"css class":"outp-
     A                                      ut-field","left":"393px","cursor co-
     A                                      lumn":"18","top":"390px","cursor ro-
     A                                      w":"15","width":"49px","text align"-
     A                                      :"right","css class 2":"HI","parent-
     A                                       tab panel":"F2353F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant25","field type":"output field-
     A                                      ","value":"Dsp share prc:","css cla-
     A                                      ss":"constant","left":"470px","curs-
     A                                      or column":"29","top":"390px","curs-
     A                                      or row":"15","parent tab panel":"F2-
     A                                      353F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCDSH","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCDSH","designValue":"[SCDSH]",-
     A                                      "refField":"PII01/IIDSH *LIBL/FTIIP-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"true","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"575px","cursor column":"44","-
     A                                      top":"390px","cursor row":"15","wid-
     A                                      th":"56px","text align":"right","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F2353F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant37","fi-
     A                                      eld type":"output field","value":"P-
     A                                      ost reclss lab:","css class":"const-
     A                                      ant","left":"652px","cursor column"-
     A                                      :"55","top":"390px","cursor row":"1-
     A                                      5","parent tab panel":"F2353F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCPRLM","field type":"output-
     A                                       field","value":{"fieldName":"SCPRL-
     A                                      M","designValue":"[SCPRLM]","refFie-
     A                                      ld":"PII01/IIPRLM *LIBL/FTIIP","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false",')
     A                                  1 10HTML('"trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"778px","cursor co-
     A                                      lumn":"73","top":"390px","cursor ro-
     A                                      w":"15","css class 2":"HI","parent -
     A                                      tab panel":"F2353F01_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant16","field type":"output field"-
     A                                      ,"value":"PR Post reclass:","css cl-
     A                                      ass":"constant","left":"274px","cur-
     A                                      sor column":"1","top":"410px","curs-
     A                                      or row":"16","parent tab panel":"F2-
     A                                      353F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPRWI1","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPRWI1","designValue":"[SCPR-
     A                                      WI1]","refField":"PII01/IIPRW1 *LIB-
     A                                      L/FTIIP","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"true",-
     A                                      "zeroBalance":"true","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00"},"css class":"output-fi-
     A                                      eld","left":"393px","cursor column"-
     A                                      :"18","top":"410px","cursor row":"1-
     A                                      6","width":"56px","text align":"rig-
     A                                      ht","css class 2":"HI","parent tab -
     A                                      panel":"F2353F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      26","field type":"output field","va-
     A                                      lue":"Provider Type:","css class":"-
     A                                      constant","left":"470px","cursor co-
     A                                      lumn":"29","top":"410px","cursor ro-
     A                                      w":"16","parent tab panel":"F2353F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPRTY","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPRTY","designValue":"[SCPRTY]","r-
     A                                      efField":"PII01/IIPRTY *LIBL/FTIIP"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"575px","cursor column":"44"-
     A                                      ,"top":"410px","cursor row":"16","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2353F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant38","f-
     A                                      ield type":"output field","value":"-
     A                                      Lugar county   :","css class":"cons-
     A                                      tant","left":"652px","cursor column-
     A                                      ":"55","top":"410px","cursor row":"-
     A                                      16","parent tab panel":"F2353F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCLUGR","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCLU-
     A                                      GR","designValue":"[SCLUGR]","refFi-
     A                                      eld":"PII01/IILUGR *LIBL/FTIIP","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"778px","cursor column":"73","to-
     A                                      p":"410px","cursor row":"16","css c-
     A                                      lass 2":"HI","parent tab panel":"F2-
     A                                      353F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant45","field-
     A                                       type":"output field","value":"Recl-
     A                                      ass status :","css class":"constant-
     A                                      ","left":"274px","cursor column":"1-
     A                                      ","top":"430px","cursor row":"17","-
     A                                      parent tab panel":"F2353F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCRECL","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCRECL","-
     A                                      designValue":"[SCRECL]","refField":-
     A                                      "PII01/IIRECL *LIBL/FTIIP","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"3-
     A                                      93px","cursor column":"18","top":"4-
     A                                      30px","cursor row":"17","css class -
     A                                      2":"HI","parent tab panel":"F2353F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant27","field type-
     A                                      ":"output field","value":"Bills(cas-
     A                                      es) :","css class":"constant","left-
     A                                      ":"470px","cursor column":"29","top-
     A                                      ":"430px","cursor row":"17","parent-
     A                                       tab panel":"F2353F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCB-
     A                                      ILL","field type":"output field","v-
     A                                      alue":{"fieldName":"SCBILL","design-
     A                                      Value":"[SCBILL]","refField":"PII01-
     A                                      /IIBILL *LIBL/FTIIP","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"true","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"css class-
     A                                      ":"output-field","left":"575px","cu-
     A                                      rsor column":"44","top":"430px","cu-
     A                                      rsor row":"17","width":"42px","text-
     A                                       align":"right","css class 2":"HI",-
     A                                      "parent tab panel":"F2353F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant39","field type":"outpu-
     A                                      t field","value":" Trns adj V24 :",-
     A                                      "css class":"constant","left":"645p-
     A                                      x","cursor column":"54","top":"490p-
     A                                      x","cursor row":"17","parent tab pa-
     A                                      nel":"F2353F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted","visibility":"hidd-
     A                                      en"},{"id":"SCTA24","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCTA24","designValue":"[SCTA24]","r-
     A                                      efField":"PII01/IITA24 *LIBL/FTIIP"-
     A                                      ,"dataType":"reference","f')
     A                                  1 11HTML('ormatting":"Number","numSep":-
     A                                      "true","zeroBalance":"true","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"-999.00"},"css class":"ou-
     A                                      tput-field","left":"755px","cursor -
     A                                      column":"70","top":"490px","cursor -
     A                                      row":"17","width":"70px","text alig-
     A                                      n":"right","css class 2":"HI","pare-
     A                                      nt tab panel":"F2353F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted","visibili-
     A                                      ty":"hidden"},{"id":"constant49","f-
     A                                      ield type":"output field","value":"-
     A                                      TA case mix V24:","css class":"cons-
     A                                      tant","left":"270px","cursor column-
     A                                      ":"1","top":"490px","cursor row":"1-
     A                                      8","parent tab panel":"F2353F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted","-
     A                                      visibility":"hidden"},{"id":"SCCM24-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCM24","designVal-
     A                                      ue":"[SCCM24]","refField":"PII01/II-
     A                                      CM24 *LIBL/FTIIP","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"true","zeroBalance":"true","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00"},"css class":"-
     A                                      output-field","left":"390px","curso-
     A                                      r column":"18","top":"490px","curso-
     A                                      r row":"18","width":"70px","text al-
     A                                      ign":"right","css class 2":"HI","pa-
     A                                      rent tab panel":"F2353F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted","visibi-
     A                                      lity":"hidden"},{"id":"constant48",-
     A                                      "field type":"output field","value"-
     A                                      :"Cse mx SCHV24:","css class":"cons-
     A                                      tant","left":"470px","cursor column-
     A                                      ":"29","top":"490px","cursor row":"-
     A                                      18","parent tab panel":"F2353F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted",-
     A                                      "visibility":"hidden"},{"id":"SCSC2-
     A                                      4","field type":"output field","val-
     A                                      ue":{"fieldName":"SCSC24","designVa-
     A                                      lue":"[SCSC24]","refField":"PII01/I-
     A                                      ISC24 *LIBL/FTIIP","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"true","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00"},"css class":-
     A                                      "output-field","left":"575px","curs-
     A                                      or column":"44","top":"490px","curs-
     A                                      or row":"18","width":"70px","text a-
     A                                      lign":"right","css class 2":"HI","p-
     A                                      arent tab panel":"F2353F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted","visib-
     A                                      ility":"hidden"},{"id":"constant47"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Trns adj V25 :","css class":"con-
     A                                      stant","left":"275px","cursor colum-
     A                                      n":"55","top":"510px","cursor row":-
     A                                      "18","parent tab panel":"F2353F01_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"visibility":"hidden"},{"id":"SCTA-
     A                                      25","field type":"output field","va-
     A                                      lue":{"fieldName":"SCTA25","designV-
     A                                      alue":"[SCTA25]","refField":"PII01/-
     A                                      IITA25 *LIBL/FTIIP","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"true","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00"},"css class"-
     A                                      :"output-field","left":"385px","cur-
     A                                      sor column":"70","top":"510px","cur-
     A                                      sor row":"18","width":"70px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      parent tab panel":"F2353F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted","visi-
     A                                      bility":"hidden"},{"id":"constant8"-
     A                                      ,"field type":"output field","value-
     A                                      ":"TA case mix V25:","css class":"c-
     A                                      onstant","left":"475px","cursor col-
     A                                      umn":"1","top":"510px","cursor row"-
     A                                      :"19","parent tab panel":"F2353F01_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      ","visibility":"hidden"},{"id":"SCC-
     A                                      M25","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCM25","design-
     A                                      Value":"[SCCM25]","refField":"PII01-
     A                                      /IICM25 *LIBL/FTIIP","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"true","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"css class-
     A                                      ":"output-field","left":"595px","cu-
     A                                      rsor column":"18","top":"510px","cu-
     A                                      rsor row":"19","width":"70px","text-
     A                                       align":"right","css class 2":"HI",-
     A                                      "parent tab panel":"F2353F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted","vis-
     A                                      ibility":"hidden"},{"id":"constant2-
     A                                      8","field type":"output field","val-
     A                                      ue":"Cse mx SCHV25:","css class":"c-
     A                                      onstant","left":"670px","cursor col-
     A                                      umn":"29","top":"510px","cursor row-
     A                                      ":"19","parent tab panel":"F2353F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d","visibility":"hidden"},{"id":"SC-
     A                                      SC25","field type":"output field","-
     A                                      value":{"fieldName":"SCSC25","desig-
     A                                      nValue":"[SCSC25]","refField":"PII0-
     A                                      1/IISC25 *LIBL/FTIIP","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"true","zeroBalance":"true","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00"},"css clas-
     A                                      s":"output-field","left":"775px","c-
     A                                      ursor column":"44","top":"510px","c-
     A                                      ursor row":"19","width":"70px","tex-
     A                                      t align":"right","css class 2":"HI"-
     A                                      ,"parent tab panel":"F2353')
     A                                  1 12HTML('F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted","visibility":"hidden"},-
     A                                      {"id":"constant40","field type":"ou-
     A                                      tput field","value":"Region       :-
     A                                      ","css class":"constant","left":"65-
     A                                      0px","cursor column":"55","top":"43-
     A                                      0px","cursor row":"19","parent tab -
     A                                      panel":"F2353F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted","width":"115px"}-
     A                                      ,{"id":"SCRGN","field type":"output-
     A                                       field","value":{"fieldName":"SCRGN-
     A                                      ","designValue":"[SCRGN]","refField-
     A                                      ":"PII01/IIRGN *LIBL/FTIIP","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      780px","cursor column":"73","top":"-
     A                                      430px","cursor row":"19","css class-
     A                                       2":"HI","parent tab panel":"F2353F-
     A                                      01_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant9","field type-
     A                                      ":"output field","value":"Prov geo -
     A                                      CBSA  :","css class":"constant","le-
     A                                      ft":"271px","cursor column":"1","to-
     A                                      p":"450px","cursor row":"20","paren-
     A                                      t tab panel":"F2353F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      URBN","field type":"output field","-
     A                                      value":{"fieldName":"SCURBN","desig-
     A                                      nValue":"[SCURBN]","refField":"PII0-
     A                                      1/IIURBN *LIBL/FTIIP","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"390px"-
     A                                      ,"cursor column":"18","top":"450px"-
     A                                      ,"cursor row":"20","css class 2":"H-
     A                                      I","parent tab panel":"F2353F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant29","field type":"ou-
     A                                      tput field","value":"Urban/Rurl pt:-
     A                                      ","css class":"constant","left":"46-
     A                                      7px","cursor column":"29","top":"45-
     A                                      0px","cursor row":"20","parent tab -
     A                                      panel":"F2353F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCURPA",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCURPA","designValue-
     A                                      ":"[SCURPA]","refField":"PII01/IIUR-
     A                                      PA *LIBL/FTIIP","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"572px","curs-
     A                                      or column":"44","top":"450px","curs-
     A                                      or row":"20","css class 2":"HI","pa-
     A                                      rent tab panel":"F2353F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant41","field type":"output f-
     A                                      ield","value":"Operating IME:","css-
     A                                       class":"constant","left":"649px","-
     A                                      cursor column":"55","top":"450px","-
     A                                      cursor row":"20","parent tab panel"-
     A                                      :"F2353F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCTCOP","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCTCOP","designValue":"[SC-
     A                                      TCOP]","refField":"PII01/IITCOP *LI-
     A                                      BL/FTIIP","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"true"-
     A                                      ,"zeroBalance":"true","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"-999.00"},"css class":"output-f-
     A                                      ield","left":"754px","cursor column-
     A                                      ":"70","top":"450px","cursor row":"-
     A                                      20","width":"70px","text align":"ri-
     A                                      ght","css class 2":"HI","parent tab-
     A                                       panel":"F2353F01_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t17","field type":"output field","v-
     A                                      alue":"Capital IME    :","css class-
     A                                      ":"constant","left":"271px","cursor-
     A                                       column":"1","top":"470px","cursor -
     A                                      row":"21","parent tab panel":"F2353-
     A                                      F01_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCTCCP","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCTCCP","designValue":"[SCTCCP]",-
     A                                      "refField":"PII01/IITCCP *LIBL/FTII-
     A                                      P","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"true","zeroB-
     A                                      alance":"true","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"390px","cursor column":"18",-
     A                                      "top":"470px","cursor row":"21","wi-
     A                                      dth":"70px","text align":"right","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2353F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant30","f-
     A                                      ield type":"output field","value":"-
     A                                      Pst rc GAF cp:","css class":"consta-
     A                                      nt","left":"473px","cursor column":-
     A                                      "29","top":"530px","cursor row":"21-
     A                                      ","parent tab panel":"F2353F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted","v-
     A                                      isibility":"hidden"},{"id":"SCPRGA"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPRGA","designValu-
     A                                      e":"[SCPRGA]","refField":"PII01/IIP-
     A                                      RGA *LIBL/FTIIP","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"true","zeroBalance":"true","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00"},"css class":"o-
     A                                      utput-field","left":"578px')
     A                                  1 13HTML('","cursor column":"44","top":-
     A                                      "530px","cursor row":"21","width":"-
     A                                      56px","text align":"right","css cla-
     A                                      ss 2":"HI","parent tab panel":"F235-
     A                                      3F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted","visibility":"hidden"},{"id"-
     A                                      :"constant42","field type":"output -
     A                                      field","value":"PR post rec  :","cs-
     A                                      s class":"constant","left":"655px",-
     A                                      "cursor column":"55","top":"530px",-
     A                                      "cursor row":"21","parent tab panel-
     A                                      ":"F2353F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted","visibility":"hidden"-
     A                                      },{"id":"SCPRFP","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCP-
     A                                      RFP","designValue":"[SCPRFP]","refF-
     A                                      ield":"PII01/IIPRFP *LIBL/FTIIP","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"true","zeroBalanc-
     A                                      e":"true","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"760px","cursor column":"70","top"-
     A                                      :"530px","cursor row":"21","width":-
     A                                      "56px","text align":"right","css cl-
     A                                      ass 2":"HI","parent tab panel":"F23-
     A                                      53F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted","visibility":"hidden"},{"id-
     A                                      ":"constant18","field type":"output-
     A                                       field","value":"PR cost of liv :",-
     A                                      "css class":"constant","left":"274p-
     A                                      x","cursor column":"1","top":"530px-
     A                                      ","cursor row":"22","parent tab pan-
     A                                      el":"F2353F01_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted","visibility":"hidde-
     A                                      n"},{"id":"SCAKHI","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CAKHI","designValue":"[SCAKHI]","re-
     A                                      fField":"PII01/IIAKHI *LIBL/FTIIP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"true","zeroBala-
     A                                      nce":"true","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"393px","cursor column":"18","to-
     A                                      p":"530px","cursor row":"22","width-
     A                                      ":"35px","text align":"right","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      2353F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted","visibility":"hidden"},{"-
     A                                      id":"constant31","field type":"outp-
     A                                      ut field","value":"Operating DSH:",-
     A                                      "css class":"constant","left":"468p-
     A                                      x","cursor column":"29","top":"470p-
     A                                      x","cursor row":"22","parent tab pa-
     A                                      nel":"F2353F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCODSH","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCODSH","designValue":-
     A                                      "[SCODSH]","refField":"PII01/IIODSH-
     A                                       *LIBL/FTIIP","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"t-
     A                                      rue","zeroBalance":"true","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00"},"css class":"outp-
     A                                      ut-field","left":"573px","cursor co-
     A                                      lumn":"44","top":"470px","cursor ro-
     A                                      w":"22","width":"70px","text align"-
     A                                      :"right","css class 2":"HI","parent-
     A                                       tab panel":"F2353F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant43","field type":"output field-
     A                                      ","value":"Capital DSH  :","css cla-
     A                                      ss":"constant","left":"650px","curs-
     A                                      or column":"55","top":"470px","curs-
     A                                      or row":"22","parent tab panel":"F2-
     A                                      353F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCCDSH","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCCDSH","designValue":"[SCCDSH-
     A                                      ]","refField":"PII01/IICDSH *LIBL/F-
     A                                      TIIP","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"true","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00"},"css class":"output-field-
     A                                      ","left":"755px","cursor column":"7-
     A                                      0","top":"470px","cursor row":"22",-
     A                                      "width":"70px","text align":"right"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"F2353F01_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant22"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Est outlier opr:","css class":"c-
     A                                      onstant","left":"274px","cursor col-
     A                                      umn":"1","top":"550px","cursor row"-
     A                                      :"23","parent tab panel":"F2353F01_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      ","visibility":"hidden"},{"id":"SCE-
     A                                      OPM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCEOPM","design-
     A                                      Value":"[SCEOPM]","refField":"PII01-
     A                                      /IIEOPM *LIBL/FTIIP","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"true","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"css class-
     A                                      ":"output-field","left":"393px","cu-
     A                                      rsor column":"18","top":"550px","cu-
     A                                      rsor row":"23","width":"70px","text-
     A                                       align":"right","css class 2":"HI",-
     A                                      "parent tab panel":"F2353F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted","vis-
     A                                      ibility":"hidden"},{"id":"constant3-
     A                                      2","field type":"output field","val-
     A                                      ue":"Est outlir cp:","css class":"c-
     A                                      onstant","left":"470px","cursor col-
     A                                      umn":"29","top":"550px","c')
     A                                  1 14HTML('ursor row":"23","parent tab p-
     A                                      anel":"F2353F01_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted","visibility":"hid-
     A                                      den"},{"id":"SCECPM","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCECPM","designValue":"[SCECPM]","-
     A                                      refField":"PII01/IIECPM *LIBL/FTIIP-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"true","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"575px","cursor column":"44","-
     A                                      top":"550px","cursor row":"23","wid-
     A                                      th":"70px","text align":"right","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F2353F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted","visibility":"hidden"},-
     A                                      {"id":"constant44","field type":"ou-
     A                                      tput field","value":"Med dys inpt :-
     A                                      ","css class":"constant","left":"65-
     A                                      2px","cursor column":"55","top":"55-
     A                                      0px","cursor row":"23","parent tab -
     A                                      panel":"F2353F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted","visibility":"hi-
     A                                      dden"},{"id":"SCMDPC","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCMDPC","designValue":"[SCMDPC]",-
     A                                      "refField":"PII01/IIMDPC *LIBL/FTII-
     A                                      P","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"true","zeroB-
     A                                      alance":"true","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"757px","cursor column":"70",-
     A                                      "top":"550px","cursor row":"23","wi-
     A                                      dth":"70px","text align":"right","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2353F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted","visibility":"hidden"}-
     A                                      ,{"id":"btnSubmit","field type":"bu-
     A                                      tton","value":"Enter","shortcut key-
     A                                      ":"Enter","left":"14px","top":"150p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF03","field type":"button","val-
     A                                      ue":"Exit","shortcut key":"F3","lef-
     A                                      t":"14px","top":"183px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF12","fiel-
     A                                      d type":"button","value":"Cancel","-
     A                                      shortcut key":"F12","left":"14px","-
     A                                      top":"216px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            SCADC     R        H      REFFLD(PII01/IIADC *LIBL/FTIIP)
     A            SCAKHI    R        H      REFFLD(PII01/IIAKHI *LIBL/FTIIP)
     A            SCBEDS    R        H      REFFLD(PII01/IIBEDS *LIBL/FTIIP)
     A            SCBILL    R        H      REFFLD(PII01/IIBILL *LIBL/FTIIP)
     A            SCCCCR    R        H      REFFLD(PII01/IIOCCR *LIBL/FTIIP)
     A            SCCDSH    R        H      REFFLD(PII01/IICDSH *LIBL/FTIIP)
     A            SCCLMA    R        H      REFFLD(PII01/IICLMA *LIBL/FTIIP)
     A            SCCM24    R        H      REFFLD(PII01/IICM24 *LIBL/FTIIP)
     A            SCCM25    R        H      REFFLD(PII01/IICM25 *LIBL/FTIIP)
     A            SCCOLA    R        H      REFFLD(PII01/IICOLA *LIBL/FTIIP)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDSH     R        H      REFFLD(PII01/IIDSH *LIBL/FTIIP)
     A            SCE505    R        H      REFFLD(PII01/IIE505 *LIBL/FTIIP)
     A            SCECPM    R        H      REFFLD(PII01/IIECPM *LIBL/FTIIP)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCEOPM    R        H      REFFLD(PII01/IIEOPM *LIBL/FTIIP)
     A            SCGLMA    R        H      REFFLD(PII01/IIGLMA *LIBL/FTIIP)
     A            SCH401    R        H      REFFLD(PII01/IIH401 *LIBL/FTIIP)
     A            SCHRAT    R        H      REFFLD(PII01/IIHRAT *LIBL/FTIIP)
     A            SCLUGR    R        H      REFFLD(PII01/IILUGR *LIBL/FTIIP)
     A            SCMDPC    R        H      REFFLD(PII01/IIMDPC *LIBL/FTIIP)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNAME    R        H      REFFLD(PII01/IINAME *LIBL/FTIIP)
     A            SCOCCR    R        H      REFFLD(PII01/IICCCR *LIBL/FTIIP)
     A            SCODSH    R        H      REFFLD(PII01/IIODSH *LIBL/FTIIP)
     A            SCPLMA    R        H      REFFLD(PII01/IIPLMA *LIBL/FTIIP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPRFP    R        H      REFFLD(PII01/IIPRFP *LIBL/FTIIP)
     A            SCPRGA    R        H      REFFLD(PII01/IIPRGA *LIBL/FTIIP)
     A            SCPRLM    R        H      REFFLD(PII01/IIPRLM *LIBL/FTIIP)
     A            SCPROV    R        H      REFFLD(PII01/IIPROV *LIBL/FTIIP)
     A            SCPRTY    R        H      REFFLD(PII01/IIPRTY *LIBL/FTIIP)
     A            SCPRWI    R        H      REFFLD(PII01/IIPRWI *LIBL/FTIIP)
     A            SCPRWI1   R        H      REFFLD(PII01/IIPRW1 *LIBL/FTIIP)
     A            SCRBED    R        H      REFFLD(PII01/IIRBED *LIBL/FTIIP)
     A            SCRDAY    R        H      REFFLD(PII01/IIRDAY *LIBL/FTIIP)
     A            SCRECL    R        H      REFFLD(PII01/IIRECL *LIBL/FTIIP)
     A            SCRGN     R        H      REFFLD(PII01/IIRGN *LIBL/FTIIP)
     A            SCSC24    R        H      REFFLD(PII01/IISC24 *LIBL/FTIIP)
     A            SCSC25    R        H      REFFLD(PII01/IISC25 *LIBL/FTIIP)
     A            SCSCC     R        H      REFFLD(PII01/IISCC *LIBL/FTIIP)
     A            SCSTAT    R        H      REFFLD(STAT)
     A            SCSTNM    R        H      REFFLD(DS40)
     A            SCTA24    R        H      REFFLD(PII01/IITA24 *LIBL/FTIIP)
     A            SCTA25    R        H      REFFLD(PII01/IITA25 *LIBL/FTIIP)
     A            SCTCCP    R        H      REFFLD(PII01/IITCCP *LIBL/FTIIP)
     A            SCTCOP    R        H      REFFLD(PII01/IITCOP *LIBL/FTIIP)
     A            SCURBN    R        H      REFFLD(PII01/IIURBN *LIBL/FTIIP)
     A            SCURPA    R        H      REFFLD(PII01/IIURPA *LIBL/FTIIP)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCW505    R        H      REFFLD(PII01/IIW505 *LIBL/FTIIP)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2353F01_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2353F01_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2353F01_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F2353F01_SCR02_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F2353F01_SCR02_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F2353F01_SCR02_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F23-
     A                                      53F01_SCR02_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"F2353F01_SCR02_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F2353F01_SCR02_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button"')
     A                                  1  4HTML(',"css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F2353F01_SCR02_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F2353F01_SCR02_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F2353F01_SCR02_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2353F01_SCR02_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant50","field type":"-
     A                                      output field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentUser()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2353F01_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCR02_SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","parent tab panel":"F2353F01_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant51","field type":"o-
     A                                      utput field","left":"778px","cursor-
     A                                       column":"73","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentDate()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2353F01_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F2353F01_SC-
     A                                      R02_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2353F01_SCR02_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCR02_Q1P-
     A                                      GM","field type":"output field","va-
     A                                      lue":{"fieldName":"Q1PGM","designVa-
     A                                      lue":"[Q1PGM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F2353F01_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR02_SC-
     A                                      PRDS","field type":"output field","-
     A                                      value":{"fieldName":"SCPRDS","desig-
     A                                      nValue":"[SCPRDS]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2353F01_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","visibility":"hidden",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant52","field type":"o-
     A                                      utput field","value":"SCR02","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      2353F01_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCMODE","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCMODE","designValue":"-
     A                                      [SCMODE]","refField":"PGM"')
     A                                  1  5HTML(',"dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"764px","cursor column-
     A                                      ":"71","top":"150px","cursor row":"-
     A                                      3","css class 2":"HI","parent tab p-
     A                                      anel":"F2353F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F2353F01_SCR02_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F2353F01-
     A                                      _SCR02_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F2353F01_SCR02_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2353F01_SCR02_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2353F01_SCR02_BtnHiddenWorkPri-
     A                                      nterOutput","value":"btnWrkprtout",-
     A                                      "top":"250px","response":{"fieldNam-
     A                                      e":"btnWrkPrnt","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2353F01_SCR02_BtnHiddenImageQu-
     A                                      eue","value":"btnImgQue","top":"275-
     A                                      px","response":{"fieldName":"btnImg-
     A                                      Que","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F2353F0-
     A                                      1_SCR02_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF03","field t-
     A                                      ype":"button","value":"Exit","short-
     A                                      cut key":"F3","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2353F01_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2353F01_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2353F01_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F2353F01_SCR03_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F2353F01_SCR03_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F2353F01_SCR03_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F23-
     A                                      53F01_SCR03_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"F2353F01_SCR03_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F2353F01_SCR03_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button"')
     A                                  1  4HTML(',"css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F2353F01_SCR03_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F2353F01_SCR03_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F2353F01_SCR03_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2353F01_SCR03_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant53","field type":"-
     A                                      output field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentUser()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2353F01_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCR03_SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","parent tab panel":"F2353F01_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant54","field type":"o-
     A                                      utput field","left":"778px","cursor-
     A                                       column":"73","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentDate()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2353F01_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F2353F01_SC-
     A                                      R03_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2353F01_SCR03_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCR03_Q1P-
     A                                      GM","field type":"output field","va-
     A                                      lue":{"fieldName":"Q1PGM","designVa-
     A                                      lue":"[Q1PGM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F2353F01_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR03_SC-
     A                                      PRDS","field type":"output field","-
     A                                      value":{"fieldName":"SCPRDS","desig-
     A                                      nValue":"[SCPRDS]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2353F01_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","visibility":"hidden",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant55","field type":"o-
     A                                      utput field","value":"SCR03","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      2353F01_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR03_SCMODE","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCMODE","designValue":"-
     A                                      [SCMODE]","refField":"PGM"')
     A                                  1  5HTML(',"dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"764px","cursor column-
     A                                      ":"71","top":"150px","cursor row":"-
     A                                      3","css class 2":"HI","parent tab p-
     A                                      anel":"F2353F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F2353F01_SCR03_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F2353F01-
     A                                      _SCR03_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F2353F01_SCR03_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2353F01_SCR03_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2353F01_SCR03_BtnHiddenWorkPri-
     A                                      nterOutput","value":"btnWrkprtout",-
     A                                      "top":"250px","response":{"fieldNam-
     A                                      e":"btnWrkPrnt","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2353F01_SCR03_BtnHiddenImageQu-
     A                                      eue","value":"btnImgQue","top":"275-
     A                                      px","response":{"fieldName":"btnImg-
     A                                      Que","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F2353F0-
     A                                      1_SCR03_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF03","field t-
     A                                      ype":"button","value":"Exit","short-
     A                                      cut key":"F3","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
