     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A                                  1  2HTML('QPUIREC2    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","overlay range":"1--
     A                                      23"},"items":[{"id":"F2379F01_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "F2379F01_SCR01_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"F2379F01_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon alignment":"mid-
     A                                      dle left","icon width":"16px","icon-
     A                                       height":"24px","icon source":"/pro-
     A                                      foundui/userdata/images/systool/sys-
     A                                      tools.png","data function":"SystemT-
     A                                      oolbarSystools","show down arrow":"-
     A                                      Yes"},{"field type":"panel","panel -
     A                                      style":"TransformButtonBar","id":"F-
     A                                      2379F01_SCR01_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"F2379F01_SCR01_-
     A                                      BtnSave","tool tip":"Save","onclick-
     A                                      ":"SystemToolbarSave","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/save.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1066px","id":"F2379F-
     A                                      01_SCR01_BtnRefresh","tool tip":"Re-
     A                                      fresh","onclick":"SystemToolbarRefr-
     A                                      esh","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/ref-
     A                                      resh.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1092px","id":"F2379F01_SCR01_BtnSe-
     A                                      arch","tool tip":"Search","onclick"-
     A                                      :"SystemToolbarSearch","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/search.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1118px","id":"F23-
     A                                      79F01_SCR01_BtnDiaryItems","tool ti-
     A                                      p":"Diary/Work Items - IDARTS","onc-
     A                                      lick":"SystemToolbarDiary","backgro-
     A                                      und image":{"fieldName":"DryIcnURL"-
     A                                      ,"dataLength":"128","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"}},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1144px","id":"F2379F-
     A                                      01_SCR01_BtnSystemMessages","tool t-
     A                                      ip":"System Messages","onclick":"Sy-
     A                                      stemToolbarMessages","background im-
     A                                      age":{"fieldName":"MsgIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"fals')
     A                                  1  4HTML('e","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"F2379F01_SCR01_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"F2379F01_SCR01_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"F2379F01_SCR01_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2379F-
     A                                      01_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      1","field type":"output field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"F2379F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","css-
     A                                       class 3":"HI","parent tab panel":"-
     A                                      F2379F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant2","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"F2379F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"F-
     A                                      2379F01_SCR01_fkeyMenu","field type-
     A                                      ":"menu","left":"10px","top":"120px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2379F-
     A                                      01_SCR01_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "Q1PGM","field type":"output field"-
     A                                      ,"value":{"fieldName":"Q1PGM","desi-
     A                                      gnValue":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"F2379F01_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPR-
     A                                      DS","field type":"output field","va-
     A                                      lue":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"130px","cursor row":"2","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F2379F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","visibility":"hidden","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant3","field type":"outp-
     A                                      ut field","value":"SCR01","css clas-
     A                                      s":"constant","left":"799px","curso-
     A                                      r column":"76","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"F237-
     A                                      9F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCMODE","field type"-
     A                                      :"output field","value":{"')
     A                                  1  5HTML('fieldName":"SCMODE","designVa-
     A                                      lue":"[SCMODE]","refField":"PGM","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"764px","cursor column":"71","t-
     A                                      op":"150px","cursor row":"3","css c-
     A                                      lass 2":"HI","parent tab panel":"F2-
     A                                      379F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F2-
     A                                      379F01_SCR01_BtnHiddenSearch","valu-
     A                                      e":"btnSearch","top":"150px","respo-
     A                                      nse":{"fieldName":"btnSearch","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant5","field type":"output f-
     A                                      ield","value":"Provider number    :-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"170-
     A                                      px","cursor row":"4","parent tab pa-
     A                                      nel":"F2379F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCPROV","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCPROV","designValue":-
     A                                      "[SCPROV]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"6"},"css -
     A                                      class":"output-field","left":"449px-
     A                                      ","cursor column":"26","top":"170px-
     A                                      ","cursor row":"4","css class 2":"H-
     A                                      I","parent tab panel":"F2379F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant28","field type":"ou-
     A                                      tput field","value":"Status:","css -
     A                                      class":"constant","left":"764px","c-
     A                                      ursor column":"71","top":"170px","c-
     A                                      ursor row":"4","parent tab panel":"-
     A                                      F2379F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCSTAT","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCSTAT","designValue":"[SCST-
     A                                      AT]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"1"},"css class"-
     A                                      :"output-field","left":"820px","cur-
     A                                      sor column":"79","top":"170px","cur-
     A                                      sor row":"4","css class 2":"HI","pa-
     A                                      rent tab panel":"F2379F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F2379F01_SCR01_Btn-
     A                                      HiddenDiaryItems","value":"btnDiary-
     A                                      ","top":"175px","response":{"fieldN-
     A                                      ame":"btnDiary","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant4","-
     A                                      field type":"output field","value":-
     A                                      "Effective date     :","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"190px","cursor ro-
     A                                      w":"5","parent tab panel":"F2379F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCEFDT","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CEFDT","designValue":"[SCEFDT]","re-
     A                                      fField":"DT8","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00","edtWrd":"''  /  /-
     A                                          ''"},"css class":"output-field"-
     A                                      ,"left":"449px","cursor column":"26-
     A                                      ","top":"190px","cursor row":"5","w-
     A                                      idth":"70px","text align":"right","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F2379F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F2379F01_SCR01_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant6","field -
     A                                      type":"output field","value":"Name -
     A                                                    :","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"210px","cursor row":"6"-
     A                                      ,"parent tab panel":"F2379F01_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCNAME","field type":"output f-
     A                                      ield","value":{"fieldName":"SCNAME"-
     A                                      ,"designValue":"[SCNAME]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"40"},"css class":"output-fiel-
     A                                      d","left":"449px","cursor column":"-
     A                                      26","top":"210px","cursor row":"6",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F2379F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2379F01_SCR01_BtnHidd')
     A                                  1  6HTML('enWorkSubmitJob","value":"btn-
     A                                      Wrksbmjob","top":"225px","response"-
     A                                      :{"fieldName":"btnWrkJob","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant7","field type":"output field-
     A                                      ","value":"NPI number         :","c-
     A                                      ss class":"constant","left":"281px"-
     A                                      ,"cursor column":"2","top":"230px",-
     A                                      "cursor row":"7","parent tab panel"-
     A                                      :"F2379F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCNPI#","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCNPI#","designValue":"[SC-
     A                                      NPI#]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"10"},"css cla-
     A                                      ss":"output-field","left":"449px","-
     A                                      cursor column":"26","top":"230px","-
     A                                      cursor row":"7","css class 2":"HI",-
     A                                      "parent tab panel":"F2379F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F2379F01_SCR01_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant8","field type":"output-
     A                                       field","value":"Eff. Date Of 1st  -
     A                                      Period:","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"270px","cursor row":"9","parent-
     A                                       tab panel":"F2379F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCF-
     A                                      FDT","field type":"output field","v-
     A                                      alue":{"fieldName":"SCFFDT","design-
     A                                      Value":"[SCFFDT]","refField":"DT8",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"true","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","edtWrd":"''  /  /    ''"},"css -
     A                                      class":"output-field","left":"463px-
     A                                      ","cursor column":"28","top":"270px-
     A                                      ","cursor row":"9","width":"70px","-
     A                                      text align":"right","css class 2":"-
     A                                      HI","parent tab panel":"F2379F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant9","field type":"ou-
     A                                      tput field","value":"Fiscal Year Be-
     A                                      gin Date     :","css class":"consta-
     A                                      nt","left":"547px","cursor column":-
     A                                      "40","top":"270px","cursor row":"9"-
     A                                      ,"parent tab panel":"F2379F01_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCBGDT","field type":"output f-
     A                                      ield","value":{"fieldName":"SCBGDT"-
     A                                      ,"designValue":"[SCBGDT]","refField-
     A                                      ":"DT8","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''  /  /    ''-
     A                                      "},"css class":"output-field","left-
     A                                      ":"750px","cursor column":"69","top-
     A                                      ":"270px","cursor row":"9","width":-
     A                                      "70px","text align":"right","css cl-
     A                                      ass 2":"HI","parent tab panel":"F23-
     A                                      79F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F23-
     A                                      79F01_SCR01_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"275px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant10","field type":"outp-
     A                                      ut field","value":"Report Date     -
     A                                              :","css class":"constant","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"290px","cursor row":"10","par-
     A                                      ent tab panel":"F2379F01_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCRPDT","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCRPDT","des-
     A                                      ignValue":"[SCRPDT]","refField":"DT-
     A                                      8","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","edtWrd":"''  /  /    ''"},"c-
     A                                      ss class":"output-field","left":"46-
     A                                      3px","cursor column":"28","top":"29-
     A                                      0px","cursor row":"10","width":"70p-
     A                                      x","text align":"right","css class -
     A                                      2":"HI","parent tab panel":"F2379F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant11","field type-
     A                                      ":"output field","value":"Terminati-
     A                                      on Date           :","css class":"c-
     A                                      onstant","left":"547px","cursor col-
     A                                      umn":"40","top":"290px","cursor row-
     A                                      ":"10","parent tab panel":"F2379F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCTRDT","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CTRDT","designValue":"[SCTRDT]","re-
     A                                      fField":"DT8","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","uni')
     A                                  1  7HTML('ts":"","negNum":"-999.00","ed-
     A                                      tWrd":"''  /  /    ''"},"css class"-
     A                                      :"output-field","left":"750px","cur-
     A                                      sor column":"69","top":"290px","cur-
     A                                      sor row":"10","width":"70px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      parent tab panel":"F2379F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2379F01_SCR01_B-
     A                                      tnHiddenHelp","value":"btnHelp","to-
     A                                      p":"300px","response":{"fieldName":-
     A                                      "btnHelp","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant12","field-
     A                                       type":"output field","value":"Prov-
     A                                      ider Waived From PPS:","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"310px","cursor ro-
     A                                      w":"11","parent tab panel":"F2379F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCWAIV","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCWAIV","designValue":"[SCWAIV]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none","-
     A                                      dataLength":"1"},"css class":"outpu-
     A                                      t-field","left":"526px","cursor col-
     A                                      umn":"37","top":"310px","cursor row-
     A                                      ":"11","css class 2":"HI","parent t-
     A                                      ab panel":"F2379F01_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant13","field type":"output field",-
     A                                      "value":"Intermediary Number       -
     A                                       :","css class":"constant","left":"-
     A                                      547px","cursor column":"40","top":"-
     A                                      310px","cursor row":"11","parent ta-
     A                                      b panel":"F2379F01_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCINT"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCINT","designValue-
     A                                      ":"[SCINT]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"true","-
     A                                      zeroBalance":"true","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"5","decPos-
     A                                      ":"0"},"css class":"output-field","-
     A                                      left":"778px","cursor column":"73",-
     A                                      "top":"310px","cursor row":"11","wi-
     A                                      dth":"49px","text align":"right","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2379F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant14","f-
     A                                      ield type":"output field","value":"-
     A                                      Provider Type           :","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"330px","curso-
     A                                      r row":"12","parent tab panel":"F23-
     A                                      79F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCTYPE","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCTYPE","designValue":"[SCTYPE]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"2"},"css class":"o-
     A                                      utput-field","left":"519px","cursor-
     A                                       column":"36","top":"330px","cursor-
     A                                       row":"12","css class 2":"HI","pare-
     A                                      nt tab panel":"F2379F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant15","field type":"output fie-
     A                                      ld","value":"Current Census Divisio-
     A                                      n    :","css class":"constant","lef-
     A                                      t":"547px","cursor column":"40","to-
     A                                      p":"330px","cursor row":"12","paren-
     A                                      t tab panel":"F2379F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      CENS","field type":"output field","-
     A                                      value":{"fieldName":"SCCENS","desig-
     A                                      nValue":"[SCCENS]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      true","zeroBalance":"true","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"1",-
     A                                      "decPos":"0"},"css class":"output-f-
     A                                      ield","left":"813px","cursor column-
     A                                      ":"78","top":"330px","cursor row":"-
     A                                      12","width":"14px","text align":"ri-
     A                                      ght","css class 2":"HI","parent tab-
     A                                       panel":"F2379F01_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t16","field type":"output field","v-
     A                                      alue":"Change Code Wage Index  :","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"350px"-
     A                                      ,"cursor row":"13","parent tab pane-
     A                                      l":"F2379F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCCDWI","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCCDWI","designValue":"[-
     A                                      SCCDWI]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"1"},"css cl-
     A                                      ass":"output-field","left":"526px",-
     A                                      "cursor column":"37","top":"350px",-
     A                                      "cursor row":"13","css class 2":"HI-
     A                                      ","parent tab panel":"F2379F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant17","field type":"out-
     A                                      put field","value":"Actual MSA     -
     A                                                  :","css class":"constan-
     A                                      t","left":"547px","cursor ')
     A                                  1  8HTML('column":"40","top":"350px","c-
     A                                      ursor row":"13","parent tab panel":-
     A                                      "F2379F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCAMSA","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCAMSA","designValue":"[SCA-
     A                                      MSA]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none","dataLength":"4"},"css class-
     A                                      ":"output-field","left":"792px","cu-
     A                                      rsor column":"75","top":"350px","cu-
     A                                      rsor row":"13","css class 2":"HI","-
     A                                      parent tab panel":"F2379F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant18","field type":"output-
     A                                       field","value":"Wage Index MSA    -
     A                                            :","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"370px","cursor row":"14","paren-
     A                                      t tab panel":"F2379F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      WMSA","field type":"output field","-
     A                                      value":{"fieldName":"SCWMSA","desig-
     A                                      nValue":"[SCWMSA]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"4-
     A                                      "},"css class":"output-field","left-
     A                                      ":"505px","cursor column":"34","top-
     A                                      ":"370px","cursor row":"14","css cl-
     A                                      ass 2":"HI","parent tab panel":"F23-
     A                                      79F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant19","field -
     A                                      type":"output field","value":"Stand-
     A                                      ardized Amount MSA    :","css class-
     A                                      ":"constant","left":"547px","cursor-
     A                                       column":"40","top":"370px","cursor-
     A                                       row":"14","parent tab panel":"F237-
     A                                      9F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCSMSA","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCSMSA","designValue":"[SCSMSA]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      ","dataLength":"4"},"css class":"ou-
     A                                      tput-field","left":"792px","cursor -
     A                                      column":"75","top":"370px","cursor -
     A                                      row":"14","css class 2":"HI","paren-
     A                                      t tab panel":"F2379F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant20","field type":"output fiel-
     A                                      d","value":"Medicare Dependent     -
     A                                       :","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"3-
     A                                      90px","cursor row":"15","parent tab-
     A                                       panel":"F2379F01_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCSOLE"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCSOLE","designValu-
     A                                      e":"[SCSOLE]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"2"},"c-
     A                                      ss class":"output-field","left":"51-
     A                                      9px","cursor column":"36","top":"39-
     A                                      0px","cursor row":"15","css class 2-
     A                                      ":"HI","parent tab panel":"F2379F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant21","field type"-
     A                                      :"output field","value":"Change Cod-
     A                                      e For LUGAR      :","css class":"co-
     A                                      nstant","left":"547px","cursor colu-
     A                                      mn":"40","top":"390px","cursor row"-
     A                                      :"15","parent tab panel":"F2379F01_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCLUG","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCL-
     A                                      UG","designValue":"[SCLUG]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"1"},"css class":"output-fie-
     A                                      ld","left":"813px","cursor column":-
     A                                      "78","top":"390px","cursor row":"15-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F2379F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant22-
     A                                      ","field type":"output field","valu-
     A                                      e":"Temp. Relief Indicator  :","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"410px","c-
     A                                      ursor row":"16","parent tab panel":-
     A                                      "F2379F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCREL","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCREL","designValue":"[SCREL-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"1"},"css class":"-
     A                                      output-field","left":"526px","curso-
     A                                      r column":"37","top":"410px","curso-
     A                                      r row":"16","css class 2":"HI","par-
     A                                      ent tab panel":"F2379F01_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant23","field type":"output fi-
     A                                      eld","value":"Federal PPS Blend Ind-
     A                                      icator:","css class":"constant","le-
     A                                      ft":"547px","cursor column":"40","t-
     A                                      op":"410px","cursor row":"16","pare-
     A                                      nt tab panel":"F2379F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CFBLE","field type":"output field",-
     A                                      "value":{"fieldName":"SCFB')
     A                                  1  9HTML('LE","designValue":"[SCFBLE]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      ,"dataLength":"4"},"css class":"out-
     A                                      put-field","left":"792px","cursor c-
     A                                      olumn":"75","top":"410px","cursor r-
     A                                      ow":"16","css class 2":"HI","parent-
     A                                       tab panel":"F2379F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant24","field type":"output field-
     A                                      ","value":"Case Mix Adjusted Cost  -
     A                                      :","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"43-
     A                                      0px","cursor row":"17","parent tab -
     A                                      panel":"F2379F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCMIX","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCMIX","designValue":-
     A                                      "[SCMIX]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"true","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"7","decPos":-
     A                                      "2"},"css class":"output-field","le-
     A                                      ft":"470px","cursor column":"29","t-
     A                                      op":"430px","cursor row":"17","widt-
     A                                      h":"70px","text align":"right","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F2379F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant25","fie-
     A                                      ld type":"output field","value":"Co-
     A                                      st Of Living Adjustment  :","css cl-
     A                                      ass":"constant","left":"547px","cur-
     A                                      sor column":"40","top":"430px","cur-
     A                                      sor row":"17","parent tab panel":"F-
     A                                      2379F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCCOLA","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCOLA","designValue":"[SCCOL-
     A                                      A]","dataType":"zoned","formatting"-
     A                                      :"Number","numSep":"true","zeroBala-
     A                                      nce":"true","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0","dataLength":"4","decPos":"3"},"-
     A                                      css class":"output-field","left":"7-
     A                                      85px","cursor column":"74","top":"4-
     A                                      30px","cursor row":"17","width":"42-
     A                                      px","text align":"right","css class-
     A                                       2":"HI","parent tab panel":"F2379F-
     A                                      01_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant26","field typ-
     A                                      e":"output field","value":"Interns/-
     A                                      Beds Ratio      :","css class":"con-
     A                                      stant","left":"281px","cursor colum-
     A                                      n":"2","top":"450px","cursor row":"-
     A                                      18","parent tab panel":"F2379F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCIBED","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCIB-
     A                                      ED","designValue":"[SCIBED]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"true","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"5","decPos":"4"},"css class"-
     A                                      :"output-field","left":"491px","cur-
     A                                      sor column":"32","top":"450px","cur-
     A                                      sor row":"18","width":"49px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      parent tab panel":"F2379F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant27","field type":"output-
     A                                       field","value":"Bed Size          -
     A                                               :","css class":"constant",-
     A                                      "left":"547px","cursor column":"40"-
     A                                      ,"top":"450px","cursor row":"18","p-
     A                                      arent tab panel":"F2379F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCBEDS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCBEDS","d-
     A                                      esignValue":"[SCBEDS]","dataType":"-
     A                                      zoned","formatting":"Number","numSe-
     A                                      p":"true","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","dataLength":-
     A                                      "5","decPos":"0"},"css class":"outp-
     A                                      ut-field","left":"778px","cursor co-
     A                                      lumn":"73","top":"450px","cursor ro-
     A                                      w":"18","width":"49px","text align"-
     A                                      :"right","css class 2":"HI","parent-
     A                                       tab panel":"F2379F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant29","field type":"output field-
     A                                      ","value":"Op.Cost To Charge Ratio -
     A                                      :","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"47-
     A                                      0px","cursor row":"19","parent tab -
     A                                      panel":"F2379F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCOCCR",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCOCCR","designValue-
     A                                      ":"[SCOCCR]","dataType":"zoned","fo-
     A                                      rmatting":"Number","numSep":"true",-
     A                                      "zeroBalance":"true","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00","dataLength":"4","decPo-
     A                                      s":"3"},"css class":"output-field",-
     A                                      "left":"498px","cursor column":"33"-
     A                                      ,"top":"470px","cursor row":"19","w-
     A                                      idth":"42px","text align":"right","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F2379F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant30","-
     A                                      field type":"output field","value":-
     A                                      "Case Mix Index             :","css-
     A                                       class":"constant","left":"547px","-
     A                                      cursor column":"40","top":')
     A                                  1 10HTML('"470px","cursor row":"19","pa-
     A                                      rent tab panel":"F2379F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCMIX1","field type":"output field-
     A                                      ","value":{"fieldName":"SCMIX1","de-
     A                                      signValue":"[SCMIX1]","dataType":"z-
     A                                      oned","formatting":"Number","numSep-
     A                                      ":"true","zeroBalance":"true","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","dataLength":"-
     A                                      5","decPos":"4"},"css class":"outpu-
     A                                      t-field","left":"778px","cursor col-
     A                                      umn":"73","top":"470px","cursor row-
     A                                      ":"19","width":"49px","text align":-
     A                                      "right","css class 2":"HI","parent -
     A                                      tab panel":"F2379F01_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant31","field type":"output field"-
     A                                      ,"value":"Supp. Security Inc.Ratio:-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"490-
     A                                      px","cursor row":"20","parent tab p-
     A                                      anel":"F2379F01_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSSI","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCSSI","designValue":"-
     A                                      [SCSSI]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"true","zer-
     A                                      oBalance":"true","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"4","decPos":"-
     A                                      4"},"css class":"output-field","lef-
     A                                      t":"498px","cursor column":"33","to-
     A                                      p":"490px","cursor row":"20","width-
     A                                      ":"42px","text align":"right","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      2379F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant32","fiel-
     A                                      d type":"output field","value":"Med-
     A                                      icaid","css class":"constant","left-
     A                                      ":"547px","cursor column":"40","top-
     A                                      ":"490px","cursor row":"20","parent-
     A                                       tab panel":"F2379F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"con-
     A                                      stant33","field type":"output field-
     A                                      ","value":"Ratio             :","cs-
     A                                      s class":"constant","left":"610px",-
     A                                      "cursor column":"49","top":"490px",-
     A                                      "cursor row":"20","parent tab panel-
     A                                      ":"F2379F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCMRAT","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCMRAT","designValue":"[S-
     A                                      CMRAT]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"true","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"4","decPos":"4-
     A                                      "},"css class":"output-field","left-
     A                                      ":"785px","cursor column":"74","top-
     A                                      ":"490px","cursor row":"20","width"-
     A                                      :"42px","text align":"right","css c-
     A                                      lass 2":"HI","parent tab panel":"F2-
     A                                      379F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant34","field-
     A                                       type":"output field","value":"Prov-
     A                                      ider PPS Period     :","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"510px","cursor ro-
     A                                      w":"21","parent tab panel":"F2379F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPPSP","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPPSP","designValue":"[SCPPSP]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none","-
     A                                      dataLength":"1"},"css class":"outpu-
     A                                      t-field","left":"526px","cursor col-
     A                                      umn":"37","top":"510px","cursor row-
     A                                      ":"21","css class 2":"HI","parent t-
     A                                      ab panel":"F2379F01_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant35","field type":"output field",-
     A                                      "value":"Spec. Pro# Updt Factor    -
     A                                       :","css class":"constant","left":"-
     A                                      547px","cursor column":"40","top":"-
     A                                      510px","cursor row":"21","parent ta-
     A                                      b panel":"F2379F01_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCSPFA-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCSPFA","designVal-
     A                                      ue":"[SCSPFA]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"true-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","dataLength":"6","dec-
     A                                      Pos":"5"},"css class":"output-field-
     A                                      ","left":"771px","cursor column":"7-
     A                                      2","top":"510px","cursor row":"21",-
     A                                      "width":"56px","text align":"right"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"F2379F01_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF12","field type":"button","v-
     A                                      alue":"Cancel","shortcut key":"F12"-
     A                                      ,"left":"14px","top":"216p')
     A                                  1 11HTML('x","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCAMSA         4A  H
     A            SCBEDS         5S 0H
     A            SCCDWI         1A  H
     A            SCCENS         1S 0H
     A            SCCOLA         4S 3H
     A            SCFBLE         4A  H
     A            SCIBED         5S 4H
     A            SCINT          5S 0H
     A            SCLUG          1A  H
     A            SCMIX          7S 2H
     A            SCMIX1         5S 4H
     A            SCMRAT         4S 4H
     A            SCNAME        40A  H
     A            SCNPI#        10A  H
     A            SCOCCR         4S 3H
     A            SCPPSP         1A  H
     A            SCPROV         6A  H
     A            SCREL          1A  H
     A            SCSMSA         4A  H
     A            SCSOLE         2A  H
     A            SCSPFA         6S 5H
     A            SCSSI          4S 4H
     A            SCSTAT         1A  H
     A            SCTYPE         2A  H
     A            SCWAIV         1A  H
     A            SCWMSA         4A  H
     A            SCBGDT    R        H      REFFLD(DT8)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCFFDT    R        H      REFFLD(DT8)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRPDT    R        H      REFFLD(DT8)
     A            SCTRDT    R        H      REFFLD(DT8)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2379F01_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2379F01_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2379F01_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F2379F01_SCR02_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F2379F01_SCR02_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F2379F01_SCR02_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      2379F01_SCR02_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F2379F01_SCR02_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F2379F01_SCR02_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F2379F01_SCR0-
     A                                      2_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F2379F01_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F2379F01_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2379F01_SCR02_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant36","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2379F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F2379F01_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant37","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2379F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"F2379F01_-
     A                                      SCR02_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F2379F01_SCR02-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR02_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F2379F01_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F2379F01_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant38","field type":-
     A                                      "output field","value":"SCR02","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F2379F01_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR02_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F2379F01_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2379F01_SCR02_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant39","field typ-
     A                                      e":"output field","value":"Provider-
     A                                       number    :","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"F2379F01_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCPROV","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      OV","designValue":"[SCPROV]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"6"},"css class":"output-fi-
     A                                      eld","left":"449px","cursor column"-
     A                                      :"26","top":"170px","cursor row":"4-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F2379F01_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant61-
     A                                      ","field type":"output field","valu-
     A                                      e":"Status:","css class":"constant"-
     A                                      ,"left":"764px","cursor column":"71-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"F2379F01_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCSTAT","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCST-
     A                                      AT","designValue":"[SCSTAT]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"1"},"css class":"output-fi-
     A                                      eld","left":"820px","cursor column"-
     A                                      :"79","top":"170px","cursor row":"4-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F2379F01_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2379F01_SCR02_BtnHiddenDiary-
     A                                      Items","value":"btnDiary","top":"17-
     A                                      5px","response":{"fieldName":"btnDi-
     A                                      ary","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant40","field type-
     A                                      ":"output field","value":"Effective-
     A                                       date     :","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"190px","cursor row":"5","pa-
     A                                      rent tab panel":"F2379F01_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR02_SCEFDT","field type":"output-
     A                                       field","value":{"fieldName":"SCEFD-
     A                                      T","designValue":"[SCEFDT]","refFie-
     A                                      ld":"DT8","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      true","curSym":"","units":"","negNu-
     A                                      m":"-999.00","edtWrd":"''  /  /    -
     A                                      ''"},"css class":"output-field","le-
     A                                      ft":"449px","cursor column":"26","t-
     A                                      op":"190px","cursor row":"5","width-
     A                                      ":"70px","text align":"right","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      2379F01_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      2379F01_SCR02_BtnHiddenSystemMessag-
     A                                      es","value":"btnMessage","top":"200-
     A                                      px","response":{"fieldName":"btnMes-
     A                                      sage","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant41","field typ-
     A                                      e":"output field","value":"Name    -
     A                                                 :","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"210px","cursor row":"6","p-
     A                                      arent tab panel":"F2379F01_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCNAME","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCNA-
     A                                      ME","designValue":"[SCNAME]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none","data-
     A                                      Length":"40"},"css class":"output-f-
     A                                      ield","left":"449px","cursor column-
     A                                      ":"26","top":"210px","cursor row":"-
     A                                      6","css class 2":"HI","parent tab p-
     A                                      anel":"F2379F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility"')
     A                                  1  6HTML(':"hidden","id":"F2379F01_SCR0-
     A                                      2_BtnHiddenWorkSubmitJob","value":"-
     A                                      btnWrksbmjob","top":"225px","respon-
     A                                      se":{"fieldName":"btnWrkJob","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant42","field type":"output f-
     A                                      ield","value":"NPI number         :-
     A                                      ","css class":"constant","left":"28-
     A                                      1px","cursor column":"2","top":"230-
     A                                      px","cursor row":"7","parent tab pa-
     A                                      nel":"F2379F01_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCR02_SCNP-
     A                                      I#","field type":"output field","va-
     A                                      lue":{"fieldName":"SCNPI#","designV-
     A                                      alue":"[SCNPI#]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"449px","cursor column":"26","top"-
     A                                      :"230px","cursor row":"7","css clas-
     A                                      s 2":"HI","parent tab panel":"F2379-
     A                                      F01_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2379-
     A                                      F01_SCR02_BtnHiddenWorkPrinterOutpu-
     A                                      t","value":"btnWrkprtout","top":"25-
     A                                      0px","response":{"fieldName":"btnWr-
     A                                      kPrnt","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant43","field ty-
     A                                      pe":"output field","value":"Operati-
     A                                      ng DSH                  :","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"270px","curso-
     A                                      r row":"9","parent tab panel":"F237-
     A                                      9F01_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCODSH","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCODSH","designValue":"[SCODSH]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"true","zeroBalance-
     A                                      ":"true","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "dataLength":"4","decPos":"4"},"css-
     A                                       class":"output-field","left":"533p-
     A                                      x","cursor column":"38","top":"270p-
     A                                      x","cursor row":"9","width":"42px",-
     A                                      "text align":"right","css class 2":-
     A                                      "HI","parent tab panel":"F2379F01_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant44","field type":"-
     A                                      output field","value":"Fiscal Year -
     A                                      End       :","css class":"constant"-
     A                                      ,"left":"589px","cursor column":"46-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"F2379F01_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCENDT","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCENDT","d-
     A                                      esignValue":"[SCENDT]","refField":"-
     A                                      DT8","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","edtWrd":"''  /  /    ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      757px","cursor column":"70","top":"-
     A                                      270px","cursor row":"9","width":"70-
     A                                      px","text align":"right","css class-
     A                                       2":"HI","parent tab panel":"F2379F-
     A                                      01_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2379F-
     A                                      01_SCR02_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant45","field type":"output -
     A                                      field","value":"Special Payment Ind-
     A                                      icator      :","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"290px","cursor row":"10",-
     A                                      "parent tab panel":"F2379F01_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCSPPY","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCSPPY",-
     A                                      "designValue":"[SCSPPY]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"1"},"css class":"output-field"-
     A                                      ,"left":"561px","cursor column":"42-
     A                                      ","top":"290px","cursor row":"10","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"F2379F01_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant62","-
     A                                      field type":"output field","value":-
     A                                      "Hosp.Quality Indicator:","css clas-
     A                                      s":"constant","left":"589px","curso-
     A                                      r column":"46","top":"290px","curso-
     A                                      r row":"10","parent tab panel":"F23-
     A                                      79F01_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCHOQU","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCHOQU","designValue":"[SCHOQU]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"1"},"css class":"o-
     A                                      utput-field","left":"820px","cursor-
     A                                       column":"79","top":"290px')
     A                                  1  7HTML('","cursor row":"10","css clas-
     A                                      s 2":"HI","parent tab panel":"F2379-
     A                                      F01_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2379-
     A                                      F01_SCR02_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t46","field type":"output field","v-
     A                                      alue":"Actual CBSA                 -
     A                                         :","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "310px","cursor row":"11","parent t-
     A                                      ab panel":"F2379F01_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCACB-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCACBS","designVa-
     A                                      lue":"[SCACBS]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"5"},-
     A                                      "css class":"output-field","left":"-
     A                                      533px","cursor column":"38","top":"-
     A                                      310px","cursor row":"11","css class-
     A                                       2":"HI","parent tab panel":"F2379F-
     A                                      01_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant47","field typ-
     A                                      e":"output field","value":"CBSA Wag-
     A                                      e Index       :","css class":"const-
     A                                      ant","left":"589px","cursor column"-
     A                                      :"46","top":"310px","cursor row":"1-
     A                                      1","parent tab panel":"F2379F01_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCWCBS","field type":"output-
     A                                       field","value":{"fieldName":"SCWCB-
     A                                      S","designValue":"[SCWCBS]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"5"},"css class":"output-fie-
     A                                      ld","left":"792px","cursor column":-
     A                                      "75","top":"310px","cursor row":"11-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F2379F01_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant48-
     A                                      ","field type":"output field","valu-
     A                                      e":"CBSA Standardized Amount Loc.  -
     A                                      :","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"33-
     A                                      0px","cursor row":"12","parent tab -
     A                                      panel":"F2379F01_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCSALO",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCSALO","designValue-
     A                                      ":"[SCSALO]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none","dataLength":"5"},"cs-
     A                                      s class":"output-field","left":"533-
     A                                      px","cursor column":"38","top":"330-
     A                                      px","cursor row":"12","css class 2"-
     A                                      :"HI","parent tab panel":"F2379F01_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant49","field type":-
     A                                      "output field","value":"Special Wag-
     A                                      e Index    :","css class":"constant-
     A                                      ","left":"589px","cursor column":"4-
     A                                      6","top":"330px","cursor row":"12",-
     A                                      "parent tab panel":"F2379F01_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCSPWI","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCSPWI",-
     A                                      "designValue":"[SCSPWI]","dataType"-
     A                                      :"zoned","formatting":"Number","num-
     A                                      Sep":"true","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00","dataLength-
     A                                      ":"6","decPos":"4"},"css class":"ou-
     A                                      tput-field","left":"778px","cursor -
     A                                      column":"73","top":"330px","cursor -
     A                                      row":"12","width":"56px","text alig-
     A                                      n":"right","css class 2":"HI","pare-
     A                                      nt tab panel":"F2379F01_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant50","field type":"output fie-
     A                                      ld","value":"GAF pre 10/1/09       -
     A                                               :","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"350px","cursor row":"13","pa-
     A                                      rent tab panel":"F2379F01_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCGAF","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCGAF","desi-
     A                                      gnValue":"[SCGAF]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      true","zeroBalance":"true","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"6",-
     A                                      "decPos":"4"},"css class":"output-f-
     A                                      ield","left":"519px","cursor column-
     A                                      ":"36","top":"350px","cursor row":"-
     A                                      13","width":"56px","text align":"ri-
     A                                      ght","css class 2":"HI","parent tab-
     A                                       panel":"F2379F01_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t51","field type":"output field","v-
     A                                      alue":"Wage ind. pre 10/1/09 :","cs-
     A                                      s class":"constant","left":"589px",-
     A                                      "cursor column":"46","top":"350px",-
     A                                      "cursor row":"13","parent tab panel-
     A                                      ":"F2379F01_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCWI')
     A                                  1  8HTML('ND","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCWIND","d-
     A                                      esignValue":"[SCWIND]","dataType":"-
     A                                      zoned","formatting":"Number","numSe-
     A                                      p":"true","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00","dataLength":-
     A                                      "6","decPos":"4"},"css class":"outp-
     A                                      ut-field","left":"778px","cursor co-
     A                                      lumn":"73","top":"350px","cursor ro-
     A                                      w":"13","width":"56px","text align"-
     A                                      :"right","css class 2":"HI","parent-
     A                                       tab panel":"F2379F01_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant52","field type":"output field-
     A                                      ","value":"Pass Through Amount for -
     A                                      Capital:","css class":"constant","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"370px","cursor row":"14","pare-
     A                                      nt tab panel":"F2379F01_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCPAS","field type":"output field",-
     A                                      "value":{"fieldName":"SCCPAS","desi-
     A                                      gnValue":"[SCCPAS]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "true","zeroBalance":"true","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"-999.00","dataLength":"6"-
     A                                      ,"decPos":"2"},"css class":"output--
     A                                      field","left":"512px","cursor colum-
     A                                      n":"35","top":"370px","cursor row":-
     A                                      "14","width":"63px","text align":"r-
     A                                      ight","css class 2":"HI","parent ta-
     A                                      b panel":"F2379F01_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt63","field type":"output field","-
     A                                      value":"Pass Thr. Amt for DME :","c-
     A                                      ss class":"constant","left":"589px"-
     A                                      ,"cursor column":"46","top":"370px"-
     A                                      ,"cursor row":"14","parent tab pane-
     A                                      l":"F2379F01_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCDPAS","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCDPAS","designValue":"[-
     A                                      SCDPAS]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"true","zer-
     A                                      oBalance":"true","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"6","decPos":"-
     A                                      2"},"css class":"output-field","lef-
     A                                      t":"771px","cursor column":"72","to-
     A                                      p":"370px","cursor row":"14","width-
     A                                      ":"63px","text align":"right","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      2379F01_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant53","fiel-
     A                                      d type":"output field","value":"Pas-
     A                                      s Through Amount for Organ  :","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"390px","c-
     A                                      ursor row":"15","parent tab panel":-
     A                                      "F2379F01_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCOPAS","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCOPAS","designValue":"[SCO-
     A                                      PAS]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"true","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"6","decPos":"2"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "512px","cursor column":"35","top":-
     A                                      "390px","cursor row":"15","width":"-
     A                                      63px","text align":"right","css cla-
     A                                      ss 2":"HI","parent tab panel":"F237-
     A                                      9F01_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant54","field t-
     A                                      ype":"output field","value":"Total -
     A                                      Pass Through    :","css class":"con-
     A                                      stant","left":"589px","cursor colum-
     A                                      n":"46","top":"390px","cursor row":-
     A                                      "15","parent tab panel":"F2379F01_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCTPAS","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCT-
     A                                      PAS","designValue":"[SCTPAS]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"true","zeroBalance":"tru-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"6","decPos":"2"},"css class-
     A                                      ":"output-field","left":"771px","cu-
     A                                      rsor column":"72","top":"390px","cu-
     A                                      rsor row":"15","width":"63px","text-
     A                                       align":"right","css class 2":"HI",-
     A                                      "parent tab panel":"F2379F01_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant55","field type":"outpu-
     A                                      t field","value":"Capital PPS Payme-
     A                                      nt Code       :","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"410px","cursor row":"16-
     A                                      ","parent tab panel":"F2379F01_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCCPPS","field type":"output -
     A                                      field","value":{"fieldName":"SCCPPS-
     A                                      ","designValue":"[SCCPPS]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"1"},"css class":"output-fiel-
     A                                      d","left":"561px","cursor column":"-
     A                                      42","top":"410px","cursor row":"16"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"F2379F01_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant64"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Hosp spec.Capital Rate:')
     A                                  1  9HTML('","css class":"constant","lef-
     A                                      t":"589px","cursor column":"46","to-
     A                                      p":"410px","cursor row":"16","paren-
     A                                      t tab panel":"F2379F01_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      HSCA","field type":"output field","-
     A                                      value":{"fieldName":"SCHSCA","desig-
     A                                      nValue":"[SCHSCA]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      true","zeroBalance":"true","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"6",-
     A                                      "decPos":"2"},"css class":"output-f-
     A                                      ield","left":"771px","cursor column-
     A                                      ":"72","top":"410px","cursor row":"-
     A                                      16","width":"63px","text align":"ri-
     A                                      ght","css class 2":"HI","parent tab-
     A                                       panel":"F2379F01_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t56","field type":"output field","v-
     A                                      alue":"Old Capital Hold Harmless Ra-
     A                                      te :","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "430px","cursor row":"17","parent t-
     A                                      ab panel":"F2379F01_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCOHH-
     A                                      R","field type":"output field","val-
     A                                      ue":{"fieldName":"SCOHHR","designVa-
     A                                      lue":"[SCOHHR]","dataType":"zoned",-
     A                                      "formatting":"Number","numSep":"tru-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00","dataLength":"6","de-
     A                                      cPos":"2"},"css class":"output-fiel-
     A                                      d","left":"512px","cursor column":"-
     A                                      35","top":"430px","cursor row":"17"-
     A                                      ,"width":"63px","text align":"right-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F2379F01_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant65-
     A                                      ","field type":"output field","valu-
     A                                      e":"New Cap.Hold Rate     :","css c-
     A                                      lass":"constant","left":"589px","cu-
     A                                      rsor column":"46","top":"430px","cu-
     A                                      rsor row":"17","parent tab panel":"-
     A                                      F2379F01_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCCHHR","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCCHHR","designValue":"[SCCH-
     A                                      HR]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"true","zeroBal-
     A                                      ance":"true","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","dataLength":"5","decPos":"4"},-
     A                                      "css class":"output-field","left":"-
     A                                      785px","cursor column":"74","top":"-
     A                                      430px","cursor row":"17","width":"4-
     A                                      9px","text align":"right","css clas-
     A                                      s 2":"HI","parent tab panel":"F2379-
     A                                      F01_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant57","field ty-
     A                                      pe":"output field","value":"Capital-
     A                                       Cost to Charge Ratio   :","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"450px","curso-
     A                                      r row":"18","parent tab panel":"F23-
     A                                      79F01_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCCCCR","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCCCR","designValue":"[SCCCCR]-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","numSep":"true","zeroBalanc-
     A                                      e":"true","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"-999.00"-
     A                                      ,"dataLength":"4","decPos":"3"},"cs-
     A                                      s class":"output-field","left":"533-
     A                                      px","cursor column":"38","top":"450-
     A                                      px","cursor row":"18","width":"42px-
     A                                      ","text align":"right","css class 2-
     A                                      ":"HI","parent tab panel":"F2379F01-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant58","field type"-
     A                                      :"output field","value":"New Hospit-
     A                                      al          :","css class":"constan-
     A                                      t","left":"589px","cursor column":"-
     A                                      46","top":"450px","cursor row":"18"-
     A                                      ,"parent tab panel":"F2379F01_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCNEW","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCNEW","-
     A                                      designValue":"[SCNEW]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"1"},"css class":"output-field","-
     A                                      left":"820px","cursor column":"79",-
     A                                      "top":"450px","cursor row":"18","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "F2379F01_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant59","fi-
     A                                      eld type":"output field","value":"C-
     A                                      apital IME Ratio              :","c-
     A                                      ss class":"constant","left":"281px"-
     A                                      ,"cursor column":"2","top":"470px",-
     A                                      "cursor row":"19","parent tab panel-
     A                                      ":"F2379F01_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCCIME","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCIME","designValue":"[S-
     A                                      CCIME]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"true","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"5","decPos":"4-
     A                                      "},"css class":"output-field","left-
     A                                      ":"526px","cursor column":"37","top-
     A                                      ":"470px","cursor row":"19","width"-
     A                                      :"49px","text align":"righ')
     A                                  1 10HTML('t","css class 2":"HI","parent-
     A                                       tab panel":"F2379F01_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant66","field type":"output field-
     A                                      ","value":"Capital Exce. Pmt Rate:"-
     A                                      ,"css class":"constant","left":"589-
     A                                      px","cursor column":"46","top":"470-
     A                                      px","cursor row":"19","parent tab p-
     A                                      anel":"F2379F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCCEXC","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCCEXC","designValue"-
     A                                      :"[SCCEXC]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"true","-
     A                                      zeroBalance":"true","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"6","decPos-
     A                                      ":"2"},"css class":"output-field","-
     A                                      left":"771px","cursor column":"72",-
     A                                      "top":"470px","cursor row":"19","wi-
     A                                      dth":"63px","text align":"right","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2379F01_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant60","f-
     A                                      ield type":"output field","value":"-
     A                                      State Code                     :","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"490px"-
     A                                      ,"cursor row":"20","parent tab pane-
     A                                      l":"F2379F01_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCSCOD","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCSCOD","designValue":"[-
     A                                      SCSCOD]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"2"},"css cl-
     A                                      ass":"output-field","left":"526px",-
     A                                      "cursor column":"37","top":"490px",-
     A                                      "cursor row":"20","css class 2":"HI-
     A                                      ","parent tab panel":"F2379F01_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit","shortcut key":"F3","left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCACBS         5A  H
     A            SCCCCR         4S 3H
     A            SCCEXC         6S 2H
     A            SCCHHR         5S 4H
     A            SCCIME         5S 4H
     A            SCCPAS         6S 2H
     A            SCCPPS         1A  H
     A            SCDPAS         6S 2H
     A            SCGAF          6S 4H
     A            SCHOQU         1A  H
     A            SCHSCA         6S 2H
     A            SCNAME        40A  H
     A            SCNEW          1A  H
     A            SCNPI#        10A  H
     A            SCODSH         4S 4H
     A            SCOHHR         6S 2H
     A            SCOPAS         6S 2H
     A            SCPROV         6A  H
     A            SCSALO         5A  H
     A            SCSCOD         2A  H
     A            SCSPPY         1A  H
     A            SCSPWI         6S 4H
     A            SCSTAT         1A  H
     A            SCTPAS         6S 2H
     A            SCWCBS         5A  H
     A            SCWIND         6S 4H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCENDT    R        H      REFFLD(DT8)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2379F01_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2379F01_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2379F01_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F2379F01_SCR03_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F2379F01_SCR03_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F2379F01_SCR03_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      2379F01_SCR03_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F2379F01_SCR03_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F2379F01_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F2379F01_SCR0-
     A                                      3_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F2379F01_SCR03_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F2379F01_SCR03_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2379F01_SCR03_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant67","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2379F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F2379F01_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant68","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2379F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"F2379F01_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F2379F01_SCR03-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR03_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F2379F01_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F2379F01_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant69","field type":-
     A                                      "output field","value":"SCR03","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F2379F01_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR03_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F2379F01_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2379F01_SCR03_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2379F-
     A                                      01_SCR03_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F2379F01_SCR03_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2379F01_SCR03_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2379F01_SCR03_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2379F01_SCR03_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2379-
     A                                      F01_SCR03_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
