     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDATA        72A  H
     A            SCDBRR         9S 0H
     A            SCPAGE         3S 0H
     A            SCPCAT        10A  H
     A            SCPTY          3S 0H
     A            SCRULE         9S 0H
     A            SCSEL          2A  H
     A            SCEFDT    R        H      REFFLD(DT7)
     A            SCSTAT    R        H      REFFLD(FLAG)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 06
     A  22 23 24                            CA01(01 'Response Indicator *IN01')
     A  25 26 27
     A  28 29 91
     A  92 93 94                            CA02(02 'Response Indicator *IN02')
     A  95                                  CA03
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    8 RSFLSIZ    1    C1    9 1   -
     A                                       RSFLNXTCHG 0    E1    3     0814  -
     A                                       ROVERLAY   0     RROWS      2    C-
     A                                      1    1C2    20 RSFLMSGID  4    C7  -
     A                                        CPD6A81C7    QCPFMSGC5    *LIBLC0-
     A                                          E1    3     92RSFLMSGID  4    C-
     A                                      7    CPD6A7CC7    QCPFMSGC5    *LIB-
     A                                      LC0    E1    3     93RERRMSGID  5  -
     A                                        C6    SCCONMC7    CPF5203C7    QC-
     A                                      PFMSGC5    *LIBLC0    E1    3     9-
     A                                      1RERRMSGID  5    C6    SCCONMC7    -
     A                                      CPF5204C7    QCPFMSGC5    *LIBLC0  -
     A                                        E1    3     94FSCPST1    INPUTONL-
     A                                      Y 0     FSCPST3    INPUTONLY 0     -
     A                                      FSCPST4    INPUTONLY 0     FSCPST5 -
     A                                         INPUTONLY 0     FSCPST2    INPUT-
     A                                      ONLY 0     FSCPSTC    INPUTONLY 0  -
     A                                         FSCPSTA    INPUTONLY 0     FSCPS-
     A                                      TB    INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A81","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"92","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"CPD6A7C","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-20"},"items":[{"id"-
     A                                      :"SCPST8","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"28","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST8","designValue":"[SCPST8]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SCPST7","field type":"ou-
     A                                      tput field","visibility":{"fieldNam-
     A                                      e":"27","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"value":{"fieldN-
     A                                      ame":"SCPST7","designValue":"[SCPST-
     A                                      7]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne","dataLength":"1"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SCRRN1","field -
     A                                      type":"output field","visibility":"-
     A                                      hidden","value":{"fieldName":"SCRRN-
     A                                      1","designValue":"[SCRRN1]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00","dataLen-
     A                                      gth":"4","decPos":"0"},"left":"0px"-
     A                                      ,"top":"-30px","width":"28px","text-
     A                                       align":"right","css class":"profou-
     A                                      nd-converted"},{"id":"SCPST6","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :{"fieldName":"26","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"valu-
     A                                      e":{"fieldName":"SCPST6","designVal-
     A                                      ue":"[SCPST6]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"1"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"SCPS-
     A                                      T9","field type":"output field","vi-
     A                                      sibility":{"fieldName":"29","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":{"fieldName":"SCPST9","-
     A                                      designValue":"[SCPST9]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"1"},"left":"0px","top":"-30px","-
     A                                      css class":"profound-converted"},{"-
     A                                      id":"SFLMOD","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SFLMOD","designValue-
     A                                      ":"[SFLMOD]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"1"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"F2400F-
     A                                      _SCR01C_avKeys","field type":"outpu-
     A                                      t field","value":{"fieldName":"AV_K-
     A                                      EYS","dataLength":"1134","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[AV_KEYS]"},"left":"0px"-
     A                                      ,"top":"0px","visibility":"hidden"}-
     A                                      ,{"id":"F2400F_SCR01C_action","fiel-
     A                                      d type":"html container","white spa-
     A                                      ce":"normal","left":"0px","top":"10-
     A                                      px","width":"230px","css class":"ac-
     A                                      tion-panel-converted","height":"700-
     A                                      px","html":"<div class=\"top\"></di-
     A                                      v><div class=\"imagetop\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_t-
     A                                      op.png\" /></div><div class=\"menul-
     A                                      inks\"></div><div class=\"imagebott-
     A                                      om\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_bottom.png\" /></div><-
     A                                      div class=\"bottom\"></div>"},{"fie-
     A                                      ld type":"icon menu button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"32px","z index-
     A                                      ":"20","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1170px","id":"F2400F_SCR-
     A                                      01C_BtnIconMenuSystemTools","tool t-
     A                                      ip":"System Tools","icon source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      systools.png","data function":"Syst-
     A                                      emToolbarSystools","show down arrow-
     A                                      ":"Yes"},{"field type":"panel","pan-
     A                                      el style":"TransformButtonBar","id"-
     A                                      :"F2400F_SCR01C_ButtonBar","top":"3-
     A                                      5px","left":"1036px","width":"187px-
     A                                      ","height":"28px","css class":"stat-
     A                                      ionary","visibility":"hidden","lock-
     A                                      ed in place":"true"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-')
     A                                  1  4HTML('repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F2400F_SCR01C_BtnSave","tool tip"-
     A                                      :"Save","onclick":"SystemToolbarSav-
     A                                      e","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/save.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1066-
     A                                      px","id":"F2400F_SCR01C_BtnRefresh"-
     A                                      ,"tool tip":"Refresh","onclick":"Sy-
     A                                      stemToolbarRefresh","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/refresh.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1092px","id":"F2400-
     A                                      F_SCR01C_BtnSearch","tool tip":"Sea-
     A                                      rch","onclick":"SystemToolbarSearch-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/search-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"111-
     A                                      8px","id":"F2400F_SCR01C_BtnDiaryIt-
     A                                      ems","tool tip":"Diary/Work Items --
     A                                       IDARTS","onclick":"SystemToolbarDi-
     A                                      ary","background image":{"fieldName-
     A                                      ":"DryIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1144px"-
     A                                      ,"id":"F2400F_SCR01C_BtnSystemMessa-
     A                                      ges","tool tip":"System Messages","-
     A                                      onclick":"SystemToolbarMessages","b-
     A                                      ackground image":{"fieldName":"MsgI-
     A                                      cnURL","dataLength":"128","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"}},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1196px","id":"-
     A                                      F2400F_SCR01C_BtnHelp","tool tip":"-
     A                                      Help","onclick":"SystemToolbarHelp"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/help.pn-
     A                                      g'')"},{"id":"F2400F_SCR01C_ImgSysT-
     A                                      oolBottom","field type":"image","im-
     A                                      age source":"/profoundui/userdata/i-
     A                                      mages/systool/butbarbot.png","left"-
     A                                      :"1036px","top":"64px","width":"187-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"stationary","visibility":"hi-
     A                                      dden"},{"id":"F2400F_SCR01C_MainTab-
     A                                      Panel","field type":"tab panel","ta-
     A                                      b panel style":"Transform","tab nam-
     A                                      es":{"fieldName":"SCPRDS","designVa-
     A                                      lue":"[SCPRDS]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"active tab":"0","left":"250p-
     A                                      x","top":"70px","width":"970px","he-
     A                                      ight":"657px","z index":"8","locked-
     A                                       in place":"true","css class":"tab--
     A                                      panel","css class 2":"stationary"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F2400F_SCR01-
     A                                      C_BtnHiddenSave","value":"btnSave",-
     A                                      "top":"100px","response":{"fieldNam-
     A                                      e":"btnSave","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant1","fie-
     A                                      ld type":"output field","left":"281-
     A                                      px","cursor column":"2","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentUser()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"F2400F_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},')
     A                                  1  5HTML('{"id":"SCCONM","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCCONM","designValue":"[SCCONM]","-
     A                                      refField":"NAME","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"414px","cur-
     A                                      sor column":"21","top":"110px","cur-
     A                                      sor row":"1","css class 2":"top-lin-
     A                                      e","css class 3":"HI","error messag-
     A                                      e id":"CPF5203","error message file-
     A                                      ":"QCPFMSG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"91","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"2 messa-
     A                                      ges","error message id 2":"CPF5204"-
     A                                      ,"error message file 2":"QCPFMSG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"94"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"F2400F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"constant2","field type":"output-
     A                                       field","left":"778px","cursor colu-
     A                                      mn":"73","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentDate()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      F2400F_SCR01C_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"F2400F_SCR01C_fke-
     A                                      yMenu","field type":"menu","left":"-
     A                                      10px","top":"150px","height":"320px-
     A                                      ","width":"230px","hover background-
     A                                       color":"#9AAA61","hover text color-
     A                                      ":"#FFFFFF","border color":"#4C6106-
     A                                      ","menu option indent":"10px","back-
     A                                      ground color":"#758B27","css class"-
     A                                      :"action-menu","css class 2":"stati-
     A                                      onary","z index":"101"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F2400F_SCR01C_BtnHidden-
     A                                      Refresh","value":"btnRefresh","top"-
     A                                      :"125px","response":{"fieldName":"b-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant3","field-
     A                                       type":"output field","value":"F240-
     A                                      0F","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F2400F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCPRDS","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCPRDS","designValue"-
     A                                      :"[SCPRDS]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"414px","cursor column":"21","top"-
     A                                      :"130px","cursor row":"2","css clas-
     A                                      s 2":"HI","parent tab panel":"F2400-
     A                                      F_SCR01C_MainTabPanel","parent tab"-
     A                                      :"0","visibility":"hidden","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant4","field type":"output fie-
     A                                      ld","value":"SCR01","css class":"co-
     A                                      nstant","left":"785px","cursor colu-
     A                                      mn":"74","top":"130px","cursor row"-
     A                                      :"2","parent tab panel":"F2400F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F2400F_SCR0-
     A                                      1C_BtnHiddenSearch","value":"btnSea-
     A                                      rch","top":"150px","response":{"fie-
     A                                      ldName":"btnSearch","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      5","field type":"output field","val-
     A                                      ue":"State:","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"170px","cursor row":"4","pa-
     A                                      rent tab panel":"F2400F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCST","field type":"output field","-
     A                                      value":{"fieldName":"SCST","designV-
     A                                      alue":"[SCST]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"2"},"-
     A                                      css class":"output-field","left":"3-
     A                                      37px","cursor column":"10","top":"1-
     A                                      70px","cursor row":"4","parent tab -
     A                                      panel":"F2400F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSTDS","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCSTDS","designValue"-
     A                                      :"[SCSTDS]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"50"},"cs-
     A                                      s class":"output-field","left":"365-
     A                                      px","cursor column":"14","top":"170-
     A                                      px","cursor row":"4","parent tab pa-
     A                                      nel":"F2400F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F2400F_SCR01C_BtnHiddenDiaryIt-
     A                                      ems","value":"btnDiary","top":"175p-
     A                                      x","response":{"fieldName"')
     A                                  1  6HTML(':"btnDiary","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2400F_SCR01C_BtnHiddenSystem-
     A                                      Messages","value":"btnMessage","top-
     A                                      ":"200px","response":{"fieldName":"-
     A                                      btnMessage","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant6","fiel-
     A                                      d type":"output field","value":"Pos-
     A                                      ition to . . .","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"210px","cursor row":"6",-
     A                                      "parent tab panel":"F2400F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant9","field type":"output -
     A                                      field","value":"Rule#:","css class"-
     A                                      :"constant","visibility":{"fieldNam-
     A                                      e":"23","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"left":"407px","-
     A                                      cursor column":"20","top":"210px","-
     A                                      cursor row":"6","parent tab panel":-
     A                                      "F2400F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant11","fie-
     A                                      ld type":"output field","value":"Ef-
     A                                      fective","css class":"constant","vi-
     A                                      sibility":{"fieldName":"25","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"407px","cursor column":-
     A                                      "20","top":"210px","cursor row":"6"-
     A                                      ,"parent tab panel":"F2400F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant10","field type":"outpu-
     A                                      t field","value":"Effective","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"24","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"407-
     A                                      px","cursor column":"20","top":"210-
     A                                      px","cursor row":"6","parent tab pa-
     A                                      nel":"F2400F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"constant8",-
     A                                      "field type":"output field","value"-
     A                                      :"Procedure","css class":"constant"-
     A                                      ,"visibility":{"fieldName":"22","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"407px","cursor colu-
     A                                      mn":"20","top":"210px","cursor row"-
     A                                      :"6","parent tab panel":"F2400F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant7","field type":"ou-
     A                                      tput field","value":"Rule#:","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"21","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"407-
     A                                      px","cursor column":"20","top":"210-
     A                                      px","cursor row":"6","parent tab pa-
     A                                      nel":"F2400F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCPST1","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","input-
     A                                       only":"true","value":{"fieldName":-
     A                                      "SCPST1","designValue":"[SCPST1]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"9","blankFill":"t-
     A                                      rue"},"text transform":"uppercase",-
     A                                      "visibility":{"fieldName":"21","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"456px","cursor colum-
     A                                      n":"27","top":"210px","cursor row":-
     A                                      "6","width":"64px","text align":"ri-
     A                                      ght","css class 3":"HI","set focus"-
     A                                      :{"fieldName":"21 and N06","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      parent tab panel":"F2400F_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 4":"profound-converted"},{"id"-
     A                                      :"SCPST3","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","input only":"true","value":-
     A                                      {"fieldName":"SCPST3","designValue"-
     A                                      :"[SCPST3]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"9","-
     A                                      blankFill":"true"},"text transform"-
     A                                      :"uppercase","visibility":{"fieldNa-
     A                                      me":"23","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"456px",-
     A                                      "cursor column":"27","top":"210px",-
     A                                      "cursor row":"6","width":"64px","te-
     A                                      xt align":"right","css class 3":"HI-
     A                                      ","set focus":{"fieldName":"23 and -
     A                                      N06","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"parent tab panel":"F24-
     A                                      00F_SCR01C_MainTabPanel","parent ta-
     A                                      b":"0","css class 4":"profound-conv-
     A                                      erted"},{"id":"constant12","field t-
     A                                      ype":"output field","value":"Catego-
     A                                      ry:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"22","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"477px","cursor column":"30"-
     A                                      ,"top":"210px","cursor row":"6","pa-
     A                                      rent tab panel":"F2400F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant14","field type":"')
     A                                  1  7HTML('output field","value":"Date:"-
     A                                      ,"css class":"constant","visibility-
     A                                      ":{"fieldName":"25","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"},"lef-
     A                                      t":"477px","cursor column":"30","to-
     A                                      p":"210px","cursor row":"6","parent-
     A                                       tab panel":"F2400F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant13","field type":"output field"-
     A                                      ,"value":"Date:","css class":"const-
     A                                      ant","visibility":{"fieldName":"24"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"477px","cursor -
     A                                      column":"30","top":"210px","cursor -
     A                                      row":"6","parent tab panel":"F2400F-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPST4","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","input only":"true-
     A                                      ","value":{"fieldName":"SCPST4","de-
     A                                      signValue":"[SCPST4]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase","dataLen-
     A                                      gth":"8","blankFill":"true"},"text -
     A                                      transform":"uppercase","visibility"-
     A                                      :{"fieldName":"24","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"519px","cursor column":"36","top-
     A                                      ":"210px","cursor row":"6","width":-
     A                                      "57px","text align":"right","css cl-
     A                                      ass 3":"HI","set focus":{"fieldName-
     A                                      ":"24 and N06","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"parent tab p-
     A                                      anel":"F2400F_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"id":"SCPST5","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","inpu-
     A                                      t only":"true","value":{"fieldName"-
     A                                      :"SCPST5","designValue":"[SCPST5]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase","dataLength":"8","blankFill":"-
     A                                      true"},"text transform":"uppercase"-
     A                                      ,"visibility":{"fieldName":"25","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"519px","cursor colu-
     A                                      mn":"36","top":"210px","cursor row"-
     A                                      :"6","width":"57px","text align":"r-
     A                                      ight","css class 3":"HI","set focus-
     A                                      ":{"fieldName":"25 and N06","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "parent tab panel":"F2400F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"constant15","field type":"output-
     A                                       field","value":"Effective Date:","-
     A                                      css class":"constant","visibility":-
     A                                      {"fieldName":"21","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"547px","cursor column":"40","top"-
     A                                      :"210px","cursor row":"6","parent t-
     A                                      ab panel":"F2400F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPST2-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      input only":"true","value":{"fieldN-
     A                                      ame":"SCPST2","designValue":"[SCPST-
     A                                      2]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"10","blankFi-
     A                                      ll":"true"},"text transform":"upper-
     A                                      case","visibility":{"fieldName":"22-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"561px","cursor-
     A                                       column":"42","top":"210px","cursor-
     A                                       row":"6","width":"71px","text alig-
     A                                      n":"right","css class 3":"HI","set -
     A                                      focus":{"fieldName":"22 and N06","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"parent tab panel":"F2400F_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant17","field type":"o-
     A                                      utput field","value":"Page#:","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"25","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"58-
     A                                      9px","cursor column":"46","top":"21-
     A                                      0px","cursor row":"6","parent tab p-
     A                                      anel":"F2400F_SCR01C_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant16-
     A                                      ","field type":"output field","valu-
     A                                      e":"Priority:","css class":"constan-
     A                                      t","visibility":{"fieldName":"24","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"left":"589px","cursor co-
     A                                      lumn":"46","top":"210px","cursor ro-
     A                                      w":"6","parent tab panel":"F2400F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCPSTC","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","input only":"true",-
     A                                      "value":{"fieldName":"SCPSTC","desi-
     A                                      gnValue":"[SCPSTC]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase","dataLengt-
     A                                      h":"3","blankFill":"true"},"text tr-
     A                                      ansform":"uppercase","visi')
     A                                  1  8HTML('bility":{"fieldName":"25","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"645px","cursor colu-
     A                                      mn":"54","top":"210px","cursor row"-
     A                                      :"6","width":"22px","text align":"r-
     A                                      ight","css class 3":"HI","parent ta-
     A                                      b panel":"F2400F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"SCPSTA"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","i-
     A                                      nput only":"true","value":{"fieldNa-
     A                                      me":"SCPSTA","designValue":"[SCPSTA-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","dataLength":"8","blankFill-
     A                                      ":"true"},"text transform":"upperca-
     A                                      se","visibility":{"fieldName":"21",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"left":"659px","cursor c-
     A                                      olumn":"56","top":"210px","cursor r-
     A                                      ow":"6","width":"57px","text align"-
     A                                      :"right","css class 3":"HI","parent-
     A                                       tab panel":"F2400F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"SCPS-
     A                                      TB","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"input only":"true","value":{"fiel-
     A                                      dName":"SCPSTB","designValue":"[SCP-
     A                                      STB]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase","dataLength":"3","blankF-
     A                                      ill":"true"},"text transform":"uppe-
     A                                      rcase","visibility":{"fieldName":"2-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"666px","curso-
     A                                      r column":"57","top":"210px","curso-
     A                                      r row":"6","width":"22px","text ali-
     A                                      gn":"right","css class 3":"HI","par-
     A                                      ent tab panel":"F2400F_SCR01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 4":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F2400F_SCR01C_BtnHid-
     A                                      denWorkSubmitJob","value":"btnWrksb-
     A                                      mjob","top":"225px","response":{"fi-
     A                                      eldName":"btnWrkJob","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t18","field type":"output field","v-
     A                                      alue":"Type options, press Enter.",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"250px-
     A                                      ","cursor row":"8","css class 2":"B-
     A                                      LU","parent tab panel":"F2400F_SCR0-
     A                                      1C_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F2400F_SCR01-
     A                                      C_BtnHiddenWorkPrinterOutput","valu-
     A                                      e":"btnWrkprtout","top":"250px","re-
     A                                      sponse":{"fieldName":"btnWrkPrnt","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"SCOPL1","field type":"output -
     A                                      field","value":{"fieldName":"SCOPL1-
     A                                      ","designValue":"[SCOPL1]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"76"},"css class":"output-fie-
     A                                      ld","left":"295px","cursor column":-
     A                                      "4","top":"270px","cursor row":"9",-
     A                                      "css class 2":"BLU","parent tab pan-
     A                                      el":"F2400F_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2400F_SCR01C_BtnHiddenImageQue-
     A                                      ue","value":"btnImgQue","top":"275p-
     A                                      x","response":{"fieldName":"btnImgQ-
     A                                      ue","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"SCOPL2","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      COPL2","designValue":"[SCOPL2]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none","d-
     A                                      ataLength":"76"},"css class":"outpu-
     A                                      t-field","left":"295px","cursor col-
     A                                      umn":"4","top":"290px","cursor row"-
     A                                      :"10","css class 2":"BLU","parent t-
     A                                      ab panel":"F2400F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F2400F_SCR01C_BtnHiddenHe-
     A                                      lp","value":"btnHelp","top":"300px"-
     A                                      ,"response":{"fieldName":"btnHelp",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant19","field type":"ou-
     A                                      tput field","value":"Proc","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"N22","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"498p-
     A                                      x","cursor column":"33","top":"310p-
     A                                      x","cursor row":"11","css class 2":-
     A                                      {"fieldName":"N22","dataTy')
     A                                  1  9HTML('pe":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"parent tab panel":"F2400F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      ","css class 4":"subfile-heading"},-
     A                                      {"id":"SCHDL1","field type":"output-
     A                                       field","value":{"fieldName":"SCHDL-
     A                                      1","designValue":"[SCHDL1]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none","dataL-
     A                                      ength":"78"},"css class":"output-fi-
     A                                      eld","left":"281px","cursor column"-
     A                                      :"2","top":"330px","cursor row":"12-
     A                                      ","css class 2":"HI","parent tab pa-
     A                                      nel":"F2400F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted","css class 4":"subf-
     A                                      ile-heading"},{"id":"SCR01S","field-
     A                                       type":"grid","number of columns":"-
     A                                      3","record format name":"SCR01S","s-
     A                                      ubfile next changed":{"fieldName":"-
     A                                      08","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"display subfile":{"fiel-
     A                                      dName":"04","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"display control-
     A                                       record":{"fieldName":"N03","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "clear subfile":{"fieldName":"03","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"subfile size":"9","place cur-
     A                                      sor":"true","header height":"40","r-
     A                                      ow height":"20","css class":"subfil-
     A                                      egrid","css class 2":"profound-conv-
     A                                      erted","parent tab panel":"F2400F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","subfile end":{"fieldName":"95","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"page down response":{"fieldN-
     A                                      ame":"*IN01","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"page up response":{"fi-
     A                                      eldName":"*IN02","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"show paging contro-
     A                                      ls":"true","scrollbar":"none","numb-
     A                                      er of rows":"9","top":"310px","left-
     A                                      ":"276px","column widths":"28,511,4-
     A                                      2","return mode":{"fieldName":"SFLM-
     A                                      OD","dataLength":"1","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none"},"subfile reco-
     A                                      rd number":{"fieldName":"SCRRN1","d-
     A                                      esignValue":"[SCRRN1]","dataType":"-
     A                                      zoned","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"true","curSym":"","units":-
     A                                      "","negNum":"-999.00","dataLength":-
     A                                      "4","decPos":"0"}},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF03","field t-
     A                                      ype":"button","value":"F3","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF05","field type":"button","v-
     A                                      alue":"F5","shortcut key":"F5","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF06","fiel-
     A                                      d type":"button","value":"F6","shor-
     A                                      tcut key":"F6","left":"14px","top":-
     A                                      "249px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF07","field type":"button"-
     A                                      ,"value":"F7","shortcut key":"F7","-
     A                                      left":"14px","top":"282px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF08","f-
     A                                      ield type":"button","value":"F8","s-
     A                                      hortcut key":"F8","left":"14px","to-
     A                                      p":"315px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF11","field type":"butt-
     A                                      on","value":"F11","shortcut key":"F-
     A                                      11","left":"14px","top":"348px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","css class-
     A                                      ":"button","cursor":"default","valu-
     A                                      e":"F12","shortcut key":"F12","left-
     A                                      ":"15px","top":"380px","height":"23-
     A                                      px","width":"100px","auto arrange":-
     A                                      "true"},{"id":"btnCF17","field type-
     A                                      ":"button","value":"F17","shortcut -
     A                                      key":"F17","left":"15px","top":"410-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "SCRULE","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCRULE","designValue":"[-
     A                                      SCRULE]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"9","decPos":"-
     A                                      0"},"left":"-58px","top":"-379px","-
     A                                      width":"63px","text align":"right",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR01S","column":"0"')
     A                                  1 10HTML('},{"id":"SCDBRR","field type"-
     A                                      :"output field","visibility":"hidde-
     A                                      n","value":{"fieldName":"SCDBRR","d-
     A                                      esignValue":"[SCDBRR]","dataType":"-
     A                                      zoned","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"true","curSym":"","units":-
     A                                      "","negNum":"-999.00","dataLength":-
     A                                      "9","decPos":"0"},"left":"-58px","t-
     A                                      op":"-379px","width":"63px","text a-
     A                                      lign":"right","css class":"profound-
     A                                      -converted","grid":"SCR01S","column-
     A                                      ":"0"},{"id":"SCPCAT","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"SCPCAT","de-
     A                                      signValue":"[SCPCAT]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none","dataLength":-
     A                                      "10"},"left":"-45px","top":"-379px"-
     A                                      ,"css class":"profound-converted","-
     A                                      grid":"SCR01S","column":"0"},{"id":-
     A                                      "SCEFDT","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCEFDT","designValue":"[-
     A                                      SCEFDT]","refField":"DT7","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"true","curSym":"","-
     A                                      units":"","negNum":"-999.00"},"left-
     A                                      ":"-44px","top":"-379px","width":"4-
     A                                      9px","text align":"right","css clas-
     A                                      s":"profound-converted","grid":"SCR-
     A                                      01S","column":"0"},{"id":"SCPAGE","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "SCPAGE","designValue":"[SCPAGE]","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"true","zeroFill":"true","curSym":-
     A                                      "","units":"","negNum":"-999.00","d-
     A                                      ataLength":"3","decPos":"0"},"left"-
     A                                      :"-16px","top":"-379px","width":"21-
     A                                      px","text align":"right","css class-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      1S","column":"0"},{"id":"SCPTY","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      CPTY","designValue":"[SCPTY]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"true","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"3","decPos":"0"},"left":"-1-
     A                                      6px","top":"-379px","width":"21px",-
     A                                      "text align":"right","css class":"p-
     A                                      rofound-converted","grid":"SCR01S",-
     A                                      "column":"0"},{"id":"SCSEL","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCSEL","designValue":"[-
     A                                      SCSEL]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase","dataLength":"2"},"tex-
     A                                      t transform":"uppercase","left":"5p-
     A                                      x","cursor column":"2","top":"1px",-
     A                                      "cursor row":"13","width":"15px","s-
     A                                      et focus":{"fieldName":"07","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":{"fieldName":"05","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"RI","customFalse"-
     A                                      :""},"description":"Selection Field-
     A                                      ","css class 4":"profound-converted-
     A                                      ","grid":"SCR01S","column":"0"},{"i-
     A                                      d":"SCDATA","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCDATA",-
     A                                      "designValue":"[SCDATA]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"72"},"css class":"output-field-
     A                                      ","left":"5px","cursor column":"6",-
     A                                      "top":"1px","cursor row":"13","css -
     A                                      class 2":"profound-converted","grid-
     A                                      ":"SCR01S","column":"1"},{"id":"SCS-
     A                                      TAT","field type":"output field","v-
     A                                      alue":{"fieldName":"SCSTAT","design-
     A                                      Value":"[SCSTAT]","refField":"FLAG"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"5px","cursor column":"79","-
     A                                      top":"1px","cursor row":"13","css c-
     A                                      lass 2":"profound-converted","grid"-
     A                                      :"SCR01S","column":"2"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCHDL1        78A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST1         9A  H
     A            SCPST2        10A  H
     A            SCPST3         9A  H
     A            SCPST4         8A  H
     A            SCPST5         8A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCPSTA         8A  H
     A            SCPSTB         3A  H
     A            SCPSTC         3A  H
     A            SCRRN1         4S 0H
     A            SCST           2A  H
     A            SCSTDS        50A  H
     A            SFLMOD         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    22C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      2-23"},"items":[{"id":"F2400F_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "F2400F_SCR01_action","field type":-
     A                                      "html container","white space":"nor-
     A                                      mal","left":"0px","top":"10px","wid-
     A                                      th":"230px","css class":"action-pan-
     A                                      el-converted","height":"700px","htm-
     A                                      l":"<div class=\"top\"></div><div c-
     A                                      lass=\"imagetop\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_top.png\"-
     A                                       /></div><div class=\"menulinks\"><-
     A                                      /div><div class=\"imagebottom\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_bottom.png\" /></div><div clas-
     A                                      s=\"bottom\"></div>"},{"field type"-
     A                                      :"icon menu button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"32px","z index":"20","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1170px","id":"F2400F_SCR01_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon source":"/profoundu-
     A                                      i/userdata/images/systool/systools.-
     A                                      png","data function":"SystemToolbar-
     A                                      Systools","show down arrow":"Yes"},-
     A                                      {"field type":"panel","panel style"-
     A                                      :"TransformButtonBar","id":"F2400F_-
     A                                      SCR01_ButtonBar","top":"35px","left-
     A                                      ":"1036px","width":"187px","height"-
     A                                      :"28px","css class":"stationary","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      40px","id":"F2400F_SCR01_BtnSave","-
     A                                      tool tip":"Save","onclick":"SystemT-
     A                                      oolbarSave","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/save.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1066px","id":"F2400F_SCR01_Btn-
     A                                      Refresh","tool tip":"Refresh","oncl-
     A                                      ick":"SystemToolbarRefresh","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/refresh.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1092px","id-
     A                                      ":"F2400F_SCR01_BtnSearch","tool ti-
     A                                      p":"Search","onclick":"SystemToolba-
     A                                      rSearch","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /search.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1118px","id":"F2400F_SCR01_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F2400F_SCR01_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button"')
     A                                  1  4HTML(',"css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F2400F_SCR01_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"F2-
     A                                      400F_SCR01_ImgSysToolBottom","field-
     A                                       type":"image","image source":"/pro-
     A                                      foundui/userdata/images/systool/but-
     A                                      barbot.png","left":"1036px","top":"-
     A                                      64px","width":"187px","locked in pl-
     A                                      ace":"true","css class":"stationary-
     A                                      ","visibility":"hidden"},{"id":"F24-
     A                                      00F_SCR01_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":"Tab 1","activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2400F_SCR01_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"F2400F_SCR01_fkeyMenu","fiel-
     A                                      d type":"menu","left":"10px","top":-
     A                                      "120px","height":"350px","width":"2-
     A                                      30px","hover background color":"#9A-
     A                                      AA61","hover text color":"#FFFFFF",-
     A                                      "border color":"#4C6106","menu opti-
     A                                      on indent":"10px","background color-
     A                                      ":"#758B27","css class":"action-men-
     A                                      u","css class 2":"stationary","z in-
     A                                      dex":"101"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F2400F_SCR01_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F2400F_SCR01_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2400F_SCR01_BtnHiddenDiaryItem-
     A                                      s","value":"btnDiary","top":"175px"-
     A                                      ,"response":{"fieldName":"btnDiary"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F2400F_SCR0-
     A                                      1_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F2400F_SCR01_BtnHi-
     A                                      ddenWorkSubmitJob","value":"btnWrks-
     A                                      bmjob","top":"225px","response":{"f-
     A                                      ieldName":"btnWrkJob","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F2400F_SCR01_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F2400F_SCR01_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2400-
     A                                      F_SCR01_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCFKL1","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFKL1","designValue"-
     A                                      :"[SCFKL1]","dataType":"char","form-
     A                                      atting":"Text","trimLeadin')
     A                                  1  5HTML('g":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"none","dataLen-
     A                                      gth":"78"},"left":"281px","cursor c-
     A                                      olumn":"2","top":"530px","cursor ro-
     A                                      w":"22","css class":"BLU","parent t-
     A                                      ab panel":"F2400F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","visibility":"h-
     A                                      idden","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCFKL2","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCFKL2","designValue":"[SCFKL2]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"78"},"left":"281px",-
     A                                      "cursor column":"2","top":"550px","-
     A                                      cursor row":"23","css class":"BLU",-
     A                                      "parent tab panel":"F2400F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","visib-
     A                                      ility":"hidden","css class 2":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnPAGEDOWN","field-
     A                                       type":"button","value":"Page Down"-
     A                                      ,"shortcut key":"PageDown","respons-
     A                                      e":{"fieldName":"*IN01","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnPAGEUP","field type-
     A                                      ":"button","value":"Page Up","short-
     A                                      cut key":"PageUp","response":{"fiel-
     A                                      dName":"*IN02","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"14px","top":"-
     A                                      216px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        72A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      1    8 RSFLSIZ    1    C1    9 1   -
     A                                       RSFLNXTCHG 0     2    ROVERLAY   0-
     A                                           RROWS      2    C1    1C2    1-
     A                                      5 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-15"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"F2400F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"F2400F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"F2400F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"F2-
     A                                      400F_SCR02C_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"F2400F_SCR02C_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"F2400F_SC-
     A                                      R02C_BtnRefresh","tool tip":"Refres-
     A                                      h","onclick":"SystemToolbarRefresh"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/refresh-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"109-
     A                                      2px","id":"F2400F_SCR02C_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"F2400F_S-
     A                                      CR02C_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","v')
     A                                  1  4HTML('isibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"F2400F_SCR02C_BtnSystemMessages"-
     A                                      ,"tool tip":"System Messages","oncl-
     A                                      ick":"SystemToolbarMessages","backg-
     A                                      round image":{"fieldName":"MsgIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1196px","id":"F240-
     A                                      0F_SCR02C_BtnHelp","tool tip":"Help-
     A                                      ","onclick":"SystemToolbarHelp","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/help.png'')-
     A                                      "},{"id":"F2400F_SCR02C_ImgSysToolB-
     A                                      ottom","field type":"image","image -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/butbarbot.png","left":"10-
     A                                      36px","top":"64px","width":"187px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      "},{"id":"F2400F_SCR02C_MainTabPane-
     A                                      l","field type":"tab panel","tab pa-
     A                                      nel style":"Transform","tab names":-
     A                                      {"fieldName":"SCPRD2","designValue"-
     A                                      :"[SCPRD2]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2400F_SCR02C_Bt-
     A                                      nHiddenSave","value":"btnSave","top-
     A                                      ":"100px","response":{"fieldName":"-
     A                                      btnSave","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant20","field -
     A                                      type":"output field","left":"281px"-
     A                                      ,"cursor column":"2","top":"110px",-
     A                                      "cursor row":"1","css class":"top-l-
     A                                      ine","value":"js: currentUser()","c-
     A                                      ss class 2":"output-field","parent -
     A                                      tab panel":"F2400F_SCR02C_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCR02-
     A                                      C_SCCONM","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCCONM","d-
     A                                      esignValue":"[SCCONM]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"110px","cursor row":"1-
     A                                      ","css class 2":"top-line","css cla-
     A                                      ss 3":"HI","parent tab panel":"F240-
     A                                      0F_SCR02C_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant21","field ty-
     A                                      pe":"output field","left":"778px","-
     A                                      cursor column":"73","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"F2400F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"F2400F-
     A                                      _SCR02C_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F2400F_SCR02-
     A                                      C_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"Q1PGM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"Q1PGM","designValue-
     A                                      ":"[Q1PGM]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"10"},"cs-
     A                                      s class":"output-field","left":"281-
     A                                      px","cursor column":"2","top":"130p-
     A                                      x","cursor row":"2","parent tab pan-
     A                                      el":"F2400F_SCR02C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCPRD2","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCPRD2","designValue":"[-
     A                                      SCPRD2]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"4-
     A                                      14px","cursor column":"21","top":"1-
     A                                      30px","cursor row":"2","css class 2-
     A                                      ":"HI","parent tab panel":"F2400F_S-
     A                                      CR02C_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant22","fie')
     A                                  1  5HTML('ld type":"output field","valu-
     A                                      e":"SCR02","css class":"constant","-
     A                                      left":"799px","cursor column":"76",-
     A                                      "top":"130px","cursor row":"2","par-
     A                                      ent tab panel":"F2400F_SCR02C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F2400F_SCR02C_BtnHid-
     A                                      denSearch","value":"btnSearch","top-
     A                                      ":"150px","response":{"fieldName":"-
     A                                      btnSearch","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant23","fiel-
     A                                      d type":"output field","value":"Pre-
     A                                      ss Enter to confirm your choices fo-
     A                                      r 4=Delete.","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"170px","cursor row":"4","cs-
     A                                      s class 2":"BLU","parent tab panel"-
     A                                      :"F2400F_SCR02C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F2400F_SCR02C_BtnHiddenDiaryItems"-
     A                                      ,"value":"btnDiary","top":"175px","-
     A                                      response":{"fieldName":"btnDiary","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant24","field type":"out-
     A                                      put field","value":"Press F12 to re-
     A                                      turn to change your choices.","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"190px","cu-
     A                                      rsor row":"5","css class 2":"BLU","-
     A                                      parent tab panel":"F2400F_SCR02C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F2400F_SCR02C_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px","response":{"-
     A                                      fieldName":"btnMessage","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F2400F_SCR02C_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCR02C_SCH-
     A                                      DL1","field type":"output field","v-
     A                                      alue":{"fieldName":"SCHDL1","design-
     A                                      Value":"[SCHDL1]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"78-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"230px","cursor row":"7","css clas-
     A                                      s 2":"HI","parent tab panel":"F2400-
     A                                      F_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted","css class 4":"subfile-heading-
     A                                      "},{"id":"SCR02S","field type":"gri-
     A                                      d","number of columns":"2","record -
     A                                      format name":"SCR02S","subfile next-
     A                                       changed":"true","display subfile":-
     A                                      {"fieldName":"14","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"display c-
     A                                      ontrol record":{"fieldName":"N13","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"clear subfile":{"fieldName":-
     A                                      "13","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"subfile size":"9","hea-
     A                                      der height":"20","row height":"20",-
     A                                      "css class":"subfilegrid","css clas-
     A                                      s 2":"profound-converted","parent t-
     A                                      ab panel":"F2400F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","subfile end":-
     A                                      {"fieldName":"N15","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"page dow-
     A                                      n response":{"fieldName":"*IN01","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"pa-
     A                                      ge up response":{"fieldName":"*IN02-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"show paging controls":"true","scr-
     A                                      ollbar":"none","number of rows":"9"-
     A                                      ,"top":"230px","left":"276px","colu-
     A                                      mn widths":"28,539","subfile record-
     A                                       number":{"fieldName":"SCRRN2","des-
     A                                      ignValue":"[SCRRN2]","dataType":"zo-
     A                                      ned","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"true","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","dataLength":"4-
     A                                      ","decPos":"0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F2400F_SCR02C_BtnHiddenWorkPri-
     A                                      nterOutput","value":"btnWrkprtout",-
     A                                      "top":"250px","response":{"fieldNam-
     A                                      e":"btnWrkPrnt","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button"')
     A                                  1  6HTML(',"cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2400F_SCR02C_Bt-
     A                                      nHiddenImageQueue","value":"btnImgQ-
     A                                      ue","top":"302px","response":{"fiel-
     A                                      dName":"btnImgQue","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F2400F_SCR02C_BtnHiddenHelp"-
     A                                      ,"value":"btnHelp","top":"327px","r-
     A                                      esponse":{"fieldName":"btnHelp","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"150px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F12","field type":"button","value":-
     A                                      "Cancel","shortcut key":"F12","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"SCR02S_SCDBRR",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"SCDBRR","designValue":"[SCDBRR]",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"true","curSym"-
     A                                      :"","units":"","negNum":"-999.00","-
     A                                      dataLength":"9","decPos":"0"},"left-
     A                                      ":"-58px","top":"-279px","width":"6-
     A                                      3px","text align":"right","css clas-
     A                                      s":"profound-converted","grid":"SCR-
     A                                      02S","column":"0"},{"id":"SCSF1R","-
     A                                      field type":"output field","visibil-
     A                                      ity":"hidden","value":{"fieldName":-
     A                                      "SCSF1R","designValue":"[SCSF1R]","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"true","zeroFill":"true","curSym":-
     A                                      "","units":"","negNum":"-999.00","d-
     A                                      ataLength":"4","decPos":"0"},"left"-
     A                                      :"-23px","top":"-279px","width":"28-
     A                                      px","text align":"right","css class-
     A                                      ":"profound-converted","grid":"SCR0-
     A                                      2S","column":"0"},{"id":"SCR02S_SCS-
     A                                      EL","field type":"output field","va-
     A                                      lue":{"fieldName":"SCSEL","designVa-
     A                                      lue":"[SCSEL]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"2"},"-
     A                                      css class":"output-field","left":"5-
     A                                      px","cursor column":"2","top":"1px"-
     A                                      ,"cursor row":"8","description":"Se-
     A                                      lection Field","css class 2":"profo-
     A                                      und-converted","grid":"SCR02S","col-
     A                                      umn":"0"},{"id":"SCR02S_SCDATA","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCDATA","designValue":"-
     A                                      [SCDATA]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none","dataLength":"72"},"css -
     A                                      class":"output-field","left":"5px",-
     A                                      "cursor column":"6","top":"1px","cu-
     A                                      rsor row":"8","css class 2":"profou-
     A                                      nd-converted","grid":"SCR02S","colu-
     A                                      mn":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"F2400F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"F2400F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      F2400F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/systools.png","data functi-
     A                                      on":"SystemToolbarSystools","show d-
     A                                      own arrow":"Yes"},{"field type":"pa-
     A                                      nel","panel style":"TransformButton-
     A                                      Bar","id":"F2400F_SCR02_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"F2400-
     A                                      F_SCR02_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"F2400F_SCR02_BtnRefresh","tool ti-
     A                                      p":"Refresh","onclick":"SystemToolb-
     A                                      arRefresh","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/refresh.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1092px","id":"F2400F_SCR02_B-
     A                                      tnSearch","tool tip":"Search","oncl-
     A                                      ick":"SystemToolbarSearch","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/search.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1118px","id":-
     A                                      "F2400F_SCR02_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"F240-
     A                                      0F_SCR02_BtnSystemMessages","tool t-
     A                                      ip":"System Messages","onclick":"Sy-
     A                                      stemToolbarMessages","background im-
     A                                      age":{"fieldName":"MsgIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"sta')
     A                                  1  4HTML('tionary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"F2400F_SCR02_BtnHelp","tool tip"-
     A                                      :"Help","onclick":"SystemToolbarHel-
     A                                      p","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/help.-
     A                                      png'')"},{"id":"F2400F_SCR02_ImgSys-
     A                                      ToolBottom","field type":"image","i-
     A                                      mage source":"/profoundui/userdata/-
     A                                      images/systool/butbarbot.png","left-
     A                                      ":"1036px","top":"64px","width":"18-
     A                                      7px","locked in place":"true","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden"},{"id":"F2400F_SCR02_MainTab-
     A                                      Panel","field type":"tab panel","ta-
     A                                      b panel style":"Transform","tab nam-
     A                                      es":"Tab 1","active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2400F-
     A                                      _SCR02_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"F2400F_SCR-
     A                                      02_fkeyMenu","field type":"menu","l-
     A                                      eft":"10px","top":"120px","height":-
     A                                      "350px","width":"230px","hover back-
     A                                      ground color":"#9AAA61","hover text-
     A                                       color":"#FFFFFF","border color":"#-
     A                                      4C6106","menu option indent":"10px"-
     A                                      ,"background color":"#758B27","css -
     A                                      class":"action-menu","css class 2":-
     A                                      "stationary","z index":"101"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F2400F_SCR02_BtnH-
     A                                      iddenRefresh","value":"btnRefresh",-
     A                                      "top":"125px","response":{"fieldNam-
     A                                      e":"btnRefresh","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2400F_SCR02_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F2400F_SCR02_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F2400F_SCR02_BtnHiddenSystem-
     A                                      Messages","value":"btnMessage","top-
     A                                      ":"200px","response":{"fieldName":"-
     A                                      btnMessage","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      F2400F_SCR02_BtnHiddenWorkSubmitJob-
     A                                      ","value":"btnWrksbmjob","top":"225-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Job","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F2400F_-
     A                                      SCR02_BtnHiddenWorkPrinterOutput","-
     A                                      value":"btnWrkprtout","top":"250px"-
     A                                      ,"response":{"fieldName":"btnWrkPrn-
     A                                      t","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F2400F_SC-
     A                                      R02_BtnHiddenImageQueue","value":"b-
     A                                      tnImgQue","top":"275px","response":-
     A                                      {"fieldName":"btnImgQue","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2400F_SCR02_BtnHidden-
     A                                      Help","value":"btnHelp","top":"300p-
     A                                      x","response":{"fieldName":"btnHelp-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"btnSubmit","field type":"b-
     A                                      utton","value":"Enter","shortcut ke-
     A                                      y":"Enter","left":"14px","top":"150-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","aut')
     A                                  1  5HTML('o arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnPAGEDOWN","field-
     A                                       type":"button","value":"Page Down"-
     A                                      ,"shortcut key":"PageDown","respons-
     A                                      e":{"fieldName":"*IN01","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnPAGEUP","field type-
     A                                      ":"button","value":"Page Up","short-
     A                                      cut key":"PageUp","response":{"fiel-
     A                                      dName":"*IN02","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"14px","top":"-
     A                                      216px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02 71
     A  75                                  CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    19 RER-
     A                                      RMSGID  5    C6    SSEFDTC7    MCR0-
     A                                      500C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     75RERRMSGID  5    C5    SS-
     A                                      SYSC7    MCR0460C6    FSMESGC5    *-
     A                                      LIBLC0    E1    3     71')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"2","window left":"4","return cur-
     A                                      sor record":{"fieldName":"HREC","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor fiel-
     A                                      d":{"fieldName":"HFLD","dataLength"-
     A                                      :"10","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none"},"overlay range":"1-19"},"ite-
     A                                      ms":[{"id":"HFLD","field type":"out-
     A                                      put field","visibility":"hidden","v-
     A                                      alue":{"fieldName":"HFLD","designVa-
     A                                      lue":"[HFLD]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none","dataLength":"10"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"HREC-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"HREC","designValue":"[HREC]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none","d-
     A                                      ataLength":"10"},"left":"0px","top"-
     A                                      :"-30px","css class":"profound-conv-
     A                                      erted"},{"id":"SCR03","field type":-
     A                                      "panel","panel style":"Transform Di-
     A                                      alog","text align":"center","left":-
     A                                      "5px","top":"5px","height":"530px",-
     A                                      "width":"534px","z index":"8","lock-
     A                                      ed in place":"true"},{"id":"SCUSER"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCUSER","designValu-
     A                                      e":"[SCUSER]","refField":"USER","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"29px","cursor column":"2","top"-
     A                                      :"65px","cursor row":"1","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRD3","field type":"output field","-
     A                                      value":{"fieldName":"SCPRD3","desig-
     A                                      nValue":"[SCPRD3]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"127px","cursor column":"16-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant25"-
     A                                      ,"field type":"output field","value-
     A                                      ":"SCR03","css class":"constant","l-
     A                                      eft":"477px","cursor column":"66","-
     A                                      top":"65px","cursor row":"1","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant26","field type":"output -
     A                                      field","value":"Description (contai-
     A                                      ns)    :","css class":"constant","l-
     A                                      eft":"36px","cursor column":"3","to-
     A                                      p":"105px","cursor row":"3","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SSSTDS","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SSSTDS"-
     A                                      ,"designValue":"[SSSTDS]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase","dat-
     A                                      aLength":"40"},"text transform":"up-
     A                                      percase","left":"232px","cursor col-
     A                                      umn":"31","top":"105px","cursor row-
     A                                      ":"3","width":"281px","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant27","field type":"output field",-
     A                                      "value":"Effective date            -
     A                                      :","css class":"constant","left":"3-
     A                                      6px","cursor column":"3","top":"145-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "profound-converted"},{"id":"SSEFDT-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SSEFDT","desig-
     A                                      nValue":"[SSEFDT]","refField":"A80"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","edtWrd":"''  /  /   0''"},"l-
     A                                      eft":"232px","cursor column":"31","-
     A                                      top":"145px","cursor row":"5","widt-
     A                                      h":"71px","error message id":"MCR05-
     A                                      00","error message file":"FSMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"75","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant28","field type":"output fie-
     A                                      ld","value":"Procedure category    -
     A                                          :","css class":"constant","left-
     A                                      ":"36px","cursor column":"3","top":-
     A                                      "185px","cursor row":"7","css class-
     A                                       2":"profound-converted"},{"id":"SS-
     A                                      PCAT","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SSPCAT","d-
     A                                      esignValue":"[SSPCAT]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"10"},"text transform":"upper-
     A                                      case","left":"232px","cursor column-
     A                                      ":"31","top":"185px","cursor row":"-
     A                                      7","width":"71px","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      9","field type":"output fi')
     A                                  1  4HTML('eld","value":"EOB code       -
     A                                                 :","css class":"constant-
     A                                      ","left":"36px","cursor column":"3"-
     A                                      ,"top":"225px","cursor row":"9","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SSEOB","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SSEO-
     A                                      B","designValue":"[SSEOB]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"3"},"text transform":"up-
     A                                      percase","left":"232px","cursor col-
     A                                      umn":"31","top":"225px","cursor row-
     A                                      ":"9","width":"22px","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt30","field type":"output field","-
     A                                      value":"Error message             :-
     A                                      ","css class":"constant","left":"36-
     A                                      px","cursor column":"3","top":"265p-
     A                                      x","cursor row":"11","css class 2":-
     A                                      "profound-converted"},{"id":"SSMESG-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SSMESG","desig-
     A                                      nValue":"[SSMESG]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","dataLength-
     A                                      ":"7"},"text transform":"uppercase"-
     A                                      ,"left":"232px","cursor column":"31-
     A                                      ","top":"265px","cursor row":"11","-
     A                                      width":"50px","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant31","-
     A                                      field type":"output field","value":-
     A                                      "Rule Priority             :","css -
     A                                      class":"constant","left":"36px","cu-
     A                                      rsor column":"3","top":"305px","cur-
     A                                      sor row":"13","css class 2":"profou-
     A                                      nd-converted"},{"id":"SSPTY","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SSPTY","designValue":"-
     A                                      [SSPTY]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","dataLength":"3","decPos"-
     A                                      :"0"},"left":"232px","cursor column-
     A                                      ":"31","top":"305px","cursor row":"-
     A                                      13","width":"22px","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      32","field type":"output field","va-
     A                                      lue":"System type (P/H/D/X)     :",-
     A                                      "css class":"constant","left":"36px-
     A                                      ","cursor column":"3","top":"345px"-
     A                                      ,"cursor row":"15","css class 2":"p-
     A                                      rofound-converted"},{"id":"SSSYS","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SSSYS","designVal-
     A                                      ue":"[SSSYS]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase","dataLength":"1"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"232px","cursor column":"31","to-
     A                                      p":"345px","cursor row":"15","width-
     A                                      ":"8px","error message id":"MCR0460-
     A                                      ","error message file":"FSMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"71","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant33","field type":"output field-
     A                                      ","value":"Status                  -
     A                                        :","css class":"constant","left":-
     A                                      "36px","cursor column":"3","top":"3-
     A                                      85px","cursor row":"17","css class -
     A                                      2":"profound-converted"},{"id":"SSS-
     A                                      TAT","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SSSTAT","de-
     A                                      signValue":"[SSSTAT]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase","dataLen-
     A                                      gth":"1"},"text transform":"upperca-
     A                                      se","left":"232px","cursor column":-
     A                                      "31","top":"385px","cursor row":"17-
     A                                      ","width":"8px","css class 3":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"490px","width":"80px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF10","field type-
     A                                      ":"button","value":"Search","shortc-
     A                                      ut key":"F10","left":"104px","top":-
     A                                      "490px","width":"80px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"194px","top":"490px","wi-
     A                                      dth":"80px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnPAGE-
     A                                      DOWN","field type":"button","value"-
     A                                      :"Page Down","shortcut key":"PageDo-
     A                                      wn","response":{"fieldName":"*IN01"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"284px","top":"490px","width-
     A                                      ":"80px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","v-
     A                                      isibility":"hidden","cursor":"defau-
     A                                      lt"},{"id":"btnPAGEUP","field type"-
     A                                      :"button","value":"Page Up","shortc-
     A                                      ut key":"PageUp","response":{"field-
     A                                      Name":"*IN02","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"left":"374px","top":"-
     A                                      490px","width":"80px","height":"23p-
     A                                      x","css class":"button","a')
     A                                  1  5HTML('uto arrange":"true","visibili-
     A                                      ty":"hidden","cursor":"default"}]}')
     A            HFLD          10A  H
     A            HREC          10A  H
     A            SSEOB          3A  H
     A            SSMESG         7A  H
     A            SSPCAT        10A  H
     A            SSPTY          3S 0H
     A            SSSTAT         1A  H
     A            SSSTDS        40A  H
     A            SSSYS          1A  H
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A            SSEFDT    R        H      REFFLD(A80)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"F2400F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"F2400F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"F2400F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"F2400F_MSGSFLC_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"F2400F_MSGSFLC_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"F2400F_MSGSFLC_BtnRef-
     A                                      resh","tool tip":"Refresh","onclick-
     A                                      ":"SystemToolbarRefresh","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/refresh.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1092px","id":"-
     A                                      F2400F_MSGSFLC_BtnSearch","tool tip-
     A                                      ":"Search","onclick":"SystemToolbar-
     A                                      Search","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      search.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1118px","id":"F2400F_MSGSFLC_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1144px","id":"F2400F_MSGSFLC_BtnSys-
     A                                      temMessages","tool tip":"System Mes-
     A                                      sages","onclick":"SystemToolbarMess-
     A                                      ages","background image":{"fieldNam-
     A                                      e":"MsgIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"butt')
     A                                  1  4HTML('on","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1196px","id":"F2400F_MSGSF-
     A                                      LC_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/help.png'')"},{"id-
     A                                      ":"F2400F_MSGSFLC_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"F2400F_MSGSFLC_MainTabPanel","f-
     A                                      ield type":"tab panel","tab panel s-
     A                                      tyle":"Transform","tab names":"Tab -
     A                                      1","active tab":"0","left":"250px",-
     A                                      "top":"70px","width":"970px","heigh-
     A                                      t":"657px","z index":"8","locked in-
     A                                       place":"true","css class":"tab-pan-
     A                                      el","css class 2":"stationary"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F2400F_MSGSFLC_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"F2400F_MSGSFLC_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2400F_MSGSFLC_BtnHidd-
     A                                      enRefresh","value":"btnRefresh","to-
     A                                      p":"125px","response":{"fieldName":-
     A                                      "btnRefresh","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F2400F_MSGSFLC_BtnHiddenSearch","v-
     A                                      alue":"btnSearch","top":"150px","re-
     A                                      sponse":{"fieldName":"btnSearch","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F2400F_MSGSFLC-
     A                                      _BtnHiddenDiaryItems","value":"btnD-
     A                                      iary","top":"175px","response":{"fi-
     A                                      eldName":"btnDiary","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F2400F_MSGSFLC_BtnHiddenSys-
     A                                      temMessages","value":"btnMessage","-
     A                                      top":"200px","response":{"fieldName-
     A                                      ":"btnMessage","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F2400F_MSGSFLC_BtnHiddenWorkSubm-
     A                                      itJob","value":"btnWrksbmjob","top"-
     A                                      :"225px","response":{"fieldName":"b-
     A                                      tnWrkJob","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F2-
     A                                      400F_MSGSFLC_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F2-
     A                                      400F_MSGSFLC_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F2400F_MSGSFL-
     A                                      C_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"MSGSFL","field -
     A                                      type":"grid","number of columns":"1-
     A                                      ","record format name":"MSGSFL","di-
     A                                      splay subfile":"true","dis')
     A                                  1  5HTML('play control record":"true","-
     A                                      subfile size":"5","initialize subfi-
     A                                      le":"true","row height":"20","css c-
     A                                      lass":"subfilegrid","css class 2":"-
     A                                      profound-converted","parent tab pan-
     A                                      el":"F2400F_MSGSFLC_MainTabPanel","-
     A                                      parent tab":"0","subfile end":{"fie-
     A                                      ldName":"N10","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"number of row-
     A                                      s":"1","has header":"false","subfil-
     A                                      e program message queue":{"fieldNam-
     A                                      e":"Q1PGM","dataLength":"10","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"subf-
     A                                      ile control program message queue":-
     A                                      {"fieldName":"Q1PGM","dataLength":"-
     A                                      10","trimLeading":"false","trimTrai-
     A                                      ling":"true","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"},"subfile message key":{"fieldN-
     A                                      ame":"MSGKEY","dataLength":"4","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"to-
     A                                      p":"570px","left":"269px","column w-
     A                                      idths":"595"},{"id":"btnSubmit","fi-
     A                                      eld type":"button","value":"Enter",-
     A                                      "shortcut key":"Enter","left":"14px-
     A                                      ","top":"150px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnPAGEDOWN","field ty-
     A                                      pe":"button","value":"Page Down","s-
     A                                      hortcut key":"PageDown","response":-
     A                                      {"fieldName":"*IN01","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnPAGEUP","field type":"-
     A                                      button","value":"Page Up","shortcut-
     A                                       key":"PageUp","response":{"fieldNa-
     A                                      me":"*IN02","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"216-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
