     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  09 40 71
     A  90 72 73
     A  74                                  CA01
     A                                  1  2HTML('QPUIREC6    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCMED#C7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         6     71 90RERRMSGID  5    C6   -
     A                                       SCEFDTC7    MCR0503C6    FSMESGC5 -
     A                                         *LIBLC0    E1    6     72 90RERR-
     A                                      MSGID  5    C6    SCEFDTC7    MCR05-
     A                                      00C6    FSMESGC5    *LIBLC0    E1  -
     A                                        6     73 90RERRMSGID  5    C5    -
     A                                      SCMSAC7    MCR0503C6    FSMESGC5   -
     A                                       *LIBLC0    E1    6     74 90')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","overlay range":"1--
     A                                      23"},"items":[{"id":"F2524F01_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "F2524F01_SCR01_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"F2524F01_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"F25-
     A                                      24F01_SCR01_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"F2524F01_SCR01_Bt-
     A                                      nSave","tool tip":"Save","onclick":-
     A                                      "SystemToolbarSave","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/save.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1066px",')
     A                                  1  2HTML('"id":"F2524F01_SCR01_BtnRefre-
     A                                      sh","tool tip":"Refresh","onclick":-
     A                                      "SystemToolbarRefresh","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/refresh.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1092px","id":"F2-
     A                                      524F01_SCR01_BtnSearch","tool tip":-
     A                                      "Search","onclick":"SystemToolbarSe-
     A                                      arch","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/se-
     A                                      arch.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1118px","id":"F2524F01_SCR01_BtnDi-
     A                                      aryItems","tool tip":"Diary/Work It-
     A                                      ems - IDARTS","onclick":"SystemTool-
     A                                      barDiary","background image":{"fiel-
     A                                      dName":"DryIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      44px","id":"F2524F01_SCR01_BtnSyste-
     A                                      mMessages","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"F2524F01_SCR01_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"')
     A                                  1  2HTML('F2524F01_SCR01_ImgSysToolBott-
     A                                      om","field type":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/butbarbot.png","left":"1036p-
     A                                      x","top":"64px","width":"187px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      stationary","visibility":"hidden"},-
     A                                      {"id":"F2524F01_SCR01_MainTabPanel"-
     A                                      ,"field type":"tab panel","tab pane-
     A                                      l style":"Transform","tab names":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "active tab":"0","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      "657px","z index":"8","locked in pl-
     A                                      ace":"true","css class":"tab-panel"-
     A                                      ,"css class 2":"stationary"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F2524F01_SCR01_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant1","field ty-
     A                                      pe":"output field","left":"281px","-
     A                                      cursor column":"2","top":"110px","c-
     A                                      ursor row":"1","css class":"top-lin-
     A                                      e","value":"js: currentUser()","css-
     A                                       class 2":"output-field","parent ta-
     A                                      b panel":"F2524F01_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCCONM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCONM","designVal-
     A                                      ue":"[SCCONM]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","css class 3":"H-
     A                                      I","parent tab panel":"F2524F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 4":"profound-converted"},-
     A                                      {"id":"constant2","field type":"out-
     A                                      put field","left":"778px","cursor c-
     A                                      olumn":"73","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentDate()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"F2524F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"F2524F01_SCR0-
     A                                      1_fkeyMenu","field type":"menu","le-
     A                                      ft":"10px","top":"120px","height":"-
     A                                      350px","width":"230px","hover backg-
     A                                      round color":"#9AAA61","hover text -
     A                                      color":"#FFFFFF","border color":"#4-
     A                                      C6106","menu option indent":"10px",-
     A                                      "background color":"#758B27","css c-
     A                                      lass":"action-menu","css class 2":"-
     A                                      stationary","z index":"101"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","c')
     A                                  1  2HTML('ss class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F2524F01_SCR01_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"Q1PGM","field type":"outpu-
     A                                      t field","value":{"fieldName":"Q1PG-
     A                                      M","designValue":"[Q1PGM]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"10"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"F2524F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCPRDS","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCPRDS",-
     A                                      "designValue":"[SCPRDS]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"130px","cursor row":-
     A                                      "2","css class 2":"HI","parent tab -
     A                                      panel":"F2524F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","visibility":"hi-
     A                                      dden","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant3","field typ-
     A                                      e":"output field","value":"SCR01","-
     A                                      css class":"constant","left":"799px-
     A                                      ","cursor column":"76","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"F2524F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCMODE","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCMODE","designValue":"[-
     A                                      SCMODE]","refField":"PGM","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"76-
     A                                      4px","cursor column":"71","top":"15-
     A                                      0px","cursor row":"3","css class 2"-
     A                                      :"HI","parent tab panel":"F2524F01_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F2524F01_-
     A                                      SCR01_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant4","field type":"output field","-
     A                                      value":"State:","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"170px","cursor row":"4",-
     A                                      "parent tab panel":"F2524F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCST","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCST","des-
     A                                      ignValue":"[SCST]","d')
     A                                  1  2HTML('ataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"2"},"css class":-
     A                                      "output-field","left":"337px","curs-
     A                                      or column":"10","top":"170px","curs-
     A                                      or row":"4","css class 2":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"F2524F01_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCSTNM","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCSTNM","designValue":"[SC-
     A                                      STNM]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"20"},"css cla-
     A                                      ss":"output-field","left":"365px","-
     A                                      cursor column":"14","top":"170px","-
     A                                      cursor row":"4","css class 2":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"parent tab pa-
     A                                      nel":"F2524F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2524F01_SCR01_BtnHiddenDiary-
     A                                      Items","value":"btnDiary","top":"17-
     A                                      5px","response":{"fieldName":"btnDi-
     A                                      ary","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant5","field type"-
     A                                      :"output field","value":"Type infor-
     A                                      mation, press Enter.","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"190px","cursor row-
     A                                      ":"5","css class 2":"BLU","parent t-
     A                                      ab panel":"F2524F01_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2524F01_SCR01_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2524F01_SCR01_BtnHiddenWorkS-
     A                                      ubmitJob","value":"btnWrksbmjob","t-
     A                                      op":"225px","response":{"fieldName"-
     A                                      :"btnWrkJob","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant6","fie-
     A                                      ld type":"output field","value":"Me-
     A                                      dicare#                     :","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","t')
     A                                  1  2HTML('op":"230px","cursor row":"7",-
     A                                      "parent tab panel":"F2524F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCMED#","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCME-
     A                                      D#","designValue":"[SCMED#]","refFi-
     A                                      eld":"DS10","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase"},"text transf-
     A                                      orm":"uppercase","left":"505px","cu-
     A                                      rsor column":"34","top":"230px","cu-
     A                                      rsor row":"7","width":"71px","read -
     A                                      only":{"fieldName":"N40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 3":{"fieldName":"N40","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"40 o-
     A                                      r 09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"error message i-
     A                                      d":"MCR0503","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"71 and 90","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","parent tab panel":"F2524F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 6":"profound-converte-
     A                                      d"},{"id":"constant7","field type":-
     A                                      "output field","value":"Status:","c-
     A                                      ss class":"constant","left":"687px"-
     A                                      ,"cursor column":"60","top":"230px"-
     A                                      ,"cursor row":"7","parent tab panel-
     A                                      ":"F2524F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCSTAT","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCSTAT","designValue"-
     A                                      :"[SCSTAT]","refField":"STAT","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"743px","cursor column":"68"-
     A                                      ,"top":"230px","cursor row":"7","wi-
     A                                      dth":"8px","css class 3":{"fieldNam-
     A                                      e":"40 and N40","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :"true","css class 4":"PR","css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"pa-
     A                                      rent tab panel":"F2524F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant8","field ty')
     A                                  1  2HTML('pe":"output field","value":"N-
     A                                      PI#                          :","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"250px","-
     A                                      cursor row":"8","parent tab panel":-
     A                                      "F2524F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCNPI#","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCNPI#","designValue":"-
     A                                      [SCNPI#]","refField":"DS12","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e"},"text transform":"uppercase","l-
     A                                      eft":"505px","cursor column":"34","-
     A                                      top":"250px","cursor row":"8","widt-
     A                                      h":"85px","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"40","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"N40","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"N40","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"paren-
     A                                      t tab panel":"F2524F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F2524F01_SCR01_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant9","field type":"output field-
     A                                      ","value":"Effective Date          -
     A                                            :","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"270px","cursor row":"9","parent-
     A                                       tab panel":"F2524F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCE-
     A                                      FDT","field type":"date field","css-
     A                                       class":"input","css class 2":"date-
     A                                      -field","value":{"fieldName":"SCEFD-
     A                                      T","designValue":"[SCEFDT]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"8","decPos":"0","numBlankFi-
     A                                      ll":"true","edtWrd":"''  /  /    ''-
     A                                      ","dateFormat":"m/d/Y"},"left":"505-
     A                                      px","cursor column":"34","top":"270-
     A                                      px","cursor row":"9","width":"71px"-
     A                                      ,"text align":"right","read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false')
     A                                  1  2HTML('"},"css class 3":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"css class 4":"HI","c-
     A                                      ss class 5":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"error message id":"MCR0503","e-
     A                                      rror message file":"FSMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"72 and 90","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"2 messages","error -
     A                                      message id 2":"MCR0500","error mess-
     A                                      age file 2":"FSMESG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"73 and 90","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"pare-
     A                                      nt tab panel":"F2524F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"F2524F01_SCR01_BtnHi-
     A                                      ddenImageQueue","value":"btnImgQue"-
     A                                      ,"top":"275px","response":{"fieldNa-
     A                                      me":"btnImgQue","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant10",-
     A                                      "field type":"output field","value"-
     A                                      :"MSA                           :",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"290px-
     A                                      ","cursor row":"10","parent tab pan-
     A                                      el":"F2524F01_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCMSA","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCMSA","designValue"-
     A                                      :"[SCMSA]","dataType":"zoned","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00","dataLength":"4","decPo-
     A                                      s":"0","numBlankFill":"true"},"left-
     A                                      ":"505px","cursor column":"34","top-
     A                                      ":"290px","cursor row":"10","width"-
     A                                      :"29px","text align":"right","read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"css class 4":"HI","css class 5":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"error me-
     A                                      ssage id":"MCR0503","error message -
     A                                      file":"FSMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"74 and 90","dataType":"exp-
     A                                      ression","formatting"')
     A                                  1  2HTML(':"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"F2524F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2524F01_SCR01_B-
     A                                      tnHiddenHelp","value":"btnHelp","to-
     A                                      p":"300px","response":{"fieldName":-
     A                                      "btnHelp","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant11","field-
     A                                       type":"output field","value":"Skil-
     A                                      led nursing rate          :","css c-
     A                                      lass":"constant","left":"281px","cu-
     A                                      rsor column":"2","top":"310px","cur-
     A                                      sor row":"11","parent tab panel":"F-
     A                                      2524F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCSKNR","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCSKNR","designValue":"[S-
     A                                      CSKNR]","refField":"A62","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00","numBl-
     A                                      ankFill":"true"},"left":"505px","cu-
     A                                      rsor column":"34","top":"310px","cu-
     A                                      rsor row":"11","width":"50px","text-
     A                                       align":"right","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"parent -
     A                                      tab panel":"F2524F01_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 5-
     A                                      ":"profound-converted","read only":-
     A                                      {"fieldName":"09","customTrue":"","-
     A                                      customFalse":"","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"}},{"id":"cons-
     A                                      tant12","field type":"output field"-
     A                                      ,"value":"Physical therapy rate    -
     A                                           :","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"330px","cursor row":"12","parent-
     A                                       tab panel":"F2524F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCP-
     A                                      TR","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCPTR","desi-
     A                                      gnValue":"[SCPTR]","refField":"A62"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00","numBlankFill":"true"},"left":-
     A                                      "505px","cursor column":"34","top":-
     A                                      "330px","cursor row":"12","width":"-
     A                                      50px","text align":"right","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatt')
     A                                  1  2HTML('ing":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"parent tab -
     A                                      panel":"F2524F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 5":"p-
     A                                      rofound-converted","read only":{"fi-
     A                                      eldName":"09","customTrue":"","cust-
     A                                      omFalse":"","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"}},{"id":"constant-
     A                                      13","field type":"output field","va-
     A                                      lue":"Speech therapy rate          -
     A                                       :","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"3-
     A                                      50px","cursor row":"13","parent tab-
     A                                       panel":"F2524F01_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCSPTR"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCSPTR","design-
     A                                      Value":"[SCSPTR]","refField":"A62",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","numBlankFill":"true"},"left":"-
     A                                      505px","cursor column":"34","top":"-
     A                                      350px","cursor row":"13","width":"5-
     A                                      0px","text align":"right","css clas-
     A                                      s 3":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"css-
     A                                       class 4":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"parent tab panel":"F2524F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 5":"profound-converted","r-
     A                                      ead only":{"fieldName":"09","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"}},{-
     A                                      "id":"constant14","field type":"out-
     A                                      put field","value":"Occupational th-
     A                                      erapy rate     :","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"370px","cursor row":"1-
     A                                      4","parent tab panel":"F2524F01_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCOCCR","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      COCCR","designValue":"[SCOCCR]","re-
     A                                      fField":"A62","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00","numBlankFill":"t-
     A                                      rue"},"left":"505px","cursor column-
     A                                      ":"34","top":"370px","cursor row":"-
     A                                      14","width":"50px","text align":"ri-
     A                                      ght","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indF')
     A                                  1  2HTML('ormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"parent tab panel":"F2524F01_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 5":"profound-converted","re-
     A                                      ad only":{"fieldName":"09","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"}},{"-
     A                                      id":"constant15","field type":"outp-
     A                                      ut field","value":"Social services -
     A                                      rate          :","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"390px","cursor row":"15-
     A                                      ","parent tab panel":"F2524F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCSSR","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCS-
     A                                      SR","designValue":"[SCSSR]","refFie-
     A                                      ld":"A62","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00","numBlankFill":"true"-
     A                                      },"left":"505px","cursor column":"3-
     A                                      4","top":"390px","cursor row":"15",-
     A                                      "width":"50px","text align":"right"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"parent tab panel":"F25-
     A                                      24F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 5":"profound-con-
     A                                      verted","read only":{"fieldName":"0-
     A                                      9","customTrue":"","customFalse":""-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"}},{"id":"constant16","field -
     A                                      type":"output field","value":"Home -
     A                                      aid allowance            :","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"410px","curs-
     A                                      or row":"16","parent tab panel":"F2-
     A                                      524F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCHAA","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCHAA","designValue":"[SCHA-
     A                                      A]","refField":"A62","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00","numBlankF-
     A                                      ill":"true"},"left":"505px","cursor-
     A                                       column":"34","top":"410px","cursor-
     A                                       row":"16","width":"50px","text ali-
     A                                      gn":"right","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","cust')
     A                                  1  2HTML('omTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"parent tab panel":"F2524F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 5":"profound-convert-
     A                                      ed","read only":{"fieldName":"09","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"}},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF03","field type":"button",-
     A                                      "value":"Exit","shortcut key":"F3",-
     A                                      "left":"14px","top":"183px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF12","-
     A                                      field type":"button","value":"Cance-
     A                                      l","shortcut key":"F12","left":"14p-
     A                                      x","top":"216px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEFDT         8S 0H
     A            SCMSA          4S 0H
     A            SCST           2A  H
     A            SCSTNM        20A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCHAA     R        H      REFFLD(A62)
     A            SCMED#    R        H      REFFLD(DS10)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNPI#    R        H      REFFLD(DS12)
     A            SCOCCR    R        H      REFFLD(A62)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPTR     R        H      REFFLD(A62)
     A            SCSKNR    R        H      REFFLD(A62)
     A            SCSPTR    R        H      REFFLD(A62)
     A            SCSSR     R        H      REFFLD(A62)
     A            SCSTAT    R        H      REFFLD(STAT)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2524F01_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2524F01_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2524F01_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F2524F01_SCR02_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F2524F01_SCR02_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F2524F01_S')
     A                                  1  2HTML('CR02_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"F2524F01_SCR02_Btn-
     A                                      Search","tool tip":"Search","onclic-
     A                                      k":"SystemToolbarSearch","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/search.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1118px","id":"F-
     A                                      2524F01_SCR02_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"F252-
     A                                      4F01_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"F2524F01_S-
     A                                      CR02_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"F2524F01_SCR02_I')
     A                                  1  2HTML('mgSysToolBottom","field type"-
     A                                      :"image","image source":"/profoundu-
     A                                      i/userdata/images/systool/butbarbot-
     A                                      .png","left":"1036px","top":"64px",-
     A                                      "width":"187px","locked in place":"-
     A                                      true","css class":"stationary","vis-
     A                                      ibility":"hidden"},{"id":"F2524F01_-
     A                                      SCR02_MainTabPanel","field type":"t-
     A                                      ab panel","tab panel style":"Transf-
     A                                      orm","tab names":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F2524F01_SCR02_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant17","field type":"output fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentUser()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F2524-
     A                                      F01_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCR02_SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","paren-
     A                                      t tab panel":"F2524F01_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant18","field type":"output fiel-
     A                                      d","left":"778px","cursor column":"-
     A                                      73","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F2524-
     A                                      F01_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"F2524F01_SCR02_fkeyMe-
     A                                      nu","field type":"menu","left":"10p-
     A                                      x","top":"120px","height":"350px","-
     A                                      width":"230px","hover background co-
     A                                      lor":"#9AAA61","hover text color":"-
     A                                      #FFFFFF","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","css class":"a-
     A                                      ction-menu","css class 2":"stationa-
     A                                      ry","z index":"101"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class')
     A                                  1  2HTML('":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2524F-
     A                                      01_SCR02_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCR02_Q1PGM","field type":"output -
     A                                      field","value":{"fieldName":"Q1PGM"-
     A                                      ,"designValue":"[Q1PGM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F2524F01_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR02_SCPRDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"130px","cursor r-
     A                                      ow":"2","css class 2":"HI","parent -
     A                                      tab panel":"F2524F01_SCR02_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant19","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      02","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F2524F01_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR02_S-
     A                                      CMODE","field type":"output field",-
     A                                      "value":{"fieldName":"SCMODE","desi-
     A                                      gnValue":"[SCMODE]","refField":"PGM-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"764px","cursor column":"71-
     A                                      ","top":"150px","cursor row":"3","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2524F01_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F2524F01_SCR02_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F2524F01_SCR0-
     A                                      2_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},')
     A                                  1  2HTML('{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2524F-
     A                                      01_SCR02_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F2524F01_SC-
     A                                      R02_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2524F01_SCR02_B-
     A                                      tnHiddenWorkPrinterOutput","value":-
     A                                      "btnWrkprtout","top":"250px","respo-
     A                                      nse":{"fieldName":"btnWrkPrnt","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2524F01_SCR02_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F2524F01_SCR02_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit","shortcut key":"F3","left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2524F01_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2524F01_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2524F01_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F2524F01_SCR03_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F2524F01_SCR03_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F2524F01_S')
     A                                  1  2HTML('CR03_BtnRefresh","tool tip":"-
     A                                      Refresh","onclick":"SystemToolbarRe-
     A                                      fresh","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/r-
     A                                      efresh.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1092px","id":"F2524F01_SCR03_Btn-
     A                                      Search","tool tip":"Search","onclic-
     A                                      k":"SystemToolbarSearch","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/search.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1118px","id":"F-
     A                                      2524F01_SCR03_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"F252-
     A                                      4F01_SCR03_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"F2524F01_S-
     A                                      CR03_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"F2524F01_SCR03_I')
     A                                  1  2HTML('mgSysToolBottom","field type"-
     A                                      :"image","image source":"/profoundu-
     A                                      i/userdata/images/systool/butbarbot-
     A                                      .png","left":"1036px","top":"64px",-
     A                                      "width":"187px","locked in place":"-
     A                                      true","css class":"stationary","vis-
     A                                      ibility":"hidden"},{"id":"F2524F01_-
     A                                      SCR03_MainTabPanel","field type":"t-
     A                                      ab panel","tab panel style":"Transf-
     A                                      orm","tab names":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F2524F01_SCR03_BtnHiddenSave","val-
     A                                      ue":"btnSave","top":"100px","respon-
     A                                      se":{"fieldName":"btnSave","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant20","field type":"output fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentUser()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F2524-
     A                                      F01_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCR03_SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","paren-
     A                                      t tab panel":"F2524F01_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant21","field type":"output fiel-
     A                                      d","left":"778px","cursor column":"-
     A                                      73","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"F2524-
     A                                      F01_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"F2524F01_SCR03_fkeyMe-
     A                                      nu","field type":"menu","left":"10p-
     A                                      x","top":"120px","height":"350px","-
     A                                      width":"230px","hover background co-
     A                                      lor":"#9AAA61","hover text color":"-
     A                                      #FFFFFF","border color":"#4C6106","-
     A                                      menu option indent":"10px","backgro-
     A                                      und color":"#758B27","css class":"a-
     A                                      ction-menu","css class 2":"stationa-
     A                                      ry","z index":"101"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class')
     A                                  1  2HTML('":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2524F-
     A                                      01_SCR03_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "SCR03_Q1PGM","field type":"output -
     A                                      field","value":{"fieldName":"Q1PGM"-
     A                                      ,"designValue":"[Q1PGM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"css class":"output-field-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"130px","cursor row":"2","p-
     A                                      arent tab panel":"F2524F01_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR03_SCPRDS","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPR-
     A                                      DS","designValue":"[SCPRDS]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"130px","cursor r-
     A                                      ow":"2","css class 2":"HI","parent -
     A                                      tab panel":"F2524F01_SCR03_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :"hidden","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant22","fiel-
     A                                      d type":"output field","value":"SCR-
     A                                      03","css class":"constant","left":"-
     A                                      799px","cursor column":"76","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"F2524F01_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR03_S-
     A                                      CMODE","field type":"output field",-
     A                                      "value":{"fieldName":"SCMODE","desi-
     A                                      gnValue":"[SCMODE]","refField":"PGM-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"764px","cursor column":"71-
     A                                      ","top":"150px","cursor row":"3","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2524F01_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"F2524F01_SCR03_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F2524F01_SCR0-
     A                                      3_BtnHiddenDiaryItems","value":"btn-
     A                                      Diary","top":"175px","response":{"f-
     A                                      ieldName":"btnDiary","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},')
     A                                  1  2HTML('{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2524F-
     A                                      01_SCR03_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"F2524F01_SC-
     A                                      R03_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2524F01_SCR03_B-
     A                                      tnHiddenWorkPrinterOutput","value":-
     A                                      "btnWrkprtout","top":"250px","respo-
     A                                      nse":{"fieldName":"btnWrkPrnt","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2524F01_SCR03_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F2524F01_SCR03_BtnHiddenHel-
     A                                      p","value":"btnHelp","top":"300px",-
     A                                      "response":{"fieldName":"btnHelp","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"btnSubmit","field type":"butt-
     A                                      on","value":"Enter","shortcut key":-
     A                                      "Enter","left":"14px","top":"150px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF03","field type":"button","value-
     A                                      ":"Exit","shortcut key":"F3","left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
