     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  09 42 04
     A  40 41 71
     A  72 73 74                            CA01
     A  75                                  CA02
     A                                  1  2HTML('QPUIREC7    RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCOPCTC7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      OPCTC7    MCR0900C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     75RERRMSGID -
     A                                       5    C6    SCEFDTC7    MCR0556C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        73RERRMSGID  5    C6    SCEFDTC7 -
     A                                         MCR0500C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     74RERRMSGID  5    C-
     A                                      6    SCDESCC7    MCR0503C6    FSMES-
     A                                      GC5    *LIBLC0    E1    3     72')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","overlay range":"1--
     A                                      23"},"items":[{"id":"F2542F01_SCR01-
     A                                      _avKeys","field type":"output field-
     A                                      ","value":{"fieldName":"AV_KEYS","d-
     A                                      ataLength":"1134","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[AV_KEYS]"},"left":"0px","top":-
     A                                      "0px","visibility":"hidden"},{"id":-
     A                                      "F2542F01_SCR01_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"F2542F01_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon alignment":"mid-
     A                                      dle left","icon width":"16px","icon-
     A                                       height":"24px","icon source":"/pro-
     A                                      foundui/userdata/images/systool/sys-
     A                                      tools.png","data function":"SystemT-
     A                                      oolbarSystools","show down arrow":"-
     A                                      Yes"},{"field type":"panel","panel -
     A                                      style":"TransformButtonBar","id":"F-
     A                                      2542F01_SCR01_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"F2542F01_SCR01_-
     A                                      BtnSave","tool tip":"Save","onclick-
     A                                      ":"SystemToolbarSave","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/save.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1066px","id":"F2542F-
     A                                      01_SCR01_BtnRefresh","tool tip":"Re-
     A                                      fresh","onclick":"SystemToolbarRefr-
     A                                      esh","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/ref-
     A                                      resh.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1092px","id":"F2542F01_SCR01_BtnSe-
     A                                      arch","tool tip":"Search","onclick"-
     A                                      :"SystemToolbarSearch","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/search.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1118px","id":"F25-
     A                                      42F01_SCR01_BtnDiaryItems","tool ti-
     A                                      p":"Diary/Work Items - IDARTS","onc-
     A                                      lick":"SystemToolbarDiary","backgro-
     A                                      und image":{"fieldName":"DryIcnURL"-
     A                                      ,"dataLength":"128","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none"}},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1144px","id":"F2542F-
     A                                      01_SCR01_BtnSystemMessages","tool t-
     A                                      ip":"System Messages","onclick":"Sy-
     A                                      stemToolbarMessages","background im-
     A                                      age":{"fieldName":"MsgIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"fals')
     A                                  1  4HTML('e","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"F2542F01_SCR01_BtnHelp","tool ti-
     A                                      p":"Help","onclick":"SystemToolbarH-
     A                                      elp","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/hel-
     A                                      p.png'')"},{"id":"F2542F01_SCR01_Im-
     A                                      gSysToolBottom","field type":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/systool/butbarbot.png","-
     A                                      left":"1036px","top":"64px","width"-
     A                                      :"187px","locked in place":"true","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden"},{"id":"F2542F01_SCR01_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2542F-
     A                                      01_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      1","field type":"output field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"F2542F01_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","css-
     A                                       class 3":"HI","parent tab panel":"-
     A                                      F2542F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant2","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"F2542F01_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"F-
     A                                      2542F01_SCR01_fkeyMenu","field type-
     A                                      ":"menu","left":"10px","top":"120px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2542F-
     A                                      01_SCR01_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "Q1PGM","field type":"output field"-
     A                                      ,"value":{"fieldName":"Q1PGM","desi-
     A                                      gnValue":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"F2542F01_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCPR-
     A                                      DS","field type":"output field","va-
     A                                      lue":{"fieldName":"SCPRDS","designV-
     A                                      alue":"[SCPRDS]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"130px","cursor row":"2","css-
     A                                       class 2":"HI","parent tab panel":"-
     A                                      F2542F01_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","visibility":"hidden","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant3","field type":"outp-
     A                                      ut field","value":"SCR01","css clas-
     A                                      s":"constant","left":"799px","curso-
     A                                      r column":"76","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"F254-
     A                                      2F01_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCMODE","field type"-
     A                                      :"output field","value":{"')
     A                                  1  5HTML('fieldName":"SCMODE","designVa-
     A                                      lue":"[SCMODE]","refField":"PGM","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"764px","cursor column":"71","t-
     A                                      op":"150px","cursor row":"3","css c-
     A                                      lass 2":"HI","parent tab panel":"F2-
     A                                      542F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F2-
     A                                      542F01_SCR01_BtnHiddenSearch","valu-
     A                                      e":"btnSearch","top":"150px","respo-
     A                                      nse":{"fieldName":"btnSearch","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant7","field type":"output f-
     A                                      ield","value":"State:","css class":-
     A                                      "constant","left":"288px","cursor c-
     A                                      olumn":"3","top":"170px","cursor ro-
     A                                      w":"4","parent tab panel":"F2542F01-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCST","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCS-
     A                                      T","designValue":"[SCST]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"2"},"css class":"output-field-
     A                                      ","left":"344px","cursor column":"1-
     A                                      1","top":"170px","cursor row":"4","-
     A                                      parent tab panel":"F2542F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSTDS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCSTDS","-
     A                                      designValue":"[SCSTDS]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"54"},"css class":"output-field"-
     A                                      ,"left":"372px","cursor column":"15-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"F2542F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F2542F01_SCR01_Bt-
     A                                      nHiddenDiaryItems","value":"btnDiar-
     A                                      y","top":"175px","response":{"field-
     A                                      Name":"btnDiary","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F2542F01_SCR01_BtnHiddenSystem-
     A                                      Messages","value":"btnMessage","top-
     A                                      ":"200px","response":{"fieldName":"-
     A                                      btnMessage","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant4","fiel-
     A                                      d type":"output field","value":"OpC-
     A                                      ert        :","css class":"constant-
     A                                      ","left":"288px","cursor column":"3-
     A                                      ","top":"210px","cursor row":"6","p-
     A                                      arent tab panel":"F2542F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCOPCT","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCOPCT-
     A                                      ","designValue":"[SCOPCT]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"10"},"text transform":"u-
     A                                      ppercase","left":"400px","cursor co-
     A                                      lumn":"19","top":"210px","cursor ro-
     A                                      w":"6","width":"71px","css class 3"-
     A                                      :{"fieldName":"09 or 42 or 04","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"read only":{"fieldName":"N40 a-
     A                                      nd N42","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"N40 and N42","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"css c-
     A                                      lass 5":{"fieldName":"42 or N09 and-
     A                                       40","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"set focus":{"fieldNam-
     A                                      e":"41","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"error message id":"-
     A                                      MCR0503","error message file":"FSME-
     A                                      SG","error message library":"*LIBL"-
     A                                      ,"error condition":{"fieldName":"71-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"2 messages","er-
     A                                      ror message id 2":"MCR0900","error -
     A                                      message file 2":"FSMESG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"75","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"F2542F01_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant5","field type":"output field",-
     A                                      "value":"Effective date:","css clas-
     A                                      s":"constant","left":"519px","curso-
     A                                      r column":"36","top":"210p')
     A                                  1  6HTML('x","cursor row":"6","parent t-
     A                                      ab panel":"F2542F01_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCEFD-
     A                                      T","field type":"date field","css c-
     A                                      lass":"input","css class 2":"date-f-
     A                                      ield","value":{"fieldName":"SCEFDT"-
     A                                      ,"designValue":"[SCEFDT]","refField-
     A                                      ":"DT8","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"false","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"-999.00","edtWrd":"''  /  /    -
     A                                      ''","dateFormat":"m/d/Y"},"left":"6-
     A                                      31px","cursor column":"52","top":"2-
     A                                      10px","cursor row":"6","width":"71p-
     A                                      x","css class 3":{"fieldName":"09 o-
     A                                      r 42 or 40","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"read only":{"f-
     A                                      ieldName":"N40 and N42","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 4":{"fieldName":"N40 and N42-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"42 or N09 and 40","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"error-
     A                                       message id":"MCR0556","error messa-
     A                                      ge file":"FSMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"73","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"2-
     A                                       messages","error message id 2":"MC-
     A                                      R0500","error message file 2":"FSME-
     A                                      SG","error message library 2":"*LIB-
     A                                      L","error condition 2":{"fieldName"-
     A                                      :"74","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"parent tab panel":"F2542F01_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant20","field type":-
     A                                      "output field","value":"Status:","c-
     A                                      ss class":"constant","left":"757px"-
     A                                      ,"cursor column":"70","top":"210px"-
     A                                      ,"cursor row":"6","parent tab panel-
     A                                      ":"F2542F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCSTAT","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCSTAT","designValue":"[S-
     A                                      CSTAT]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"1"},"css cla-
     A                                      ss":"output-field","left":"827px","-
     A                                      cursor column":"80","top":"210px","-
     A                                      cursor row":"6","parent tab panel":-
     A                                      "F2542F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F2542F01_SCR01_BtnHiddenWorkSubmit-
     A                                      Job","value":"btnWrksbmjob","top":"-
     A                                      225px","response":{"fieldName":"btn-
     A                                      WrkJob","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant6","field ty-
     A                                      pe":"output field","value":"Name   -
     A                                             :","css class":"constant","l-
     A                                      eft":"288px","cursor column":"3","t-
     A                                      op":"230px","cursor row":"7","paren-
     A                                      t tab panel":"F2542F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      DESC","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCDESC","d-
     A                                      esignValue":"[SCDESC]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"40"},"text transform":"upper-
     A                                      case","left":"400px","cursor column-
     A                                      ":"19","top":"230px","cursor row":"-
     A                                      7","width":"281px","read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"cs-
     A                                      s class 5":"HI","error message id":-
     A                                      "MCR0503","error message file":"FSM-
     A                                      ESG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"7-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"F2542F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F2542F01_SCR01_Btn-
     A                                      HiddenWorkPrinterOutput","value":"b-
     A                                      tnWrkprtout","top":"250px","respons-
     A                                      e":{"fieldName":"btnWrkPrnt","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant8","field type":"output fi-
     A                                      eld","value":"Admission Ra')
     A                                  1  7HTML('te   :","css class":"constant-
     A                                      ","left":"288px","cursor column":"3-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"F2542F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCC001","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCC001-
     A                                      ","designValue":"[SCC001]","refFiel-
     A                                      d":"A112","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"true"-
     A                                      ,"zeroBalance":"true","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"-999.00"},"left":"421px","curso-
     A                                      r column":"22","top":"270px","curso-
     A                                      r row":"9","width":"106px","read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 4":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 5":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"parent tab panel":"F2542-
     A                                      F01_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant9","field typ-
     A                                      e":"output field","value":"Discharg-
     A                                      e Rate    :","css class":"constant"-
     A                                      ,"left":"547px","cursor column":"40-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"F2542F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCC002","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCC002-
     A                                      ","designValue":"[SCC002]","refFiel-
     A                                      d":"A112","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"true"-
     A                                      ,"zeroBalance":"true","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"-999.00"},"left":"687px","curso-
     A                                      r column":"60","top":"270px","curso-
     A                                      r row":"9","width":"106px","read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 4":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 5":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"parent tab panel":"F2542-
     A                                      F01_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2542-
     A                                      F01_SCR01_BtnHiddenImageQueue","val-
     A                                      ue":"btnImgQue","top":"275px","resp-
     A                                      onse":{"fieldName":"btnImgQue","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant10","field type":"output-
     A                                       field","value":"Statewide Price  :-
     A                                      ","css class":"constant","left":"28-
     A                                      8px","cursor column":"3","top":"290-
     A                                      px","cursor row":"10","parent tab p-
     A                                      anel":"F2542F01_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCC003","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCC003","designVa-
     A                                      lue":"[SCC003]","refField":"A112","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"true","zeroBalan-
     A                                      ce":"true","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      "},"left":"421px","cursor column":"-
     A                                      22","top":"290px","cursor row":"10"-
     A                                      ,"width":"106px","read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 3":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      4":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 5":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "parent tab panel":"F2542F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"constant11","field type":"outpu-
     A                                      t field","value":"ISAF             -
     A                                       :","css class":"constant","left":"-
     A                                      547px","cursor column":"40","top":"-
     A                                      290px","cursor row":"10","parent ta-
     A                                      b panel":"F2542F01_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCC004-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"t')
     A                                  1  8HTML('extbox","value":{"fieldName":-
     A                                      "SCC004","designValue":"[SCC004]","-
     A                                      refField":"A64","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "true","zeroBalance":"true","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"-999.00"},"left":"736px",-
     A                                      "cursor column":"67","top":"290px",-
     A                                      "cursor row":"10","width":"57px","r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"parent tab panel":-
     A                                      "F2542F01_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "F2542F01_SCR01_BtnHiddenHelp","val-
     A                                      ue":"btnHelp","top":"300px","respon-
     A                                      se":{"fieldName":"btnHelp","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant12","field type":"output fie-
     A                                      ld","value":"High Cost CC''s   :","-
     A                                      css class":"constant","left":"288px-
     A                                      ","cursor column":"3","top":"310px"-
     A                                      ,"cursor row":"11","parent tab pane-
     A                                      l":"F2542F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCC005","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCC005","designValue-
     A                                      ":"[SCC005]","dataType":"zoned","fo-
     A                                      rmatting":"Number","numSep":"true",-
     A                                      "zeroBalance":"true","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"-999.00","dataLength":"8","decPo-
     A                                      s":"6"},"left":"456px","cursor colu-
     A                                      mn":"27","top":"310px","cursor row"-
     A                                      :"11","width":"71px","read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 5":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"parent tab panel":"F2542F01_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant13","field type":"o-
     A                                      utput field","value":"IME %        -
     A                                           :","css class":"constant","lef-
     A                                      t":"547px","cursor column":"40","to-
     A                                      p":"310px","cursor row":"11","paren-
     A                                      t tab panel":"F2542F01_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      C006","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCC006","d-
     A                                      esignValue":"[SCC006]","refField":"-
     A                                      A52","dataType":"reference","format-
     A                                      ting":"Number","numSep":"true","zer-
     A                                      oBalance":"true","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00"},"left":"743px","cursor col-
     A                                      umn":"68","top":"310px","cursor row-
     A                                      ":"11","width":"50px","read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      css class 5":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"parent tab panel":"F2542F01_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant14","field type":"-
     A                                      output field","value":"DME Rate    -
     A                                           :","css class":"constant","lef-
     A                                      t":"288px","cursor column":"3","top-
     A                                      ":"330px","cursor row":"12","parent-
     A                                       tab panel":"F2542F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCC-
     A                                      007","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCC007","de-
     A                                      signValue":"[SCC007]","refField":"A-
     A                                      92","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"true","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00"},"left":"435px","cursor colu-
     A                                      mn":"24","top":"330px","cu')
     A                                  1  9HTML('rsor row":"12","width":"92px"-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"css class 5":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"F2542F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant15",-
     A                                      "field type":"output field","value"-
     A                                      :"Cap Rate DISCH    :","css class":-
     A                                      "constant","left":"547px","cursor c-
     A                                      olumn":"40","top":"330px","cursor r-
     A                                      ow":"12","parent tab panel":"F2542F-
     A                                      01_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCC008","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCC008","designValue":"[SCC008-
     A                                      ]","refField":"A92","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"true","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00"},"left":"701-
     A                                      px","cursor column":"62","top":"330-
     A                                      px","cursor row":"12","width":"92px-
     A                                      ","read only":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"PR","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F2542F01_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"id":"constant16"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Cap Rate per Diem:","css class":-
     A                                      "constant","left":"288px","cursor c-
     A                                      olumn":"3","top":"350px","cursor ro-
     A                                      w":"13","parent tab panel":"F2542F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCC009","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCC009","designValue":"[SCC009]-
     A                                      ","refField":"A92","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"true","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"-999.00"},"left":"435p-
     A                                      x","cursor column":"24","top":"350p-
     A                                      x","cursor row":"13","width":"92px"-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"css class 5":{"fieldN-
     A                                      ame":"N09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"F2542F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant17",-
     A                                      "field type":"output field","value"-
     A                                      :"ALC               :","css class":-
     A                                      "constant","left":"547px","cursor c-
     A                                      olumn":"40","top":"350px","cursor r-
     A                                      ow":"13","parent tab panel":"F2542F-
     A                                      01_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCC010","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCC010","designValue":"[SCC010-
     A                                      ]","refField":"A92","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"true","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00"},"left":"701-
     A                                      px","cursor column":"62","top":"350-
     A                                      px","cursor row":"13","width":"92px-
     A                                      ","read only":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"PR","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"HI","cus-
     A                                      tomFalse":""},"css class 5":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F2542F01_SCR01_MainTa')
     A                                  1 10HTML('bPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"constant18","field type":"outpu-
     A                                      t field","value":"Surcharge        -
     A                                      :","css class":"constant","left":"2-
     A                                      88px","cursor column":"3","top":"37-
     A                                      0px","cursor row":"14","parent tab -
     A                                      panel":"F2542F01_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCC011",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCC011","designV-
     A                                      alue":"[SCC011]","refField":"A53","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"true","zeroBalan-
     A                                      ce":"true","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"-999.00-
     A                                      "},"left":"477px","cursor column":"-
     A                                      30","top":"370px","cursor row":"14"-
     A                                      ,"width":"50px","read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      parent tab panel":"F2542F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant19","field type":"output-
     A                                       field","value":"Addtl. Surcharge  -
     A                                      :","css class":"constant","left":"5-
     A                                      47px","cursor column":"40","top":"3-
     A                                      70px","cursor row":"14","parent tab-
     A                                       panel":"F2542F01_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCC012"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCC012","design-
     A                                      Value":"[SCC012]","refField":"A53",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"true","zeroBala-
     A                                      nce":"true","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"-999.0-
     A                                      0"},"left":"743px","cursor column":-
     A                                      "68","top":"370px","cursor row":"14-
     A                                      ","width":"50px","read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 3":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      4":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 5":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "parent tab panel":"F2542F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"150px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F03","field type":"button","value":-
     A                                      "Exit","shortcut key":"F3","left":"-
     A                                      14px","top":"183px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF12","field ty-
     A                                      pe":"button","value":"Cancel","shor-
     A                                      tcut key":"F12","left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCC005         8S 6H
     A            SCDESC        40A  H
     A            SCOPCT        10A  H
     A            SCST           2A  H
     A            SCSTAT         1A  H
     A            SCSTDS        54A  H
     A            SCC001    R        H      REFFLD(A112)
     A            SCC002    R        H      REFFLD(A112)
     A            SCC003    R        H      REFFLD(A112)
     A            SCC004    R        H      REFFLD(A64)
     A            SCC006    R        H      REFFLD(A52)
     A            SCC007    R        H      REFFLD(A92)
     A            SCC008    R        H      REFFLD(A92)
     A            SCC009    R        H      REFFLD(A92)
     A            SCC010    R        H      REFFLD(A92)
     A            SCC011    R        H      REFFLD(A53)
     A            SCC012    R        H      REFFLD(A53)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2542F01_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2542F01_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2542F01_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F2542F01_SCR02_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F2542F01_SCR02_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F2542F01_SCR02_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      2542F01_SCR02_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F2542F01_SCR02_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F2542F01_SCR02_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F2542F01_SCR0-
     A                                      2_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F2542F01_SCR02_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F2542F01_SCR02_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2542F01_SCR02_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant21","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2542F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F2542F01_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant22","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2542F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"F2542F01_-
     A                                      SCR02_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F2542F01_SCR02-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR02_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F2542F01_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR02_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F2542F01_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant23","field type":-
     A                                      "output field","value":"SCR02","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F2542F01_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR02_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F2542F01_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2542F01_SCR02_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2542F-
     A                                      01_SCR02_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F2542F01_SCR02_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2542F01_SCR02_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2542F01_SCR02_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2542F01_SCR02_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2542-
     A                                      F01_SCR02_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2542F01_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2542F01_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2542F01_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F2542F01_SCR03_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F2542F01_SCR03_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F2542F01_SCR03_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      2542F01_SCR03_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F2542F01_SCR03_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"F2542F01_SCR03_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"c')
     A                                  1  4HTML('har","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F2542F01_SCR0-
     A                                      3_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F2542F01_SCR03_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F2542F01_SCR03_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2542F01_SCR03_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant24","field type"-
     A                                      :"output field","left":"281px","cur-
     A                                      sor column":"2","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentUser()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2542F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR03_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","css class 3"-
     A                                      :"HI","parent tab panel":"F2542F01_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant25","field type":-
     A                                      "output field","left":"778px","curs-
     A                                      or column":"73","top":"110px","curs-
     A                                      or row":"1","css class":"top-line",-
     A                                      "value":"js: currentDate()","css cl-
     A                                      ass 2":"output-field","parent tab p-
     A                                      anel":"F2542F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"F2542F01_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F2542F01_SCR03-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCR03_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F2542F01_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCPRDS","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCPRDS","des-
     A                                      ignValue":"[SCPRDS]","refField":"NA-
     A                                      ME","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"414px","cursor column":"-
     A                                      21","top":"130px","cursor row":"2",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F2542F01_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","visibility":"hidden-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant26","field type":-
     A                                      "output field","value":"SCR03","css-
     A                                       class":"constant","left":"799px","-
     A                                      cursor column":"76","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F2542F01_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR03_SCMODE","-
     A                                      field type":"output field"')
     A                                  1  5HTML(',"value":{"fieldName":"SCMODE-
     A                                      ","designValue":"[SCMODE]","refFiel-
     A                                      d":"PGM","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"764px","cursor colu-
     A                                      mn":"71","top":"150px","cursor row"-
     A                                      :"3","css class 2":"HI","parent tab-
     A                                       panel":"F2542F01_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2542F01_SCR03_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F2542F-
     A                                      01_SCR03_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"F2542F01_SCR03_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2542F01_SCR03_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2542F01_SCR03_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F2542F01_SCR03_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F2542-
     A                                      F01_SCR03_BtnHiddenHelp","value":"b-
     A                                      tnHelp","top":"300px","response":{"-
     A                                      fieldName":"btnHelp","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"btnSubm-
     A                                      it","field type":"button","value":"-
     A                                      Enter","shortcut key":"Enter","left-
     A                                      ":"14px","top":"150px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF03","field-
     A                                       type":"button","value":"Exit","sho-
     A                                      rtcut key":"F3","left":"14px","top"-
     A                                      :"183px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
