     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  09 10 40
     A  41 42 43
     A  44 45 71                            CA01
     A  72 73 74
     A  75 76 77
     A  78                                  CA02
     A                                  1  2HTML('QPUIREC10   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C6    SCCODEC7    MCR0-
     A                                      503C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     71RERRMSGID  5    C6    SC-
     A                                      CODEC7    MCR0900C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     76RERRMSGID -
     A                                       5    C5    SCINDC7    MCR0503C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       72RERRMSGID  5    C5    SCINDC7   -
     A                                       MCR0319C6    FSMESGC5    *LIBLC0  -
     A                                        E1    3     77RERRMSGID  5    C6 -
     A                                         SCDSC1C7    MCR0503C6    FSMESGC-
     A                                      5    *LIBLC0    E1    3     73RERRM-
     A                                      SGID  5    C6    SCFCODC7    MCR050-
     A                                      3C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     74RERRMSGID  5    C5    SCVL-
     A                                      DC7    MCR0503C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     75RERRMSGID  5 -
     A                                         C5    SCVLDC7    MCR0319C6    FS-
     A                                      MESGC5    *LIBLC0    E1    3     78-
     A                                      ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","return cursor reco-
     A                                      rd":{"fieldName":"HREC","dataLength-
     A                                      ":"10","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none"},"return cursor field":{"fie-
     A                                      ldName":"HFLD","dataLength":"10","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"none"},"-
     A                                      overlay range":"1-23"},"items":[{"i-
     A                                      d":"HFLD","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"HFLD","designValue":"[H-
     A                                      FLD]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"10"},"left":"0p-
     A                                      x","top":"-30px","css class":"profo-
     A                                      und-converted"},{"id":"HREC","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"HREC-
     A                                      ","designValue":"[HREC]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"left":"0px","top":"-30px"-
     A                                      ,"css class":"profound-converted"},-
     A                                      {"id":"F2554F01_SCR01_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"F2554F01_SCR0-
     A                                      1_action","field type":"html contai-
     A                                      ner","white space":"normal","left":-
     A                                      "0px","top":"10px","width":"230px",-
     A                                      "css class":"action-panel-converted-
     A                                      ","height":"700px","html":"<div cla-
     A                                      ss=\"top\"></div><div class=\"image-
     A                                      top\"><img src=\"/profoundui/userda-
     A                                      ta/images/bar_top.png\" /></div><di-
     A                                      v class=\"menulinks\"></div><div cl-
     A                                      ass=\"imagebottom\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_bottom.-
     A                                      png\" /></div><div class=\"bottom\"-
     A                                      ></div>"},{"field type":"icon menu -
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "32px","z index":"20","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1170px","-
     A                                      id":"F2554F01_SCR01_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"F2554F01_SCR01_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"F2554F01_SCR01_BtnSave","tool t-
     A                                      ip":"Save","onclick":"SystemToolbar-
     A                                      Save","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/sa-
     A                                      ve.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      066px","id":"F2554F01_SCR01_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"F-
     A                                      2554F01_SCR01_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"F2554F01_SCR01_BtnD-
     A                                      iaryItems","tool tip":"Dia')
     A                                  1  4HTML('ry/Work Items - IDARTS","oncl-
     A                                      ick":"SystemToolbarDiary","backgrou-
     A                                      nd image":{"fieldName":"DryIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1144px","id":"F2554F0-
     A                                      1_SCR01_BtnSystemMessages","tool ti-
     A                                      p":"System Messages","onclick":"Sys-
     A                                      temToolbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnURL","dataL-
     A                                      ength":"128","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"}},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1196px","id":"F2554F01_SCR0-
     A                                      1_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"F2554F01_SCR01_ImgSysToolBottom",-
     A                                      "field type":"image","image source"-
     A                                      :"/profoundui/userdata/images/systo-
     A                                      ol/butbarbot.png","left":"1036px","-
     A                                      top":"64px","width":"187px","locked-
     A                                       in place":"true","css class":"stat-
     A                                      ionary","visibility":"hidden"},{"id-
     A                                      ":"F2554F01_SCR01_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","designValue":"[SCP-
     A                                      RDS]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"act-
     A                                      ive tab":"0","left":"250px","top":"-
     A                                      70px","width":"970px","height":"657-
     A                                      px","z index":"8","locked in place"-
     A                                      :"true","css class":"tab-panel","cs-
     A                                      s class 2":"stationary"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2554F01_SCR01_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant1","field type":-
     A                                      "output field","left":"281px","curs-
     A                                      or column":"2","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentUser()","css cla-
     A                                      ss 2":"output-field","parent tab pa-
     A                                      nel":"F2554F01_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"SCCONM","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCCONM","designValue":-
     A                                      "[SCCONM]","refField":"NAME","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                       2":"top-line","css class 3":"HI","-
     A                                      parent tab panel":"F2554F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"constant2","field type":"output -
     A                                      field","left":"778px","cursor colum-
     A                                      n":"73","top":"110px","cursor row":-
     A                                      "1","css class":"top-line","value":-
     A                                      "js: currentDate()","css class 2":"-
     A                                      output-field","parent tab panel":"F-
     A                                      2554F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"F2554F01_SCR01_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F2554F01_SCR01_BtnHidd-
     A                                      enRefresh","value":"btnRefresh","to-
     A                                      p":"125px","response":{"fieldName":-
     A                                      "btnRefresh","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"Q1PGM","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"Q1PGM","designValue":"[Q1PGM-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"10"},"css class":-
     A                                      "output-field","left":"281px","curs-
     A                                      or column":"2","top":"130px","curso-
     A                                      r row":"2","parent tab pan')
     A                                  1  5HTML('el":"F2554F01_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCPRD-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCPRDS","designVa-
     A                                      lue":"[SCPRDS]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"130px","cursor row":"2","css -
     A                                      class 2":"HI","parent tab panel":"F-
     A                                      2554F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","visibility":"hidden","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant3","field type":"outpu-
     A                                      t field","value":"SCR01","css class-
     A                                      ":"constant","left":"799px","cursor-
     A                                       column":"76","top":"130px","cursor-
     A                                       row":"2","parent tab panel":"F2554-
     A                                      F01_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCMODE","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCMODE","designValue":"[SCMODE]",-
     A                                      "refField":"PGM","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none"},"css class"-
     A                                      :"output-field","left":"764px","cur-
     A                                      sor column":"71","top":"150px","cur-
     A                                      sor row":"3","css class 2":"HI","pa-
     A                                      rent tab panel":"F2554F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F2554F01_SCR01_Btn-
     A                                      HiddenSearch","value":"btnSearch","-
     A                                      top":"150px","response":{"fieldName-
     A                                      ":"btnSearch","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant4","fi-
     A                                      eld type":"output field","value":"T-
     A                                      ype information, press Enter.","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"170px","c-
     A                                      ursor row":"4","css class 2":"BLU",-
     A                                      "parent tab panel":"F2554F01_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"F2554F01_SCR01_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F2554F01_SCR01_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant5","fi-
     A                                      eld type":"output field","value":"I-
     A                                      CD10 code                 :","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"210px","cur-
     A                                      sor row":"6","parent tab panel":"F2-
     A                                      554F01_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCCODE","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCCODE","designValue":"[SC-
     A                                      CODE]","refField":"DS7","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"498px","cursor column":"33","top"-
     A                                      :"210px","cursor row":"6","width":"-
     A                                      50px","css class 3":{"fieldName":"0-
     A                                      9 or 40","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09 and 40","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09 or 10","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09 o-
     A                                      r 10","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"set focus":{"fieldNa-
     A                                      me":"41","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error message id":-
     A                                      "MCR0503","error message file":"FSM-
     A                                      ESG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"7-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"2 messages","e-
     A                                      rror message id 2":"MCR0900","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"76","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"F2554F01_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      6":"profound-converted"},{"id":"con-
     A                                      stant6","field type":"output field"-
     A                                      ,"value":"Status:","css cl')
     A                                  1  6HTML('ass":"constant","left":"764px-
     A                                      ","cursor column":"71","top":"210px-
     A                                      ","cursor row":"6","parent tab pane-
     A                                      l":"F2554F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCSTAT","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCSTAT","designValue-
     A                                      ":"[SCSTAT]","refField":"STAT","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"820px","cursor column":"79-
     A                                      ","top":"210px","cursor row":"6","w-
     A                                      idth":"8px","css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"HI","-
     A                                      customFalse":""},"css class 4":{"fi-
     A                                      eldName":"N09 and 40","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09 or 10","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 5":{"fieldName":"09 o-
     A                                      r 10","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"parent tab panel":"F-
     A                                      2554F01_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      2554F01_SCR01_BtnHiddenWorkSubmitJo-
     A                                      b","value":"btnWrksbmjob","top":"22-
     A                                      5px","response":{"fieldName":"btnWr-
     A                                      kJob","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"constant7","field type-
     A                                      ":"output field","value":"Diag type-
     A                                       (D/O)            :","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"250px","cursor row"-
     A                                      :"8","parent tab panel":"F2554F01_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCIND","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCIND","designValue":"[SCIND]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"498px","-
     A                                      cursor column":"33","top":"250px","-
     A                                      cursor row":"8","width":"8px","css -
     A                                      class 3":"HI","css class 4":{"field-
     A                                      Name":"N09 or 40","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"s-
     A                                      et focus":{"fieldName":"42","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "error message id":"MCR0503","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"72","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0319","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"77","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"F25-
     A                                      54F01_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 6":"profound-con-
     A                                      verted"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F25-
     A                                      54F01_SCR01_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F25-
     A                                      54F01_SCR01_BtnHiddenImageQueue","v-
     A                                      alue":"btnImgQue","top":"275px","re-
     A                                      sponse":{"fieldName":"btnImgQue","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant8","field type":"outpu-
     A                                      t field","value":"Description      -
     A                                                :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"290px","cursor row":"10","p-
     A                                      arent tab panel":"F2554F01_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCDSC1","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCDSC1-
     A                                      ","designValue":"[SCDSC1]","refFiel-
     A                                      d":"DS25","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true"')
     A                                  1  7HTML('},"left":"498px","cursor colu-
     A                                      mn":"33","top":"290px","cursor row"-
     A                                      :"10","width":"176px","css class 3"-
     A                                      :"HI","css class 4":{"fieldName":"N-
     A                                      09 or 40","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"set focus-
     A                                      ":{"fieldName":"43","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"MCR0503","error message-
     A                                       file":"FSMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"73","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"F2554F0-
     A                                      1_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F2554F0-
     A                                      1_SCR01_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant9-
     A                                      ","field type":"output field","valu-
     A                                      e":"Actual value (with decimal):","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"330px"-
     A                                      ,"cursor row":"12","parent tab pane-
     A                                      l":"F2554F01_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCFCOD","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCFCOD","designValue-
     A                                      ":"[SCFCOD]","refField":"DS8","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"498px","cursor column":"33"-
     A                                      ,"top":"330px","cursor row":"12","w-
     A                                      idth":"57px","css class 3":"HI","cs-
     A                                      s class 4":{"fieldName":"N09 or 40"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"44","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message id-
     A                                      ":"MCR0503","error message file":"F-
     A                                      SMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "74","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"F2554F01_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant10","field type":"output-
     A                                       field","value":"Specific          -
     A                                               :","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"370px","cursor row":"14","pa-
     A                                      rent tab panel":"F2554F01_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCVLD","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCVLD","-
     A                                      designValue":"[SCVLD]","refField":"-
     A                                      FLAG","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","left":"498px","cursor c-
     A                                      olumn":"33","top":"370px","cursor r-
     A                                      ow":"14","width":"8px","css class 3-
     A                                      ":"HI","css class 4":{"fieldName":"-
     A                                      N09 or 40","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"UL"-
     A                                      ,"customFalse":""},"read only":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"css class 5":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"PR","customFalse":""},"set focu-
     A                                      s":{"fieldName":"45","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"error -
     A                                      message id":"MCR0503","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"75","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"2 -
     A                                      messages","error message id 2":"MCR-
     A                                      0319","error message file 2":"FSMES-
     A                                      G","error message library 2":"*LIBL-
     A                                      ","error condition 2":{"fieldName":-
     A                                      "78","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"F2554F01_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-c')
     A                                  1  8HTML('onverted"},{"id":"constant11"-
     A                                      ,"field type":"output field","value-
     A                                      ":"LOS group                  :","c-
     A                                      ss class":"constant","left":"295px"-
     A                                      ,"cursor column":"4","top":"410px",-
     A                                      "cursor row":"16","parent tab panel-
     A                                      ":"F2554F01_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCLOS","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCLOS","designValue":"-
     A                                      [SCLOS]","refField":"DS10","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      "},"text transform":"uppercase","le-
     A                                      ft":"498px","cursor column":"33","t-
     A                                      op":"410px","cursor row":"16","widt-
     A                                      h":"71px","read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 3":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR-UL-
     A                                      ","customFalse":""},"parent tab pan-
     A                                      el":"F2554F01_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 4":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF12","field type":"button","v-
     A                                      alue":"Cancel","shortcut key":"F12"-
     A                                      ,"left":"14px","top":"216px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCODE    R        H      REFFLD(DS7)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDSC1    R        H      REFFLD(DS25)
     A            SCFCOD    R        H      REFFLD(DS8)
     A            SCIND     R        H      REFFLD(FLAG)
     A            SCLOS     R        H      REFFLD(DS10)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSTAT    R        H      REFFLD(STAT)
     A            SCVLD     R        H      REFFLD(FLAG)
     A          R SCR02
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2554F01_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2554F01_SCR02_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2554F01_SCR02_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F2554F01_SCR02_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F2554F01_SCR02_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F2554F01_SCR02_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F25-
     A                                      54F01_SCR02_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"F2554F01_SCR02_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F2554F01_SCR02_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button"')
     A                                  1  4HTML(',"css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F2554F01_SCR02_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F2554F01_SCR02_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F2554F01_SCR02_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2554F01_SCR02_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant12","field type":"-
     A                                      output field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentUser()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2554F01_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCR02_SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","parent tab panel":"F2554F01_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant13","field type":"o-
     A                                      utput field","left":"778px","cursor-
     A                                       column":"73","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentDate()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2554F01_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F2554F01_SC-
     A                                      R02_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2554F01_SCR02_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCR02_Q1P-
     A                                      GM","field type":"output field","va-
     A                                      lue":{"fieldName":"Q1PGM","designVa-
     A                                      lue":"[Q1PGM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F2554F01_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR02_SC-
     A                                      PRDS","field type":"output field","-
     A                                      value":{"fieldName":"SCPRDS","desig-
     A                                      nValue":"[SCPRDS]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2554F01_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","visibility":"hidden",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant14","field type":"o-
     A                                      utput field","value":"SCR02","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      2554F01_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCMODE","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCMODE","designValue":"-
     A                                      [SCMODE]","refField":"PGM"')
     A                                  1  5HTML(',"dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"764px","cursor column-
     A                                      ":"71","top":"150px","cursor row":"-
     A                                      3","css class 2":"HI","parent tab p-
     A                                      anel":"F2554F01_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F2554F01_SCR02_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F2554F01-
     A                                      _SCR02_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F2554F01_SCR02_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2554F01_SCR02_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2554F01_SCR02_BtnHiddenWorkPri-
     A                                      nterOutput","value":"btnWrkprtout",-
     A                                      "top":"250px","response":{"fieldNam-
     A                                      e":"btnWrkPrnt","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2554F01_SCR02_BtnHiddenImageQu-
     A                                      eue","value":"btnImgQue","top":"275-
     A                                      px","response":{"fieldName":"btnImg-
     A                                      Que","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F2554F0-
     A                                      1_SCR02_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF03","field t-
     A                                      ype":"button","value":"Exit","short-
     A                                      cut key":"F3","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
     A          R SCR03
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"F2554F01_SCR03_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"F2554F01_SCR03_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F2554F01_SCR03_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F2554F01_SCR03_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"F2554F01_SCR03_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"F2554F01_SCR03_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"F25-
     A                                      54F01_SCR03_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"F2554F01_SCR03_BtnDia-
     A                                      ryItems","tool tip":"Diary/Work Ite-
     A                                      ms - IDARTS","onclick":"SystemToolb-
     A                                      arDiary","background image":{"field-
     A                                      Name":"DryIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"114-
     A                                      4px","id":"F2554F01_SCR03_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button"')
     A                                  1  4HTML(',"css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1196px","id":"F2554F01_SCR03_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      F2554F01_SCR03_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "F2554F01_SCR03_MainTabPanel","fiel-
     A                                      d type":"tab panel","tab panel styl-
     A                                      e":"Transform","tab names":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F2554F01_SCR03_BtnHidden-
     A                                      Save","value":"btnSave","top":"100p-
     A                                      x","response":{"fieldName":"btnSave-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant15","field type":"-
     A                                      output field","left":"281px","curso-
     A                                      r column":"2","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentUser()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2554F01_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCR03_SCCON-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCCONM","designVa-
     A                                      lue":"[SCCONM]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","css class 3":"-
     A                                      HI","parent tab panel":"F2554F01_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant16","field type":"o-
     A                                      utput field","left":"778px","cursor-
     A                                       column":"73","top":"110px","cursor-
     A                                       row":"1","css class":"top-line","v-
     A                                      alue":"js: currentDate()","css clas-
     A                                      s 2":"output-field","parent tab pan-
     A                                      el":"F2554F01_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"F2554F01_SC-
     A                                      R03_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"F2554F01_SCR03_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCR03_Q1P-
     A                                      GM","field type":"output field","va-
     A                                      lue":{"fieldName":"Q1PGM","designVa-
     A                                      lue":"[Q1PGM]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"10"},-
     A                                      "css class":"output-field","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      30px","cursor row":"2","parent tab -
     A                                      panel":"F2554F01_SCR03_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR03_SC-
     A                                      PRDS","field type":"output field","-
     A                                      value":{"fieldName":"SCPRDS","desig-
     A                                      nValue":"[SCPRDS]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"414px","cursor column":"21-
     A                                      ","top":"130px","cursor row":"2","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"F2554F01_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","visibility":"hidden",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant17","field type":"o-
     A                                      utput field","value":"SCR03","css c-
     A                                      lass":"constant","left":"799px","cu-
     A                                      rsor column":"76","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"F-
     A                                      2554F01_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR03_SCMODE","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCMODE","designValue":"-
     A                                      [SCMODE]","refField":"PGM"')
     A                                  1  5HTML(',"dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"764px","cursor column-
     A                                      ":"71","top":"150px","cursor row":"-
     A                                      3","css class 2":"HI","parent tab p-
     A                                      anel":"F2554F01_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"F2554F01_SCR03_BtnHiddenSear-
     A                                      ch","value":"btnSearch","top":"150p-
     A                                      x","response":{"fieldName":"btnSear-
     A                                      ch","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"F2554F01-
     A                                      _SCR03_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"F2554F01_SCR03_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F2554F01_SCR03_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2554F01_SCR03_BtnHiddenWorkPri-
     A                                      nterOutput","value":"btnWrkprtout",-
     A                                      "top":"250px","response":{"fieldNam-
     A                                      e":"btnWrkPrnt","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"F2554F01_SCR03_BtnHiddenImageQu-
     A                                      eue","value":"btnImgQue","top":"275-
     A                                      px","response":{"fieldName":"btnImg-
     A                                      Que","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F2554F0-
     A                                      1_SCR03_BtnHiddenHelp","value":"btn-
     A                                      Help","top":"300px","response":{"fi-
     A                                      eldName":"btnHelp","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF03","field t-
     A                                      ype":"button","value":"Exit","short-
     A                                      cut key":"F3","left":"14px","top":"-
     A                                      183px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
