     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A  27 28 29
     A  31                                  CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                  1  2HTML('QPUIREC12   RROWS      2    C-
     A                                      1    1C2    24 RERRMSGID  5    C6  -
     A                                        SCFCO#C7    MCR0503C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCFCO#C7    MCR0507-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     21RERRMSGID  5    C6    SCFSU-
     A                                      BC7    MCR0503C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     28RERRMSGID  5 -
     A                                         C6    SCFSUBC7    MCR0787C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     2-
     A                                      9RERRMSGID  5    C6    SCFFNDC7    -
     A                                      MCR0503C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     22RERRMSGID  5    C6  -
     A                                        SCFFNDC7    MCR0508C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     23RERRMS-
     A                                      GID  5    C6    SCFFNDC7    MCR0371-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     31RERRMSGID  5    C6    SCFFY-
     A                                      RC7    MCR0503C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     24RERRMSGID  5 -
     A                                         C6    SCFCASC7    MCR0503C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     2-
     A                                      5RERRMSGID  5    C6    SCFCASC7    -
     A                                      MCR0681C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     26RERRMSGID  5    C6  -
     A                                        SCFCASC7    MCR0749C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     27')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N29","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      1","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"valid command key":{"fieldName":-
     A                                      "*IN11","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"overlay range":"1-24"},"ite-
     A                                      ms":[{"id":"F7061F_SCR01_avKeys","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"AV_KEYS","dataLength":-
     A                                      "1134","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[AV_KEY-
     A                                      S]"},"left":"0px","top":"0px","visi-
     A                                      bility":"hidden"},{"id":"F7061F_SCR-
     A                                      01_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"F7061F_SCR01_BtnIconMenuSyste-
     A                                      mTools","tool tip":"System Tools","-
     A                                      icon alignment":"middle left","icon-
     A                                       width":"16px","icon height":"24px"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"F7061F_SCR01_But-
     A                                      tonBar","top":"35px","left":"1036px-
     A                                      ","width":"187px","height":"28px","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1040px","id-
     A                                      ":"F7061F_SCR01_BtnSave","tool tip"-
     A                                      :"Save","onclick":"SystemToolbarSav-
     A                                      e","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/save.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1066-
     A                                      px","id":"F7061F_SCR01_BtnRefresh",-
     A                                      "tool tip":"Refresh","onclick":"Sys-
     A                                      temToolbarRefresh","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/refresh.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1092px","id":"F7061F-
     A                                      _SCR01_BtnSearch","tool tip":"Searc-
     A                                      h","onclick":"SystemToolbarSearch",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/search.p-
     A                                      ng'')"},{"field type":"button","css-
     A                                       class":"stationary","widt')
     A                                  1  4HTML('h":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1118px","id":"F7061F_SCR0-
     A                                      1_BtnDiaryItems","tool tip":"Diary/-
     A                                      Work Items - IDARTS","onclick":"Sys-
     A                                      temToolbarDiary","background image"-
     A                                      :{"fieldName":"DryIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1144px","id":"F7061F_SCR01_Btn-
     A                                      SystemMessages","tool tip":"System -
     A                                      Messages","onclick":"SystemToolbarM-
     A                                      essages","background image":{"field-
     A                                      Name":"MsgIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"119-
     A                                      6px","id":"F7061F_SCR01_BtnHelp","t-
     A                                      ool tip":"Help","onclick":"SystemTo-
     A                                      olbarHelp","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/help.png'')"},{"id":"F7061F_SCR0-
     A                                      1_ImgSysToolBottom","field type":"i-
     A                                      mage","image source":"/profoundui/u-
     A                                      serdata/images/systool/butbarbot.pn-
     A                                      g","left":"1036px","top":"64px","wi-
     A                                      dth":"187px","locked in place":"tru-
     A                                      e","css class":"stationary","visibi-
     A                                      lity":"hidden"},{"id":"F7061F_SCR01-
     A                                      _MainTabPanel","field type":"tab pa-
     A                                      nel","tab panel style":"Transform",-
     A                                      "tab names":{"fieldName":"SCPRDS","-
     A                                      designValue":"[SCPRDS]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"active tab":"0","lef-
     A                                      t":"250px","top":"70px","width":"97-
     A                                      0px","height":"657px","z index":"8"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"tab-panel","css class 2":"stati-
     A                                      onary"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F706-
     A                                      1F_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"SCUSER",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCUSER","designValue-
     A                                      ":"[SCUSER]","refField":"USER","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"110px","cursor row":"1","css clas-
     A                                      s 2":"top-line","parent tab panel":-
     A                                      "F7061F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCCONM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCONM","designValue":"[SCCON-
     A                                      M]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","description":"COMPANY NAME-
     A                                      ","parent tab panel":"F7061F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"constant1","field type":"output-
     A                                       field","left":"778px","cursor colu-
     A                                      mn":"73","top":"110px","cursor row"-
     A                                      :"1","css class":"top-line","value"-
     A                                      :"js: currentDate()","css class 2":-
     A                                      "output-field","parent tab panel":"-
     A                                      F7061F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"F7061F_SCR01_fkeyM-
     A                                      enu","field type":"menu","left":"10-
     A                                      px","top":"120px","height":"350px",-
     A                                      "width":"230px","hover background c-
     A                                      olor":"#9AAA61","hover text color":-
     A                                      "#FFFFFF","border color":"#4C6106",-
     A                                      "menu option indent":"10px","backgr-
     A                                      ound color":"#758B27","css class":"-
     A                                      action-menu","css class 2":"station-
     A                                      ary","z index":"101"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"F7061F_SCR01_Btn')
     A                                  1  5HTML('HiddenRefresh","value":"btnRe-
     A                                      fresh","top":"125px","response":{"f-
     A                                      ieldName":"btnRefresh","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant2","field type":"output field","-
     A                                      value":"F7061F","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"F7061F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCPRDS","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCPRDS","d-
     A                                      esignValue":"[SCPRDS]","refField":"-
     A                                      NAME","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"414px","cursor column"-
     A                                      :"21","top":"130px","cursor row":"2-
     A                                      ","description":"PROGRAM NAME","par-
     A                                      ent tab panel":"F7061F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","visibilit-
     A                                      y":"hidden","css class 2":"profound-
     A                                      -converted"},{"id":"constant3","fie-
     A                                      ld type":"output field","value":"SC-
     A                                      R01","css class":"constant","left":-
     A                                      "799px","cursor column":"76","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"F7061F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F7061F_SCR01_BtnHiddenSearc-
     A                                      h","value":"btnSearch","top":"150px-
     A                                      ","response":{"fieldName":"btnSearc-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F7061F_SC-
     A                                      R01_BtnHiddenDiaryItems","value":"b-
     A                                      tnDiary","top":"175px","response":{-
     A                                      "fieldName":"btnDiary","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F7061F_SCR01_BtnHiddenSy-
     A                                      stemMessages","value":"btnMessage",-
     A                                      "top":"200px","response":{"fieldNam-
     A                                      e":"btnMessage","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant6","-
     A                                      field type":"output field","value":-
     A                                      "Company     :","css class":"consta-
     A                                      nt","left":"456px","cursor column":-
     A                                      "27","top":"210px","cursor row":"6"-
     A                                      ,"parent tab panel":"F7061F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCFCO#","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCFCO-
     A                                      #","designValue":"[SCFCO#]","refFie-
     A                                      ld":"CO#","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00","numBlankFill":"true"-
     A                                      },"left":"554px","cursor column":"4-
     A                                      1","top":"210px","cursor row":"6","-
     A                                      width":"22px","text align":"right",-
     A                                      "css class 3":"HI","error message i-
     A                                      d":"MCR0503","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"20","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"MCR0507","er-
     A                                      ror message file 2":"FSMESG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"21","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"des-
     A                                      cription":"Company #:","parent tab -
     A                                      panel":"F7061F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F7061F_SCR01_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant9","field-
     A                                       type":"output field","value":"Subs-
     A                                      criber  :","css class":"constant","-
     A                                      left":"456px","cursor column":"27",-
     A                                      "top":"250px","cursor row":"8","par-
     A                                      ent tab panel":"F7061F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      FSUB","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCFSUB","d-
     A                                      esignValue":"[SCFSUB]","refField":"-
     A                                      SUB#","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"999.00"},"left":"554px","cursor c-
     A                                      olumn":"41","top":"250px","cursor r-
     A                                      ow":"8","width":"36px","css class 3-
     A                                      ":"HI","error message id":"MCR0503"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL')
     A                                  1  6HTML('","error condition":{"fieldNa-
     A                                      me":"28","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0787",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"29","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      description":"SUBSCIBER","parent ta-
     A                                      b panel":"F7061F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 4":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"F7061F_SCR01_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"F7061F_SCR01_BtnHiddenImageQu-
     A                                      eue","value":"btnImgQue","top":"275-
     A                                      px","response":{"fieldName":"btnImg-
     A                                      Que","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant8","field type"-
     A                                      :"output field","value":"Group     -
     A                                        :","css class":"constant","left":-
     A                                      "456px","cursor column":"27","top":-
     A                                      "290px","cursor row":"10","parent t-
     A                                      ab panel":"F7061F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCFFND"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCFFND","design-
     A                                      Value":"[SCFFND]","refField":"FND",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","numBlankFill":"true"},"left":"-
     A                                      554px","cursor column":"41","top":"-
     A                                      290px","cursor row":"10","width":"2-
     A                                      2px","text align":"right","css clas-
     A                                      s 3":"HI","error message id":"MCR05-
     A                                      03","error message file":"FSMESG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"22","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"3 messages","error m-
     A                                      essage id 2":"MCR0508","error messa-
     A                                      ge file 2":"FSMESG","error message -
     A                                      library 2":"*LIBL","error condition-
     A                                       2":{"fieldName":"23","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 3":"MCR0371","error message fi-
     A                                      le 3":"FSMESG","error message libra-
     A                                      ry 3":"*LIBL","error condition 3":{-
     A                                      "fieldName":"31","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"description":"Gro-
     A                                      up","parent tab panel":"F7061F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 4":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"F7061F_SCR01_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant4","field-
     A                                       type":"output field","value":"Year-
     A                                              :","css class":"constant","-
     A                                      left":"456px","cursor column":"27",-
     A                                      "top":"330px","cursor row":"12","pa-
     A                                      rent tab panel":"F7061F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CFFYR","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCFFYR","-
     A                                      designValue":"[SCFFYR]","refField":-
     A                                      "YR","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00","numBlankFill":"true"},"le-
     A                                      ft":"554px","cursor column":"41","t-
     A                                      op":"330px","cursor row":"12","widt-
     A                                      h":"15px","text align":"right","css-
     A                                       class 3":"HI","set focus":"true","-
     A                                      error message id":"MCR0503","error -
     A                                      message file":"FSMESG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"24","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","description":"Fund -
     A                                      Year","parent tab panel":"F7061F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant5","field type":"ou-
     A                                      tput field","value":"Case        :"-
     A                                      ,"css class":"constant","left":"456-
     A                                      px","cursor column":"27","top":"370-
     A                                      px","cursor row":"14","parent tab p-
     A                                      anel":"F7061F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCFCAS","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCFCAS","designValu-
     A                                      e":"[SCFCAS]","refField":"CASE","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","z')
     A                                  1  7HTML('eroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00","numBlankFill":"tru-
     A                                      e"},"left":"554px","cursor column":-
     A                                      "41","top":"370px","cursor row":"14-
     A                                      ","width":"50px","text align":"righ-
     A                                      t","css class 3":"HI","error messag-
     A                                      e id":"MCR0503","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"25","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"3 messag-
     A                                      es","error message id 2":"MCR0681",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"26","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id 3":"MCR0749","erro-
     A                                      r message file 3":"FSMESG","error m-
     A                                      essage library 3":"*LIBL","error co-
     A                                      ndition 3":{"fieldName":"27","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"descr-
     A                                      iption":"Case","parent tab panel":"-
     A                                      F7061F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant7","field -
     A                                      type":"output field","value":"Input-
     A                                       Company, Subscriber, Group, Year, -
     A                                      and Case you wish to transfer","css-
     A                                       class":"constant","left":"330px","-
     A                                      cursor column":"9","top":"410px","c-
     A                                      ursor row":"16","parent tab panel":-
     A                                      "F7061F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"btnSubmit","field-
     A                                       type":"button","value":"Enter","sh-
     A                                      ortcut key":"Enter","left":"14px","-
     A                                      top":"150px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF03","field type":"bu-
     A                                      tton","value":"Exit","shortcut key"-
     A                                      :"F3","left":"14px","top":"183px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F06","field type":"button","value":-
     A                                      "Ss#/acdt search","shortcut key":"F-
     A                                      6","left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF07-
     A                                      ","field type":"button","value":"Ca-
     A                                      se search","shortcut key":"F7","lef-
     A                                      t":"14px","top":"249px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF08","fiel-
     A                                      d type":"button","value":"Ss#/case -
     A                                      search","shortcut key":"F8","left":-
     A                                      "14px","top":"282px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF09","field t-
     A                                      ype":"button","value":"Alpha search-
     A                                      ","shortcut key":"F9","left":"14px"-
     A                                      ,"top":"315px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF10","field type":"-
     A                                      button","value":"Transfer search","-
     A                                      shortcut key":"F10","left":"14px","-
     A                                      top":"348px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","value":"Cancel  ","shortcut -
     A                                      key":"F12","left":"14px","top":"381-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF13","field type":"button","va-
     A                                      lue":"Chg user parms","shortcut key-
     A                                      ":"F13","left":"14px","top":"414px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF16","field type":"button","value-
     A                                      ":"History search","shortcut key":"-
     A                                      F16","left":"14px","top":"447px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnHE-
     A                                      LP","field type":"button","shortcut-
     A                                       key":"Alt-F1","bypass validation":-
     A                                      "true","value":"HELP","response":{"-
     A                                      fieldName":"*IN10","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"left":"14px","to-
     A                                      p":"480px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFCAS    R        H      REFFLD(CASE)
     A            SCFCO#    R        H      REFFLD(CO#)
     A            SCFFND    R        H      REFFLD(FND)
     A            SCFFYR    R        H      REFFLD(YR)
     A            SCFSUB    R        H      REFFLD(SUB#)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR02
     A  10 11 20
     A  21 22 23
     A  24 29 30                            CA01(10 'Response Indicator *IN10')
     A  31 32 33
     A  27 28                               CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                  1  2HTML('QPUIREC9    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCTCO#C7    MCR0503C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCTCO#C7    MCR0507-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     21RERRMSGID  5    C6    SCTSU-
     A                                      BC7    MCR0503C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     29RERRMSGID  5 -
     A                                         C6    SCTSUBC7    MCR0787C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     3-
     A                                      0RERRMSGID  5    C6    SCTFNDC7    -
     A                                      MCR0503C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     22RERRMSGID  5    C6  -
     A                                        SCTFNDC7    MCR0508C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     23RERRMS-
     A                                      GID  5    C6    SCTCASC7    MCR0726-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     28RERRMSGID  5    C6    SCTCA-
     A                                      SC7    MCR0001C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     27')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN29","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN30","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN31","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN32","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N33","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"valid command key":{"fieldName-
     A                                      ":"*IN11","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"overlay range":"1-23"},"i-
     A                                      tems":[{"id":"F7061F_SCR02_avKeys",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"AV_KEYS","dataLength-
     A                                      ":"1134","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[AV_K-
     A                                      EYS]"},"left":"0px","top":"0px","vi-
     A                                      sibility":"hidden"},{"id":"F7061F_S-
     A                                      CR02_action","field type":"html con-
     A                                      tainer","white space":"normal","lef-
     A                                      t":"0px","top":"10px","width":"230p-
     A                                      x","css class":"action-panel-conver-
     A                                      ted","height":"700px","html":"<div -
     A                                      class=\"top\"></div><div class=\"im-
     A                                      agetop\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_top.png\" /></div>-
     A                                      <div class=\"menulinks\"></div><div-
     A                                       class=\"imagebottom\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_bott-
     A                                      om.png\" /></div><div class=\"botto-
     A                                      m\"></div>"},{"field type":"icon me-
     A                                      nu button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"32px","z index":"20","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1170px-
     A                                      ","id":"F7061F_SCR02_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon alignment":"middle left","ic-
     A                                      on width":"16px","icon height":"24p-
     A                                      x","icon source":"/profoundui/userd-
     A                                      ata/images/systool/systools.png","d-
     A                                      ata function":"SystemToolbarSystool-
     A                                      s","show down arrow":"Yes"},{"field-
     A                                       type":"panel","panel style":"Trans-
     A                                      formButtonBar","id":"F7061F_SCR02_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"F7061F_SCR02_BtnSave","tool ti-
     A                                      p":"Save","onclick":"SystemToolbarS-
     A                                      ave","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sav-
     A                                      e.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      66px","id":"F7061F_SCR02_BtnRefresh-
     A                                      ","tool tip":"Refresh","onclick":"S-
     A                                      ystemToolbarRefresh","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/refresh.png'')"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1092px","id":"F706-
     A                                      1F_SCR02_BtnSearch","tool tip":"Sea-
     A                                      rch","onclick":"SystemToolbarSearch-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/search-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","bo')
     A                                  1  4HTML('rder top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1118px","id":"F7061F_SC-
     A                                      R02_BtnDiaryItems","tool tip":"Diar-
     A                                      y/Work Items - IDARTS","onclick":"S-
     A                                      ystemToolbarDiary","background imag-
     A                                      e":{"fieldName":"DryIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1144px","id":"F7061F_SCR02_B-
     A                                      tnSystemMessages","tool tip":"Syste-
     A                                      m Messages","onclick":"SystemToolba-
     A                                      rMessages","background image":{"fie-
     A                                      ldName":"MsgIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      196px","id":"F7061F_SCR02_BtnHelp",-
     A                                      "tool tip":"Help","onclick":"System-
     A                                      ToolbarHelp","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/help.png'')"},{"id":"F7061F_SC-
     A                                      R02_ImgSysToolBottom","field type":-
     A                                      "image","image source":"/profoundui-
     A                                      /userdata/images/systool/butbarbot.-
     A                                      png","left":"1036px","top":"64px","-
     A                                      width":"187px","locked in place":"t-
     A                                      rue","css class":"stationary","visi-
     A                                      bility":"hidden"},{"id":"F7061F_SCR-
     A                                      02_MainTabPanel","field type":"tab -
     A                                      panel","tab panel style":"Transform-
     A                                      ","tab names":{"fieldName":"SCPRDS"-
     A                                      ,"designValue":"[SCPRDS]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"active tab":"0","l-
     A                                      eft":"250px","top":"70px","width":"-
     A                                      970px","height":"657px","z index":"-
     A                                      8","locked in place":"true","css cl-
     A                                      ass":"tab-panel","css class 2":"sta-
     A                                      tionary"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"F7-
     A                                      061F_SCR02_BtnHiddenSave","value":"-
     A                                      btnSave","top":"100px","response":{-
     A                                      "fieldName":"btnSave","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"SCR02_-
     A                                      SCUSER","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCUSER","des-
     A                                      ignValue":"[SCUSER]","refField":"US-
     A                                      ER","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"281px","cursor column":"-
     A                                      2","top":"110px","cursor row":"1","-
     A                                      css class 2":"top-line","parent tab-
     A                                       panel":"F7061F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCC-
     A                                      ONM","field type":"output field","v-
     A                                      alue":{"fieldName":"SCCONM","design-
     A                                      Value":"[SCCONM]","refField":"NAME"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none"},"css class":"output-field",-
     A                                      "left":"414px","cursor column":"21"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","description"-
     A                                      :"COMPANY NAME","parent tab panel":-
     A                                      "F7061F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant10","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"F7061F_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"F70-
     A                                      61F_SCR02_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F7061F_SCR-
     A                                      02_BtnHiddenRefresh","value":"btnRe-
     A                                      fresh","top":"125px","response":{"f-
     A                                      ieldName":"btnRefresh","da')
     A                                  1  5HTML('taType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"constant11","field type":-
     A                                      "output field","value":"F7061F","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "F7061F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCPRDS","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      130px","cursor row":"2","descriptio-
     A                                      n":"PROGRAM NAME","parent tab panel-
     A                                      ":"F7061F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","visibility":"hidden","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant12","field type":"ou-
     A                                      tput field","value":"SCR02","css cl-
     A                                      ass":"constant","left":"799px","cur-
     A                                      sor column":"76","top":"130px","cur-
     A                                      sor row":"2","parent tab panel":"F7-
     A                                      061F_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCMODE","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCMODE","designValue":"[SCMODE]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      ","dataLength":"10"},"css class":"o-
     A                                      utput-field","left":"764px","cursor-
     A                                       column":"71","top":"150px","cursor-
     A                                       row":"3","parent tab panel":"F7061-
     A                                      F_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"F7061F_-
     A                                      SCR02_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"F7061F_SCR02_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant13","field t-
     A                                      ype":"output field","value":"Transf-
     A                                      er From:","css class":"constant","l-
     A                                      eft":"274px","cursor column":"1","t-
     A                                      op":"190px","cursor row":"5","paren-
     A                                      t tab panel":"F7061F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant14","field type":"output field"-
     A                                      ,"value":"Company ","css class":"co-
     A                                      nstant","left":"407px","cursor colu-
     A                                      mn":"20","top":"190px","cursor row"-
     A                                      :"5","parent tab panel":"F7061F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant15","field type":"ou-
     A                                      tput field","value":"Subscriber","c-
     A                                      ss class":"constant","left":"491px"-
     A                                      ,"cursor column":"32","top":"190px"-
     A                                      ,"cursor row":"5","parent tab panel-
     A                                      ":"F7061F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant16","fi-
     A                                      eld type":"output field","value":"G-
     A                                      roup","css class":"constant","left"-
     A                                      :"610px","cursor column":"49","top"-
     A                                      :"190px","cursor row":"5","parent t-
     A                                      ab panel":"F7061F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t17","field type":"output field","v-
     A                                      alue":"Year","css class":"constant"-
     A                                      ,"left":"694px","cursor column":"61-
     A                                      ","top":"190px","cursor row":"5","p-
     A                                      arent tab panel":"F7061F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant18","field type":"output fi-
     A                                      eld","value":"Case","css class":"co-
     A                                      nstant","left":"771px","cursor colu-
     A                                      mn":"72","top":"190px","cursor row"-
     A                                      :"5","parent tab panel":"F7061F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F7061F_SCR02-
     A                                      _BtnHiddenSystemMessages","value":"-
     A                                      btnMessage","top":"200px","response-
     A                                      ":{"fieldName":"btnMessage","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      SCR02_SCFCO#","field type":"output -
     A                                      field","value":{"fieldName":"SCFCO#-
     A                                      ","designValue":"[SCFCO#]","refFiel-
     A                                      d":"CO#","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"421px","cursor column-
     A                                      ":"22","top":"210px","cursor row":"-
     A                                      6","width":"21px","text align":"rig-
     A                                      ht","css class 2":"HI","description-
     A                                      ":"From Company #","parent tab pane-
     A                                      l":"F7061F_SCR02_MainTabPa')
     A                                  1  6HTML('nel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant19","field type":"output f-
     A                                      ield","value":"-","css class":"cons-
     A                                      tant","left":"470px","cursor column-
     A                                      ":"29","top":"210px","cursor row":"-
     A                                      6","parent tab panel":"F7061F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR02_SCFSUB","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CFSUB","designValue":"[SCFSUB]","re-
     A                                      fField":"SUB#","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"505px","cursor -
     A                                      column":"34","top":"210px","cursor -
     A                                      row":"6","width":"35px","text align-
     A                                      ":"right","css class 2":"HI","descr-
     A                                      iption":"FROM SUBSCRIBER","parent t-
     A                                      ab panel":"F7061F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t20","field type":"output field","v-
     A                                      alue":"-","css class":"constant","l-
     A                                      eft":"582px","cursor column":"45","-
     A                                      top":"210px","cursor row":"6","pare-
     A                                      nt tab panel":"F7061F_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      02_SCFFND","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCFFND","-
     A                                      designValue":"[SCFFND]","refField":-
     A                                      "FND","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"999.00"},"css class":"output-fiel-
     A                                      d","left":"617px","cursor column":"-
     A                                      50","top":"210px","cursor row":"6",-
     A                                      "width":"21px","text align":"right"-
     A                                      ,"css class 2":"HI","description":"-
     A                                      From Group","parent tab panel":"F70-
     A                                      61F_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant21","field ty-
     A                                      pe":"output field","value":"-","css-
     A                                       class":"constant","left":"659px","-
     A                                      cursor column":"56","top":"210px","-
     A                                      cursor row":"6","parent tab panel":-
     A                                      "F7061F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCFFYR","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCFFYR","designValue":"-
     A                                      [SCFFYR]","refField":"YR","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00"},"css-
     A                                       class":"output-field","left":"701p-
     A                                      x","cursor column":"62","top":"210p-
     A                                      x","cursor row":"6","width":"14px",-
     A                                      "text align":"right","css class 2":-
     A                                      "HI","description":"From Fund Year"-
     A                                      ,"parent tab panel":"F7061F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant22","field type":"output-
     A                                       field","value":"-","css class":"co-
     A                                      nstant","left":"736px","cursor colu-
     A                                      mn":"67","top":"210px","cursor row"-
     A                                      :"6","parent tab panel":"F7061F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCR02_SCFCAS","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCFCAS","designValue":"[SCFCAS]","-
     A                                      refField":"CASE","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"764px","curso-
     A                                      r column":"71","top":"210px","curso-
     A                                      r row":"6","width":"49px","text ali-
     A                                      gn":"right","css class 2":"HI","des-
     A                                      cription":"From Case","parent tab p-
     A                                      anel":"F7061F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"F7061F_SCR02_BtnHiddenWorkSubm-
     A                                      itJob","value":"btnWrksbmjob","top"-
     A                                      :"225px","response":{"fieldName":"b-
     A                                      tnWrkJob","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant23","field-
     A                                       type":"output field","value":"C l -
     A                                      i e n t    N a m e","css class":"co-
     A                                      nstant","left":"281px","cursor colu-
     A                                      mn":"2","top":"250px","cursor row":-
     A                                      "8","parent tab panel":"F7061F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"constant24","field type":"out-
     A                                      put field","value":"Soc. Sec. #","c-
     A                                      ss class":"constant","left":"589px"-
     A                                      ,"cursor column":"46","top":"250px"-
     A                                      ,"cursor row":"8","parent tab panel-
     A                                      ":"F7061F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"constant25","fi-
     A                                      eld type":"output field","value":"A-
     A                                      cc. Date","css class":"constant","l-
     A                                      eft":"701px","cursor column":"62","-
     A                                      top":"250px","cursor row":"8","pare-
     A                                      nt tab panel":"F7061F_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visib')
     A                                  1  7HTML('ility":"hidden","id":"F7061F_-
     A                                      SCR02_BtnHiddenWorkPrinterOutput","-
     A                                      value":"btnWrkprtout","top":"250px"-
     A                                      ,"response":{"fieldName":"btnWrkPrn-
     A                                      t","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"SCNAME","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      NAME","designValue":"[SCNAME]","ref-
     A                                      Field":"NAME","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none"},"css class":"o-
     A                                      utput-field","left":"281px","cursor-
     A                                       column":"2","top":"270px","cursor -
     A                                      row":"9","css class 2":"HI","descri-
     A                                      ption":"NAME","parent tab panel":"F-
     A                                      7061F_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCSS#","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCSS#","designValue":"[SCSS#]","-
     A                                      refField":"SS#","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"596px","curs-
     A                                      or column":"47","top":"270px","curs-
     A                                      or row":"9","css class 2":"HI","des-
     A                                      cription":"Soc Sec #","parent tab p-
     A                                      anel":"F7061F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCACDT","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCACDT","designValue":"-
     A                                      [SCACDT]","refField":"DT8","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","edtW-
     A                                      rd":"''  /  /    ''"},"css class":"-
     A                                      output-field","left":"701px","curso-
     A                                      r column":"62","top":"270px","curso-
     A                                      r row":"9","width":"70px","text ali-
     A                                      gn":"right","css class 2":"HI","des-
     A                                      cription":"Accident Date","parent t-
     A                                      ab panel":"F7061F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F7061F_SCR02_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F706-
     A                                      1F_SCR02_BtnHiddenHelp","value":"bt-
     A                                      nHelp","top":"300px","response":{"f-
     A                                      ieldName":"btnHelp","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      26","field type":"output field","va-
     A                                      lue":"TO:","css class":"constant","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"310px","cursor row":"11","pa-
     A                                      rent tab panel":"F7061F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant27","field type":"output fie-
     A                                      ld","value":"Company #  :","css cla-
     A                                      ss":"constant","left":"470px","curs-
     A                                      or column":"29","top":"310px","curs-
     A                                      or row":"11","parent tab panel":"F7-
     A                                      061F_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCTCO#","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCTCO#","designValue":"[SCTC-
     A                                      O#]","refField":"CO#","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00","numBlank-
     A                                      Fill":"true"},"left":"568px","curso-
     A                                      r column":"43","top":"310px","curso-
     A                                      r row":"11","width":"22px","text al-
     A                                      ign":"right","css class 3":"HI","er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0507","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"21","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"description":"To Company -
     A                                      #","parent tab panel":"F7061F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      id":"constant28","field type":"outp-
     A                                      ut field","value":"Subscriber","css-
     A                                       class":"constant","left":"470px","-
     A                                      cursor column":"29","top":"350px","-
     A                                      cursor row":"13","parent tab panel"-
     A                                      :"F7061F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant29","fie-
     A                                      ld type":"output field","value":":"-
     A                                      ,"css class":"constant","left":"547-
     A                                      px","cursor column":"40","top":"350-
     A                                      px","cursor row":"13","parent tab p-
     A                                      anel":"F7061F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCTSUB","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCTSUB","d')
     A                                  1  8HTML('esignValue":"[SCTSUB]","refFi-
     A                                      eld":"SUB#","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00","numBlankFill":"tru-
     A                                      e"},"left":"568px","cursor column":-
     A                                      "43","top":"350px","cursor row":"13-
     A                                      ","width":"36px","text align":"righ-
     A                                      t","css class 3":"HI","set focus":{-
     A                                      "fieldName":"31","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"MCR0503","error message fi-
     A                                      le":"FSMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"29","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"MCR0787-
     A                                      ","error message file 2":"FSMESG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"30"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"description":"TO SUBSCRIBER","par-
     A                                      ent tab panel":"F7061F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       4":"profound-converted"},{"id":"co-
     A                                      nstant30","field type":"output fiel-
     A                                      d","value":"Group       :","css cla-
     A                                      ss":"constant","left":"470px","curs-
     A                                      or column":"29","top":"390px","curs-
     A                                      or row":"15","parent tab panel":"F7-
     A                                      061F_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCTFND","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCTFND","designValue":"[SCTF-
     A                                      ND]","refField":"FND","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00","numBlank-
     A                                      Fill":"true"},"left":"568px","curso-
     A                                      r column":"43","top":"390px","curso-
     A                                      r row":"15","width":"22px","text al-
     A                                      ign":"right","css class 3":"HI","se-
     A                                      t focus":{"fieldName":"32","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message id":"MCR0503","error -
     A                                      message file":"FSMESG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"22","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"2 messages","error message id 2-
     A                                      ":"MCR0508","error message file 2":-
     A                                      "FSMESG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"23","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"description":"To Group"-
     A                                      ,"parent tab panel":"F7061F_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 4":"profound-converted"},{"id-
     A                                      ":"constant31","field type":"output-
     A                                       field","value":"Year       :","css-
     A                                       class":"constant","left":"470px","-
     A                                      cursor column":"29","top":"430px","-
     A                                      cursor row":"17","parent tab panel"-
     A                                      :"F7061F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCTFYR","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCTFYR","designValue":"[-
     A                                      SCTFYR]","refField":"YR","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00"},"left-
     A                                      ":"568px","cursor column":"43","top-
     A                                      ":"430px","cursor row":"17","width"-
     A                                      :"15px","css class 3":"HI","set foc-
     A                                      us":{"fieldName":"33","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"descr-
     A                                      iption":"To Fund Year","parent tab -
     A                                      panel":"F7061F_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"id":"constant32-
     A                                      ","field type":"output field","valu-
     A                                      e":"Case       :","css class":"cons-
     A                                      tant","left":"470px","cursor column-
     A                                      ":"29","top":"470px","cursor row":"-
     A                                      19","parent tab panel":"F7061F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCTCAS","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      TCAS","designValue":"[SCTCAS]","ref-
     A                                      Field":"CASE","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"left":"568px","-
     A                                      cursor column":"43","top":"470px","-
     A                                      cursor row":"19","width":"50px","cs-
     A                                      s class 3":"HI","error message id":-
     A                                      "MCR0726","error message file":"FSM-
     A                                      ESG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"2-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"2 messages","e-
     A                                      rror message id 2":"MCR0001","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"27","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"descri-
     A                                      ption":"To Case","parent tab panel"-
     A                                      :"F7061F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"SCEM","')
     A                                  1  9HTML('field type":"output field","v-
     A                                      alue":{"fieldName":"SCEM","designVa-
     A                                      lue":"[SCEM]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"38"},"-
     A                                      css class":"output-field","left":"4-
     A                                      14px","cursor column":"21","top":"5-
     A                                      10px","cursor row":"21","css class -
     A                                      2":"HI","parent tab panel":"F7061F_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"15-
     A                                      0px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF03","field type":"button","v-
     A                                      alue":"Exit","shortcut key":"F3","l-
     A                                      eft":"14px","top":"183px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF06","fi-
     A                                      eld type":"button","value":"Subscri-
     A                                      ber search","shortcut key":"F6","le-
     A                                      ft":"14px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF10","fie-
     A                                      ld type":"button","value":"Group se-
     A                                      arch","shortcut key":"F10","left":"-
     A                                      14px","top":"249px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF12","field ty-
     A                                      pe":"button","value":"Cancel  ","sh-
     A                                      ortcut key":"F12","left":"14px","to-
     A                                      p":"282px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnHELP","field type":"butt-
     A                                      on","shortcut key":"Alt-F1","bypass-
     A                                       validation":"true","value":"HELP",-
     A                                      "response":{"fieldName":"*IN10","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"lef-
     A                                      t":"14px","top":"315px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCEM          38A  H
     A            SCMODE        10A  H
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFCAS    R        H      REFFLD(CASE)
     A            SCFCO#    R        H      REFFLD(CO#)
     A            SCFFND    R        H      REFFLD(FND)
     A            SCFFYR    R        H      REFFLD(YR)
     A            SCFSUB    R        H      REFFLD(SUB#)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSS#     R        H      REFFLD(SS#)
     A            SCTCAS    R        H      REFFLD(CASE)
     A            SCTCO#    R        H      REFFLD(CO#)
     A            SCTFND    R        H      REFFLD(FND)
     A            SCTFYR    R        H      REFFLD(YR)
     A            SCTSUB    R        H      REFFLD(SUB#)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR03
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"1-24"},"items-
     A                                      ":[{"id":"F7061F_SCR03_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"F7061F_SCR03-
     A                                      _action","field type":"html contain-
     A                                      er","white space":"normal","left":"-
     A                                      0px","top":"10px","width":"230px","-
     A                                      css class":"action-panel-converted"-
     A                                      ,"height":"700px","html":"<div clas-
     A                                      s=\"top\"></div><div class=\"imaget-
     A                                      op\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_top.png\" /></div><div-
     A                                       class=\"menulinks\"></div><div cla-
     A                                      ss=\"imagebottom\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_bottom.p-
     A                                      ng\" /></div><div class=\"bottom\">-
     A                                      </div>"},{"field type":"icon menu b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      32px","z index":"20","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1170px","i-
     A                                      d":"F7061F_SCR03_BtnIconMenuSystemT-
     A                                      ools","tool tip":"System Tools","ic-
     A                                      on alignment":"middle left","icon w-
     A                                      idth":"16px","icon height":"24px","-
     A                                      icon source":"/profoundui/userdata/-
     A                                      images/systool/systools.png","data -
     A                                      function":"SystemToolbarSystools","-
     A                                      show down arrow":"Yes"},{"field typ-
     A                                      e":"panel","panel style":"Transform-
     A                                      ButtonBar","id":"F7061F_SCR03_Butto-
     A                                      nBar","top":"35px","left":"1036px",-
     A                                      "width":"187px","height":"28px","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden","locked in place":"true"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1040px","id":-
     A                                      "F7061F_SCR03_BtnSave","tool tip":"-
     A                                      Save","onclick":"SystemToolbarSave"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/save.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1066px-
     A                                      ","id":"F7061F_SCR03_BtnRefresh","t-
     A                                      ool tip":"Refresh","onclick":"Syste-
     A                                      mToolbarRefresh","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/refresh.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1092px","id":"F7061F_S-
     A                                      CR03_BtnSearch","tool tip":"Search"-
     A                                      ,"onclick":"SystemToolbarSearch","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/search.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1118px"-
     A                                      ,"id":"F7061F_SCR03_BtnDiaryItems",-
     A                                      "tool tip":"Diary/Work Items - IDAR-
     A                                      TS","onclick":"SystemToolbarDiary",-
     A                                      "background image":{"fieldName":"Dr-
     A                                      yIcnURL","dataLength":"128","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"}}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1144px","id"-
     A                                      :"F7061F_SCR03_BtnSystemMessages","-
     A                                      tool tip":"System Messages","onclic-
     A                                      k":"SystemToolbarMessages","backgro-
     A                                      und image":{"fieldName":"MsgIcnURL"-
     A                                      ,"dataLength":"128","trimL')
     A                                  1  4HTML('eading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1196p-
     A                                      x","id":"F7061F_SCR03_BtnHelp","too-
     A                                      l tip":"Help","onclick":"SystemTool-
     A                                      barHelp","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /help.png'')"},{"id":"F7061F_SCR03_-
     A                                      ImgSysToolBottom","field type":"ima-
     A                                      ge","image source":"/profoundui/use-
     A                                      rdata/images/systool/butbarbot.png"-
     A                                      ,"left":"1036px","top":"64px","widt-
     A                                      h":"187px","locked in place":"true"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden"},{"id":"F7061F_SCR03_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F7061F-
     A                                      _SCR03_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCR03_SCUS-
     A                                      ER","field type":"output field","va-
     A                                      lue":{"fieldName":"SCUSER","designV-
     A                                      alue":"[SCUSER]","refField":"USER",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","parent tab pan-
     A                                      el":"F7061F_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCR03_SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","description":"CO-
     A                                      MPANY NAME","parent tab panel":"F70-
     A                                      61F_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant33","field ty-
     A                                      pe":"output field","left":"778px","-
     A                                      cursor column":"73","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"F7061F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"F7061F_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"F7061F_SCR03_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant3-
     A                                      4","field type":"output field","val-
     A                                      ue":"F7061F","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"F7061F_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR03_SCPRDS","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPRDS"-
     A                                      ,"designValue":"[SCPRDS]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"414px","cursor colu-
     A                                      mn":"21","top":"130px","cursor row"-
     A                                      :"2","description":"PROGRAM NAME","-
     A                                      parent tab panel":"F7061F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","visibi-
     A                                      lity":"hidden","css class 2":"profo-
     A                                      und-converted"},{"id":"constant35",-
     A                                      "field type":"output field","value"-
     A                                      :"SCR03","css class":"constant","le-
     A                                      ft":"799px","cursor column":"76","t-
     A                                      op":"130px","cursor row":"2","paren-
     A                                      t tab panel":"F7061F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","cs')
     A                                  1  5HTML('s class 2":"profound-converte-
     A                                      d"},{"id":"SCR03_SCMODE","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCMODE","designValue":"[SCMODE-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne","dataLength":"10"},"css class":-
     A                                      "output-field","left":"764px","curs-
     A                                      or column":"71","top":"150px","curs-
     A                                      or row":"3","parent tab panel":"F70-
     A                                      61F_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"F7061-
     A                                      F_SCR03_BtnHiddenSearch","value":"b-
     A                                      tnSearch","top":"150px","response":-
     A                                      {"fieldName":"btnSearch","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"F7061F_SCR03_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant36","field-
     A                                       type":"output field","value":"Tran-
     A                                      sfer From:","css class":"constant",-
     A                                      "left":"274px","cursor column":"1",-
     A                                      "top":"190px","cursor row":"5","par-
     A                                      ent tab panel":"F7061F_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant50","field type":"output fiel-
     A                                      d","value":"Company #","css class":-
     A                                      "constant","left":"407px","cursor c-
     A                                      olumn":"20","top":"190px","cursor r-
     A                                      ow":"5","parent tab panel":"F7061F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant56","field type":-
     A                                      "output field","value":"Subscriber"-
     A                                      ,"css class":"constant","left":"498-
     A                                      px","cursor column":"33","top":"190-
     A                                      px","cursor row":"5","parent tab pa-
     A                                      nel":"F7061F_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant55",-
     A                                      "field type":"output field","value"-
     A                                      :"Group","css class":"constant","le-
     A                                      ft":"617px","cursor column":"50","t-
     A                                      op":"190px","cursor row":"5","paren-
     A                                      t tab panel":"F7061F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant37","field type":"output field"-
     A                                      ,"value":"Year","css class":"consta-
     A                                      nt","left":"701px","cursor column":-
     A                                      "62","top":"190px","cursor row":"5"-
     A                                      ,"parent tab panel":"F7061F_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant38","field type":"output-
     A                                       field","value":"Case","css class":-
     A                                      "constant","left":"771px","cursor c-
     A                                      olumn":"72","top":"190px","cursor r-
     A                                      ow":"5","parent tab panel":"F7061F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"F7061F_SC-
     A                                      R03_BtnHiddenSystemMessages","value-
     A                                      ":"btnMessage","top":"200px","respo-
     A                                      nse":{"fieldName":"btnMessage","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"SCR03_SCFCO#","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCF-
     A                                      CO#","designValue":"[SCFCO#]","refF-
     A                                      ield":"CO#","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"css class":"outpu-
     A                                      t-field","left":"421px","cursor col-
     A                                      umn":"22","top":"210px","cursor row-
     A                                      ":"6","width":"21px","text align":"-
     A                                      right","css class 2":"HI","descript-
     A                                      ion":"From Company #:","parent tab -
     A                                      panel":"F7061F_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant57-
     A                                      ","field type":"output field","valu-
     A                                      e":"-","css class":"constant","left-
     A                                      ":"477px","cursor column":"30","top-
     A                                      ":"210px","cursor row":"6","parent -
     A                                      tab panel":"F7061F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCFSUB","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCFSUB","des-
     A                                      ignValue":"[SCFSUB]","refField":"SU-
     A                                      B#","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"512px","cursor column":"35-
     A                                      ","top":"210px","cursor row":"6","w-
     A                                      idth":"35px","text align":"right","-
     A                                      css class 2":"HI","description":"FR-
     A                                      OM SUBSCRIBER","parent tab panel":"-
     A                                      F7061F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant39","field-
     A                                       type":"output field","value":"-","-
     A                                      css class":"constant","left":"589px-
     A                                      ","cursor column":"46","top":"210px-
     A                                      ","cursor row":"6","parent')
     A                                  1  6HTML(' tab panel":"F7061F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR03_SCFFND","field type":"output-
     A                                       field","value":{"fieldName":"SCFFN-
     A                                      D","designValue":"[SCFFND]","refFie-
     A                                      ld":"FND","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"624px","cursor colum-
     A                                      n":"51","top":"210px","cursor row":-
     A                                      "6","width":"21px","text align":"ri-
     A                                      ght","css class 2":"HI","descriptio-
     A                                      n":"From Group","parent tab panel":-
     A                                      "F7061F_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant40","fiel-
     A                                      d type":"output field","value":"-",-
     A                                      "css class":"constant","left":"666p-
     A                                      x","cursor column":"57","top":"210p-
     A                                      x","cursor row":"6","parent tab pan-
     A                                      el":"F7061F_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR03_SCFFYR"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFFYR","designValu-
     A                                      e":"[SCFFYR]","refField":"YR","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      708px","cursor column":"63","top":"-
     A                                      210px","cursor row":"6","width":"14-
     A                                      px","text align":"right","css class-
     A                                       2":"HI","description":"From Fund Y-
     A                                      ear","parent tab panel":"F7061F_SCR-
     A                                      03_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant41","field type":"ou-
     A                                      tput field","value":"-","css class"-
     A                                      :"constant","left":"743px","cursor -
     A                                      column":"68","top":"210px","cursor -
     A                                      row":"6","parent tab panel":"F7061F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCR03_SCFCAS","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCFCAS","designValue":"[SCFCAS-
     A                                      ]","refField":"CASE","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"764px","c-
     A                                      ursor column":"71","top":"210px","c-
     A                                      ursor row":"6","width":"49px","text-
     A                                       align":"right","css class 2":"HI",-
     A                                      "description":"From Case","parent t-
     A                                      ab panel":"F7061F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"F7061F_SCR03_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant42","f-
     A                                      ield type":"output field","value":"-
     A                                      C l i e n t    N a m e","css class"-
     A                                      :"constant","left":"330px","cursor -
     A                                      column":"9","top":"250px","cursor r-
     A                                      ow":"8","parent tab panel":"F7061F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"constant43","field type":-
     A                                      "output field","value":"Soc. Sec. #-
     A                                      ","css class":"constant","left":"63-
     A                                      8px","cursor column":"53","top":"25-
     A                                      0px","cursor row":"8","parent tab p-
     A                                      anel":"F7061F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"constant44"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Acc. Date","css class":"constant-
     A                                      ","left":"750px","cursor column":"6-
     A                                      9","top":"250px","cursor row":"8","-
     A                                      parent tab panel":"F7061F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"F7061F_SCR03_BtnHi-
     A                                      ddenWorkPrinterOutput","value":"btn-
     A                                      Wrkprtout","top":"250px","response"-
     A                                      :{"fieldName":"btnWrkPrnt","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant46","field type":"output fie-
     A                                      ld","value":"From:","css class":"co-
     A                                      nstant","left":"281px","cursor colu-
     A                                      mn":"2","top":"270px","cursor row":-
     A                                      "9","parent tab panel":"F7061F_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCR03_SCNAME","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCNAME","designValue":"[SCNAME]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"330px","curs-
     A                                      or column":"9","top":"270px","curso-
     A                                      r row":"9","css class 2":"HI","desc-
     A                                      ription":"NAME","parent tab panel":-
     A                                      "F7061F_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCR03_SCSS#","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCSS#","designV')
     A                                  1  7HTML('alue":"[SCSS#]","refField":"S-
     A                                      S#","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"645px","cursor column":"-
     A                                      54","top":"270px","cursor row":"9",-
     A                                      "css class 2":"HI","description":"S-
     A                                      oc Sec #","parent tab panel":"F7061-
     A                                      F_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCR03_SCACDT","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCACDT","designValue":"[SCACD-
     A                                      T]","refField":"DT8","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"true","curSym":"","units-
     A                                      ":"","negNum":"-999.00","edtWrd":"'-
     A                                      '  /  /    ''"},"css class":"output-
     A                                      -field","left":"750px","cursor colu-
     A                                      mn":"69","top":"270px","cursor row"-
     A                                      :"9","width":"70px","text align":"r-
     A                                      ight","css class 2":"HI","descripti-
     A                                      on":"Accident Date","parent tab pan-
     A                                      el":"F7061F_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"F7061F_SCR03_BtnHiddenImageQueue-
     A                                      ","value":"btnImgQue","top":"275px"-
     A                                      ,"response":{"fieldName":"btnImgQue-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F7061F_SCR-
     A                                      03_BtnHiddenHelp","value":"btnHelp"-
     A                                      ,"top":"300px","response":{"fieldNa-
     A                                      me":"btnHelp","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant45","f-
     A                                      ield type":"output field","value":"-
     A                                      TO:","css class":"constant","left":-
     A                                      "414px","cursor column":"21","top":-
     A                                      "310px","cursor row":"11","parent t-
     A                                      ab panel":"F7061F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t51","field type":"output field","v-
     A                                      alue":"Company #   :","css class":"-
     A                                      constant","left":"470px","cursor co-
     A                                      lumn":"29","top":"310px","cursor ro-
     A                                      w":"11","parent tab panel":"F7061F_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR03_SCTCO#","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCTCO#","designValue":"[SCTCO#]-
     A                                      ","refField":"CO#","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"575px","cur-
     A                                      sor column":"44","top":"310px","cur-
     A                                      sor row":"11","width":"21px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      description":"To Company #","parent-
     A                                       tab panel":"F7061F_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant58","field type":"output field",-
     A                                      "value":"Subscriber  :","css class"-
     A                                      :"constant","left":"470px","cursor -
     A                                      column":"29","top":"330px","cursor -
     A                                      row":"12","parent tab panel":"F7061-
     A                                      F_SCR03_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCR03_SCTSUB","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCTSUB","designValue":"[SCTSU-
     A                                      B]","refField":"SUB#","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00"},"css cla-
     A                                      ss":"output-field","left":"575px","-
     A                                      cursor column":"44","top":"330px","-
     A                                      cursor row":"12","width":"35px","te-
     A                                      xt align":"right","css class 2":"HI-
     A                                      ","description":"TO SUBSCRIBER","pa-
     A                                      rent tab panel":"F7061F_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant52","field type":"output fie-
     A                                      ld","value":"Group       :","css cl-
     A                                      ass":"constant","left":"470px","cur-
     A                                      sor column":"29","top":"350px","cur-
     A                                      sor row":"13","parent tab panel":"F-
     A                                      7061F_SCR03_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCR03_SCTFND","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCTFND","designValue":"[S-
     A                                      CTFND]","refField":"FND","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00"},"css -
     A                                      class":"output-field","left":"575px-
     A                                      ","cursor column":"44","top":"350px-
     A                                      ","cursor row":"13","width":"21px",-
     A                                      "text align":"right","css class 2":-
     A                                      "HI","description":"To Group","pare-
     A                                      nt tab panel":"F7061F_SCR03_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant53","field type":"output field-
     A                                      ","value":"Year        :","css clas-
     A                                      s":"constant","left":"470px","curso-
     A                                      r column":"29","top":"370px","curso-
     A                                      r row":"14","parent tab panel":"F70-
     A                                      61F_SCR03_MainTabPanel","p')
     A                                  1  8HTML('arent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCR03_-
     A                                      SCTFYR","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCTFYR","des-
     A                                      ignValue":"[SCTFYR]","refField":"YR-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"575px","cursor column":"44",-
     A                                      "top":"370px","cursor row":"14","wi-
     A                                      dth":"14px","text align":"right","c-
     A                                      ss class 2":"HI","description":"To -
     A                                      Fund Year","parent tab panel":"F706-
     A                                      1F_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant54","field typ-
     A                                      e":"output field","value":"Case    -
     A                                          :","css class":"constant","left-
     A                                      ":"470px","cursor column":"29","top-
     A                                      ":"390px","cursor row":"15","parent-
     A                                       tab panel":"F7061F_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCR03-
     A                                      _SCTCAS","field type":"output field-
     A                                      ","value":{"fieldName":"SCTCAS","de-
     A                                      signValue":"[SCTCAS]","refField":"C-
     A                                      ASE","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"575px","cursor column":"4-
     A                                      4","top":"390px","cursor row":"15",-
     A                                      "width":"49px","text align":"right"-
     A                                      ,"css class 2":"HI","description":"-
     A                                      To Case","parent tab panel":"F7061F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant47","field type"-
     A                                      :"output field","value":"To:","css -
     A                                      class":"constant","left":"295px","c-
     A                                      ursor column":"4","top":"410px","cu-
     A                                      rsor row":"16","parent tab panel":"-
     A                                      F7061F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCNAM2","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCNAM2","designValue":"[SCNAM2-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"330px",-
     A                                      "cursor column":"9","top":"410px","-
     A                                      cursor row":"16","css class 2":"HI"-
     A                                      ,"description":"NAME","parent tab p-
     A                                      anel":"F7061F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"SCSS#2","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCSS#2","designValue":"-
     A                                      [SCSS#2]","refField":"SS#","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"6-
     A                                      45px","cursor column":"54","top":"4-
     A                                      10px","cursor row":"16","css class -
     A                                      2":"HI","description":"Soc Sec #","-
     A                                      parent tab panel":"F7061F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "SCACD2","field type":"output field-
     A                                      ","value":{"fieldName":"SCACD2","de-
     A                                      signValue":"[SCACD2]","refField":"D-
     A                                      T8","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","edtWrd":"''  /  /    ''"},"-
     A                                      css class":"output-field","left":"7-
     A                                      50px","cursor column":"69","top":"4-
     A                                      10px","cursor row":"16","width":"70-
     A                                      px","text align":"right","css class-
     A                                       2":"HI","description":"Accident Da-
     A                                      te","parent tab panel":"F7061F_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant48","field type":"out-
     A                                      put field","value":"Verify all info-
     A                                      rmation is correct, then press ente-
     A                                      r to transfer case","css class":"co-
     A                                      nstant","left":"295px","cursor colu-
     A                                      mn":"4","top":"450px","cursor row":-
     A                                      "18","css class 2":"RI","parent tab-
     A                                       panel":"F7061F_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant4-
     A                                      9","field type":"output field","val-
     A                                      ue":"To Bypass this transfer, use F-
     A                                      12 to return to previous screen","c-
     A                                      ss class":"constant","left":"323px"-
     A                                      ,"cursor column":"8","top":"490px",-
     A                                      "cursor row":"20","css class 2":"RI-
     A                                      ","parent tab panel":"F7061F_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCR03_SCEM","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCEM-
     A                                      ","designValue":"[SCEM]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"38"},"css class":"output-field-
     A                                      ","left":"414px","cursor column":"2-
     A                                      1","top":"530px","cursor row":"22",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"F7061F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"btnSubmit","fi-
     A                                      eld type":"button","value":"Enter",-
     A                                      "shortcut key":"Enter","left":"14px-
     A                                      ","top":"150px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF03","field type":-
     A                                      "button","value":"Exit","s')
     A                                  1  9HTML('hortcut key":"F3","left":"14p-
     A                                      x","top":"183px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF12","field type"-
     A                                      :"button","value":"Cancel  ","short-
     A                                      cut key":"F12","left":"14px","top":-
     A                                      "216px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnHELP","field type":"button"-
     A                                      ,"shortcut key":"Alt-F1","bypass va-
     A                                      lidation":"true","value":"HELP","re-
     A                                      sponse":{"fieldName":"*IN10","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"left":-
     A                                      "14px","top":"249px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCEM          38A  H
     A            SCMODE        10A  H
     A            SCACD2    R        H      REFFLD(DT8)
     A            SCACDT    R        H      REFFLD(DT8)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFCAS    R        H      REFFLD(CASE)
     A            SCFCO#    R        H      REFFLD(CO#)
     A            SCFFND    R        H      REFFLD(FND)
     A            SCFFYR    R        H      REFFLD(YR)
     A            SCFSUB    R        H      REFFLD(SUB#)
     A            SCNAM2    R        H      REFFLD(NAME)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSS#     R        H      REFFLD(SS#)
     A            SCSS#2    R        H      REFFLD(SS#)
     A            SCTCAS    R        H      REFFLD(CASE)
     A            SCTCO#    R        H      REFFLD(CO#)
     A            SCTFND    R        H      REFFLD(FND)
     A            SCTFYR    R        H      REFFLD(YR)
     A            SCTSUB    R        H      REFFLD(SUB#)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR99
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"F7061F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"F7061F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"F7061F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"F7061F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      F7061F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"F7061F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"F7061F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"F7061F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "F7061F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"F7061F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"F7061F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"F7061F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"F-
     A                                      7061F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"F7061-
     A                                      F_SCR99_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"F7061F_SCR99-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCERR",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","input only":"true","value":{"f-
     A                                      ieldName":"SCERR","designValue":"[S-
     A                                      CERR]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      8px","read only":"true","css class -
     A                                      3":"PR-UL","parent tab panel":"F706-
     A                                      1F_SCR99_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"F7061F-
     A                                      _SCR99_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"F7061F_SCR99_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"F70-
     A                                      61F_SCR99_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"F7061F_SCR-
     A                                      99_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F7061F_SCR99_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css cla')
     A                                  1  5HTML('ss":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"F706-
     A                                      1F_SCR99_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"F7061F_SCR99_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF03","field type":"button-
     A                                      ","value":"Exit","shortcut key":"F3-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnHELP"-
     A                                      ,"field type":"button","shortcut ke-
     A                                      y":"Alt-F1","bypass validation":"tr-
     A                                      ue","value":"HELP","response":{"fie-
     A                                      ldName":"*IN10","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"14px","top":-
     A                                      "216px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
