     A*****************************************************************
     A* (c) 2009 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A*  Title: Work with HES Bill Transfer History
     A*****************************************************************
     A*  CREATED BY C:227  11/03/09  Project : 135MMX
     A*****************************************************************
     A*  REVISIONS
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FSREFP)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      PAGEDOWN(01)
     A                                      PAGEUP(02)
     A          R SCR01S                    SFL
     A  08                                  SFLNXTCHG
     A            SCDBRR         9S 0H
     A            SCSEL          2A  B 11  2TEXT('Selection Field')
     A  07                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            SCDCID    R        H      REFFLD(DCID)
     A            SCMBR#    R        H      REFFLD(DS10)
     A            SCCVDT    R        H      REFFLD(DT8)
     A            SCCVTM    R        H      REFFLD(TIME)
     A            SCPRDT    R        H      REFFLD(DT8)
     A            SCPRTM    R        H      REFFLD(TIME)
     A            SCDATA        70   O 11  7
     A  60                                  COLOR(RED)
     A          R SCR01C                    SFLCTL(SCR01S)
     A                                      CF03
     A                                      CF05
     A                                      CF06
     A                                      CF11
     A                                      CF12
     A                                      CF17
     A                                      CF23
     A                                      CF24
     A                                      OVERLAY
     A  04                                  SFLDSP
     A N03                                  SFLDSPCTL
     A  03                                  SFLCLR
     A  95                                  SFLEND(*MORE)
     A  92                                  SFLMSGID(CPD6A81 *LIBL/QCPFMSG)
     A  93                                  SFLMSGID(CPD6A7C *LIBL/QCPFMSG)
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A* 12                                  SFLDROP(CF15)
     A*N12                                  SFLFOLD(CF15)
     A                                      SFLMODE(&SFLMOD)
     A            SFLMOD         1   H
     A            SCRRN1         4S 0H      SFLRCDNBR(CURSOR)
     A  22        SCPST2         1A  H
     A  23        SCPST3         1A  H
     A  24        SCPST4         1A  H
     A  25        SCPST5         1A  H
     A  26        SCPST6         1A  H
     A  27        SCPST7         1A  H
     A  28        SCPST8         1A  H
     A  29        SCPST9         1A  H
     A            SCOPL2        76A  H
     A                                  1  2USER
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      DSPATR(HI)
     A  91                                  ERRMSGID(CPF5203 *LIBL/QCPFMSG)
     A  94                                  ERRMSGID(CPF5204 *LIBL/QCPFMSG)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A            Q1PGM         10   O  2  2
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      DSPATR(HI)
     A                                  2 76'SCR01'
     A                                  5  2'Position to . . .'
     A                                  5 20'Document ID:'
     A            SCPST1    R        I  5 33REFFLD(DCID)
     A N06                                  DSPATR(PC)
     A                                  6  2'Type options, press Enter.'
     A                                      COLOR(BLU)
     A            SCOPL1        76      7  4
     A            SCHDL1        78     10  2DSPATR(HI)
     A                                  9 33'----- Convert ------'
     A                                      DSPATR(HI)
     A                                  9 55'---- Processed -----'
     A                                      DSPATR(HI)
     A          R SCR01
     A*%%TS  SD  19960912  144152  FREEMANT    REL-V3R6M0  5716-PW1
     A                                      OVERLAY
     A            SCFKL1        78     23  2
     A                                      COLOR(BLU)
     A            SCFKL2        78   H
     A          R SCR02S                    SFL
     A*%%TS  SD  19960910  170935  FREEMANT    REL-V3R6M0  5716-PW1
     A                                      SFLNXTCHG
     A            SCSF1R         4S 0H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  O  8  2TEXT('Selection Field')
     A            SCDATA        70   O  8  7
     A          R SCR02C                    SFLCTL(SCR02S)
     A*%%TS  SD  19960910  170935  FREEMANT    REL-V3R6M0  5716-PW1
     A                                      CF12
     A                                      OVERLAY
     A  14                                  SFLDSP
     A N13                                  SFLDSPCTL
     A  13                                  SFLCLR
     A N15                                  SFLEND(*MORE)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A            SCRRN2         4S 0H      SFLRCDNBR
     A                                  1  2USER
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      DSPATR(HI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A            Q1PGM         10   O  2  2
     A            SCPRD2    R        O  2 21REFFLD(NAME)
     A                                      DSPATR(HI)
     A                                  2 76'SCR02'
     A                                  4  2'Press Enter to confirm your choice-
     A                                      s for 4=Delete.'
     A                                      COLOR(BLU)
     A                                  5  2'Press F12 to return to change your-
     A                                       choices.'
     A                                      COLOR(BLU)
     A            SCHDL1        78      7  2
     A                                      DSPATR(HI)
     A          R SCR02
     A*%%TS  SD  19960909  173107  FREEMANT    REL-V3R6M0  5716-PW1
     A                                 23  2'F12=Cancel'
     A                                      COLOR(BLU)
     A          R SCR03
     A*%%TS  SD  19960912  144152  FREEMANT    REL-V3R6M0  5716-PW1
     A                                      CF12
     A                                      WINDOW(3 4 10 70)
     A                                  1  2USER
     A            SCPRD3    R        O  1 16REFFLD(NAME)
     A                                      DSPATR(HI)
     A                                  1 66'SCR03'
     A                                  3  2'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                  9  2'F12=Cancel'
     A                                      COLOR(BLU)
     A          R MSGSFL                    SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            Q1PGM                     SFLPGMQ
     A          R MSGSFLC                   SFLCTL(MSGSFL)
     A                                      SFLSIZ(5) SFLPAG(1)
     A N10                                  SFLEND
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A                                      SFLINZ
     A            Q1PGM                     SFLPGMQ
