     A*%%TS  SD  19950925  170942  PJEANN      REL-V3R0M5  5763-PW1
     A**
     A* (C) Copyright PROGRESSIVE DATA SOLUTIONS, INC., 1995
     A**
     A**  Prompt Screen for BCL-9 Magnetic Tape
     A**
     A**
     A
     A                                      REF(*LIBL/FSREFP)
     A          R HEAD                      SKIPB(001)
     A            CONAME         1        85
     A            DATE           6S 0O   122EDTCDE(Y)
     A                                      SPACEA(2)
     A            Q1PGM         10        10
     A                                    34'TEXAS STATE TAPE EDIT REPORT'
     A            ORTITL        60        96
     A                                   116'PAGE:'
     A                                    +1PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(2)
     A                                     5'FUND NUMBER'
     A                                    31'EOEOB NUMBER'
     A                                    55'REASON'
     A                                      SPACEA(2)
     A**
     A          R ERRMSGL                   SPACEA(1)
     A            FUND          21A  O     1
     A            EOEOB#    R        O    31REFFLD(EOB#)
     A            EMSG          67A  O    51
     A**
     A**        R TOTRECL                   SPACEB(2)
     A**                                  69'# OF RECORDS LISTED:'
     A**          XXRCDS         4S 0O    78
