     A* (C) Copyright Progressive Data Solutions, Inc., 2003
     A*
     A* - EBC Rx Bill Process File - Logical
     A*
     A*****************************************************************
     A* Created on 03/03/2003 by C:62 for Project 48MFE
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PB101                     PFILE(FAB1P)
     A          K B1NAME
     A          S B1PRFL                    COMP(EQ ' ')
