     A*  (C) Copyright Progressive Data Systems, Inc., 2001
     A** Charge Master Service Codes
     A** CREATED BY: C062  08/06/01  114MCG
     A*
     A          R PCG01                     PFILE(FACGPPA)
     A          K CGDESC
     A          K CGSVCD
     A          K CGMED#
     A          K CGEFDT
