     A*****************************************************************
     A* (C) 2016 STONERIVER, INC. ALL RIGHTS RESERVED.                *
     A* STONERIVER IS A TRADEMARK OF STONERIVER, INC.                 *
     A*****************************************************************
     A**                                                              *
     A** CORVEL BILL UPLOAD TRANSLATION HEADER FILE                   *
     A*****************************************************************
     A*  CREATED BY: C:212   PROJECT: 89MBT    DATE: 10/21/16         *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A          R PU101                     PFILE(FAD2P)
     A          K U1TRID
