     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1993-1995, 1997
     A**
     A** WCMC - EOB AUXILIARY FILE
     A****************************************************************
     A**  IMPORTANT NOTE:
     A**   CHANGES TO THIS FILE MAY REQUIRE CHANGES TO THE FOLLOWING:
     A**
     A**          FDE1P
     A**          PAE1P
     A****************************************************************
     A**  REVISIONS:
     A**
     A**  03/04/96  C:53  PROJECT: 48MBV
     A**                  CHANGE COMMENT FOR E120A1
     A**
     A**  03/10/95  C:28  PROJECT: 68AEZ
     A**                  AUTO RELEASE EOMB PAYMENTS
     A**
     A**  06/15/95  C:33  PROJECT: FL006
     A**                  ADD THE FOLLOWING NEW FIELDS:
     A**                    E17A01 - FLTP: PRINCIPLE PROCEDURE (1)
     A**                    E17A02 - FLTP: OTHER PROCEDURE (2)
     A**                    E17A03-04
     A**                    E1FL01-10
     A**                    E110A4-10
     A**                    E1DT6  - FLTP: HOSPITAL ADMISSION DATE
     A**                    E1DT7  - FLTP: COVERAGE FROM DATE
     A**                    E1DT8  - FLTP: COVERAGE TO DATE
     A**                    E1DT9-15
     A**
     A**  07/17/95  C:33  PROJECT: TX002
     A**                  UPDATE THE FOLLOWING FIELDS:
     A**                    E17A01 - TXTP: PRINCIPLE PROCEDURE (1)
     A**                    E17A02 - TXTP: OTHER PROCEDURE (2)
     A**                    E17A03 - TXTP: OTHER PROCEDURE (3)
     A**                    E1DT6  - TXTP: HOSPITAL ADMISSION DATE
     A**                    E1DT7  - TXTP: SERVICE COVERAGE FROM DATE
     A**                    E1DT8  - TXTP: SERVICE COVERAGE TO DATE
     A**                    E1DT9  - TXTP: SUBMISSION DATE
     A**
     A**  01/31/96  C:43  PROJECT: 68MBU
     A**                  NOTATE FILE FIELD E140A1 AS A DATA STRUCTURE
     A**                  NOTATE FILE FIELD E110A4 AS A DATA STRUCTURE
     A**                  NOTATE FILE FIELD E110A5 AS A DATA STRUCTURE
     A**                  NOTATE FILE FIELD E110A6 AS A DATA STRUCTURE
     A**
     A**  06/07/96  C:43  PROJECT: 68MAT
     A**                  NOTATE FILE FIELD E1FL02 AS NOW BEING USED
     A**                  NOTATE FILE FIELD E1FL03 AS NOW BEING USED
     A**                  NOTATE FILE FIELD E1FL01 AS NOW BEING USED
     A**
     A**  02/12/97  C:45  PROJECT# 87MAW
     A**                  ADD 70 NEW FIELDS FOR BILL ENTRY
     A**                  REFER TO PROJECT 'BEGIN ADD' AND 'END ADD'
     A**                  NOTATIONS.
     A**
     A**
     A**  08/21/97  C:32  PROJECT# 87MCJ
     A**                  ADDED E1PEOB - PREVIOUS EOMB#  9.0
     A**
     A****************************************************************
     A                                      REF(FSREFP)
     A          R PE101                     TEXT('EOB AUXILIARY FILE')
     A            E1CO#     R               REFFLD(CO#)
     A            E1SUB#    R               REFFLD(SUB#)
     A            E1FND     R               REFFLD(FND)
     A            E1FYR     R               REFFLD(FYR)
     A            E1CASE    R               REFFLD(CASE)
     A            E1EOB#    R               REFFLD(EOB#)
     A            E1ACCT    R               REFFLD(DS15)
     A                                      COLHDG('PATIENT' 'ACCOUNT#' )
     A            E1ENDT    R               REFFLD(DT)
     A                                      COLHDG('ENTRY' 'DATE')
     A*                                         Based on F7027R/Base s/b all clt
     A*                                             PROVIDER Check Date
     A********
     A            E1BLDT    R               REFFLD(DT)
     A                                      COLHDG('BILL' 'DATE')
     A            E1ORDT    R               REFFLD(DT)
     A                                      COLHDG('OUR COMPANY' 'RECEIPT DATE')
     A            E1CRDT    R               REFFLD(DT)
     A                                      COLHDG('CARRIER' 'RECEIPT DATE')
     A            E1TRPH    R               REFFLD(FEIN)
     A                                      COLHDG('TREATING' 'PHYSICIAN')
     A            E1TRPM    R               REFFLD(MOD)
     A                                      COLHDG('TREATING' 'PHYSICIAN' 'MOD')
     A*** THE FOLLOWING FIELDS ARE NOT USED YET
     A            E1FLG1    R               REFFLD(FLAG) COLHDG('FLAG 1')
     A*                                         Client: 60
     A*                                            R=RECONSIDERATION
     A*                                            B=RECON AND REFUND
     A*                                            BLANKS=NO RECON OR REFUND
     A********
     A            E1FLG2    R               REFFLD(FLAG) COLHDG('FLAG 2')
     A* Possible usage..........................Client: 18
     A*                                            NCCI Flag = 1 or 2
     A********
     A            E1FLG3    R               REFFLD(FLAG) COLHDG('FLAG 3')
     A*                                         Clt: BASE
     A*                                            Bill Type: P, H, X, D
     A********
     A            E1FLG4    R               REFFLD(FLAG) COLHDG('FLAG 4')
     A********
     A            E1FLG5    R               REFFLD(FLAG) COLHDG('FLAG 5')
     A********
     A            E1DT1     R               REFFLD(DT) COLHDG('DATE 1')
     A*                                         Client: 03/40
     A*                                             Download Held Date
     A********
     A            E1DT2     R               REFFLD(DT) COLHDG('DATE 2')
     A*                                         Client: 03/40
     A*                                             Download Sent Date
     A********
     A            E1DT3     R               REFFLD(DT) COLHDG('DATE 3')
     A*                                         Client: 03/40
     A*                                             Download Rcvd Date
     A********
     A            E1DT4     R               REFFLD(DT) COLHDG('DATE 4')
     A*                                         Client: 03/40
     A*                                             MEDVIEW Check Date
     A********
     A            E1DT5     R               REFFLD(DT) COLHDG('DATE 5')
     A*                                         Client: 03/40
     A*                                             BRS Check Date
     A********
     A            E1AMT1    R               REFFLD(A92) COLHDG('AMOUNT 1')
     A*                                         Client: 03/40
     A*                                             MEDVIEW Payment
     A********
     A            E1AMT2    R               REFFLD(A92) COLHDG('AMOUNT 2')
     A*                                         Client: 44
     A*                                             CONSERVCO REDUCTIONS
     A********
     A            E1AMT3    R               REFFLD(A92) COLHDG('AMOUNT 3')
     A*                                         Client: Base
     A*                                             Audit/Recon Prev Paid Amt
     A********
     A            E1AMT4    R               REFFLD(A92) COLHDG('AMOUNT 4')
     A********                                  Line Item Room Charge
     A            E1AMT5    R               REFFLD(A92) COLHDG('AMOUNT 5')
     A********
     A            E110A1    R               REFFLD(DS10) COLHDG('1 DESC 10')
     A*                                         Client: 03/40
     A*                                             MEDVIEW Check#
     A********
     A            E110A2    R               REFFLD(DS10) COLHDG('2 DESC 10')
     A*                                         Client: 03/40
     A*                                             BRS Check#
     A********
     A            E110A3    R               REFFLD(DS10) COLHDG('3 DESC 10')
     A*                                         Client: 03/40
     A*                                             MedView Batch ID#
     A********
     A            E120A1    R               REFFLD(DS20) COLHDG('1 DESC 20')
     A*                                     1-5 POSITIONS ARE NETWORK CODE
     A*                                     6-8 POSITIONS ARE BILL SUB-TYPE
     A*                                     9-11   Bill Status
     A*                                                R   = Reconsideration
     A*                                                A01 = 1st Time Audit
     A*                                                A02 = 2nd Time Audit
     A*                                                A03 = ...
     A*** BEG ADD *** 03/04/99 ***************************************
     A*                                     10-11  WARPP PV1 CODE (V4)
     A*** BEG ADD *** 03/04/99 ***************************************
     A** BEG CHG **** 03/10/95 *************************************
     A*                                     13-14  WARPP Pend Status
     A** END CHG **** 03/10/95 *************************************
     A*                                     15-17  FLTP: Type of Bill
     A*                                            1st digit = 1-9
     A*                                            2nd digit = 1-9
     A*                                            3rd digit = 1-9,A,B,C,D,P,I
     A*                                     18-19  FLTP: Discharge Hour
     A*                                     20     FLTP: Proc Code Method
     A********
     A            E120A2    R               REFFLD(DS20) COLHDG('2 DESC 20')
     A*                              Pos. 1 = NM Gross Receipt Tax code:
     A*                                       S = Itemized Separately
     A*                                       I = Individual Chrgs incl NMGRT
     A*                                       X = N/A for this bill
     A*                              Pos. 2-6 NM Gross Receipt Tax Percentage
     A*                                       which will be translated to 5.2
     A*                              Pos. 7-9 Tx Hospital Type of Service:
     A*                                  Pos. 7-8 = Type of Service
     A*                                            IM = Acute Care Inpat Med
     A*                                            IS = Acute Care Inpat Sur
     A*                                            IR = Rehab Inpat
     A*                                            IP = Psych Inpat
     A*                                            HS = Hos Sur Outpat
     A*                                            AS = ASC Outpat
     A*                                            HO = Hos Outpat Other
     A*                                            AO = AS Outpat Other
     A*                                   Pos. 9 = I for Interim
     A*                                            F for Final
     A********
     A            E140A1    R               REFFLD(DS40)
     A*** BEGIN ADD *** 01/31/96  E140A1 COMMENTS :
     A***                                  POS  1 -  5 : SOURCE ID
     A***                                  POS  6 - 14 : BATCH ID
     A***                                  POS 15 - 34 : SOURCE BILL ID
     A***                                  POS 35 - 35 : PAID VIA 24 HR
     A*** END   ADD *** 01/31/96  E140A1 COMMENTS
     A*** END UNUSED FIELDS
     A            E1USER    R               REFFLD(USER)
     A            E1PGM     R               REFFLD(PGM)
     A            E1TIME    R               REFFLD(TIME)
     A            E1DT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            E1IUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            E1IDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A***  BEGIN ADD  ***  06/15/95  *********************************
     A            E17A01    R               REFFLD(DS7)
     A************                          UB92: 80a - Principal Procedure
     A            E17A02    R               REFFLD(DS7)
     A************                          UB92: 81a1 - Other Proc 2
     A            E17A03    R               REFFLD(DS7)
     A************                          UB92: 81b1 - Other Proc 3
     A            E17A04    R               REFFLD(DS7)
     A************                          UB92: 81c1 - Other Proc 4
     A*
     A            E1FL01    R               REFFLD(FLAG)
     A****  PCA: 68MAT: SENT TO FL STATE ON TAPE
     A****  Y=SENT TO STATE, OR MARKED WITH Y UPON IMPLEMENTATION OF
     A****    PROJECT 68MAT.
     A****  *BLANK=NOT YET SENT TO STATE OR IS NOT ELIGIBLE TO BE SENT
     A            E1FL02    R               REFFLD(FLAG)
     A****  PCA: 68MAT: MEDVIEW REVIEW STATUS
     A****  THE ORIGIN OF THESE VALUES IS THE UPLOADED RECORD TYPE 30
     A****  OUR FILE FIELD  FXI1P/I1STAT
     A************                  PCA: 68MAT: A=APPROVED
     A************                  PCA: 68MAT: D=DENIED
     A************                  PCA: 68MAT: N=NOT PROCESSED
     A************                  PCA: 68MAT: V=VOID
     A************                  PCA: 68MAT: P=PENDING
     A            E1FL03    R               REFFLD(FLAG)
     A****  PCA: 68MAT: MEDVIEW REVIEW STATUS
     A************                  PCA: E1FL03=BLANK=NORMAL BATCH
     A************                  PCA: E1FL03=I=IMMEDIATE PROCESS
     A            E1FL04    R               REFFLD(FLAG)
     A            E1FL05    R               REFFLD(FLAG)
     A            E1FL06    R               REFFLD(FLAG)
     A            E1FL07    R               REFFLD(FLAG)
     A            E1FL08    R               REFFLD(FLAG)
     A            E1FL09    R               REFFLD(FLAG)
     A            E1FL10    R               REFFLD(FLAG)
     A            E1DT6     R               REFFLD(DT)
     A************                        UB92: 17 - Hosp Admission Date
     A            E1DT7     R               REFFLD(DT)
     A************                        UB92: 6a - Statement Covers From Date
     A            E1DT8     R               REFFLD(DT)
     A************                        UB92: 6b - Statement Covers To Date
     A            E1DT9     R               REFFLD(DT)
     A************                        Date Bill sent to Carrier
     A            E1DT10    R               REFFLD(DT)
     A************                  TXTP: Bill Adjustment Date 1
     A            E1DT11    R               REFFLD(DT)
     A************                  TXTP: Bill Adjustment Date 2
     A            E1DT12    R               REFFLD(DT)
     A************                  TXTP: Bill Adjustment Date 3
     A            E1DT13    R               REFFLD(DT)
     A************                        UB92: 80b Principal Proc Date
     A            E1DT14    R               REFFLD(DT)
     A************                        UB92: 81a2 Other Proc Date 2
     A            E1DT15    R               REFFLD(DT)
     A************                        UB92: 81b2 Other Proc Date 3
     A            E110A4    R               REFFLD(DS10) COLHDG('4 DESC 10')
     A***                 EPI CLAIM ID NUMBER
     A            E110A5    R               REFFLD(DS10) COLHDG('5 DESC 10')
     A***                 EPI SOURCE BATCH ID#
     A            E110A6    R               REFFLD(DS10) COLHDG('6 DESC 10')
     A***                 EPI SOURCE PAYMENT AMOUNT
     A            E110A7    R               REFFLD(DS10) COLHDG('7 DESC 10')
     A            E110A8    R               REFFLD(DS10) COLHDG('8 DESC 10')
     A            E110A9    R               REFFLD(DS10) COLHDG('9 DESC 10')
     A            E110A0    R               REFFLD(DS10) COLHDG('10 DESC 10')
     A***  END   ADD  ***  06/15/95  *********************************
     A*** BEGIN ADD *** 02/12/97 ***********************************************
     A            E1ADSC    R               REFFLD(FLAG)
     A                                      COLHDG('ADDMISSION' 'SOURCE')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "ADSC"
     A            E1ADTY    R               REFFLD(FLAG)
     A                                      COLHDG('ADMISSION' 'TYPE')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "ADTY"
     A            E1ADDI    R               REFFLD(DIA)
     A                                      COLHDG('ADMIT DIAGNOSIS' 'CODE')
     A            E1ADLT    R               REFFLD(FLAG)
     A                                      COLHDG('ADMIT DIAG' 'LOS TYPE')
     A            E1ADHR    R               REFFLD(TIMEHM)
     A                                      COLHDG('ADMIT' 'HOUR')
     A            E1DYCV    R               REFFLD(A50)
     A                                      COLHDG('DAYS' 'COVERED')
     A            E1NOCV    R               REFFLD(A50)
     A                                      COLHDG('DAYS' 'NON-COVERED')
     A            E1OCD1    R               REFFLD(DS15)
     A                                      COLHDG('OCCURANCE' 'CODE 1')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "OCCD"
     A            E1ODT1    R               REFFLD(DT)
     A                                      COLHDG('ODDURANCE' 'DATE 1')
     A            E1OCD2    R               REFFLD(DS15)
     A                                      COLHDG('OCCURANCE' 'CODE 2')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "OCCD"
     A            E1ODT2    R               REFFLD(DT)
     A                                      COLHDG('ODDURANCE' 'DATE 2')
     A            E1OCD3    R               REFFLD(DS15)
     A                                      COLHDG('OCCURANCE' 'CODE 3')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "OCCD"
     A            E1ODT3    R               REFFLD(DT)
     A                                      COLHDG('ODDURANCE' 'DATE 3')
     A            E1OCD4    R               REFFLD(DS15)
     A                                      COLHDG('OCCURANCE' 'CODE 4')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "OCCD"
     A            E1ODT4    R               REFFLD(DT)
     A                                      COLHDG('ODDURANCE' 'DATE 4')
     A            E1OSCD    R               REFFLD(DS15)
     A                                      COLHDG('OCCURANCE' 'SPAN CODE')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "OCSP"
     A            E1OSFD    R               REFFLD(DT)
     A                                      COLHDG('OCCUR SPAN' 'FROM DATE')
     A            E1OSTD    R               REFFLD(DT)
     A                                      COLHDG('OCCUR SPAN' 'TO DATE')
     A            E1PATS    R               REFFLD(CODE)
     A                                      COLHDG('PATIENT' 'STATUS')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "PATS"
     A            E1VC01    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 1A')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA01    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 1A')
     A            E1VC02    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 1B')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA02    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 1B')
     A            E1VC03    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 1C')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA03    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 1C')
     A            E1VC04    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 1D')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA04    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 1D')
     A            E1VC05    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 2A')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA05    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 2A')
     A            E1VC06    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 2B')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA06    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 2B')
     A            E1VC07    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 2C')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA07    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 2C')
     A            E1VC08    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 2D')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA08    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 2D')
     A            E1VC09    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 3A')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA09    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 3A')
     A            E1VC10    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 3B')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA10    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 3B')
     A            E1VC11    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 3C')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA11    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 3C')
     A            E1VC12    R               REFFLD(DS15)
     A                                      COLHDG('VALUE' 'CODE 3D')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "VLCD"
     A            E1VA12    R               REFFLD(A122)
     A                                      COLHDG('VALUE' 'AMOUNT 3D')
     A            E1SPCD    R               REFFLD(DS3)
     A                                      COLHDG('BILL/PROV' 'SPEC CODE')
     A            E1IWRI    R               REFFLD(FLAG)
     A                                      COLHDG('INJ WORKERS' 'REIMB IND')
     A            E1PHTY    R               REFFLD(CODE)
     A                                      COLHDG('PHYSICAN' 'TYPE')
     A**********    VALID VALUES:  XREF TO FTGTP VIA "PHTY"
     A            E1SFEI    R               REFFLD(FEIN)
     A                                      COLHDG('SERVICING' 'PROV FEIN')
     A            E1SMOD    R               REFFLD(MOD)
     A                                      COLHDG('SERVICING' 'PROV MOD')
     A            E1BFEI    R               REFFLD(FEIN)
     A                                      COLHDG('BILLING' 'FEIN')
     A            E1BMOD    R               REFFLD(MOD)
     A            E1TFEI    R               REFFLD(FEIN)
     A                                      COLHDG('ATTENDING' 'PHYS FEIN')
     A            E1TMOD    R               REFFLD(MOD)
     A                                      COLHDG('ATTENDING' 'PHYS MOD')
     A            E1OFEI    R               REFFLD(FEIN)
     A                                      COLHDG('OTHER' 'PHYS FEIN')
     A            E1OMOD    R               REFFLD(MOD)
     A                                      COLHDG('OTHER' 'PHYS MOD')
     A            E1COC1    R               REFFLD(DS15)
     A                                      COLHDG('CONDITION' 'CODE 1')
     A            E1COC2    R               REFFLD(DS15)
     A                                      COLHDG('CONDITION' 'CODE 2')
     A            E1COC3    R               REFFLD(DS15)
     A                                      COLHDG('CONDITION' 'CODE 3')
     A            E1COC4    R               REFFLD(DS15)
     A                                      COLHDG('CONDITION' 'CODE 4')
     A            E1COC5    R               REFFLD(DS15)
     A                                      COLHDG('CONDITION' 'CODE 5')
     A            E1COC6    R               REFFLD(DS15)
     A                                      COLHDG('CONDITION' 'CODE 6')
     A            E1COC7    R               REFFLD(DS15)
     A                                      COLHDG('CONDITION' 'CODE 7')
     A            E1MRC#    R               REFFLD(DS15)
     A                                      COLHDG('MEDICAL RECORD' 'NUMBER')
     A            E1OAMT    R               REFFLD(A112)
     A                                      COLHDG('OTHER' 'AMOUNT')
     A            E1DIA5    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS' 'CODE 5')
     A            E1DIA6    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS' 'CODE 6')
     A            E1DIA7    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS' 'CODE 7')
     A            E1DIA8    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS' 'CODE 8')
     A            E1DIA9    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS' 'CODE 9')
     A            E17A05    R               REFFLD(DS7)
     A                                      COLHDG('OTHER' 'PROC CODE 5')
     A            E17A06    R               REFFLD(DS7)
     A                                      COLHDG('OTHER' 'PROC CODE 6')
     A            E1DT16    R               REFFLD(DT)
     A                                      COLHDG('OTHER' 'PROC DATE 4')
     A            E1DT17    R               REFFLD(DT)
     A                                      COLHDG('OTHER' 'PROC DATE 5')
     A            E1DT18    R               REFFLD(DT)
     A                                      COLHDG('OTHER' 'PROC DATE 6')
     A            E1PMRI    R               REFFLD(FLAG)
     A                                      COLHDG('PAITENT MED' 'RELEASE IND')
     A            E1TOTN    R               REFFLD(A112)
     A                                      COLHDG('TOTAL NON-' 'COVERED CHGS')
     A            E1AMOD    R               REFFLD(DS4)
     A                                      COLHDG('ANTHEM' 'MODIFIER')
     A*** END ADD *** 02/12/97 *************************************************
     A*** BEG ADD *** 08/21/97 *************************************************
     A            E1PEOB    R               REFFLD(EOB#)
     A                                      COLHDG('PREVIOUS' 'EOMB#')
     A*** END ADD *** 08/21/97 *************************************************
