     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2001
     A*
     A*  Created 04/05/01 by C:62 for project AR034
     A*****************************************************************
     A*  REVISIONS:
     A*
     A*
     A*****************************************************************
     A** EOMB HEADER AMOUNT FILE LOGICAL
     A*
     A                                      ALTSEQ(QSYSTRNTBL)
     A*
     A          R PEA01                     PFILE(FAEAP)
     A          K EACO#
     A          K EASUB#
     A          K EAFND
     A          K EAFYR
     A          K EACASE
     A          K EATRDT
     A          K EAEOB#
     A          K EARCN
