     A* (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**
     A** FEE SCHEDULE LOGICAL OVER EOB WORK FILE
     A*
     A*  EOB WORK FILE
     A          R PEO01                     PFILE(FAEOP)
     A          K EOCO#
     A          K EOSUB#
     A          K EOFND
     A          K EOFYR
     A          K EOCASE
     A          K EOTRDT
     A          K EOFEIN
     A          K EOMOD
     A          K EOEOB#
