     A** (C) 2012 STONERIVER, INC. ALL RIGHTS RESERVED.
     A** STONERIVER IS A TRADEMARK OF STONERIVER, INC.
     A*
     A* LOGICAL OVER EOB WORK FILE
     A*
     A****************************************************************
     A* REVISIONS:
     A*
     A* 09/07/01 C:62 PROJECT:FS233
     A*               ADD EOFRDT TO KEY
     A*
     A****************************************************************
     A                                      ALTSEQ(QSYSTRNTBL)
     A          R PEO01                     PFILE(FAEOP)
     A          K EOCO#
     A          K EOIUSR
     A          K EOLSN
     A          K EOFSN
     A*** BEGIN ADD *** 09/07/01 **************************************
     A          K EOFRDT                    DESCEND
     A*** END   ADD *** 09/07/01 **************************************
     A          K EOEOB#
     A          K EOPNAM
     A          S EOBTYP                    COMP(NE ' ')
     A            EOBLST                    COMP(NE 'X')
