     A*****************************************************************
     A* copyright('(c) 2025 Sapiens, Inc. All rights reserved.')      *
     A**********************************************************************
     A**                                                              *
     A** WCMC EOMB Pharmacy Bill Header File                          *
     A*****************************************************************
     A*  Created by: C:05    Project: MC152    Date: 01/28/98         *
     A*  NOTE:  See EXCEL spreadsheet FAEPP.XLS for information       *
     A*         about valid status changes                            *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*
     A*   07/18/25 C:342 Project: MC451
     A*                  NCCI MED DATA CALL ENHANCEMENTS
     A*
     A*   02/26/14 C:296 Project: NC034
     A*                  Added EPRFEI - RENDERING PROVIDER FEIN
     A*
     A*   02/26/14 C:296 Project: NC034
     A*                  Added EPRFEI - RENDERING PROVIDER FEIN
     A*
     A*   12/21/12 C:277 Project: 146MFP
     A*                  Added EPRNLN AND EPRNFN
     A*
     A*   04/05/11 C:198 Project: 45MHZ
     A*                  Added EPPNPI AND EPPHNM
     A*
     A*   09/29/10 C:257 PROJECT: 133MJN
     A*                  PHARMACY TAX
     A*
     A*   05/18/09 C:198 Support: 67689
     A*                  Added Referring provider NPI number.
     A*
     A* 03/14/07 C:182  Project: FL067
     A*                 1. Added Pharmacists State License Number
     A*                 2. Changed Fld Heading for 'Payment plan'
     A*                    to be 'Payment code'.
     A*                         
     A*   01/10/06 C:163 Project: MC270
     A*                  Rx New field - "Medical Supplies"
     A*
     A*   10/25/05 C:163 Project: 136MBR
     A*                  Managed Care/Prov Bill Interface Process
     A*
     A*   10/31/05 C:163 PROJECT: FL056
     A*                  FL EDI SCREEN CHANGES
     A*
     A*   02/18/05 C:79 PROJECT: 25MNZ
     A*                 ADD PRESCRIBERS LICENSE# AND NAME
     A*
     A*   11/22/00 C:62 PROJECT: FS212
     A*                 INCREASE ACCOUNT FIELD FROM 15A TO 30A.
     A*
     A*   01/25/00 C:53 PROJECT: KY010
     A*                 ADD FIELD FOR KY PHARMACY
     A*
     A*   06/14/99 C:53 PROJECT: MC152
     A*                 ADD FIELD(S)
     A*
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PEP01                     TEXT('EOMB Rx BILL HEADER FILE')
     A            EPCO#     R               REFFLD(CO#)
     A                                      COLHDG('COMPANY#')
     A            EPSUB#    R               REFFLD(SUB#)
     A                                      COLHDG('SUBSCRIBER')
     A            EPFND     R               REFFLD(FND)
     A                                      COLHDG('GROUP')
     A            EPFYR     R               REFFLD(FYR)
     A                                      COLHDG('YEAR')
     A            EPCASE    R               REFFLD(CASE)
     A                                      COLHDG('CASE#')
     A            EPSS#     R               REFFLD(SS#)
     A                                      COLHDG('SOC SEC#')
     A            EPACDT    R               REFFLD(DT)
     A                                      COLHDG('ACC DATE')
     A            EPEOB#    R               REFFLD(EOB#)
     A                                      COLHDG('EOMB#')
     A            EPPHAR    R               REFFLD(DS15)
     A                                      COLHDG('PHARMACY' 'NUMBER')
     A            EPEDI     R               REFFLD(FLAG)
     A                                      COLHDG('ELIGIBLE' 'DATA' 'SUBM')
     A*********************     Valid values:  Y or N                     ')
     A            EPSTAT    R               REFFLD(STAT)
     A                                      COLHDG('STATUS')
     A            EPUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINT USER')
     A            EPPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINT PGM')
     A            EPTIME    R               REFFLD(TIME)
     A                                      COLHDG('MAINT TIME')
     A            EPDT      R               REFFLD(DT)
     A                                      COLHDG('MAINT DATE')
     A            EPIUSR    R               REFFLD(USER)
     A                                      COLHDG('INIT USER')
     A            EPIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INIT PGM')
     A            EPITIM    R               REFFLD(TIME)
     A                                      COLHDG('INIT TIME')
     A            EPIDT     R               REFFLD(DT)
     A                                      COLHDG('INIT DATE')
     A*** BEG ADD *** 06/14/99 ************************
     A*** BEGIN CHG *** 11/22/00 **************************************
     A            EPACCT    R               REFFLD(DS30)
     A*** END   CHG *** 11/22/00 **************************************
     A                                      COLHDG('PATIENT CONTROL #')
     A*** END ADD *** 06/14/99 ************************
     A*** BEG ADD *** 01/25/00 ************************
     A            EPBTCD    R               REFFLD(DS2)
     A                                      COLHDG('BILLING TYPE CODE')
     A*** END ADD *** 01/25/00 ************************
     A*** BEG ADD *** 02/18/05 ************************
     A            EPPNAM    R               REFFLD(DS40)
     A                                      COLHDG('PRESCRIBERS' 'NAME')
     A            EPPDEA    R               REFFLD(LIC#)
     A                                      COLHDG('PRESCRIBERS' 'DEA#')
     A*** END ADD *** 02/18/05 ************************
     A*** BEG ADD *** 10/31/05 ************************
     A            EPPPLN    R               REFFLD(CODE)
    A*** BEG CHG *** 03/14/07 ************************
     A                                      COLHDG('PAYMENT CODE')
    A*** END CHG *** 03/14/07 ************************
     A*** END ADD *** 10/31/05 ************************
     A*** BEG ADD *** 10/25/05 ************************
     A            EPFLIC    R               REFFLD(LIC#)
     A                                      COLHDG('Rend Prov' 'State' 'Lic#')
     A*** END ADD *** 10/25/05 ************************
     A*** BEG ADD *** 01/10/06 ************************
     A            EPRXPT    R               REFFLD(FLAG)
     A                                      COLHDG('Rx' 'Payment' 'Type')
     A*** END ADD *** 01/10/06 ************************
    A*** BEG ADD *** 03/14/07 ************************
     A            EPPLIC    R               REFFLD(LIC#)
     A                                      COLHDG('LICENSE NUMBER')
    A*** END ADD *** 03/14/07 ************************
     A*** BEG ADD *** 05/18/09 ************************
     A            EPRFNP    R               REFFLD(DS15)
     A                                      COLHDG('Referring NPI')
     A*** END ADD *** 05/18/09 ************************
     A*** BEG ADD *** 09/29/10 ************************
     A            EPTAX     R               REFFLD(FLAG)
     A                                      COLHDG('LA' 'Parish Sales Tax' 'In+
     A                                      cluded')
     A*** END ADD *** 09/29/10 ************************
     A*** Beg Add *** 04/05/11 ************************
     A            EPPNPI    R               REFFLD(DS15)
     A                                      COLHDG('Prescribing Phy NPI#')
     A            EPPHNM    R               REFFLD(DS40)
     A                                      COLHDG('Pharmacy name')
     A*** End Add *** 04/05/11 ************************
     A*** Beg Add *** 12/21/12 ************************
     A            EPRNLN    R               REFFLD(DS40)
     A                                      COLHDG('Rendering provider' 'last-
     A                                      /pharmacy name')
     A            EPRNFN    R               REFFLD(DS15)
     A                                      COLHDG('Rendering provider' 'First -
     A                                      name')
     A*** End Add *** 12/21/12 *********************name
     A*** Beg Add *** 02/26/14 ************************
     A            EPRFEI         9S 0       COLHDG('Rendering provider' 'FEIN')
     A*** End Add *** 02/26/14 ************************
     A*** Beg Add *** 07/18/25 ************************
     A            EPDNPI        15A         COLHDG('Dispensing Pharmacy' 'NPI#')
     A*** End Add *** 07/18/25 ************************
