      *****************************************************************
      *  (C) Copyright Fiserv Insurance Solutions Inc., 2007
      *****************************************************************
      *  WCMC EOMB Status Transaction File - Back Up
      *
      *  Created by: C:47    Project: MC309    Date: 10/31/2007
      *****************************************************************
     A          R PES01                     FORMAT(FAESP)
