      *****************************************************************
      *  (C) Copyright Fiserv Insurance Solutions Inc., 2007
      *****************************************************************
      * Letter Detail Transaction File
      *
      *  Created by: C:47    Project: MC309    Date: 10/31/2007
      *****************************************************************
     A          R PL201                     FORMAT(FAL2P)
