     A* (C) Copyright Progressive Data Solutions, Inc., 2001
     A*
     A* - EOS Payment File - Detail
     A*
     A*****************************************************************
     A* Created on 10/31/2001 by C:62 for Project 96MEN
     A*****************************************************************
     A* Purpose: This file will house the 'bill detail' record for the
     A*          associated EOS records.
     A*****************************************************************
     A* REVISIONS
     A*
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PO201                     TEXT('EOS Payment File - Detail')
     A            O2RCDE    R               REFFLD(FLAG)
     A                                      COLHDG('Record Type')
     A            O2EID#    R               REFFLD(DS8)
     A                                      COLHDG('Bill ID')
     A            O2CODE        11A
     A                                      COLHDG('RVS code')
     A            O2DESC    R               REFFLD(DS30)
     A                                      COLHDG('RVS description')
     A            O2MOD1    R               REFFLD(CODE)
     A                                      COLHDG('RVS Code Modifier 1')
     A            O2MOD2    R               REFFLD(CODE)
     A                                      COLHDG('RVS Code Modifier 2')
     A            O2MOD3    R               REFFLD(CODE)
     A                                      COLHDG('RVS Code Modifier 3')
     A            O2POS     R               REFFLD(CODE)
     A                                      COLHDG('Place of Service')
     A            O2BAMT        12S 0
     A                                      COLHDG('Billed Amount')
     A            O2PAMT        12S 0
     A                                      COLHDG('Paid Amount')
     A            O2NAMT        12S 0
     A                                      COLHDG('PPO Reduction')
     A            O2UNTS         4S 0
     A                                      COLHDG('Units')
     A            O2DOS     R     S         REFFLD(DT8)
     A                                      COLHDG('Date of Service')
     A            O2MCD1         3S 0
     A                                      COLHDG('Saving Message' -
     A                                      'Code 1')
     A            O2MDS1        64A
     A                                      COLHDG('Saving Message' -
     A                                      'Description 1')
     A            O2MCD2         3S 0
     A                                      COLHDG('Saving Message' -
     A                                      'Code 2')
     A            O2MDS2        64A
     A                                      COLHDG('Saving Message' -
     A                                      'Description 2')
     A            O2DXR1         1A
     A                                      COLHDG('Diagnosis code' -
     A                                      'X-ref 1')
     A            O2DXR2         1A
     A                                      COLHDG('Diagnosis code' -
     A                                      'X-ref 2')
     A            O2DXR3         1A
     A                                      COLHDG('Diagnosis code' -
     A                                      'X-ref 3')
     A            O2DXR4         1A
     A                                      COLHDG('Diagnosis code' -
     A                                      'X-ref 4')
     A            O2FILL       206A
     A                                      COLHDG('Filler')
     A            O2PRFL    R               REFFLD(FLAG)
     A                                      COLHDG('Processed Flag')
     A            O2EOB#    R               REFFLD(EOB#)
     A                                      COLHDG('(PDS) EOMB#')
     A            O2DSEQ    R               REFFLD(SEQ#)
     A                                      COLHDG('(PDS) Detail' +
     A                                      'Sequence #')
     A            O2PRDT    R               REFFLD(DT)
     A                                      COLHDG('(PDS) Process Date')
     A            O2PRTM    R               REFFLD(TIME)
     A                                      COLHDG('(PDS) Process Time')
