     A* (C) Copyright Progressive Data Solutions, Inc., 2002
     A*
     A* Matrix Bill Transmission Information - Logical
     A*
     A*****************************************************************
     A* Created on 01/27/2003 by c:62 for Project 114MEK
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PP901                     PFILE(FAP9P)
     A          K P9MBR#
