     A*  (C) Copyright Progressive Data Solutions, Inc., 2000
     A*
     A*  - Rockport Bill Flatfile - Logical           C:62 10/04/00
     A*                                               PROJ: 25MMR
     A*****************************************************************
     A* REVISIONS
     A*
     A*****************************************************************
     A          R PR001                     PFILE(FAR0P)
     A          K R0PRFL
     A          O R0PRFL                    COMP(NE ' ')
