     A*  (C) Copyright Progressive Data Solutions, Inc., 2000
     A*
     A*  - Rockport Bill Transmission Information     C:62 08/29/00
     A*                                               PROJ: 25MMR
     A*****************************************************************
     A* REVISIONS
     A*
     A*****************************************************************
     A          R PR901                     PFILE(FAR9P)
     A          K R9DCID
