     A* (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2001
     A*
     A* FASNL - Skilled Nursing Facilities
     A************************************************************************8
     A* Revisions
     A************************************************************************8
     A* 6/20/14  C: 079 Project: LOGICALS
     A*                 Change to refer to FASNP
     A************************************************************************8
      *                                                                    ***8
     A*** Beg Chg *** 06/20/14 ****************************************
     A********* R PSN01                     PFILE(FASNPPA)
     A          R PSN01                     PFILE(FASNP)
     A*** End Chg *** 06/20/14 ****************************************
     A          K SNMED#
     A          K SNEFDT
      *                                                                    ***8
