     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 1992
     A**
     A** Work File to Report BCL-9 to State on Magnetic Tape
     A**
     A** NOTE:  WHEN COMPILING - # MBRS MUST BE *NOMAX
     A**
     A          R PTP01                     TEXT('BCL9 WRK FILE RCD TYP ALL')
     A            TPDATA       102          TEXT('DATA -102')
