     A* (C) Copyright Progressive Data Solutions, Inc., 2003
     A*
     A* Provima Payment File - Line Information - Logical
     A*
     A*****************************************************************
     A* Created on 01/17/2003 by c:62 for Project 126MBD
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PU201                     PFILE(FAU2P)
     A          K U2TRID
     A          K U2LIN#
