     A* (C) Copyright Fiserv Insurance Solutions, Inc., 2006
     A*
     A* FAX4L4 - X4SS#/X4ACDT - Logical
     A*          Select where X4PRFL = E=Claim/Prov error
     A*                                P=Payment error
     A*                                R=Recon error
     A*
     A*****************************************************************
     A* Created on 05/24/2006 by C:163 for Project 139MCV from client 139
     A*****************************************************************
     A* Purpose:
     A*
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PX401                     PFILE(FAX4P)
     A          K X4SS#
     A          K X4ACDT
     A          S X4PRFL                    VALUES('E' 'P' 'R')
