     A* (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                                    *
     A* PROCURA RETURN FLAT FILE                                           *
     A*                                                                    *
     A**********************************************************************
     A* Created on 12/18/2010 by C:251 for Project 146MCV                  *
     A**********************************************************************
     A*                                                                    *
     A* REVISIONS                                                          *
     A*                                                                    *
     A*   09/03/15   C:212   Project: MC400                                *
     A*                      Change of length for Z3DATA                   *
     A*                                                                    *
     A*   05/22/12   C:251   Project: 146MEZ                               *
     A*                      Change of length for Z3DATA                   *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(FSREFP)
     A          R PZ301                     TEXT('Procura Return Flat File')
     A*** Beg Chg *** 05/22/12 *********************************************
     A******      Z3DATA       859A         COLHDG('Procura Data')
     A*** Beg Chg *** 09/03/15 *********************************************
     A******      Z3DATA      1200A         COLHDG('Procura Data')
     A            Z3DATA      3000A         COLHDG('Procura Data')
     A*** End Chg *** 09/03/15 *********************************************
     A*** End Chg *** 05/22/12 *********************************************
     A            Z3PRFL    R               REFFLD(FLAG)
     A                                      COLHDG('Processed Flag')
