     A* (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                                    *
     A* FAZ9L1 - PROCURA TRANSMISSION FILE - LOGICAL                       *
     A*                                                                    *
     A**********************************************************************
     A* Created on 12/18/2010 by C:251 for Project 146MCV                  *
     A**********************************************************************
     A*                                                                    *
     A* REVISIONS                                                          *
     A*                                                                    *
     A*  04/26/12 C:277 SUPPORT:79693                                      *
     A*                 RECOMPILE                                          *
     A*                                                                    *
     A**********************************************************************
     A*
     A          R PZ901                     PFILE(FAZ9P)
     A          K Z9DCID
