     A* ------------------------------------------------------------------------
     A* Copyright('(c) 2013 StoneRiver, Inc. All rights reserved. -
     A* StoneRiver is a trademark of StoneRiver, Inc.')
     A* ------------------------------------------------------------------------
     A** FEE SCHEDULE CASE DETAIL FILE LOGICAL
     A* ------------------------------------------------------------------------
     A* REVISIONS:
     A*
     A*  02/01/13 C:280 Project: 114MBB
     A*                 CHANGE COPYRIGHT
     A*
     A* ------------------------------------------------------------------------
     A*
     A          R PCA01                     PFILE(FDCAP)
     A            CACO#
     A            CASUB#
     A            CAFND
     A            CAFYR
     A            CACASE
     A            CAFDAT
     A            CADSEQ
     A            CAFEIN
     A            CAMOD
     A            CASVCD
     A            CACPT4
     A            CAUNTS
     A            CATOTA
     A            CATOTD
     A            CATOTP
     A            CATOTC
     A            CAPMOD
     A            CAUSER
     A            CAPGM
     A            CADT
     A            CATIME
     A            CACHK#
     A            CAEOB#
     A*** ADD NEXT LINE *** TAPE SUBMISSION ***************************
     A            CADXR
     A*** ADD NEXT LINE *** PEND LETTER SYSTEM ************************
     A            CAFLAG
     A*
     A          K CACO#
     A          K CASUB#
     A          K CAFND
     A          K CAFYR
     A          K CACASE
     A          K CAFDAT
     A          K CAFEIN
     A          K CAMOD
     A          K CASVCD
     A          K CACPT4
     A          K CAUNTS
     A*** ADD NEXT LINE *** PEND LETTER SYSTEM ************************
     A          S CAFLAG                    COMP(NE 'P')
