     A*
     A*  DO NOT ADD ANY MORE FIELDS TO THIS FILE.
     A*  MAXIMUM RECORD LENGTH IS CURRENTLY 4027.
     A*  IF ANY FIELDS NEED TO BE ADDED, ADD THEM TO FDD1P1.
     A*
     A*==================================================================
     A*
     A*  (C) Copyright Progressive Data Solutions, Inc., 2001
     A*
     A*  WCMC DEPT LETTERS WORKFILE 1 - FOR SCREEN
     A*
     A*  05/13/98  C:62  Project:  MC177
     A********************************************************************
     A*  REVISIONS:
     A*
     A*  03/02/01 C:62 PROJECT:114MAZ
     A*                ADDED ADDITIONAL INFO FIELDS.
     A*
     A*  02/21/01 C:62 PROJECT:MC184
     A*                ADDED PROVIDER SELECT INFORMATION
     A*
     A*  02/22/00 C:62 PROJECT:48MEM
     A*                ADDED CARRIER INFORMATION FIELDS.
     A*
     A*  11/18/98 C:62 PROJECT:MC184
     A*                ADDED NEW FIELDS.
     A*
     A********************************************************************
     A                                      REF(FSREFP)
     A          R PD101                     TEXT('WCMC DEPT LETTER WORK FILE 1')
     A*
     A*  KEY INFORMATION
     A*
     A            D1CO#     R               REFFLD(CO#)
     A                                      COLHDG('COMPANY' 'NUMBER')
     A            D1SUB#    R               REFFLD(SUB#)
     A                                      COLHDG('SUBSCRIBER')
     A            D1FND     R               REFFLD(FND)
     A                                      COLHDG('GROUP')
     A            D1FYR     R               REFFLD(FYR)
     A                                      COLHDG('YEAR')
     A            D1CASE    R               REFFLD(CASE)
     A                                      COLHDG('FROM CLAIM' 'NUMBER')
     A            D1REQ#    R               REFFLD(SEQ#)
     A                                      COLHDG('REQUEST #')
     A            D1DPCD    R               REFFLD(DS5)
     A                                      COLHDG('DEPT' 'CODE')
     A            D1FLDR    R               REFFLD(FLDR)
     A                                      COLHDG('FOLDER')
     A            D1DCID    R               REFFLD(DCID)
     A                                      COLHDG('DOCUMENT ID')
     A*
     A*  Selected Documents
     A*
     A            D1#CPY    R               REFFLD(SEQ#)
     A                                      COLHDG('# OF COPIES')
     A            D1SFLD    R               REFFLD(FLDR)
     A                                      TEXT('SAVE FOLDER NAME')
     A            D1SDOC    R               REFFLD(DCID)
     A                                      TEXT('SAVE DOCUMENT ID')
     A            D1DOVR    R               REFFLD(PGM)
     A                                      TEXT('DOCUMENT OVERLAY OBJECT')
     A            D1OUTQ    R               REFFLD(OUTQ)
     A                                      COLHDG('DOCUMENT' 'OUTPUT QUEUE')
     A*
     A*  COMPANY INFORMATION
     A*
     A            D1CNME    R               REFFLD(NAME)
     A                                      COLHDG('CO NAME')
     A            D1CPA1    R               REFFLD(ADR1)
     A                                      COLHDG('CO PHYS ADDR1')
     A            D1CPA2    R               REFFLD(ADR2)
     A                                      COLHDG('CO PHYS ADDR2')
     A            D1CPCZ    R               REFFLD(DS40)
     A                                      COLHDG('CO PHYS CITY/ST/ZIP')
     A            D1CMA1    R               REFFLD(ADR1)
     A                                      COLHDG('CO MAIL ADDR1')
     A            D1CMA2    R               REFFLD(ADR2)
     A                                      COLHDG('CO MAIL ADDR2')
     A            D1CMCZ    R               REFFLD(DS40)
     A                                      COLHDG('CO MAIL CITY/ST/ZIP')
     A            D1CARA    R               REFFLD(AREA)
     A                                      COLHDG('CO AREA CODE')
     A            D1CPHN    R               REFFLD(PHN#)
     A                                      COLHDG('CO PHONE#')
     A            D1CFAR    R               REFFLD(AREA)
     A                                      COLHDG('CO FAX AREA CODE')
     A            D1CFAX    R               REFFLD(PHN#)
     A                                      COLHDG('CO FAX#')
     A            D1CFEI    R               REFFLD(FEIN)
     A                                      COLHDG('CO FEIN')
     A            D1CANM    R               REFFLD(DS40)
     A                                      COLHDG('CO AUX NAME')
     A            D1CAA1    R               REFFLD(ADR1)
     A                                      COLHDG('CO AUX ADDR1')
     A            D1CAA2    R               REFFLD(ADR2)
     A                                      COLHDG('CO AUX ADDR2')
     A            D1CACZ    R               REFFLD(DS40)
     A                                      COLHDG('CO AUX CITY/ST/ZIP')
     A            D1CAAR    R               REFFLD(AREA)
     A                                      COLHDG('CO AUX AREA CODE')
     A            D1CAPH    R               REFFLD(PHN#)
     A                                      COLHDG('CO AUX PHONE#')
     A            D1CAFE    R               REFFLD(FEIN)
     A                                      COLHDG('CO AUX FEIN')
     A*
     A*  SUBSCRIBER INFORMATION
     A*
     A            D1SNAM    R               REFFLD(DS40)
     A                                      COLHDG('SUB NAME')
     A            D1SMA1    R               REFFLD(ADR1)
     A                                      COLHDG('SUB MAIL ADDR 1')
     A            D1SMA2    R               REFFLD(ADR2)
     A                                      COLHDG('SUB MAIL ADDR 2')
     A            D1SMCZ    R               REFFLD(DS40)
     A                                      COLHDG('SUB MAIL CITY/ST/ZIP')
     A            D1SARA    R               REFFLD(AREA)
     A                                      COLHDG('SUB PHONE 1' 'AREA CD')
     A            D1SPHN    R               REFFLD(PHN#)
     A                                      COLHDG('SUB INCOMING PHN #')
     A*
     A*  FUND INFORMATION
     A*
     A            D1FNME    R               REFFLD(NM60)
     A                                      COLHDG('GROUP NAME')
     A            D1FSHN    R               REFFLD(NM30)
     A                                      COLHDG('GROUP SHORT NAME')
     A            D1FEFD    R               REFFLD(DT8)
     A                                      COLHDG('GROUP EFFECTIVE DATE')
     A            D1FMA1    R               REFFLD(ADR1)
     A                                      COLHDG('GROUP MAIL ADDR 1')
     A            D1FMA2    R               REFFLD(ADR2)
     A                                      COLHDG('GROUP MAIL ADDR 2')
     A            D1FMCS    R               REFFLD(DS40)
     A                                      COLHDG('GRP MAIL CITY/ST/ZIP')
     A            D1FPA1    R               REFFLD(ADR1)
     A                                      COLHDG('GROUP PHYS ADDR 1')
     A            D1FPA2    R               REFFLD(ADR2)
     A                                      COLHDG('GROUP PHYS ADDR 2')
     A            D1FPCS    R               REFFLD(DS40)
     A                                      COLHDG('GRP PHYS CITY/ST/ZIP')
     A            D1FAR1    R               REFFLD(AREA)
     A                                      COLHDG('GROUP AREA CODE')
     A            D1FPH1    R               REFFLD(PHN#)
     A                                      COLHDG('GROUP PHONE# 1')
     A            D1FAR2    R               REFFLD(AREA)
     A                                      COLHDG('GROUP AREA CODE')
     A            D1FPH2    R               REFFLD(PHN#)
     A                                      COLHDG('GROUP PHONE# 2')
     A            D1FARA    R               REFFLD(AREA)
     A                                      COLHDG('GROUP FAX AREA CD')
     A            D1FAX     R               REFFLD(PHN#)
     A                                      COLHDG('GROUP FAX PHN#')
     A            D1ANAM    R               REFFLD(NM50)
     A                                      COLHDG('GROUP ALT NAME')
     A            D1FAA1    R               REFFLD(ADR1)
     A                                      COLHDG('GROUP ALT ADDRESS 1')
     A            D1FAA2    R               REFFLD(ADR2)
     A                                      COLHDG('GROUP ALT ADDRESS 2')
     A            D1FACZ    R               REFFLD(DS40)
     A                                      COLHDG('GRP ALT CITY/ST/ZIP')
     A            D1FAAR    R               REFFLD(AREA)
     A                                      COLHDG('GROUP ALT AREA CODE')
     A            D1FAPH    R               REFFLD(PHN#)
     A                                      COLHDG('GROUP ALT PHONE#')
     A*
     A*  EMPLOYER INFORMATION
     A*
     A            D1EEMP    R               REFFLD(EMP#)
     A                                      COLHDG('EMPLR#')
     A            D1EDIV    R               REFFLD(DIV)
     A                                      COLHDG('EMPLR DIV')
     A            D1ENME    R               REFFLD(NAME)
     A                                      COLHDG('EMPLR NAME')
     A            D1EDBA    R               REFFLD(NAME)
     A                                      COLHDG('EMPLR DBA')
     A            D1EMA1    R               REFFLD(ADR1)
     A                                      COLHDG('EMPLR MAIL ADDR 1')
     A            D1EMA2    R               REFFLD(ADR2)
     A                                      COLHDG('EMPLR MAIL ADDR 2')
     A            D1EMCS    R               REFFLD(DS40)
     A                                      COLHDG('EMP MAIL CITY/ST/ZIP')
     A            D1EPA1    R               REFFLD(ADR1)
     A                                      COLHDG('EMPLR PHYS ADDR 1')
     A            D1EPA2    R               REFFLD(ADR2)
     A                                      COLHDG('EMPLR PHYS ADDR 2')
     A            D1EPCS    R               REFFLD(DS40)
     A                                      COLHDG('EMP PHYS CITY/ST/ZIP')
     A            D1EARA    R               REFFLD(AREA)
     A                                      COLHDG('EMPLR AREA CODE')
     A            D1EPH#    R               REFFLD(PHN#)
     A                                      COLHDG('EMPLR PHONE #')
     A            D1EFAR    R               REFFLD(AREA)
     A                                      COLHDG('EMP FAX' 'AREA CODE')
     A            D1EFAX    R               REFFLD(PHN#)
     A                                      COLHDG('EMP FAX #')
     A            D1EFID    R               REFFLD(FEIN)
     A                                      COLHDG('EMPLR FEDERAL ID')
     A            D1ENOB    R               REFFLD(DS40)
     A                                      COLHDG('EMPLR NATURE OF' -
     A                                      'BUSINESS')
     A*
     A*  PROVIDER INFORMATION
     A*
     A            D1PFEI    R               REFFLD(FEIN)
     A                                      COLHDG('PROV FEIN')
     A            D1PMOD    R               REFFLD(MOD)
     A                                      COLHDG('PROV MOD')
     A            D1PMNM    R               REFFLD(NAME)
     A                                      COLHDG('PROV MAIL NAME')
     A            D1PMFN    R               REFFLD(FSN)
     A                                      COLHDG('PROV FIRST NAME')
     A            D1PMDN    R               REFFLD(NAME)
     A                                      COLHDG('PROV DBA NAME')
     A            D1PMA1    R               REFFLD(ADR1)
     A                                      COLHDG('PROV MAIL ADDR 1')
     A            D1PMA2    R               REFFLD(ADR2)
     A                                      COLHDG('PROV MAIL ADDR 2')
     A            D1PMCZ    R               REFFLD(DS40)
     A                                      COLHDG('PRV MAIL CITY/ST/ZIP')
     A            D1PMAR    R               REFFLD(AREA)
     A                                      COLHDG('PROV AREA CODE')
     A            D1PMPH    R               REFFLD(PHN#)
     A                                      COLHDG('PROV PHONE #')
     A            D1PMFA    R               REFFLD(AREA)
     A                                      COLHDG('PROV FAX AREA CODE')
     A            D1PMFP    R               REFFLD(PHN#)
     A                                      COLHDG('PROV FAX #')
     A            D1PPNM    R               REFFLD(NAME)
     A                                      COLHDG('PROV PHYS MAIL NAME')
     A            D1PPFN    R               REFFLD(FSN)
     A                                      COLHDG('PROV PHYS FIRST NAME')
     A            D1PPA1    R               REFFLD(ADR1)
     A                                      COLHDG('PROV PHYS ADDR 1')
     A            D1PPA2    R               REFFLD(ADR2)
     A                                      COLHDG('PROV PHYS ADDR 2')
     A            D1PPCZ    R               REFFLD(DS40)
     A                                      COLHDG('PRV PHYS CITY/ST/ZIP')
     A            D1PPAR    R               REFFLD(AREA)
     A                                      COLHDG('PROV PHYS AREA CODE')
     A            D1PPPH    R               REFFLD(PHN#)
     A                                      COLHDG('PROV PHYS PHONE #')
     A            D1PSPC    R               REFFLD(DS3)
     A                                      COLHDG('PROV SPEC CODE')
     A            D1PSPD    R               REFFLD(DS40)
     A                                      COLHDG('PROV SPEC DESC')
     A            D1PWCC    R               REFFLD(FLAG)
     A                                      COLHDG('PROV WC CERTIFIED')
     A            D1PWC#    R               REFFLD(CMSV)
     A                                      COLHDG('PROV WC CERTIFIED #')
     A*
     A*   MAINTENANCE INFORMATION
     A*
     A            D1STAT    R               REFFLD(STAT)
     A            D1USER    R               REFFLD(USER)
     A            D1PGM     R               REFFLD(PGM)
     A            D1TIME    R               REFFLD(TIME)
     A            D1DT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            D1IUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            D1IPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PGM')
     A            D1ITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            D1IDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A*** BEGIN ADD *** 11/18/98 **************************************
     A            D1DIUS    R               REFFLD(DS10)
     A                                      COLHDG('DIARY USER')
     A            D1DIDT    R               REFFLD(DT8)
     A                                      COLHDG('DIARY DATE')
     A            D1RSFL    R               REFFLD(FLAG)
     A                                      COLHDG('SUB RECIPIENT FLAG')
     A            D1RSAT    R               REFFLD(NAME)
     A                                      COLHDG('SUB RECIPIENT' +
     A                                      ' ATTENTION NAME')
     A            D1RGFL    R               REFFLD(FLAG)
     A                                      COLHDG('GRP RECIPIENT FLAG')
     A            D1RGAT    R               REFFLD(NAME)
     A                                      COLHDG('GRP RECIPIENT' +
     A                                      ' ATTENTION NAME')
     A            D1REFL    R               REFFLD(FLAG)
     A                                      COLHDG('EMP RECIPIENT FLAG')
     A            D1REAT    R               REFFLD(NAME)
     A                                      COLHDG('EMP RECIPIENT' +
     A                                      ' ATTENTION NAME')
     A            D1RCFL    R               REFFLD(FLAG)
     A                                      COLHDG('CLM RECIPIENT FLAG')
     A            D1ROFL    R               REFFLD(FLAG)
     A                                      COLHDG('OTH RECIPIENT FLAG')
     A            D1RONM    R               REFFLD(NAME)
     A                                      COLHDG('OTH RECIPIENT' +
     A                                      ' NAME')
     A            D1ROAT    R               REFFLD(NAME)
     A                                      COLHDG('OTH RECIPIENT' +
     A                                      ' ATTENTION NAME')
     A            D1ROA1    R               REFFLD(ADR1)
     A                                      COLHDG('OTH RECIPIENT' +
     A                                      ' ADDRESS 1')
     A            D1ROA2    R               REFFLD(ADR2)
     A                                      COLHDG('OTH RECIPIENT' +
     A                                      ' ADDRESS 2')
     A            D1ROCT    R               REFFLD(CTY)
     A                                      COLHDG('OTH RECIPIENT' +
     A                                      ' CITY')
     A            D1ROST    R               REFFLD(ST)
     A                                      COLHDG('OTH RECIPIENT' +
     A                                      ' STATE')
     A            D1ROZP    R               REFFLD(ZIP)
     A                                      COLHDG('OTH RECIPIENT' +
     A                                      ' ZIP')
     A            D1RRN1    R               REFFLD(NAME)
     A                                      COLHDG('RECIPIENT NAME 1')
     A            D1RRN2    R               REFFLD(NAME)
     A                                      COLHDG('RECIPIENT NAME 2')
     A            D1RRA1    R               REFFLD(ADR1)
     A                                      COLHDG('RECIPIENT ADR 1')
     A            D1RRA2    R               REFFLD(ADR2)
     A                                      COLHDG('RECIPIENT ADR 2')
     A            D1RRCT    R               REFFLD(CTY)
     A                                      COLHDG('RECIPIENT CITY' +
     A                                      '/STATE/ZIP')
     A*** END   ADD *** 11/18/98 **************************************
     A*** BEGIN ADD *** 02/22/00 **************************************
     A            D1CRNM    R               REFFLD(DS40)
     A                                      COLHDG('CARRIER NAME')
     A            D1CRA1    R               REFFLD(ADR1)
     A                                      COLHDG('CARRIER ADDR1')
     A            D1CRA2    R               REFFLD(ADR2)
     A                                      COLHDG('CARRIER ADDR2')
     A            D1CRCZ    R               REFFLD(DS40)
     A                                      COLHDG('CARRIER CITY' +
     A                                      '/STATE/ZIP')
     A            D1CRAR    R               REFFLD(AREA)
     A                                      COLHDG('CARRIER AREA' +
     A                                      ' CODE')
     A            D1CRPH    R               REFFLD(PHN#)
     A                                      COLHDG('CARRIER PHONE#')
     A*** END   ADD *** 02/22/00 **************************************
     A*** BEGIN ADD *** 02/21/01 **************************************
     A            D1RPFL    R               REFFLD(FLAG)
     A                                      COLHDG('PROVIDER RECIPIENT' +
     A                                      'FLAG')
     A            D1RPFE    R               REFFLD(FEIN)
     A                                      COLHDG('PROVIDER RECIPIENT' +
     A                                      'FEIN')
     A            D1RPMD    R               REFFLD(MOD)
     A                                      COLHDG('PROVIDER RECIPIENT' +
     A                                      'MOD')
     A            D1RPAT    R               REFFLD(DS40)
     A                                      COLHDG('PROVIDER RECIPIENT' +
     A                                      'ATTENTION NAME')
     A*** END   ADD *** 02/21/01 **************************************
     A*** BEGIN ADD *** 03/02/01 **************************************
     A            D1QNME    R               REFFLD(DS40)
     A                                      COLHDG('REQUESTOR NAME')
     A            D1QTIL    R               REFFLD(DS40)
     A                                      COLHDG('REQUESTOR TITLE')
     A            D1QCNM    R               REFFLD(DS40)
     A                                      COLHDG('REQUESTOR COMPANY' +
     A                                      'NAME')
     A            D1QAD1    R               REFFLD(DS40)
     A                                      COLHDG('REQUESTOR ADDRESS 1')
     A            D1QAD2    R               REFFLD(DS40)
     A                                      COLHDG('REQUESTOR ADDRESS 2')
     A            D1QAD3    R               REFFLD(DS40)
     A                                      COLHDG('REQUESTOR ADDRESS 3')
     A            D1QPAR    R               REFFLD(AREA)
     A                                      COLHDG('REQUESTOR TELEPHONE' +
     A                                      'AREA CODE')
     A            D1QPHN    R               REFFLD(PHN#)
     A                                      COLHDG('REQUESTOR TELEPHONE' +
     A                                      'NUMBER')
     A            D1QFAR    R               REFFLD(AREA)
     A                                      COLHDG('REQUESTOR FAX' +
     A                                      'AREA CODE')
     A            D1QFAX    R               REFFLD(PHN#)
     A                                      COLHDG('REQUESTOR FAX' +
     A                                      'NUMBER')
     A*** BEGIN ADD *** 03/02/01 **************************************
