     A*****************************************************************
     A*  (C) Copyright Progressive Data Solutions Inc., 2007          *
     A**                                                              *
     A** WCMC Detail Provider Bill Error File                         *
     A*****************************************************************
     A*  Created by: C:188   Project: 10MJC    Date: 02/13/07         *
     A*              EDI Edits (P2P Import)                           *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PEL01                     TEXT('DETAIL PROV BILL ERROR FILE')
     A            ELEOB#    R               REFFLD(EOB#)
     A                                      COLHDG('EOB#')
     A                                      TEXT('EOB#')
     A            ELDSEQ    R               REFFLD(SEQ#)
     A                                      COLHDG('DETAIL' 'SEQUENCE #')
     A                                      TEXT('DETAIL SEQUENCE #')
     A            ELLIN#    R               REFFLD(A90)
     A                                      COLHDG('LINE' 'NUMBER')
     A                                      TEXT('LINE NUMBER')
     A            ELAST     R               REFFLD(DS2)
     A                                      COLHDG('ADJUDICATION' 'STATE')
     A                                      TEXT('ADJUDICATION STATE')
     A            ELBTYP    R               REFFLD(FLAG)
     A                                      COLHDG('BILL' 'TYPE')
     A                                      TEXT('BILL TYPE')
     A            ELCODE    R               REFFLD(DS3)
     A                                      COLHDG('ERROR' 'CODE')
     A                                      TEXT('ERROR CODE')
     A            ELFLD     R               REFFLD(DS6)
     A                                      COLHDG('FIELD')
     A                                      TEXT('FIELD')
     A            ELVALU    R               REFFLD(DS15)
     A                                      COLHDG('FIELD' 'VALUE')
     A                                      TEXT('FIELD VALUE')
     A            ELNVAL    R               REFFLD(DS15)
     A                                      COLHDG('NEW' 'FIELD' 'VALUE')
     A                                      TEXT('NEW FIELD VALUE')
     A            ELPRFL    R               REFFLD(FLAG)
     A                                      COLHDG('PROCESS' 'FLAG')
     A                                      TEXT('PROCESS FLAG')
     A            ELPRDT    R               REFFLD(DT)
     A                                      COLHDG('PROCESS' 'DATE')
     A                                      TEXT('PROCESS DATE')
     A            ELUPLD    R               REFFLD(FLAG)
     A                                      COLHDG('P2P' 'UPLOAD' 'FLAG')
     A                                      TEXT('P2P UPLOAD FLAG')
     A            ELSTAT    R               REFFLD(FLAG)
     A                                      COLHDG('STATUS')
     A                                      TEXT('STATUS')
     A            ELUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINT' 'USER')
     A                                      TEXT('MAINT USER')
     A            ELPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINT' 'PGM')
     A                                      TEXT('MAINT PGM')
     A            ELTIME    R               REFFLD(TIME)
     A                                      COLHDG('MAINT' 'TIME')
     A                                      TEXT('MAINT TIME')
     A            ELDT      R               REFFLD(DT)
     A                                      COLHDG('MAINT' 'DATE')
     A                                      TEXT('MAINT DATE')
     A            ELIUSR    R               REFFLD(USER)
     A                                      COLHDG('INIT' 'USER')
     A                                      TEXT('INIT USER')
     A            ELIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INIT' 'PGM')
     A                                      TEXT('INIT PGM')
     A            ELITIM    R               REFFLD(TIME)
     A                                      COLHDG('INIT' 'TIME')
     A                                      TEXT('INIT TIME')
     A            ELIDT     R               REFFLD(DT)
     A                                      COLHDG('INIT' 'DATE')
     A                                      TEXT('INIT DATE')
