     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1996
     A**
     A** LOGICAL OVER EOB DELETE WORK FILE
     A*
     A*  EOB DELETE WORK FILE
     A          R PEO01                     PFILE(FDEOP)
     A          K EOCO#
     A          K EOSUB#
     A          K EOFND
     A          K EOFYR
     A          K EOCASE
     A          K EOEOB#
