     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC.. 1997
     A**
     A** FEE SCHEDULE STATE FEE SCHEDULE RULES
     A*****************************************************************
     A** REVISIONS:
     A*
     A*  07/15/03 C:79 PROJECT: TX020
     A*                SELECT IF STATUS NOT INACTIVE
     A*****************************************************************
     A*
     A          R PFR01                     PFILE(FDFRP)
     A          K FRST
     A          K FRSYS
     A          K FREFDT
     A          K FRPTY
     A          K FRBFCD
     A          S FRSTAT                    COMP(NE 'I')
