     A* (c) 2012 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A* ClaimCheck History File                                       *
     A*                                                               *
     A*****************************************************************
     A* Created on 06/11/2012 by C:251 for Project 114MER             *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PKH01                     TEXT('ClaimCheck History File')
     A            KHCO#     R     S         REFFLD(CO#)
     A                                      COLHDG('Company #')
     A            KHSUB#    R     S         REFFLD(SUB#)
     A                                      COLHDG('Subscriber #')
     A            KHFND     R     S         REFFLD(FND)
     A                                      COLHDG('Group #')
     A            KHFYR     R     S         REFFLD(FYR)
     A                                      COLHDG('Group Year')
     A            KHCASE    R     S         REFFLD(CASE)
     A                                      COLHDG('Case #')
     A            KHEOB#    R     S         REFFLD(EOB#)
     A                                      COLHDG('EOB Number')
     A            KHRCN     R     S         REFFLD(RCN)
     A                                      COLHDG('Recon #')
     A            KHDSEQ    R     S         REFFLD(SEQ#)
     A                                      COLHDG('Detail Sequence #')
     A            KHLIN#    R     S         REFFLD(A90)
     A                                      COLHDG('Line Number')
     A            KHPEOB#   R     S         REFFLD(A90)
     A                                      COLHDG('EOB# of the bill' +
     A                                      'being processed')
     A            KHPRCD    R               REFFLD(CPT4)
     A                                      COLHDG('Procedure Code')
     A            KHDOS     R     S         REFFLD(DT7)
     A                                      COLHDG('Date of Service')
     A            KHPAID    R     S         REFFLD(A92)
     A                                      COLHDG('Paid Amount')
     A            KHCKRF    R               REFFLD(DS40)
     A                                      COLHDG('ClaimCheck' +
     A                                      'Returned Field')
     A            KHCKHS    R               REFFLD(FLAG)
     A                                      COLHDG('History Indicator')
     A*           Valid values are: '0' = Current or unaudited procedure
     A*                             '1' = Previously paid procedure; History paid
     A*
     A            KHCKPS    R               REFFLD(FLAG)
     A                                      COLHDG('ClaimCheck' +
     A                                      'Payment Status')
     A            KHCKCO    R               REFFLD(FLAG)
     A                                      COLHDG('ClaimCheck' +
     A                                      'Code Origination')
     A*           Valid values are: '0' = Original Line
     A*                             Any other value = Added by claim check
     A            KHMCOD    R               REFFLD(CPT4)
     A                                      COLHDG('ClaimCheck' +
     A                                             'Message Code')
     A            KHMCDS    R     S         REFFLD(SEQ#)
     A                                      COLHDG('Message Code' +
     A                                             'DSeq')
     A            KHMLIN    R     S         REFFLD(A90)
     A                                      COLHDG('Message Code' +
     A                                             'Line#')
     A            KHMCEB    R     S         REFFLD(EOB#)
     A                                      COLHDG('Message Code' +
     A                                             'EOB#')
     A            KHMESG    R               REFFLD(DS7)
     A                                      COLHDG('Message Id')
     A            KHEOB     R               REFFLD(DS3)
     A                                      COLHDG('EOB Code')
     A            KHCKAC    R               REFFLD(DS7)
     A                                      COLHDG('ClaimCheck' +
     A                                             'Action')
     A            KHSTAT    R               REFFLD(STAT)
     A                                      COLHDG('Status')
     A            KHPRDT    R     S         REFFLD(DT)
     A                                      COLHDG('Print Date')
     A            KHPGM     R               REFFLD(PGM)
     A                                      COLHDG('Maintenance Program')
     A            KHUSER    R               REFFLD(USER)
     A                                      COLHDG('Maintenance User')
     A            KHDT      R     S         REFFLD(DT)
     A                                      COLHDG('Maintenance Date')
     A            KHTIME    R               REFFLD(TIME)
     A                                      COLHDG('Maintenance Time')
     A            KHIPGM    R               REFFLD(PGM)
     A                                      COLHDG('Initial Program')
     A            KHIUSR    R               REFFLD(USER)
     A                                      COLHDG('Initial User')
     A            KHIDT     R     S         REFFLD(DT)
     A                                      COLHDG('Initial Date')
     A            KHITIM    R               REFFLD(TIME)
     A                                      COLHDG('Initial Time')
