     A*****************************************************************
     A* (C) 2014 STONERIVER, INC. ALL RIGHTS RESERVED.                *
     A* STONERIVER IS A TRADEMARK OF STONERIVER, INC.                 *
     A*****************************************************************
     A**                                                              *
     A** 997 FUNCTINAL ACK TSET HEADER FILE                           *
     A*****************************************************************
     A*  CREATED BY: C:296   PROJECT: MC376    DATE: 03/25/14         *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R P837FL                    TEXT('837 Medical Bill'-
     A                                      'Reporting Flat File')
     A            FL837DATA   1000A         COLHDG('Flat file field')
