     A*****************************************************************
     A* (C) 2014 STONERIVER, INC. ALL RIGHTS RESERVED.                *
     A* STONERIVER IS A TRADEMARK OF STONERIVER, INC.                 *
     A*****************************************************************
     A**                                                              *
     A** 997 FUNCTINAL ACK TRANSACTION SET TRAILER FILE               *
     A*****************************************************************
     A*  CREATED BY: C:296   PROJECT: MC376    DATE: 03/25/14         *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R P99701                    TEXT('997 Functional Arc'-
     A                                      'Transaction Set Trailer File')
     A            SESEG          2A         COLHDG('SE Segment ID')
     A            SE01      R   10A         REFFLD(DS10)
     A                                      COLHDG('Number of Included' +
     A                                      'Segments')
     A            SE02      R   10A         REFFLD(DS10)
     A                                      COLHDG('Transaction Set' +
     A                                      'Control Number')
