     A** (C) COPYRIGHT PROGRESSICE DATA SOLUTIONS, INC. 1999
     A**
     A** EDI 824 ACKNOWLEDGEMENT FILE
     A*
     A          R PAH01                     PFILE(FEAHP)
     A          K AHCO#
     A          K AHLTDT                    DESCEND
     A          K AHLTTM                    DESCEND
     A          K AHJST
