     A* (C) Copyright Fiserv Insurance Solutions, Inc., 2008
     A*
     A* FIX0P - First Health EOR Financial Flat File
     A*
     A*****************************************************************
     A* Created on 02/05/2008 by C:47 for Project 129MQN
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PX001                     TEXT('First Health EOR Financial +
     A                                            Flat File')
     A            X0DATA      2900A
     A                                      COLHDG('EOR Record')
     A            X0PRFL    R               REFFLD(FLAG)
     A                                      COLHDG('Processed Flag')
