     A* (C) Copyright Fiserv Insurance Solutions, Inc., 2006
     A*
     A* FIX5L2 - X5EOB#/X5DSEQ - Logical
     A*
     A*****************************************************************
     A* Created on 02/05/2008 by C:47 for Project 129MQN
     A*****************************************************************
     A          R PX501                     PFILE(FIX5P)
     A          K X5EOB#
     A          K X5DSEQ
