      * (c) 2010 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
     A**************************************************************
     A*
     A*
     A*  CREATED BY : 08/12/10   C:198   PROJECT: 114MWS
     A*                                  MEDICARE CONTRACT IMPLEMENTATION
     A*
     A**************************************************************
     A** FEE SCHEDULE LOGICAL OVER AMBULANCE RATE FILE
     A*
     A          R PAM01                     PFILE(FMAMP)
     A*
     A          K AMHCPC
     A          K AMEFDT
