      * (c) 2019 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
      *
      * NY Conversion Factor file                                          *
      *****************************************************************    *
      * Created: 4/16/19 C:079 Project: NY044                              *
      *****************************************************************    *
      * Revisions                                                          *
      *****************************************************************    *
     A                                      REF(FSREFP)
     A          R PCV01                     TEXT('Conversion Factors')
     A            CVPRCD    R               REFFLD(CPT4)
     A                                      COLHDG('PROC CODE')
     A            CVEFDT    R     S         REFFLD(DT)
     A                                      COLHDG('EFF. DATE')
     A            CVSRC          4A         COLHDG('SOURCE')
     A            CVSECT    R               REFFLD(DS40)
     A                                      COLHDG('SECTION')
     A            CVREGI    R     S         REFFLD(A92)
     A                                      COLHDG('REG I CONV FACTOR')
     A            CVREGII   R     S         REFFLD(A92)
     A                                      COLHDG('REG II CONV FACTOR')
     A            CVREGIII  R     S         REFFLD(A92)
     A                                      COLHDG('REG III CONV FACTOR')
     A            CVREGIV   R     S         REFFLD(A92)
     A                                      COLHDG('REG IV CONV FACTOR')
     A            CVREGIPT  R     S         REFFLD(A92)
     A                                      COLHDG('REG I CONV FACTOR' 'PT/OT')
     A            CVREGIIPT R     S         REFFLD(A92)
     A                                      COLHDG('REG II CONV FACTOR' 'PT/OT')
     A            CVREGIIIPTR     S         REFFLD(A92)
     A                                      COLHDG('REG III CONV FACT' 'PT/OT')
     A            CVREGIVPT R     S         REFFLD(A92)
     A                                      COLHDG('REG IV CONV FACTOR' 'PT/OT')
     A            CVIUSR    R               REFFLD(USER)
     A            CVIPGM    R               REFFLD(PGM)
     A            CVIDT     R     S         REFFLD(DT)
     A            CVITIM    R     S         REFFLD(TIME)
     A            CVUSER    R               REFFLD(USER)
     A            CVPGM     R               REFFLD(PGM)
     A            CVDT      R     S         REFFLD(DT)
     A            CVTIME    R     S         REFFLD(TIME)
