     A* (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                                    *
     A**********************************************************************
     A* Created on 08/11/2010 by C:227 for Project IL001                   *
     A**********************************************************************
     A* Purpose: Illinois Fee Schedule Master File                         *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(FSREFP)
     A          R PFS01                     TEXT('FS Master File')
     A            FSCODE    R               REFFLD(DS5)
     A                                      COLHDG('Code')
     A            FSCAT     R               REFFLD(DS25)
     A                                      COLHDG('Category')
     A            FSZIP     R               REFFLD(DS3)
     A                                      COLHDG('Geo zip')
     A            FSEFDT    R               REFFLD(DT7)
     A                                      COLHDG('Effective Date')
     A            FSDSC1    R               REFFLD(DS50)
     A                                      COLHDG('Description 1')
     A            FSDSC2    R               REFFLD(DS50)
     A                                      COLHDG('Description 2')
     A            FSFSR     R               REFFLD(FLAG)
     A                                      COLHDG('FS Reimbursable')
     A            FSRPT     R               REFFLD(FLAG)
     A                                      COLHDG('By report')
     A            FSANBA    R               REFFLD(A50)
     A                                      COLHDG('Anesthesia' 'Base units')
     A            FSANCV    R               REFFLD(A92)
     A                                      COLHDG('Anesthesia' 'conv factor')
     A            FSASTC    R               REFFLD(A92)
     A                                      COLHDG('ASC Allowance')
     A            FSASPO    R               REFFLD(A52)
     A                                      COLHDG('POC for ASC')
     A            FSNEW     R               REFFLD(A92)
     A                                      COLHDG('HCPCS' 'New Allowance')
     A            FSNWPO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'New HCPCS')
     A            FSUSED    R               REFFLD(A92)
     A                                      COLHDG('HCPCS' 'Used Allowance')
     A            FSUEPO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'Used HCPCS')
     A            FSRNT     R               REFFLD(A92)
     A                                      COLHDG('HCPCS' 'Rental')
     A            FSRNPO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'Rental HCPCS')
     A            FSCIII    R               REFFLD(A92)
     A                                      COLHDG('FDA Class III')
     A            FSC3PO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'Class III HCPCS')
     A            FSOUTP    R               REFFLD(A92)
     A                                      COLHDG('Outpatient' 'Allowance')
     A            FSOTPO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'Outpatient')
     A            FSPTOT    R               REFFLD(A92)
     A                                      COLHDG('Professional' 'Total')
     A            FSTPPO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'Professional Total')
     A            FSPPC     R               REFFLD(A92)
     A                                      COLHDG('Professional' 'Prof Comp')
     A            FSPPPO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'Professional PC')
     A            FSPTC     R               REFFLD(A92)
     A                                      COLHDG('Professional' 'Tech Comp')
     A            FSPTPO    R               REFFLD(A52)
     A                                      COLHDG('POC' 'Professional TC')
     A            FSDRGS    R               REFFLD(A92)
     A                                      COLHDG('DRG Standard' 'Allowance')
     A            FSDSPO    R               REFFLD(A52)
     A                                      COLHDG('POC DRG Standard' 'Allow')
     A            FSDRGT    R               REFFLD(A92)
     A                                      COLHDG('DRG Trauma' 'Allowance')
     A            FSDTPO    R               REFFLD(A52)
     A                                      COLHDG('POC DRG' 'Trauma Allow')
     A            FSGLOB    R               REFFLD(A50)
     A                                      COLHDG('Global Days')
     A            FSMULT    R               REFFLD(FLAG)
     A                                      COLHDG('Mult Proc')
     A            FSBILA    R               REFFLD(FLAG)
     A                                      COLHDG('Bilat Surg')
     A            FSASST    R               REFFLD(FLAG)
     A                                      COLHDG('Asst Surg')
     A            FSCOSG    R               REFFLD(FLAG)
     A                                      COLHDG('Co-Surg')
     A            FSTESG    R               REFFLD(FLAG)
     A                                      COLHDG('Team Surg')
     A            FSANE     R               REFFLD(FLAG)
     A                                      COLHDG('Anesthesia Flag')
     A            FSSTAT    R               REFFLD(STAT)
     A                                      COLHDG('Status')
     A            FSPGM     R               REFFLD(PGM)
     A                                      COLHDG('Maint Program')
     A            FSUSER    R               REFFLD(USER)
     A                                      COLHDG('Maint User')
     A            FSDT      R               REFFLD(DT)
     A                                      COLHDG('Maint Date')
     A            FSTIME    R               REFFLD(TIME)
     A                                      COLHDG('Maint Time')
     A            FSIPGM    R               REFFLD(PGM)
     A                                      COLHDG('Initial Program')
     A            FSIUSR    R               REFFLD(USER)
     A                                      COLHDG('Initial User')
     A            FSIDT     R               REFFLD(DT)
     A                                      COLHDG('Initial Date')
     A            FSITIM    R               REFFLD(TIME)
     A                                      COLHDG('Initial Time')
