     A* (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                                    *
     A*  ILLINOIS                                                          *
     A*  FEE SCHEDULE MASTER FILE LOGICAL                                  *
     A**********************************************************************
     A*  CREATED:                                                          *
     A*                                                                    *
     A*  08/11/10  C:227  Project: IL001                                   *
     A*                   Illinois 2010 Fee Schedule                       *
     A**********************************************************************
     A*  REVISIONS:                                                        *
     A*                                                                    *
     A**********************************************************************
     A*
     A          R PFS01                     PFILE(FMFSP)
     A          K FSCODE
     A          K FSEFDT
