     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2002
     A**
     A** NATIONAL - GEOGRAPHIC ZIP AREA FILE
     A**
     A****************************************************************
     A**  REVISIONS:
     A**
     A**  09/20/02 C:079 Support: FSMNT 34254
     A**                 Create based on FMRCP
     A*
     A*   08/07/02 C:62  PROJECT: FS244
     A*                  ADD EFFECTIVE DATE
     A*
     A*   01/14/99 C:53  PROJECT: 48MCC
     A*                  ADDED FIELDS
     A*
     A****************************************************************
     A**
     A                                      REF(FSREFP)
     A*** BEG ADD *** 09/20/02 ****************************************
     A          R PGZ01                     FORMAT(FMGZP)
     A*** END ADD *** 09/20/02 ****************************************
     A*** BEG DEL *** 09/20/02 ****************************************
     A*********
     A********* R PGZ01                     TEXT('GEOGRAPHIC ZIP AREA FILE')
     A*********   GZCO#     R               REFFLD(CO#)
     A*********   GZZIPA    R               REFFLD(ZIPA)
     A*********                             TEXT('GEOGRAPHIC ZIP AREA')
     A*********   GZDESC    R               REFFLD(DS40)
     A*********                             TEXT('GEOGRAPHIC TEXT DESC')
     A****COVERED ZIP AREAS:
     A*********   GZFRZP    R               REFFLD(ZIPA)
     A*********                             TEXT('FROM ZIP AREA')
     A*********   GZTOZP    R               REFFLD(ZIPA)
     A*********                             TEXT('TO ZIP AREA')
     A*********   GZSTAT    R               REFFLD(STAT)
     A*********   GZUSER    R               REFFLD(USER)
     A*********   GZPGM     R               REFFLD(PGM)
     A*********   GZTIME    R               REFFLD(TIME)
     A*********   GZDT      R               REFFLD(DT)
     A*********                             COLHDG('DATE' 'MAINTAINED')
     A*********   GZIUSR    R               REFFLD(USER)
     A*********                             COLHDG('INITIAL' 'USER')
     A*********   GZIDT     R               REFFLD(DT)
     A*********                             COLHDG('INITIAL' 'ENTRY' 'DATE')
     A****BEG*ADD *** 01/13/98 **************************************
     A*********   GZCOVA    R               REFFLD(DS40)
     A*********                             TEXT('COVERED AREAS')
     A*********   GZRVS#    R               REFFLD(A30)
     A*********                             TEXT('RVS ID')
     A****BEG*ADD *** 01/13/98 **************************************
     A****BEGIN ADD *** 08/07/02 **************************************
     A*********   GZEFDT    R     S         REFFLD(DT)
     A*********                             TEXT('EFFECTIVE DATE')
     A****END** ADD *** 08/07/02 **************************************
     A*** END DEL *** 09/20/02 ****************************************
