     A* (C) Copyright Fiserv Insurance Solutions, Inc. 2008
     A*
     A* Home Health Fee Schedule Logical
     A*
     A************************************************************************8
     A* Created on 04/04/2008 by c:62 for Project TX040
     A************************************************************************8
     A* Revisions:
     A*
     A************************************************************************8
     A          R PHH01                     PFILE(FMHHP)
     A          K HHCO#
     A          K HHPRCD
     A          K HHFAGE
     A          K HHTAGE
     A          K HHMOD1
     A          K HHMOD2
     A          K HHTOS
     A          K HHEFDT
