     A*****************************************************************
     A* (c) 2011 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*****************************************************************
     A*  MEDICARE HIPPS CODE MASTER FILE
     A*
     A*  FILE:       FMHPL1
     A*  DATE:       10/04/11
     A*  PROJECT:    C114MZO
     A*  PROGRAMMER: C:280
     A*
     A*****************************************************************
     A* REVISIONS:
     A*
     A*
     A*****************************************************************
     A*
     A          R PHP01                     PFILE(FMHPP)
     A          K HPCODE
     A          K HPEFDT
     A          K HPTODT
