     A*****************************************************************
     A* (C) 2011 STONERIVER, INC. ALL RIGHTS RESERVED.
     A* STONERIVER IS A TRADEMARK OF STONERIVER, INC.
     A**
     A** IRF WAGE INDEX TABLE
     A**        IWCBSA - CBSA CODE
     A**        IWEFDT - EFFECTIVE DATE
     A**        IWAREA - URBAN/RURAL AREA
     A**
     A*****************************************************************
     A** CREATED BY: C:280  10/20/11  114MAR
     A*****************************************************************
     A*****************************************************************
     A** REVISIONS:
     A**
     A**
     A*****************************************************************
     A**
     A          R PIW01                     PFILE(FMIWP)
     A          K IWCBSA
     A          K IWEFDT
     A          K IWAREA
     A*****************************************************************
