     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1992,1993
     A**
     A** WCMC  - LICENSE NUMBER MASTER FILE
     A****************************************************************
     A                                      REF(FSREFP)
     A          R PLN01                     TEXT('LICENSE# MASTER FILE')
     A            LNNAME    R               REFFLD(NAME)
     A            LNADR1    R               REFFLD(ADR1)
     A            LNADR2    R               REFFLD(ADR2)
     A            LNADR3    R               REFFLD(ADR2)
     A            LNCTY     R               REFFLD(CTY)
     A            LNST      R               REFFLD(ST)
     A            LNZIP     R               REFFLD(ZIP)
     A            LNCNTY    R               REFFLD(CNTY)
     A            LNLIC#    R               REFFLD(FEI2)
     A                                      COLHDG('STATE' 'LICENSE#')
     A            LNLSTS    R               REFFLD(CODE)
     A                                      COLHDG('LICENSE' 'STATUS' 'CODE')
     A            LNOCCP    R               REFFLD(CODE)
     A                                      COLHDG('OCCUPATION' 'CODE')
     A            LNDBA     R               REFFLD(NAME)
     A                                      COLHDG('DOING' 'BUSINESS' 'AS')
     A            LNUSER    R               REFFLD(USER)
     A            LNPGM     R               REFFLD(PGM)
     A            LNTIME    R               REFFLD(TIME)
     A            LNDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            LNIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            LNIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
