     A*****************************************************************
     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 1998
     A*****************************************************************
     A**   WCMC PAYEE DEMOGRAPHICS RECORD (PARN/FEIN/MOD)            **
     A*****************************************************************
     A** REVISIONS:                                                  **
     A*                                                              **
     A*****************************************************************
     A**
     A          R PPD01                     PFILE(FMPDP)
     A          K PDPARN
     A          K PDFEIN
     A          K PDMOD
