     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2006
     A*
     A*****************************************************************
     A* Created on 10/03/2006 by C:079 for Support 55126
     A*****************************************************************
     A* Purpose: Wisconsin procedure code table file logical
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PPR01                     PFILE(FMPRPWI)
     A          K PRCO#
     A          K PRCPT4
     A          K PREFDT
