     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2005
     A**
     A** MICHIGAN
     A** FEE SCHEDULE LOGICAL OVER FMPRPMI PROC CODE FILE
     A*****************************************************************
     A* CREATED:
     A* 01/06/04  C: 79  PROJECT: 135WAA
     A*****************************************************************
     A* REVISIONS
     A*****************************************************************
     A*
     A                                      ALTSEQ(QSYSTRNTBL)
     A          R PPR01                     PFILE(FMPRPMI)
     A          K PRCO#
     A          K PRDSC1
