     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 1993
     A**
     A** FEE SCHEDULE LOGICAL OVER PROCEDURE CODE MASTER FILE
     A*
     A* MISSISSIPPI -  PROCEDURE CODE FILE
     A          R PPR01                     PFILE(FMPRPMS)
     A          K PRCO#
     A          K PRCPT4
     A          K PREFDT
