     A          R PSV01                     PFILE(FMSVPTX)
     A            SVCO#
     A            SVRVCD             I      SST(SVCMSV 1 3)
     A                                      COLHDG('REVENUE' 'CODE')
     A            SVEFDT
     A            SVSVCD
     A            SVDESC
     A            SVTYPE
     A            SVALOW
     A            SVINPC
     A            SVOTPC
     A            SVSTAT
     A            SVUSER
     A            SVPGM
     A            SVTIME
     A            SVIUSR
     A            SVIDT
     A            SVCMSV
     A            SVFL01
     A            SVFL02
     A            SVFL03
     A            SVFL04
     A            SVFL05
     A            SV92A1
     A            SV92A2
     A            SV92A3
     A            SV92A4
     A            SV92A5
     A            SVTSRV
     A          K SVCO#
     A          K SVRVCD
     A          K SVEFDT
