     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2006
     A*
     A*****************************************************************
     A* Created on 11/28/2006 by C:053 for Project 139MFU
     A*****************************************************************
     A* Purpose: Iowa service code table file logical
     A*****************************************************************
     A* Revisions:
     A*
     A*****************************************************************
     A          R PSV01                     PFILE(FMSVPIA)
     A          K SVCO#
     A          K SVCMSV
     A          K SVEFDT
