     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1993
     A**
     A** FEE SCHEDULE COMMON SERVICE CODE FILE - LOGICAL
     A*
     A          R PSV01                     PFILE(FMSVPLA)
     A          K SVCO#
     A          K SVSVCD
     A          K SVEFDT
