     A* (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2003
     A*
     A* FLORIDA ZIP CODE/REGION FILE
     A*
     A*****************************************************************
     A* CREATED ON 12/12/03 BY C:79 FOR PROJECT FL048
     A*****************************************************************
     A* REVISIONS:
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PZR01                     TEXT('TX ZIP CODE/REGION FILE')
     A            ZRCO#     R               REFFLD(CO#)
     A            ZRFZCD    R               REFFLD(ZIP1)
     A                                      TEXT('FROM ZIP CODE')
     A            ZRTZCD    R               REFFLD(ZIP1)
     A                                      TEXT('TO ZIP CODE')
     A            ZREFDT    R               REFFLD(DT)
     A                                      TEXT('EFFECTIVE DATE')
     A            ZRRGN#    R               REFFLD(RGN#)
     A                                      TEXT('REGION')
     A            ZRSTAT    R               REFFLD(STAT)
     A                                      COLHDG('STATUS')
     A            ZRUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINTENANCE' 'USER')
     A            ZRPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINTENANCE' 'PGM')
     A            ZRTIME    R               REFFLD(TIME)
     A                                      COLHDG('MAINTENANCE' 'TIME')
     A            ZRDT      R               REFFLD(DT)
     A                                      COLHDG('MAINTENANCE' 'DATE')
     A            ZRIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            ZRIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            ZRAREA    R               REFFLD(FLAG)
     A                                      COLHDG('AREA' 'RURAL/URBAN')
