     A* (c) 2010 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A* DELAWARE - LOGICAL OVER ZIP CODE/REGION FILE
     A*
     A*****************************************************************
     A* CREATED ON 08/12/10   C:251     PROJECT 114MWS
     A*****************************************************************
     A* REVISIONS:
     A*
     A*****************************************************************
     A*
     A          R PZR01                     PFILE(FMZRPDE)
     A          K ZRCO#
     A          K ZRFZCD
     A          K ZREFDT
     A          K ZRRGN#
