     A* (c) 2011 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A**
     A** Pennsylvania - Logical over Zip Code/Region File
     A*
     A*****************************************************************
     A** Created by: C:198  06/22/11  Project: 114MYS
     A*****************************************************************
     A** Revisions:
     A*
     A*
     A*
     A*****************************************************************
     A          R PZR01                     PFILE(FMZRPP1)
     A          K ZRCO#
     A          K ZRFZCD
     A          K ZREFDT
     A          K ZRRGN#
