     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 2006
     A**
     A** TEXAS - LOGICAL OVER ZIP CODE/REGION FILE
     A*
     A          R PZR01                     PFILE(FMZRPTX)
     A          K ZRCO#
     A          K ZREFDT
     A          K ZRFZCD
     A          K ZRRGN#
