     A** (C) COPYRIGHT PROGRESSIVE DATE SOLUTIONS, INC. 1992,1993
     A**
     A** FEE SCHEDULE - EOB - NETWORK RECORDS WORK FILE FOR REBILLS ***
     A****************************************************************
     A**  IMPORTANT NOTE:
     A**   CHANGES TO THIS FILE MAY REQUIRE CHANGES TO THE FOLLOWING:
     A**
     A**          FAEOP
     A**          FDEOP
     A**          FWEOP
     A**          FWEOP1
     A**          FXEOP
     A**          HAEOP
     A**          PAEOP
     A**          PDEOP
     A**          TAEOP
     A**
     A****************************************************************
     A**
     A** REVISIONS
     A*
     A*  01/07/99  C:94  PROJECT: MC152
     A*                  CHANGE LENGTH OF INV# FROM 5 TO 9
     A*
     A****************************************************************
     A                                      REF(FSREFP)
     A          R PEO01                     TEXT('EOB WORK FILE')
     A            EOCO#     R               REFFLD(CO#)
     A            EOFND     R               REFFLD(FND)
     A            EOFYR     R               REFFLD(FYR)
     A            EOCASE    R               REFFLD(CASE)
     A            EOTRDT    R               REFFLD(DT)
     A                                      COLHDG('TRANSACTION' 'DATE')
     A            EOFEIN    R               REFFLD(FEIN)
     A                                      COLHDG('PAYEE' 'FEDERAL' 'ID #')
     A            EOMOD     R               REFFLD(MOD)
     A            EOAMT     R               REFFLD(A92)
     A                                      COLHDG('RECOMMENDED' 'ALLOWANCE')
     A            EOFRDT    R               REFFLD(DT)
     A                                      COLHDG('FROM' 'DATE')
     A            EOTODT    R               REFFLD(DT)
     A                                      COLHDG('TO' 'DATE')
     A            EOTRCD    R               REFFLD(CODE)
     A                                      COLHDG('TRANSACTION' 'CODE')
     A            EOPNAM    R               REFFLD(NAME)
     A            EOADR1    R               REFFLD(ADR1)
     A            EOADR2    R               REFFLD(ADR2)
     A            EOCTY     R               REFFLD(CTY)
     A            EOST      R               REFFLD(ST)
     A            EOZIP     R               REFFLD(ZIP)
     A            EOEOB1    R               REFFLD(SPEC)
     A                                      COLHDG('EOMB TABLE' 'CODE 1')
     A            EOEOB2    R               REFFLD(SPEC)
     A                                      COLHDG('EOMB TABLE' 'CODE 2')
     A            EOEOB3    R               REFFLD(SPEC)
     A                                      COLHDG('EOMB TABLE' 'CODE 3')
     A            EOCHK#    R               REFFLD(CHK#) COLHDG('EOB# AFTR'+
     A                                      'PROCESSED')
     A            EOEOB#    R               REFFLD(EOB#) COLHDG('EOB# BE-4'+
     A                                      'PROCESSED')
     A            EOSYS     R               REFFLD(FLAG) COLHDG('SYSTEM ID')
     A                                      TEXT('SYSTEM CODE-"N"-NETWORK, +
     A                                      "P"-PROVIDER BILL REVIEW, "H"-+
     A                                      HOSPITAL BILL AUDIT')
     A
     A            EOFLG1    R               REFFLD(FLAG)
     A                                      TEXT('CHANGED RECORD Y/N')
     A            EOFLG2    R               REFFLD(FLAG)
     A                                      COLHDG('HOLD/RELEASE' 'STATUS')
     A                                      TEXT('HOLD/RELEASE STATUS')
     A            EOFLG3    R               REFFLD(FLAG) COLHDG('CRIMS INTERF' +
     A                                      'FLAG')
     A                                      TEXT('CRIMS INTERFACE FLAG')
     A            EOFLG4    R               REFFLD(FLAG) COLHDG('BILLING' +
     A                                      'FLAG')
     A                                      TEXT('BILLING FLAG')
     A            EOFLG5    R               REFFLD(FLAG) COLHDG('NO LOST' +
     A                                      'FLAG')
     A                                      TEXT('NO LOST TIME FLAG')
     A            EOFLG6    R               REFFLD(FLAG) COLHDG('DEL FRM' +
     A                                      'INV FLAG')
     A                                      TEXT('DEL FRM INV FLAG')
     A            EOFLG7    R               REFFLD(FLAG) COLHDG('BILL' +
     A                                      'BOTH SYS')
     A                                      TEXT('NOT USED YET FLAG')
     A            EOFLG8    R               REFFLD(FLAG) COLHDG('FLAG 8')
     A                                      TEXT('NOT USED YET FLAG')
     A            EOFLG9    R               REFFLD(FLAG) COLHDG('FLAG 9')
     A                                      TEXT('NOT USED YET FLAG')
     A            EOAMTC    R               REFFLD(A92)
     A                                      COLHDG('AMOUNT' 'CHARGED')
     A            EOSTAT    R               REFFLD(STAT) TEXT('P=PRINTED')
     A                                      COLHDG('PRINTED' 'FLAG')
     A            EOUSER    R               REFFLD(USER)
     A            EOPGM     R               REFFLD(PGM)
     A            EOTIME    R               REFFLD(TIME)
     A            EODT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A*** BEGIN ADD TO DUPLICATE FAEOP ********
     A            EOIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            EOIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A            EOWCCK    R               REFFLD(CHK#)
     A                                      COLHDG('WC' 'CHECK' 'NUMBER')
     A            EODIA1    R               REFFLD(DIA)
     A                                      TEXT('DIAGNOSTIC CODE 1')
     A            EODIA2    R               REFFLD(DIA)
     A                                      TEXT('DIAGNOSTIC CODE 2')
     A            EODIA3    R               REFFLD(DIA)
     A                                      TEXT('DIAGNOSTIC CODE 3')
     A            EODIA4    R               REFFLD(DIA)
     A                                      TEXT('DIAGNOSTIC CODE 4')
     A            EODIA5    R               REFFLD(DIA)
     A                                      TEXT('DIAGNOSTIC CODE 5')
     A            EOEMPL    R               REFFLD(FLAG)
     A                                      TEXT('PATIENT EMPLMNT')
     A            EODFC     R               REFFLD(DT)
     A                                      TEXT('DATE 1ST CONSULTED')
     A            EOFLIC    R               REFFLD(FEI2)
     A                                      COLHDG('PHYS FL LIC#')
     A            EOTAPE    R               REFFLD(FLAG)
     A                                      TEXT('SUBMIT ON TAPE FLAG')
     A            EO#BLL    R               REFFLD(AP3)
     A                                      COLHDG('NUMBER OF BILLS')
     A            EOCLSF    R               REFFLD(FLAG)
     A                                      COLHDG('CLOSED' 'FILE' 'FLAG')
     A            EOAST     R               REFFLD(ST)
     A                                      COLHDG('ADJUDICATION' 'STATE')
     A            EOSUB#    R               REFFLD(SUB#)
     A            EOAUDT    R               REFFLD(FLAG) COLHDG('AUDITED')
     A                                      TEXT('HBA HAS BEEN PERFORMED')
     A            EOBTFL    R               REFFLD(FLAG)
     A                                      COLHDG('BILLING TYPE' 'D=DETAIL' +
     A                                             'S=SUMMARY')
     A            EOHRFL    R               REFFLD(FLAG)
     A                                      COLHDG('HOLD/RELEASE' 'FLAG')
     A            EOBLFL    R               REFFLD(FLAG)
     A                                      COLHDG('BILLING' 'FLAG')
     A            EONLFL    R               REFFLD(FLAG)
     A                                      COLHDG('NO LOST' 'TIME FLAG')
     A            EODIFL    R               REFFLD(FLAG)
     A                                      COLHDG('DEL FROM' 'INV FLAG')
     A*** BEG CHG *** 01/07/99 ***************************************
     A            EOINV#    R               REFFLD(A90)
     A**********  EOINV#    R               REFFLD(SEQ#)
     A*** END CHG *** 01/07/99 ***************************************
     A                                      COLHDG('INVOICE' 'NUMBER')
     A            EORMDS    R               REFFLD(DS30)
     A                                      TEXT('REMARKS')
     A            EORMK1    R               REFFLD(CODE)
     A                                      TEXT('REMARK CODE 1')
     A            EORMK2    R               REFFLD(CODE)
     A                                      TEXT('REMARK CODE 2')
     A            EORMK3    R               REFFLD(CODE)
     A                                      TEXT('REMARK CODE 3')
     A            EOCKCN    R               REFFLD(CODE)
     A                                      COLHDG('CHECK CONTROL')
     A            EOOTHR    R               REFFLD(A92)
     A                                      COLHDG('OTHER' 'REDUCTIONS' +
     A                                      'AMOUNT')
     A            EONDIS    R               REFFLD(A92)
     A                                      COLHDG('NETWORK' 'DISCOUNT' +
     A                                      'REDUCTION')
     A            EOSB01    R               REFFLD(FLAG) COLHDG('SYSTEMS' +
     A                                      'BILLED' 'FLAG')
     A            EOSB02    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB03    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB04    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB05    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB06    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB07    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB08    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB09    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOSB10    R               REFFLD(FLAG)
     A                                      COLHDG('SYSTEMS' 'BILLED' 'FLAG')
     A            EOBAMT    R               REFFLD(A92)
     A                                      COLHDG('BILLING' 'AMOUNT')
     A            EOZIPA    R               REFFLD(ZIPA)
     A                                      COLHDG('GEO ZIP AREA')
     A            EOCERT    R               REFFLD(CERT)
     A                                      COLHDG('PRE-CERT #')
     A            EOEXT     R               REFFLD(EXT)
     A                                      COLHDG('PRE-CERT EXTENSION')
     A*** KEY LIST FOR FILE  *********************************************
     A          K EOCO#
     A          K EOSUB#
     A          K EOFND
     A          K EOINV#
     A          K EOEOB#
