     A*****************************************************************
     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 1995 - 1998
     A*****************************************************************
     A**   Save File for Data Sent to State - HOSPITAL               **
     A**                                                             **
     A**   NOTE:  WHEN COMPILING - # MBRS MUST BE *NOMAX             **
     A**                                                             **
     A**   PROGRAMMER: C:31                                          **
     A**   CREATED:   04/02/98      PROJECT: MC145                   **
     A*****************************************************************
     A** REVISIONS:
     A** 04/28/03 C:79 PROJECT: FL043
     A**               INCREASE RECORD LENGTH TO 500
     A*****************************************************************
     A**
     A                                      REF(FSREFP)
     A          R PTP01                     TEXT('BCL9 WRK FILE RCD TYP ALL')
     A*** BEG CHG *** 04/28/03 ****************************************
     A*********** TPDATA       208          TEXT('DATA -208')
     A            TPDATA       500          TEXT('DATA -500')
     A*** END CHG *** 04/28/03 ****************************************
