     A* (c) 2012 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A* CK STATE - CLAIM CHECK
     A* FSMS LOGICAL OVER ALL FSMS TABLE FILES
     A****************************************************************
     A* Created 06/11/12 by C:251 for project 114MER
     A*****************************************************************
     A*  REVISIONS:
     A*****************************************************************
     A*
     A*  CLAIM STATUS CODE
     A          R PCS01                     PFILE(FTCSP)
     A          K CSCO#
     A          K CSKEY
     A*
     A*  EOMB TYPE CODE
     A          R PEB01                     PFILE(FTEBPCK)
     A          K EBCO#
     A          K EBKEY
     A*
     A*  PROCEDURE CODE MODIFIER
     A          R PPM01                     PFILE(FTPMPCK)
     A          K PMCO#
     A          K PMKEY
     A*
     A*  PART CODE
     A          R PPA01                     PFILE(FTPAPCK)
     A          K PACO#
     A          K PAKEY
     A*
     A*  SPECIALTY CODE
     A          R PSP01                     PFILE(FTSPP)
     A          K SPCO#
     A          K SPKEY
     A*
     A*  PLACE OF SERVICE
     A          R PPS01                     PFILE(FTPSPCK)
     A          K PSCO#
     A          K PSKEY
     A*
     A*  COUNTY CODE
     A          R PCC01                     PFILE(FTCCP)
     A          K CCCO#
     A          K CCKEY
     A*
     A*  FACILITY TYPE CODE
     A          R PFT01                     PFILE(FTFTPCK)
     A          K FTCO#
     A          K FTKEY
     A*
     A*  TYPE OF SERVICE CODE
     A          R PTS01                     PFILE(FTTSP)
     A          K TSCO#
     A          K TSKEY
