     A*  (C) Copyright Progressive Data Systems, Inc., 2004
     A**
     A** FTASLMA -  Logical over FTASPMA
     A**
     A** Created By: C:079  Project: MA014
     A**
     A****************************************************************
     A* REVISIONS:                                                   *
     A*                                                              *
     A****************************************************************
     A*
     A                                      ALTSEQ(QSYSTRNTBL)
     A          R PAS01                     PFILE(FTASPMA)
     A          K ASGRP
     A          K ASAREA
     A          K ASEFDT
     A*
