     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDTABPAN
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdTabPan","onload":"          -
     A                                                        ","description":"-
     A                                      PerformRx Bill Import Errors Tab Pa-
     A                                      nel","overlay":"true","assume":"tru-
     A                                      e","window left":"10px"},"items":[{-
     A                                      "id":"HdgBilImportErr","field type"-
     A                                      :"output field","css class":"headin-
     A                                      g","value":"PerformRx Bill Import E-
     A                                      rrors ","left":"25px","top":"15px",-
     A                                      "description":"PerformRx Bill Impor-
     A                                      t Errors ","z index":"11","width":"-
     A                                      180px","heading type":"Section Head-
     A                                      er","text align":"left"},{"id":"Btn-
     A                                      ExitButton","field type":"button","-
     A                                      css class":"button","value":"Exit",-
     A                                      "left":"510px","top":"10px","width"-
     A                                      :"100px","cursor":"default","descri-
     A                                      ption":"Exit Button","response":{"f-
     A                                      ieldName":"ExitNow","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"shortcut key":"F3-
     A                                      ","visibility":"hidden"},{"id":"Btn-
     A                                      TabClick","field type":"button","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","description":"tab click button",-
     A                                      "value":"Tab","response":{"fieldNam-
     A                                      e":"tabClick","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"shortcut key":"F3","l-
     A                                      eft":"460px","top":"10px","width":"-
     A                                      35px","visibility":"hidden"},{"id":-
     A                                      "btnRefresh1","field type":"button"-
     A                                      ,"css class":"button","value":"Refr-
     A                                      esh","left":"650px","top":"10px","w-
     A                                      idth":"100px","cursor":"default","r-
     A                                      esponse":{"fieldName":"BtnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      visibility":"hidden","shortcut key"-
     A                                      :"F5"},{"id":"TabCountyCode","field-
     A                                       type":"tab panel","css class":"tab-
     A                                      -panel","left":"25px","top":"70px",-
     A                                      "width":"1210px","height":{"fieldNa-
     A                                      me":"TabHeight","dataLength":"5","d-
     A                                      ecPos":"0","numSep":"false","zeroBa-
     A                                      lance":"false","numBlankFill":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"px-
     A                                      ","designValue":"570px"},"tab names-
     A                                      ":"Bill Import Error Detail","z ind-
     A                                      ex":"0","tab panel style":"CompSuit-
     A                                      e Tab Panel","active tab":{"fieldNa-
     A                                      me":"TabIndex","dataLength":"5","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":""},-
     A                                      "ontabclick":"pui.click(\"BtnTabCli-
     A                                      ck\")"}]}')
     A            BTNREFRESH     1A  H
     A            EXITNOW        1A  H
     A            TABCLICK       1A  H
     A            TABHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A          R SFLBILIMER                SFL
     A            QPUI000001     1A  O  2  2
     A            DSPMODE        1A  H
     A            DSPVISB        1A  H
     A            SCBLROWSL      1A  H
     A            SCCLAIM#      15A  H
     A            SCDLT          1A  H
     A            SCDOI           L  H
     A            SCERR          1A  H
     A            SCRRNBLIME     9S 0H
     A            SCSS#          9A  H
     A            SCTRNSFR       1A  H
     A          R QSFLCTL001                SFLCTL(SFLBILIMER)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLRCDBILIMER')
     A          R RCDBILIMER
     A                                  1  2HTML('QPUICTL1    SFLBILIMER5    RS-
     A                                      FLDSP    0    FDSPBLSUB  RSFLDSPCTL-
     A                                       0    FDSPBLCTL  RSFLCLR    0    FC-
     A                                      LRBLSUB  RSFLPAG    1    C1    6 RS-
     A                                      FLSIZ    1    C1    7 0    3    ROV-
     A                                      ERLAY   0     RASSUME    0     RROW-
     A                                      S      2    C1    1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdBilImEr","overlay":"true","e-
     A                                      xternal css":"label","onload":"docu-
     A                                      ment.body.style.background = \"#EBF-
     A                                      5FF\"; fillDetailBox(''sflBilImEr''-
     A                                      ,1,''OutBLRRN#'', ''FTBILLPRE1''); -
     A                                       ","description":"Perform Rx Bill I-
     A                                      mport Errors Detail","assume":"true-
     A                                      ","overlay range":"1-1","design ove-
     A                                      rlay formats":"RcdTabPan","return c-
     A                                      ursor field":{"fieldName":"HFLD","d-
     A                                      ataLength":"20","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},"items":[{"-
     A                                      id":"BtnExitButtonAll","field type"-
     A                                      :"button","css class":"button","val-
     A                                      ue":"Exit","left":"460px","top":"50-
     A                                      px","width":"100px","cursor":"defau-
     A                                      lt","description":"Exit Button","re-
     A                                      sponse":{"fieldName":"ExitNow","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"shor-
     A                                      tcut key":"F3","visibility":"hidden-
     A                                      "},{"id":"OutJobNm","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":{"fieldName":"q1job","-
     A                                      refField":"Q1JOB SZQ1P","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"reference","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[q1job]"},"left":"22-
     A                                      0px","top":"95px","visibility":"hid-
     A                                      den","text align":"right"},{"id":"O-
     A                                      utJobN","field type":"output field"-
     A                                      ,"css class":"output-field","value"-
     A                                      :{"fieldName":"q1jobn","refField":"-
     A                                      Q1JOBN SZQ1P","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[q1jobn]"},"left":"295px","top-
     A                                      ":"95px","visibility":"hidden","tex-
     A                                      t align":"right"},{"id":"OutJobU","-
     A                                      field type":"output field","css cla-
     A                                      ss":"output-field","value":{"fieldN-
     A                                      ame":"q1cusr","refField":"Q1CUSR SZ-
     A                                      Q1P","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"ref-
     A                                      erence","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[q1c-
     A                                      usr]"},"left":"370px","top":"95px",-
     A                                      "visibility":"hidden","text align":-
     A                                      "right"},{"id":"sflBilImEr","field -
     A                                      type":"grid","css class":"subfilegr-
     A                                      id","left":"65px","top":"130px","nu-
     A                                      mber of rows":"7","number of column-
     A                                      s":"6","column widths":"114,107,105-
     A                                      ,35,74,84","column headings":"Claim-
     A                                       #,Social Security #,Date of Injury-
     A                                      ,Error,,","header height":"23","row-
     A                                       height":"20","csv export":"true","-
     A                                      export with headings":"true","sorta-
     A                                      ble columns":"true","resizable colu-
     A                                      mns":"true","movable columns":"true-
     A                                      ","height":"143px","width":"520px",-
     A                                      "header text align":"Conter,center,-
     A                                      Center,left,Center,le')
     A                                  1  2HTML('ft","record format name":"sfl-
     A                                      BilImEr","description":"Perform Rx -
     A                                      Bill Import Errors Detail","clear s-
     A                                      ubfile":{"fieldName":"clrBLSub","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"subfile record number":{"fieldNam-
     A                                      e":"rrnBilImEr","dataLength":"9","d-
     A                                      ecPos":"0","numSep":"false","zeroBa-
     A                                      lance":"false","numBlankFill":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":""}-
     A                                      ,"row selection":"single","display -
     A                                      subfile":{"fieldName":"dspBLSub","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"display control record":{"fieldN-
     A                                      ame":"dspBLCtl","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"selection fiel-
     A                                      d":{"fieldName":"scBLRowSl","dataLe-
     A                                      ngth":"1","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"},"selection value":-
     A                                      "A","onrowclick":"fillDetailBox(''s-
     A                                      flBilImEr'',row,''OutBLRRN#'', ''FT-
     A                                      BILLPRE1'')","cursor record number"-
     A                                      :{"fieldName":"ScRowRrn","dataLengt-
     A                                      h":"9","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":""},"export file name":"Bill_-
     A                                      Import_Errors","find option":"true"-
     A                                      ,"filter option":"true"},{"id":"Lbl-
     A                                      DtlClmntNm","field type":"output fi-
     A                                      eld","css class":"label","value":"C-
     A                                      laimant Name","left":"290px","top":-
     A                                      "315px","width":"110px","locked in -
     A                                      place":"false","text align":"left",-
     A                                      "height":"15px"},{"id":"DtlOutFldCl-
     A                                      mntNm","field type":"output field",-
     A                                      "css class":"output-field","left":"-
     A                                      290px","top":"330px","width":"280px-
     A                                      ","locked in place":"false","height-
     A                                      ":"12px","text align":"left"},{"id"-
     A                                      :"LblDtlClm#","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Claim#","text align":"left","left"-
     A                                      :"65px","top":"315px","width":"50px-
     A                                      ","locked in place":"false"},{"id":-
     A                                      "DtlOutFldClm#","field type":"outpu-
     A                                      t field","css class":"output-field"-
     A                                      ,"text align":"left","left":"65px",-
     A                                      "top":"330px","height":"12px","widt-
     A                                      h":"135px","locked in place":"false-
     A                                      "},{"id":"LblDtlDOI","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"Date Of Injury","left":"290-
     A                                      px","top":"360px","width":"85px","l-
     A                                      ocked in place":"false","text align-
     A                                      ":"left"},{"id":"DtlOutFldDOI","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","left":"290px","top-
     A                                      ":"375px","width":"85')
     A                                  1  2HTML('px","height":"12px","locked i-
     A                                      n place":"false","text align":"left-
     A                                      "},{"id":"LblDtlSSN#","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Social Security #","text a-
     A                                      lign":"left","left":"65px","top":"3-
     A                                      60px","width":"95px","locked in pla-
     A                                      ce":"false"},{"id":"DtlOutFldSSN#",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"output-field","text align":"l-
     A                                      eft","left":"65px","top":"375px","h-
     A                                      eight":"12px","width":"110px","lock-
     A                                      ed in place":"false"},{"id":"LblDtl-
     A                                      Clm#_copy","field type":"output fie-
     A                                      ld","css class":"label","value":"Cl-
     A                                      aim Status","text align":"left","le-
     A                                      ft":"65px","top":"400px","width":"7-
     A                                      5px","locked in place":"false"},{"i-
     A                                      d":"DtlOutFldClmSts","field type":"-
     A                                      output field","css class":"output-f-
     A                                      ield","text align":"left","left":"6-
     A                                      5px","top":"415px","height":"12px",-
     A                                      "width":"360px","locked in place":"-
     A                                      false"},{"id":"btnRefresh","field t-
     A                                      ype":"button","css class":"button",-
     A                                      "value":"Refresh","response":{"fiel-
     A                                      dName":"BtnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"shortcut key":"-
     A                                      F5","left":"870px","top":"28px","wi-
     A                                      dth":"100px","cursor":"default","vi-
     A                                      sibility":"hidden"},{"id":"OutFldCl-
     A                                      m#","field type":"output field","cs-
     A                                      s class":"output-field","value":{"f-
     A                                      ieldName":"scClaim#","dataLength":"-
     A                                      15","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scClaim#]-
     A                                      "},"left":"25px","top":"5px","width-
     A                                      ":"55px","grid":"sflBilImEr","colum-
     A                                      n":"0"},{"id":"OutFldSSN#","field t-
     A                                      ype":"output field","css class":"ou-
     A                                      tput-field","value":{"fieldName":"s-
     A                                      cSS#","dataLength":"9","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scSS#]"},"left":"10px","t-
     A                                      op":"5px","width":"75px","grid":"sf-
     A                                      lBilImEr","column":"1"},{"id":"OutF-
     A                                      ldDOI","field type":"output field",-
     A                                      "css class":"output-field","value":-
     A                                      {"fieldName":"scDOI","dataType":"da-
     A                                      te","formatting":"Date","dateFormat-
     A                                      ":"m/d/Y","locale":"en_US","designV-
     A                                      alue":"[scDOI]"},"left":"20px","top-
     A                                      ":"5px","width":"60px","text align"-
     A                                      :"right","grid":"sflBilImEr","colum-
     A                                      n":"2"},{"id":"OutBLRRN#","field ty-
     A                                      pe":"output field","css class":"out-
     A                                      put-field","value":{"fieldName":"sc-
     A                                      RrnBLIME","dataLength":"9","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"true","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"999.00","units":"","designV-
     A                                      alue":"[scRrnBLIME]"},"left":"55px"-
     A                                      ,"top":"5px","visibil')
     A                                  1  2HTML('ity":"hidden","grid":"sflBilI-
     A                                      mEr","column":"3"},{"id":"OutFldErr-
     A                                      ","field type":"output field","css -
     A                                      class":"output-field","value":{"fie-
     A                                      ldName":"scErr","dataLength":"1","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scErr]"},"left"-
     A                                      :"5px","top":"5px","width":"15px","-
     A                                      grid":"sflBilImEr","column":"3"},{"-
     A                                      id":"HyperlinkDlt","field type":"hy-
     A                                      perlink","css class":"link","value"-
     A                                      :"Delete","left":"10px","top":"0px"-
     A                                      ,"width":"35px","response":{"fieldN-
     A                                      ame":"SCDlt","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"disabled":{"fieldName":"-
     A                                      DspMode","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"visibility":{"fieldNa-
     A                                      me":"dspVisb","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"grid":"sflBi-
     A                                      lImEr","column":"4"},{"id":"Hyperli-
     A                                      nkTrnsfer","field type":"hyperlink"-
     A                                      ,"css class":"link","value":"Transf-
     A                                      er","left":"5px","top":"0px","respo-
     A                                      nse":{"fieldName":"ScTrnsfr","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"visibili-
     A                                      ty":{"fieldName":"dspVisb","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "disabled":{"fieldName":"dspMode","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"grid":"sflBilImEr","column":"5"-
     A                                      }]}')
     A            BTNREFRESH     1A  H
     A            CLRBLSUB       1A  H
     A            DSPBLCTL       1A  H
     A            DSPBLSUB       1A  H
     A            EXITNOW        1A  H
     A            HFLD          20A  H
     A            RRNBILIMER     9S 0H
     A            SCROWRRN       9S 0H
     A            Q1CUSR    R        H      REFFLD(Q1CUSR SZQ1P)
     A            Q1JOB     R        H      REFFLD(Q1JOB SZQ1P)
     A            Q1JOBN    R        H      REFFLD(Q1JOBN SZQ1P)
     A          R RCDTRNSFR
     A                                  1  2HTML('QPUIREC4    RWINDOW    0     -
     A                                      RASSUME    0     RERRMSGID  5    C7-
     A                                          TxtSSN#FMSADDCTY  C6    FSMESGC-
     A                                      0    C0    FERADDCTY  RERRMSGID  5 -
     A                                         C6    TxtDOIFMSADDCTY  C6    FSM-
     A                                      ESGC0    C0    FERADDCTY  ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdTrnsfr","description":"Trans-
     A                                      fer Bill","assume":"true","show as -
     A                                      window":"true"},"items":[{"id":"Pnl-
     A                                      TransferBill","field type":"panel",-
     A                                      "css class":"dialog","panel style":-
     A                                      "Transform Dialog","value":"Transfe-
     A                                      r Bill","left":"115px","top":"115px-
     A                                      ","height":"205px","width":"415px",-
     A                                      "z index":"8"},{"id":"LabelClmntNm"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value":"Claimant Nam-
     A                                      e","text align":"left","left":"275p-
     A                                      x","top":"150px","width":"95px","lo-
     A                                      cked in place":"false"},{"id":"TxtC-
     A                                      lmntNm","field type":"output field"-
     A                                      ,"css class":"output field","value"-
     A                                      :{"fieldName":"scClmntNm","dataLeng-
     A                                      th":"50","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[scCl-
     A                                      mntNm]"},"text align":"left","disab-
     A                                      led":{"fieldName":"dsbAddCty","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"left":"275px","top":"165px","widt-
     A                                      h":"200px","locked in place":"false-
     A                                      "},{"id":"LabelPmnt_copy","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"Claim #","text align":-
     A                                      "left","left":"130px","top":"150px"-
     A                                      ,"width":"55px","locked in place":"-
     A                                      false"},{"id":"TxbClaim#","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      value":{"fieldName":"scClaim1#","da-
     A                                      taLength":"15","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scClaim1#]"},"text align":"left",-
     A                                      "required":"false","left":"130px","-
     A                                      top":"165px","width":"100px","locke-
     A                                      d in place":"false"},{"id":"BtnTrns-
     A                                      frCancel","field type":"button","cs-
     A                                      s class":"button","value":"Cancel",-
     A                                      "response":{"fieldName":"BtnTrCancl-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      shortcut key":"F12","left":"370px",-
     A                                      "top":"280px","width":"100px","lock-
     A                                      ed in place":"false","cursor":"defa-
     A                                      ult","tab index":"23"},{"id":"BtnSa-
     A                                      veTrnsfr","field type":"button","cs-
     A                                      s class":"button","value":"Transfer-
     A                                      ","response":{"fieldName":"BtnSaveT-
     A                                      r","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "shortcut key":"Enter","left":"230p-
     A                                      x","top":"280px","width":"100px","l-
     A                                      ocked in place":"false","cursor":"d-
     A                                      efault","tab index":"24"},{"id":"Lb-
     A                                      lDtlSSN#_copy","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Social Security #","text align":"-
     A                                      left","left":"130px","top":"200px",-
     A                                      "width":"95px","locked in place":"f-
     A                                      alse"},{"id":"LblDtlD')
     A                                  1  2HTML('OI_copy","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Date Of Injury","text align":"lef-
     A                                      t","left":"275px","top":"195px","wi-
     A                                      dth":"85px","locked in place":"fals-
     A                                      e"},{"id":"TxtSSN#","field type":"o-
     A                                      utput field","css class":"output fi-
     A                                      eld","value":{"fieldName":"scSS1#",-
     A                                      "dataLength":"20","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scSS1#]"},"text align":"left",-
     A                                      "disabled":{"fieldName":"dsbAddCty"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"error messages":"2 messages-
     A                                      ","error message id":{"fieldName":"-
     A                                      MSADDCTY","dataLength":"10","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "error message file":"FSMESG","erro-
     A                                      r condition":{"fieldName":"erAddCty-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error condition 2":{"fieldName":"-
     A                                      errAddCty","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode":"0"-
     A                                      ,"error enhanced mode 2":"0","left"-
     A                                      :"130px","top":"215px","width":"105-
     A                                      px","locked in place":"false"},{"id-
     A                                      ":"TxtDOI","field type":"output fie-
     A                                      ld","css class":"output field","val-
     A                                      ue":{"fieldName":"scDOI1","dataType-
     A                                      ":"date","formatting":"Date","dateF-
     A                                      ormat":"m/d/Y","locale":"en_US","de-
     A                                      signValue":"[scDOI1]"},"text align"-
     A                                      :"left","disabled":{"fieldName":"ds-
     A                                      bAddCty","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"error messages":"2 -
     A                                      messages","error message id":{"fiel-
     A                                      dName":"MSADDCTY","dataLength":"10"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"},"error message file":"FSMES-
     A                                      G","error condition":{"fieldName":"-
     A                                      erAddCty","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error condition 2":{"fiel-
     A                                      dName":"errAddCty","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode":"0","error enhanced mode 2":"0-
     A                                      ","left":"275px","top":"210px","wid-
     A                                      th":"95px","locked in place":"false-
     A                                      ","tab index":"1"},{"id":"TxtClmSts-
     A                                      ","field type":"output field","css -
     A                                      class":"output field","value":{"fie-
     A                                      ldName":"scClmSts1","dataLength":"1-
     A                                      50","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scClmSts1-
     A                                      ]"},"text align":"lef')
     A                                  1  2HTML('t","left":"130px","top":"250p-
     A                                      x","width":"385px","locked in place-
     A                                      ":"false","color":"red"},{"id":"Btn-
     A                                      Clm#Search","field type":"button","-
     A                                      css class":"button","left":"230px",-
     A                                      "top":"160px","width":"0px","height-
     A                                      ":"20px","response":{"fieldName":"S-
     A                                      cClm#Scrh","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"background color":"transpa-
     A                                      rent","background image":"url(''/pr-
     A                                      ofoundui/proddata/images/icons/view-
     A                                      .png'')","background repeat":"no-re-
     A                                      peat","border bottom width":"0px","-
     A                                      border left width":"0px","border to-
     A                                      p width":"0px","cursor":"default","-
     A                                      border right width":"0px","shortcut-
     A                                       key":"F10"}]}')
     A            BTNSAVETR      1A  H
     A            BTNTRCANCL     1A  H
     A            DSBADDCTY      1A  H
     A            ERADDCTY       1A  H
     A            ERRADDCTY      1A  H
     A            MSADDCTY      10A  H
     A            SCCLAIM1#     15A  H
     A            SCCLM#SCRH     1A  H
     A            SCCLMNTNM     50A  H
     A            SCCLMSTS1    150A  H
     A            SCDOI1          L  H
     A            SCSS1#        20A  H
