     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDTABPAN
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdTabPan","onload":"          -
     A                                                        ","description":"-
     A                                      Bill Import PerformRx Upload Transn-
     A                                       Import History Tab Panel","overlay-
     A                                      ":"true","assume":"true","window le-
     A                                      ft":"10px"},"items":[{"id":"HdgBilI-
     A                                      mportErr","field type":"output fiel-
     A                                      d","css class":"heading","value":"P-
     A                                      erformRx Upload Transaction Import -
     A                                      History","left":"15px","top":"15px"-
     A                                      ,"description":"Bill Import Perform-
     A                                      Rx Upload Transaction Import Histor-
     A                                      y","z index":"11","width":"320px","-
     A                                      heading type":"Section Header","tex-
     A                                      t align":"left"},{"id":"BtnExitButt-
     A                                      on","field type":"button","css clas-
     A                                      s":"button","value":"Exit","left":"-
     A                                      510px","top":"10px","width":"100px"-
     A                                      ,"cursor":"default","description":"-
     A                                      Exit Button","response":{"fieldName-
     A                                      ":"ExitNow","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"shortcut key":"F3","vis-
     A                                      ibility":"hidden"},{"id":"BtnTabCli-
     A                                      ck","field type":"button","css clas-
     A                                      s":"button","cursor":"default","des-
     A                                      cription":"tab click button","value-
     A                                      ":"Tab","response":{"fieldName":"ta-
     A                                      bClick","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"shortcut key":"F3","left":"-
     A                                      460px","top":"10px","width":"35px",-
     A                                      "visibility":"hidden"},{"id":"btnRe-
     A                                      fresh1","field type":"button","css -
     A                                      class":"button","value":"Refresh","-
     A                                      left":"650px","top":"10px","width":-
     A                                      "100px","cursor":"default","respons-
     A                                      e":{"fieldName":"BtnRefresh","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"visibi-
     A                                      lity":"hidden"},{"id":"TabCountyCod-
     A                                      e","field type":"tab panel","css cl-
     A                                      ass":"tab-panel","left":"15px","top-
     A                                      ":"70px","width":"1210px","height":-
     A                                      {"fieldName":"TabHeight","dataLengt-
     A                                      h":"5","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"px","designValue":"570px"},"-
     A                                      tab names":"Upload Transaction Impo-
     A                                      rt History","z index":"0","tab pane-
     A                                      l style":"CompSuite Tab Panel","act-
     A                                      ive tab":{"fieldName":"TabIndex","d-
     A                                      ataLength":"5","decPos":"0","numSep-
     A                                      ":"false","zeroBalance":"false","nu-
     A                                      mBlankFill":"false","zeroFill":"fal-
     A                                      se","curSym":"","dataType":"zoned",-
     A                                      "formatting":"Number","negNum":"-99-
     A                                      9.00","units":""},"ontabclick":"pui-
     A                                      .click(\"BtnTabClick\")"}]}')
     A            BTNREFRESH     1A  H
     A            EXITNOW        1A  H
     A            TABCLICK       1A  H
     A            TABHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A          R SFLBLIMHST                SFL
     A            QPUI000001     1A  O  2  2
     A            SCHSTROWSL     1A  H
     A            SCMBR#        10A  H
     A            SCPRCSDDAT    10A  H
     A            SCPRCSDTIM     6S 0H
     A            SCRRNBLIMH     9S 0H
     A            SCUPLDDAT     10A  H
     A            SCUPLDTIM      6S 0H
     A          R QSFLCTL001                SFLCTL(SFLBLIMHST)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLRCDBLIMHST')
     A          R RCDBLIMHST
     A                                  1  2HTML('QPUICTL1    SFLBLIMHST5    RS-
     A                                      FLDSP    0    FDSPHSTSUB RSFLDSPCTL-
     A                                       0    FDSPHSTCTL RSFLCLR    0    FC-
     A                                      LRHSTSUB RSFLPAG    1    C1    9 RS-
     A                                      FLSIZ    1    C2    10 0    3    RO-
     A                                      VERLAY   0     RASSUME    0     RRO-
     A                                      WS      2    C1    1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdBLImHst","overlay":"true","e-
     A                                      xternal css":"label","onload":"docu-
     A                                      ment.body.style.background = \"#EBF-
     A                                      5FF\"; fillDetailBox(''sflBilImHst'-
     A                                      ',1,''OutHsRRN#'', ''FTBILLPRH1'');-
     A                                        ","description":"Bill Import Perf-
     A                                      ormRx Upload Transaction Import His-
     A                                      tory","assume":"true","overlay rang-
     A                                      e":"1-1","design overlay formats":"-
     A                                      RcdTabPan"},"items":[{"id":"BtnExit-
     A                                      ButtonAll","field type":"button","c-
     A                                      ss class":"button","value":"Exit","-
     A                                      left":"460px","top":"50px","width":-
     A                                      "100px","cursor":"default","descrip-
     A                                      tion":"Exit Button","response":{"fi-
     A                                      eldName":"ExitNow","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"shortcut key":"F-
     A                                      3","visibility":"hidden"},{"id":"Ou-
     A                                      tJobNm","field type":"output field"-
     A                                      ,"css class":"output-field","value"-
     A                                      :{"fieldName":"q1job","refField":"Q-
     A                                      1JOB SZQ1P","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[q1job]"},"left":"220px","top":"-
     A                                      95px","visibility":"hidden","text a-
     A                                      lign":"right"},{"id":"OutJobN","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"output-field","value":{"fieldName-
     A                                      ":"q1jobn","refField":"Q1JOBN SZQ1P-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"refere-
     A                                      nce","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[q1jobn-
     A                                      ]"},"left":"295px","top":"95px","vi-
     A                                      sibility":"hidden","text align":"ri-
     A                                      ght"},{"id":"OutJobU","field type":-
     A                                      "output field","css class":"output--
     A                                      field","value":{"fieldName":"q1cusr-
     A                                      ","refField":"Q1CUSR SZQ1P","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"reference","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[q1cusr]"},"left-
     A                                      ":"370px","top":"95px","visibility"-
     A                                      :"hidden","text align":"right"},{"i-
     A                                      d":"sflBilImHst","field type":"grid-
     A                                      ","css class":"subfilegrid","left":-
     A                                      "45px","top":"115px","number of row-
     A                                      s":"10","number of columns":"3","co-
     A                                      lumn widths":"119,187,237","column -
     A                                      headings":",------- Upload ----,----
     A                                      ---  Processed ----","header height-
     A                                      ":"40","row height":"20","csv expor-
     A                                      t":"true","csv file name":"Upload_T-
     A                                      ransaction_Imp_History","export wit-
     A                                      h headings":"true","sortable column-
     A                                      s":"true","resizable columns":"true-
     A                                      ","movable columns":"true","height"-
     A                                      :"220px","width":"544px","header te-
     A                                      xt align":"Left,Left, Left","record-
     A                                       format name":"sflBlImHst","descrip-
     A                                      tion":"Bill Import PerformRx Upload-
     A                                       Transaction Import History","clear-
     A                                       subfile":{"fieldName":"clrHstSub",-
     A                                      "customTrue":"","cust')
     A                                  1  2HTML('omFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"subfile re-
     A                                      cord number":{"fieldName":"rrnBLImH-
     A                                      st","dataLength":"9","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"-999.00","units":""},"row select-
     A                                      ion":"single","display subfile":{"f-
     A                                      ieldName":"dspHstSub","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"display -
     A                                      control record":{"fieldName":"dspHs-
     A                                      tCtl","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"selection field":{"field-
     A                                      Name":"scHstRowSl","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"},"selection value":"A","onro-
     A                                      wclick":"fillDetailBox(''sflBilImHs-
     A                                      t'',row,''OutHsRRN#'', ''FTBILLPRH1-
     A                                      '');","value":"Member Name"},{"id":-
     A                                      "LblDtlMbrNm","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Member #","left":"50px","top":"370-
     A                                      px","width":"65px","locked in place-
     A                                      ":"false","text align":"left","heig-
     A                                      ht":"15px"},{"id":"DtlOutFldMbr","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"output-field","left":"50px","to-
     A                                      p":"385px","width":"150px","locked -
     A                                      in place":"false","height":"12px","-
     A                                      text align":"left"},{"id":"LblDtlPr-
     A                                      cDtTm","field type":"output field",-
     A                                      "css class":"label","value":"Proces-
     A                                      sed Date/Time","left":"50px","top":-
     A                                      "450px","width":"125px","locked in -
     A                                      place":"false","text align":"left"}-
     A                                      ,{"id":"LblDtlUpDtTm","field type":-
     A                                      "output field","css class":"label",-
     A                                      "value":"Upload Date/Time","text al-
     A                                      ign":"left","left":"50px","top":"41-
     A                                      0px","width":"110px","locked in pla-
     A                                      ce":"false"},{"id":"DtlOutUpldDate"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"output-field","text align":"-
     A                                      left","left":"50px","top":"425px","-
     A                                      height":"12px","width":"75px","lock-
     A                                      ed in place":"false"},{"id":"LblDtl-
     A                                      TtlRcCount","field type":"output fi-
     A                                      eld","css class":"label","value":"T-
     A                                      otal Record Count","text align":"le-
     A                                      ft","left":"50px","top":"490px","wi-
     A                                      dth":"120px","locked in place":"fal-
     A                                      se"},{"id":"DtlOutTtlRcCount","fiel-
     A                                      d type":"output field","css class":-
     A                                      "output-field","text align":"left",-
     A                                      "left":"50px","top":"505px","height-
     A                                      ":"12px","width":"135px","locked in-
     A                                       place":"false"},{"id":"LblDtlClmEr-
     A                                      Count","field type":"output field",-
     A                                      "css class":"label","value":"Claim -
     A                                      Error Count","text align":"left","l-
     A                                      eft":"300px","top":"415px","width":-
     A                                      "115px","locked in pl')
     A                                  1  2HTML('ace":"false"},{"id":"DtlOutCl-
     A                                      mErCount","field type":"output fiel-
     A                                      d","css class":"output-field","text-
     A                                       align":"left","left":"300px","top"-
     A                                      :"430px","height":"12px","width":"1-
     A                                      35px","locked in place":"false"},{"-
     A                                      id":"LblDtlNbrOfDup","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"Number Of Duplicates","text-
     A                                       align":"left","left":"300px","top"-
     A                                      :"375px","width":"135px","locked in-
     A                                       place":"false"},{"id":"DtlOutNbrOf-
     A                                      Dup","field type":"output field","c-
     A                                      ss class":"output-field","text alig-
     A                                      n":"left","left":"300px","top":"390-
     A                                      px","height":"12px","width":"135px"-
     A                                      ,"locked in place":"false"},{"id":"-
     A                                      LblDtlBillTrnsfd","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"Bill Transferred","text align"-
     A                                      :"left","left":"300px","top":"455px-
     A                                      ","width":"115px","locked in place"-
     A                                      :"false"},{"id":"DtlOutBillTnsfrd",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"output-field","text align":"l-
     A                                      eft","left":"300px","top":"470px","-
     A                                      height":"12px","width":"135px","loc-
     A                                      ked in place":"false"},{"id":"LblDt-
     A                                      lMbr#","field type":"output field",-
     A                                      "css class":"label","value":"Member-
     A                                       #","text align":"left","left":"55p-
     A                                      x","top":"130px","height":"15px","w-
     A                                      idth":"65px","locked in place":"fal-
     A                                      se"},{"id":"LblDtlUpldDt","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"Date","text align":"le-
     A                                      ft","left":"175px","top":"140px","h-
     A                                      eight":"15px","width":"60px","locke-
     A                                      d in place":"false"},{"id":"LblDtlU-
     A                                      pldTm","field type":"output field",-
     A                                      "css class":"label","value":"Time",-
     A                                      "text align":"left","left":"260px",-
     A                                      "top":"140px","height":"15px","widt-
     A                                      h":"30px","locked in place":"false"-
     A                                      },{"id":"LblDtlPrcsDt","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Date","text align":"left"-
     A                                      ,"left":"365px","top":"140px","heig-
     A                                      ht":"15px","width":"60px","locked i-
     A                                      n place":"false"},{"id":"LblDtlPrcs-
     A                                      Tm","field type":"output field","cs-
     A                                      s class":"label","value":"Time","te-
     A                                      xt align":"left","left":"455px","to-
     A                                      p":"140px","height":"15px","width":-
     A                                      "30px","locked in place":"false"},{-
     A                                      "id":"DtlOutUpldTime","field type":-
     A                                      "output field","css class":"output--
     A                                      field","text align":"left","left":"-
     A                                      135px","top":"425px","height":"12px-
     A                                      ","width":"75px","locked in place":-
     A                                      "false"},{"id":"DtlOutPrcsdTime","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"output-field","text align":"lef-
     A                                      t","left":"135px","top":"465px","he-
     A                                      ight":"12px","width":"75px","locked-
     A                                       in place":"false"},{"id":"DtlOutPr-
     A                                      cdDate","field type":"output field"-
     A                                      ,"css class":"output-field","text a-
     A                                      lign":"left","left":"50px","top":"4-
     A                                      65px","height":"12px","width":"75px-
     A                                      ","locked in place":"false"},{"id":-
     A                                      "btnRefresh","field t')
     A                                  1  2HTML('ype":"button","css class":"bu-
     A                                      tton","value":"Refresh","response":-
     A                                      {"fieldName":"BtnRefresh","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"58-
     A                                      5px","top":"50px","width":"100px","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","shortcut key":"F5"},{"id":"Ou-
     A                                      tFldMbr","field type":"output field-
     A                                      ","css class":"output-field","value-
     A                                      ":{"fieldName":"scMbr#","dataLength-
     A                                      ":"10","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[scMbr#-
     A                                      ]"},"left":"10px","top":"5px","widt-
     A                                      h":"55px","grid":"sflBilImHst","col-
     A                                      umn":"0"},{"id":"OutHsRRN#","field -
     A                                      type":"output field","css class":"o-
     A                                      utput-field","value":{"fieldName":"-
     A                                      SCRRNBLIMH","dataLength":"9","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"false","numBlankFill":"false","-
     A                                      zeroFill":"true","curSym":"","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "negNum":"999.00","units":"","desig-
     A                                      nValue":"[SCRRNBLIMH]"},"left":"55p-
     A                                      x","top":"5px","visibility":"hidden-
     A                                      ","grid":"sflBilImHst","column":"2"-
     A                                      },{"id":"OutUpldDate","field type":-
     A                                      "output field","css class":"output--
     A                                      field","value":{"fieldName":"SCUpld-
     A                                      Dat","dataLength":"10","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[SCUpldDat]"},"left":"10px-
     A                                      ","top":"5px","grid":"sflBilImHst",-
     A                                      "column":"1"},{"id":"OutUpldTime","-
     A                                      field type":"output field","css cla-
     A                                      ss":"output-field","value":{"fieldN-
     A                                      ame":"ScUpldTim","dataLength":"6","-
     A                                      decPos":"0","numSep":"false","zeroB-
     A                                      alance":"true","numBlankFill":"fals-
     A                                      e","zeroFill":"true","edtWrd":"''  -
     A                                      :  :  ''","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"-999.00","units":"","designValue-
     A                                      ":"[ScUpldTim]"},"left":"95px","top-
     A                                      ":"5px","grid":"sflBilImHst","colum-
     A                                      n":"1"},{"id":"OutPrcsdTime","field-
     A                                       type":"output field","css class":"-
     A                                      output-field","value":{"fieldName":-
     A                                      "SCPrcsdTim","dataLength":"6","decP-
     A                                      os":"0","numSep":"false","zeroBalan-
     A                                      ce":"true","numBlankFill":"false","-
     A                                      zeroFill":"true","edtWrd":"''  :  :-
     A                                        ''","curSym":"","dataType":"zoned-
     A                                      ","formatting":"Number","negNum":"--
     A                                      999.00","units":"","designValue":"[-
     A                                      SCPrcsdTim]"},"left":"105px","top":-
     A                                      "5px","grid":"sflBilImHst","column"-
     A                                      :"2"},{"id":"OutPrcdDate","field ty-
     A                                      pe":"output field","css class":"out-
     A                                      put-field","value":{"fieldName":"SC-
     A                                      PrcsdDat","dataLength":"10","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTrans')
     A                                  1  2HTML('form":"none","designValue":"[-
     A                                      SCPrcsdDat]"},"left":"10px","top":"-
     A                                      5px","grid":"sflBilImHst","column":-
     A                                      "2"}]}')
     A            BTNREFRESH     1A  H
     A            CLRHSTSUB      1A  H
     A            DSPHSTCTL      1A  H
     A            DSPHSTSUB      1A  H
     A            EXITNOW        1A  H
     A            RRNBLIMHST     9S 0H
     A            Q1CUSR    R        H      REFFLD(Q1CUSR SZQ1P)
     A            Q1JOB     R        H      REFFLD(Q1JOB SZQ1P)
     A            Q1JOBN    R        H      REFFLD(Q1JOBN SZQ1P)
