     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1995
     A**
     A** WCMC TYPE OF COVERAGE TABLE FILE
     A**
     A                                      REF(FSREFP)
     A          R PCV01                     TEXT('TYPE OF COVERAGE TABLE FILE')
     A            CVCO#     R               REFFLD(CO#)
     A            CVKEY     R               REFFLD(KEY)
     A                                      COLHDG('TYPE' 'CVR 2-A')
     A            CVDESC    R               REFFLD(DS60)
     A            CVSTAT    R               REFFLD(STAT)
     A                                      COLHDG('RCD' 'STS')
     A            CVUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINT' 'USER')
     A            CVPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINT' 'PGM')
     A            CVTIME    R               REFFLD(TIME)
     A                                      COLHDG('MAINT' 'TIME')
     A            CVDT      R               REFFLD(DT)
     A                                      COLHDG('MAINT' 'DATE')
     A            CVIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            CVIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            CVITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
