     A* (c) 2013 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A* FTDGPME - Maine DRG Production File                           *
     A*****************************************************************
     A** Created by: C277  06/14/13  PROJECT ME005                    *
     A*****************************************************************
     A** REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A                                      REF(FSREFP)
     A*
     A          R PDG01                     TEXT('Maine DRG Production -
     A                                      File')
     A*
     A            DGDRG     R     S         REFFLD(A50)
     A                                      COLHDG('DRG' 'CODE')
     A                                      TEXT('DRG CODE')
     A*
     A            DGEFDT    R     S         REFFLD(DT7)
     A                                      COLHDG('EFFECTIVE' 'DATE')
     A                                      TEXT('EFFECTIVE DATE')
     A*
     A            DGTYPE    R               REFFLD(DS10)
     A                                      COLHDG('DRG' 'TYPE')
     A                                      TEXT('DRG TYPE')
     A*
     A            DGDESC    R               REFFLD(DS50)
     A                                      COLHDG('DRG' 'DESCRIPTION')
     A                                      TEXT('DRG DESCRIPTION')
     A*
     A            DGGLOS    R     S         REFFLD(A41)
     A                                      COLHDG('GEOMETRIC' 'MEAN LOS')
     A                                      TEXT('GEOMETRIC MEAN LOS')
     A*
     A            DGRELW         7S 4
     A                                      COLHDG('RELATIVE' 'WEIGHT')
     A                                      TEXT('RELATIVE WEIGHT')
     A*
     A            DGAFEE    R     S         REFFLD(A112)
     A                                      COLHDG('ACH FEE')
     A                                      TEXT('ACH FEE')
     A*
     A            DGCFEE    R     S         REFFLD(A112)
     A                                      COLHDG('CAH' 'FEE')
     A                                      TEXT('CAH FEE')
     A*
     A            DGSTAT    R               REFFLD(STAT)
     A                                      COLHDG('STATUS')
     A                                      TEXT('STATUS')
     A*
     A            DGPGM     R               REFFLD(PGM)
     A                                      COLHDG('MAINTENANCE' 'PROGRAM')
     A                                      TEXT('MAINTENANCE PROGRAM')
     A*
     A            DGUSER    R               REFFLD(USER)
     A                                      COLHDG('MAINTENANCE' 'USER')
     A                                      TEXT('MAINTENANCE USER')
     A*
     A            DGDT      R     S         REFFLD(DT)
     A                                      COLHDG('MAINTENANCE' 'DATE')
     A                                      TEXT('MAINTENANCE DATE')
     A*
     A            DGTIME    R     S         REFFLD(TIME)
     A                                      COLHDG('MAINTENANCE' 'TIME')
     A                                      TEXT('MAINTENANCE TIME')
     A*
     A            DGIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A                                      TEXT('INITIAL PROGRAM')
     A*
     A            DGIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A                                      TEXT('INITIAL USER')
     A*
     A            DGIDT     R     S         REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A                                      TEXT('INITIAL DATE')
     A*
     A            DGITIM    R     S         REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A                                      TEXT('INITIAL TIME')
