     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2004
     A**
     A** FEE SCHEDULE (UC) EOMB DESCRIPTIONS TABLE FILE
     A**
     A*****************************************************************
     A* CREATED 11/03/04 BY C:79 FOR PROJECT MC257
     A*****************************************************************
     A** REVISIONS:
     A**
     A** 05/04/11 C:191 PROJECT: FS389
     A**                CHANGE TO BASE FORMAT ON FTEBP
     A**
     A*****************************************************************
     A*** BEGIN CHG ****** 05/04/11 ************************************
     A          R PEB01                     FORMAT(FTEBP)
     A*
     A*********                             REF(FSREFP)
     A********* R PEB01                     TEXT('EOMB DESC TABLE')
     A*********   EBCO#     R               REFFLD(CO#)
     A*********   EBKEY     R               REFFLD(KEY)
     A*********                             COLHDG('EOB' 'CODE 3-A')
     A*********   EBDESC    R               REFFLD(DS70)
     A*********   EBSTAT    R               REFFLD(STAT)
     A*********   EBUSER    R               REFFLD(USER)
     A*********   EBPGM     R               REFFLD(PGM)
     A*********   EBTIME    R               REFFLD(TIME)
     A*********   EBDT      R               REFFLD(DT)
     A*********                             COLHDG('DATE' 'MAINTAINED')
     A*********   EBIUSR    R               REFFLD(USER)
     A*********                             COLHDG('INITIAL' 'USER')
     A*********   EBIDT     R               REFFLD(DT)
     A*********                             COLHDG('INITIAL' 'ENTRY' 'DATE')
     A*********   EBOTHR    R               REFFLD(FLAG)
     A*********                             COLHDG('OTHER' 'REDUCTIONS' 'TYPE')
     A*********                                    Valid Values:  Y/N
     A*********   EBDSC2    R               REFFLD(DS70)
     A*********                             COLHDG('DESCRIPTION TWO')
     A*********   Position 1-3 = 2nd cross reference EOMB code.
     A*********   EBXREF    R               REFFLD(DS3)
     A*********                             COLHDG('EOMB CROSS' 'REFERENCE')
     A*********   EBCRST    R               REFFLD(CODE3)
     A*********                             COLHDG('CodeReview' 'Status')
     A*********
     A*********         Valid Values:  from Generic table id CRST
     A*********
     A*********   EBCRET    R               REFFLD(DS15)
     A*********                             COLHDG('CodeReview' 'Edit Type')
     A*********
     A*********         Valid Values:  from Generic table id CRET
     A*********
     A*** END   CHG ****** 05/04/11 ************************************
