     A* (c) 2013 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*                                                                    *
     A*  ILLINOIS                                                          *
     A*  FEE SCHEDULE LOGICAL OVER FTEBPIL TABLE FILE                      *
     A**********************************************************************
     A*  CREATED:                                                          *
     A*                                                                    *
     A*  08/11/10  C:227  Project: IL001                                   *
     A*                   Illinois 2010 Fee Schedule                       *
     A**********************************************************************
     A*  REVISIONS:                                                        *
     A*                                                                    *
     A**********************************************************************
     A          R PEB01                     PFILE(FTEBPIL)
     A          K EBCO#
     A          K EBXREF
     A          K EBKEY
