     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2002
     A**
     A** PENNSYLVANIA
     A** FEE SCHEDULE UNIQUE LOGICAL OVER FTEBPPA TABLE FILE
     A*
     A                                      UNIQUE
     A*
     A*  EOMB TYPE CODE
     A          R PEB01                     PFILE(FTEBPPA)
     A          K EBCO#
     A          K EBKEY
