     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2000
     A**
     A** MISSISSIPPI
     A** WCMC LOGICAL OVER THE EOMB CODE FILE
     A*****************************************************************
     A* CREATED 09/26/2000 BY C:62 FOR PROJECT FSMNT
     A*****************************************************************
     A*  REVISIONS:
     A*
     A*****************************************************************
     A          R PEB01                     PFILE(FTEBPMS)
     A          K EBCO#
     A          K EBDESC
