     A* (c) 2012 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A* FEE SCHEDULE UNIQUE LOGICAL OVER FTEBPCK TABLE FILE
     A*
     A*****************************************************************
     A* Created 06/11/12 by C:251 for project 114MER
     A*****************************************************************
     A*  REVISIONS:
     A*****************************************************************
     A                                      UNIQUE
     A*
     A*  EOMB TYPE CODE
     A          R PEB01                     PFILE(FTEBPCK)
     A          K EBCO#
     A          K EBKEY
