     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2002
     A**
     A** FEE SCHEDULE EOMB DESCRIPTIONS TABLE FILE
     A**
     A*****************************************************************
     A**************************** NOTE *******************************
     A** WHEN ADDING NEW FIELDS TO THIS FILE YOU MUST FIRST INCLUDE  **
     A**             THE FIELDS FROM FILE FTEBPCR                    **
     A*****************************************************************
     A** REVISIONS:
     A**
     A** 05/04/11 C:191 PROJECT: FS389
     A**                ADD NEW FIELDS FOR 3RD AND 4TH DESC LINES
     A**
     A** 01/10/07 C:118 PROJ:CA002
     A**                ADD 2nd CROSS REFERENCE FIELD
     A**
     A*  07/16/02 C:62 PROJECT:114MDC
     A*                ADD CODE REVIEW ACTION FIELDS.
     A*
     A** 05/31/02 C:62 PROJ:114MDC
     A**               ADD EBCRST AND EBCRET.
     A**
     A** 08/28/00 C:62 PROJ:MCMNT
     A**               ADD COMMENT TO EBDSC2.
     A**
     A** 01/06/99 C:79 PROJ:TX009
     A**               1. Add EBXREF to cross reference to state EOMB
     A**                  codes
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PEB01                     TEXT('EOMB DESC TABLE')
     A            EBCO#     R               REFFLD(CO#)
     A            EBKEY     R               REFFLD(KEY)
     A                                      COLHDG('EOB' 'CODE 3-A')
     A            EBDESC    R               REFFLD(DS70)
     A            EBSTAT    R               REFFLD(STAT)
     A            EBUSER    R               REFFLD(USER)
     A            EBPGM     R               REFFLD(PGM)
     A            EBTIME    R               REFFLD(TIME)
     A            EBDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            EBIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            EBIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A            EBOTHR    R               REFFLD(FLAG)
     A                                      COLHDG('OTHER' 'REDUCTIONS' 'TYPE')
     A***                                          Valid Values:  Y/N
     A            EBDSC2    R               REFFLD(DS70)
     A                                      COLHDG('DESCRIPTION TWO')
     A*           Position 1-3 = 2nd cross reference EOMB code.
      *** BEG ADD *** 01/06/99 ****************************************
     A            EBXREF    R               REFFLD(DS3)
     A                                      COLHDG('EOMB CROSS' 'REFERENCE')
      *** END ADD *** 01/06/99 ****************************************
     A*** BEGIN ADD *** 05/31/02 **************************************
     A            EBCRST    R               REFFLD(CODE3)
     A                                      COLHDG('CodeReview' 'Status')
     A*
     A*                 Valid Values:  from Generic table id CRST
     A*
     A            EBCRET    R               REFFLD(DS15)
     A                                      COLHDG('CodeReview' 'Edit Type')
     A*
     A*                 Valid Values:  from Generic table id CRET
     A*
     A*** END   ADD *** 05/31/02 **************************************
     A*** BEGIN ADD *** 07/16/02 **************************************
     A            EBCRCA    R               REFFLD(DS10)
     A                                      COLHDG('CodeReview Current' +
     A                                      'Action')
     A*                          Valid Values:  from Generic table id CRCA
     A            EBCRPF    R               REFFLD(FLAG)
     A                                      COLHDG('CodeReview Pend' +
     A                                      'Flag')
     A*                          Valid Values:  'Y', 'N' or ' '
     A            EBCRHA    R               REFFLD(DS10)
     A                                      COLHDG('CodeReview History' +
     A                                      'Action')
     A*                          Valid Values:  from Generic table id CRHA
     A*** END   ADD *** 07/16/02 **************************************
     A*** BEG ADD *** 01/10/07 ****************************************
     A            EBXRF2    R               REFFLD(DS3)
     A                                      COLHDG('EOMB CROSS' 'REFERENCE')
     A*** END ADD *** 01/10/07 ****************************************
     A*** BEGIN ADD ****** 05/04/11 ************************************
     A            EBDSC3    R               REFFLD(DS70)
     A                                      COLHDG('DESCRIPTION THREE')
     A            EBDSC4    R               REFFLD(DS70)
     A                                      COLHDG('DESCRIPTION FOUR')
     A*** END   ADD ****** 05/04/11 ************************************
