     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1999
     A**
     A** FLORIDA
     A** FEE SCHEDULE UNIQUE LOGICAL OVER FTEBPFL TABLE FILE
     A*
     A                                      UNIQUE
     A*
     A*  EOMB TYPE CODE
     A          R PEB01                     PFILE(FTEBPOH)
     A          K EBCO#
     A          K EBKEY
