     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2007
     A**
     A**
     A** DRG Federal Register Table 5
     A*****************************************************************
     A** CREATED BY: C079  03/14/07  SUPPORT: 57590
     A**
     A*****************************************************************
     A*****************************************************************
     A** REVISIONS:
     A**
     A*****************************************************************
     A*
     A          R PFE01                     PFILE(FTFEPTN)
     A          K FEDESC
