     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1999
     A**
     A** CALIFORNIA
     A*  FACILITY CODE
     A          R PFT01                     PFILE(FTFTPCA)
     A          K FTCO#
     A          K FTSPCD
