     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1996
     A**
     A*  FACILITY CODE
     A          R PFT01                     PFILE(FTFTPSC)
     A          K FTCO#
     A          K FTSPCD
