     A* (c) 2011 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A*  ARKANSAS
     A*  FACILITY CODE
     A*
     A************************************************************************
     A* Created on 10/05/2011 by C:277 for PROJECT: 114MWS
     A*                          Use FxxxxMC instead of FxxxxAR (Xref# 77548)
     A************************************************************************
     A* REVISIONS:
     A************************************************************************
     A*
     A          R PFT01                     PFILE(FTFTPMC)
     A          K FTCO#
     A          K FTSPCD
