     A*****************************************************************
     A* (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**                                                              *
     A** Medicare GPCI Table File                                     *
     A*****************************************************************
     A*  CREATED BY C:227 07/03/09 PROJECT: AR038
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A* 10/01/10  C:198 Project:WV009                                 *
     A*                 Added field for Medicare release level.       *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PGP01                     TEXT('MEDICARE GPCI TABLE FILE')
     A            GPCONT    R               REFFLD(A60)
     A                                      COLHDG('Contractor')
     A            GPST      R               REFFLD(ST)
     A                                      COLHDG('State')
     A            GPLOC     R               REFFLD(A30)
     A                                      COLHDG('Locality')
     A            GPEFDT    R               REFFLD(DT)
     A                                      COLHDG('Effective Date')
     A            GPLNAM    R               REFFLD(DS50)
     A                                      COLHDG('Locality Name')
     A            GPWKGP         6S 3       COLHDG('Work GPCI')
     A            GPPEGP         6S 3       COLHDG('Practice Exp.GPCI')
     A            GPMPGP         6S 3       COLHDG('Malpractice GPCI')
     A            GPSTAT    R               REFFLD(FLAG)
     A                                      COLHDG('Status')
     A            GPPGM     R               REFFLD(PGM)
     A                                      COLHDG('Maint Program')
     A            GPUSER    R               REFFLD(USER)
     A                                      COLHDG('Maint User')
     A            GPDT      R               REFFLD(DT)
     A                                      COLHDG('Maint Date')
     A            GPTIME    R               REFFLD(TIME)
     A                                      COLHDG('Maint Time')
     A            GPIPGM    R               REFFLD(PGM)
     A                                      COLHDG('Initial Program')
     A            GPIUSR    R               REFFLD(USER)
     A                                      COLHDG('Initial User')
     A            GPIDT     R               REFFLD(DT)
     A                                      COLHDG('Initial Date')
     A            GPITIM    R               REFFLD(TIME)
     A                                      COLHDG('Initial Time')
     A*** Beg Add *** 10/01/10 ****************************************
     A            GPMREL    R               REFFLD(FLAG)
     A                                      COLHDG('Medicare Release ' +
     A                                      'Level')
     A*** End Add *** 10/01/10 ****************************************
