     A* (C) 2013 STONERIVER, INC. ALL RIGHTS RESERVED.                *
     A* STONERIVER IS A TRADEMARK OF STONERIVER, INC.                 *
     A*                                                               *
     A* FTLPXRL1 - RATE CODE TO DISCOUNT CODE - LOGICAL               *
    A*****************************************************************
    A** CREATED BY: C284  05/08/13  PROJECT 147MAS                   *
    A*****************************************************************
     A** REVISIONS:                                                   *
     A*                                                               *
     A*****************************************************************
     A          R PXR01                     PFILE(FTLPXR)
     A          K XRRATC
