     A**********************************************************************
     A* (c) 2018 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**********************************************************************
     A*  CREATED :                                                         *
     A*                                                                    *
     A*  06/21/18   C:079   Project: TX101                                 *
     A*                                                                    *
     A**********************************************************************
     A*  REVISION                                                          *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(FSREFP)
     A          R PME01                     TEXT('Medicaid DME File')
     A            MEHCPC         5A
     A            MEMOD1         2A
     A            MEMOD2         2A
     A            MEEFDT    R     S         REFFLD(DT)
     A            MEFEE     R     S         REFFLD(A92)
     A            MESTAT    R               REFFLD(FLAG)
     A            MEPGM     R               REFFLD(PGM)
     A            MEUSER    R               REFFLD(USER)
     A            MEDT      R     S         REFFLD(DT)
     A            METIME    R     S         REFFLD(TIME)
     A            MEIPGM    R               REFFLD(PGM)
     A            MEIUSR    R               REFFLD(USER)
     A            MEIDT     R     S         REFFLD(DT)
     A            MEITIM    R     S         REFFLD(TIME)
