     A** (C) COPYRIGHT FISERV INSURANCE SOLUTIONS, INC. 2008
     A**
     A** TX - HOSPITAL OUTPATIENT PROVIDER IMPACT FILE
     A**
     A****************************************************************
     A**  CREATED:
     A*   04/03/08 C:198  PROJECT: TX039
     A****************************************************************
     A**  REVISIONS:
     A****************************************************************
     A*
     A          R POI01                     PFILE(FTOIP)
     A*
     A          K OIPROV
     A          K OIEFDT
