     A** (C) COPYRIGHT STONERIVER, INC. 2009
     A**
     A** OREGON
     A** WCMC LOGICAL OVER THE BODY PART FILE
     A*****************************************************************
     A* CREATED 09/23/2009 BY C:62 FOR PROJECT 135WNA
     A*****************************************************************
     A*  REVISIONS:
     A*
     A*****************************************************************
     A                                      UNIQUE
     A*
     A*  BODY PART CODE
     A          R PPA01                     PFILE(FTPAPOR)
     A          K PACO#
     A          K PAKEY
