     A* (c) 2011 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A**
     A** P2
     A** FEE Schedule Unique Logical Over FTPAPP2 Table File
     A*
     A*****************************************************************
     A** Created by: C:277  10/06/11  Project: 114MZO
     A*****************************************************************
     A** Revisions:
     A*
     A*
     A*
     A*****************************************************************
     A*
     A                                      UNIQUE
     A*
     A*  BODY PART CODE
     A          R PPA01                     PFILE(FTPAPP2)
     A          K PACO#
     A          K PAKEY
