     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1998
     A**
     A** OKLAHOMA
     A** FEE SCHEDULE UNIQUE LOGICAL OVER FTPMPOK TABLE FILE
     A*
     A                                      UNIQUE
     A*
     A*  MODIFIER CODES
     A          R PPM01                     PFILE(FTPMPOK)
     A          K PMCO#
     A          K PMKEY
