     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2005
     A**
     A** MICHIGAN
     A** FEE SCHEDULE PROCEDURE CODE MODIFIER TABLE FILE
     A*****************************************************************
     A* CREATED:
     A* 01/06/04  C: 79  PROJECT: 135WAA
     A*****************************************************************
     A* REVISIONS
     A*****************************************************************
     A**
     A                                      REF(FSREFP)
     A          R PPM01                     TEXT('PROCED CODE MOD FILE')
     A            PMCO#     R               REFFLD(CO#)
     A            PMKEY     R               REFFLD(KEY)
     A                                      COLHDG('PROC' 'CODE' 'MOD 2/0')
     A            PMDESC    R               REFFLD(DS40)
     A            PMPERC    R               REFFLD(PC52)
     A                                      COLHDG('PROCEDURE' 'MOD' 'PERCENT')
     A            PMSURG    R               REFFLD(FLAG)
     A                                      COLHDG('ASSISTING' 'SURGEON' 'Y/N')
     A            PMPROF    R               REFFLD(FLAG)
     A                                      COLHDG('PROFESS' 'COMPONENT' 'Y/N')
     A            PMSTAT    R               REFFLD(STAT)
     A            PMUSER    R               REFFLD(USER)
     A            PMPGM     R               REFFLD(PGM)
     A            PMTIME    R               REFFLD(TIME)
     A            PMDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            PMIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            PMIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
