     A** (C) COPYRIGHT STONERIVER, INC. 2009
     A**
     A** OREGON
     A** WCMC LOGICAL OVER THE MODIFIER CODE FILE
     A*****************************************************************
     A* CREATED 09/23/2009 BY C:62 FOR PROJECT 135WNA
     A*****************************************************************
     A*  REVISIONS:
     A*
     A*****************************************************************
     A                                      UNIQUE
     A*
     A*  MODIFIER CODES
     A          R PPM01                     PFILE(FTPMPOR)
     A          K PMCO#
     A          K PMKEY
