     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1999
     A**
     A** CALIFORNIA
     A** FEE SCHEDULE UNIQUE LOGICAL OVER FTPMPCA TABLE FILE
     A*
     A                                      UNIQUE
     A*
     A*  MODIFIER CODES
     A          R PPM01                     PFILE(FTPMPCA)
     A          K PMCO#
     A          K PMKEY
