     A** (C) COPYRIGHT PROGRESSIVE DATE SOLUTIONS, INC., 1993
     A**
     A** GEORGIA
     A** FEE SCHEDULE PLACE OF SERVICE FILE
     A**
     A                                      REF(FSREFP)
     A          R PPS01                     TEXT('PLACE OF SERVICE FILE')
     A            PSCO#     R               REFFLD(CO#)
     A            PSKEY     R               REFFLD(KEY)
     A                                      COLHDG('SYSTEM' 'POS CODE')
     A            PSPOS     R               REFFLD(A30)
     A                                      COLHDG('STATE' 'POS CODE')
     A            PSDESC    R               REFFLD(DS40)
     A                                      COLHDG('STATE POS' 'DESCRIPTION')
     A            PS1A1     R               REFFLD(FLAG)
     A                                      COLHDG('1 FLAG 1')
     A            PS1A2     R               REFFLD(FLAG)
     A                                      COLHDG('2 FLAG 1')
     A            PS1A3     R               REFFLD(FLAG)
     A                                      COLHDG('3 FLAG 1')
     A            PS1A4     R               REFFLD(FLAG)
     A                                      COLHDG('4 FLAG 1')
     A            PS1A5     R               REFFLD(FLAG)
     A                                      COLHDG('5 FLAG 1')
     A            PS6N1     R               REFFLD(A60)
     A                                      COLHDG('1 AMOUNT 6.0')
     A            PS6N2     R               REFFLD(A60)
     A                                      COLHDG('2 AMOUNT 6.0')
     A            PS6N3     R               REFFLD(A60)
     A                                      COLHDG('3 AMOUNT 6.0')
     A            PS6N4     R               REFFLD(A60)
     A                                      COLHDG('4 AMOUNT 6.0')
     A            PS6N5     R               REFFLD(A60)
     A                                      COLHDG('5 AMOUNT 6.0')
     A            PS40A1    R               REFFLD(DS40)
     A                                      COLHDG('1 DESC 40')
     A            PSSTAT    R               REFFLD(STAT)
     A            PSUSER    R               REFFLD(USER)
     A            PSPGM     R               REFFLD(PGM)
     A            PSTIME    R               REFFLD(TIME)
     A            PSDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            PSIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            PSIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
