     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1997
     A**
     A** PLACE OF SERVICE LOGICAL
     A*
     A          R PPS01                     PFILE(FTPSPRI)
     A          K PSCO#
     A          K PSDESC
