     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1997
     A**
     A** TYPE OF SERVICE LOGICAL
     A*
     A          R PPS01                     PFILE(FTPSPUC)
     A          K PSCO#
     A          K PSDESC
