     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1995
     A**
     A** FLORIDA: PLACE OF SERVICE CODE UNIQUE LOGICAL
     A*
     A                                      UNIQUE
     A          R PPS01                     PFILE(FTPSPFL)
     A          K PSCO#
     A          K PSPOS
