     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1995
     A**
     A** ALABAMA: PLACE OF SERVICE CODE LOGICAL
     A*
     A          R PPS01                     PFILE(FTPSPAL)
     A          K PSCO#
     A          K PSPOS
