     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1995
     A**
     A** NEW HAMPSHIRE: PLACE OF SERVICE CODE LOGICAL
     A*
     A          R PPS01                     PFILE(FTPSPNH)
     A          K PSCO#
     A          K PSPOS
