     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1995
     A**
     A** TEXAS: PLACE OF SERVICE CODE LOGICAL
     A*
     A          R PPS01                     PFILE(FTPSPTX)
     A          K PSCO#
     A          K PSPOS
