     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1995
     A**
     A** RHODE ISLAND: PLACE OF SERVICE CODE LOGICAL
     A*
     A          R PPS01                     PFILE(FTPSPRI)
     A          K PSCO#
     A          K PSPOS
