     A** (C) COPYRIGHT FISERV INSURANCE SOLUTIONS, INC. 2008
     A**
     A** TEXAS
     A** WCMC LOGICAL OVER THE NON HPSA ZIP CODE FILE
     A*****************************************************************
     A* CREATED 03/31/2008 BY C:198 FOR PROJECT TX040
     A*****************************************************************
     A*  REVISIONS:
     A*****************************************************************
     A                                      ALTSEQ(QSYSTRNTBL)
     A          R PUA01                     PFILE(FTUAPTX)
     A          K UAZIP
     A          K UAEFDT
