     A*****************************************************************
     A*  (C) Copyright Progressive Data Solutions Inc., 1997          *
     A**                                                              *
     A** WCMC EDI 835 ACKNOWLEDGEMENT DETAIL CHARGE ADJUSTMENT FILE   *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*****************************************************************
     A                                      REF(FSREFP)
     A          R PA401                     TEXT('EDI 835 FILE')
     A            A4TYPE         5A         TEXT('TRANSACTION TYPE')
     A            A4ACLC        25A         TEXT('CARRIER CLAIM #')
     A            A4TDT          8A         TEXT('TRANSMISSION DATE')
     A            A4JRST         2A         TEXT('JURISDICTION')
     A            A4FILL         1A         TEXT('FILLER SPACE')
     A            A4EOB#         9A         TEXT('EOMB#')
     A            A4SEQ#         5A         TEXT('LINE ITEM SEQ#')
     A            A4FLL1         5A         TEXT('FILLER SPACE')
     A*
     A            A4UADJ         5A         TEXT('10-LINE ITEM ADJUSTED UNITS')
     A            A4AJAM         9A         TEXT('11-LINE ITEM ADJUSTED AMT')
     A            A4EOMB         3A         TEXT('14-LINE ITEM EOB CODE')
     A            A4AJCD         5A         TEXT('32-LINE ITEM ADJ REASON CODE')
     A            A4STAT         1A         TEXT('   RECORD STATUS')
     A*                  (BLANK = NOT PROCESSED)
     A*                  ('P'   = PROCESSED)
     A            A4TRN#         5  0       TEXT('   TRANSACTION #')
     A*                  (THIS FIELD IS USED TO ATTACH THE LINE ITEM
     A*                   TO A SPECIFIC RECORD IN THIS FILE.  THE KEY
     A*                   TO THIS FILE IS 'EOB#/TRN#/SEQ#/SSQ#')
     A            A4SSQ#         5  0       TEXT('LINE ITEM SUB SEQ#')
