     A** (C) Copyright Progressive Data Systems, INC., 1992
     A**
     A** FEE SCHEDULE CASE LOCK OUT FILE
     A**
     A                                      REF(FSREFP)
     A          R PLO01                     TEXT('CASE LOCK OUT FILE')
     A            LOCO#     R               REFFLD(CO#)
     A            LOFND     R               REFFLD(FND)
     A            LOFYR     R               REFFLD(FYR)
     A            LOCASE    R               REFFLD(CASE)
     A            LOUSER    R               REFFLD(USER)
     A            LOPGM     R               REFFLD(PGM)
     A            LOTIME    R               REFFLD(TIME)
     A            LODT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            LOSS#     R               REFFLD(SS#)
     A            LOACDT    R               REFFLD(DT)
     A                                      COLHDG('ACCIDENT' 'DATE')
     A            LOSUB#    R               REFFLD(SUB#)
     A                                      COLHDG('SUBSCRIBER')
     A*
     A          K LOCO#
     A          K LOSUB#
     A          K LOFND
     A          K LOFYR
     A          K LOCASE
