     A*  (C) Copyright Progressive Data Systems, Inc., 1996
     A**
     A** WCMC EDI 837 PRIMARY EXTRACT FILE                            *
     A*
     A          R PT101                     PFILE(FXT1P)
     A          K T1ACLC
     A          K T1EOB#
     A          K T1EXDT
