     A*  (C) Copyright Progressive Data Systems, Inc., 2003
     A**
     A** EDI EXTRACT WORKFILE
     A*
     A          R PXT01                     PFILE(FXXTP)
     A          K XTCO#
     A          K XTSUB#
     A          K XTFND
