     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*%%TS  SD  19921211  102835  WHERR       REL-V2R1M1  5738-PW1
     A*  91/08/15  08:40:42    KASSI       REL-R03M00  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BKREFP)
     A                                      CHGINPDFT(CS)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      ALTHELP
     A                                      HELP
     A                                      VLDCMDKEY(11)
     A*  91/08/01  10:03:55    KASSI       REL-R03M00  5728-PW1
     A          R SCR01
     A*%%TS  SD  19921211  102835  WHERR       REL-V2R1M1  5738-PW1
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A          H                           HLPDOC('SCRN1' 'GLI091F.F' 'BK.HLP')
     A                                      HLPARA(01 001 24 080)
     A            SCFILE    R        O  1  3REFFLD(FLE)
     A            SCRECF    R        O  1 70REFFLD(RECF)
     A            SCUSER    R        O  2 70REFFLD(USER)
     A                                  4  4'From Company #.:'
     A            SCCO#     R     Y  B  4 21REFFLD(CO#)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  21                                  ERRMSGID(BKM0151 *LIBL/BKMES)
     A                                 23  2'F1=Help'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 12'F3=Exit'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 22'F5=Search chart'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                  6  4'To Company #...:'
     A            S2CO#     R     Y  B  6 21REFFLD(CO#)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                  1 27'Duplicate Company Chart'
     A                                      DSPATR(HI)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
