     A*%%TS  SD  20000427  151840  ROGULSKI    REL-V4R4M0  5769-PW1
     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*  SD  19911018  161019  WDILLARD    REL-V2R1M0  5738-PW1
     A*
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/WREFP)
     A                                      CHGINPDFT(UL)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A*            08:25:34    LJQ01       REL-R08M00  5714-UT1
     A*  SD  19911018  161019  WDILLARD    REL-V2R1M0  5738-PW1
     A          R SCR01
     A*%%TS  SD  20000427  151840  ROGULSKI    REL-V4R4M0  5769-PW1
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      SETOF(25)
     A                                      SETOF(26)
     A                                      SETOF(27)
     A                                      SETOF(28)
     A                                      SETOF(29)
     A                                      SETOF(30)
     A                                      SETOF(31)
     A                                      SETOF(32)
     A                                      SETOF(33)
     A                                      SETOF(71)
     A                                      CF13
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      PUTOVR
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2'GLINTF'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  5  2'Fund:'
     A            SCFND     R        O  5 10REFFLD(FND)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A            SCNAME    R        O  5 21REFFLD(NM60)
     A                                      DSPATR(HI)
     A                                      TEXT('FUND NAME')
     A                                  7 21'From Date:'
     A            SCFRDT    R        B  7 44REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A  20                                  ERRMSGID(WCR0500 *LIBL/WMESGG)
     A  32                                  ERRMSGID(WCR0908 *LIBL/WMESGG)
     A  33                                  ERRMSGID(WCR0907 *LIBL/WMESGG)
     A                                      CHECK(RB)
     A                                  8 21'To Date:'
     A            SCTODT    R        B  8 44REFFLD(DT8)
     A                                      EDTWRD('  /  /    ')
     A  21                                  ERRMSGID(WCR0500 *LIBL/WMESGG)
     A  32                                  ERRMSGID(WCR0908 *LIBL/WMESGG)
     A  33                                  ERRMSGID(WCR0907 *LIBL/WMESGG)
     A                                      CHECK(RB)
     A                                  9 21'Accounting Month:'
     A            SCACMT    R        B  9 39REFFLD(DISC)
     A                                      RANGE(1 12)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  71                                  ERRMSGID(BKM0105 *LIBL/BKMES)
     A                                  9 44'Year:'
     A            SCACYR         4Y 0B  9 50EDTCDE(4)
     A                                      CHECK(RB)
     A                                      TEXT('Year')
     A  71                                  ERRMSGID(BKM0105 *LIBL/BKMES)
     A                                 11 21'Batch ID:'
     A            SCBAT     R        B 11 44REFFLD(PREF01/WCBTCH *LIBL/WREFP)
     A  31                                  ERRMSGID(WCR0903 *LIBL/WMESGG)
     A                                 12 21'Batch Source Code:'
     A            SCSOU     R        B 12 44REFFLD(PREF01/WCSRC *LIBL/WREFP)
     A  30                                  ERRMSGID(WCR0902 *LIBL/WMESGG)
     A                                 14  9'Only ONE of the following transact-
     A                                      ions can be chosen at a time.'
     A                                 15 12'Place a Y next to the transaction -
     A                                      of your choice.'
     A                                 17 21'Agent Transactions:'
     A            SCCSFL    R        B 17 44REFFLD(FLAG WREFP)
     A  22                                  ERRMSGID(WCR0571 *LIBL/WMESGG)
     A                                 18 21'A/R Transactions:'
     A            SCTTFL    R        B 18 44REFFLD(FLAG WREFP)
     A  23                                  ERRMSGID(WCR0571 *LIBL/WMESGG)
     A  26                                  ERRMSGID(WCR0894 *LIBL/WMESGG)
     A                                 19 21'Claim Transactions:'
     A            SCPCFL    R        B 19 44REFFLD(FLAG WREFP)
     A  24                                  ERRMSGID(WCR0571 *LIBL/WMESGG)
     A  27                                  ERRMSGID(WCR0894 *LIBL/WMESGG)
     A                                 20 21'Reserve Transactions:'
     A            SCRTFL    R        B 20 44REFFLD(FLAG WREFP)
     A  25                                  ERRMSGID(WCR0571 *LIBL/WMESGG)
     A  28                                  ERRMSGID(WCR0894 *LIBL/WMESGG)
     A  29                                  ERRMSGID(WCR0895 *LIBL/WMESGG)
     A                                 22 14'F3=Exit      '
     A                                      COLOR(BLU)
     A                                 22 40'F13=Change user parms'
     A                                      COLOR(BLU)
     A                                 23  2'F5=Search prev. moves'
     A                                      COLOR(BLU)
     A                                 23 29'F6=Search batch id'
     A                                      COLOR(BLU)
     A                                 23 57'F7=Search source codes'
     A                                      COLOR(BLU)
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
