     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A**
     A** GENERAL LEDGER SRC CODE FILE.
     A**
     A* * * SRC CODE FILE * * *
     A*
     A                                      REF(BKREFP)
     A          R PSR01                     TEXT('SRC CODE RECORD')
     A            SRTBL     R               REFFLD(TBL)
     A            SRVAL     R               REFFLD(VAL)
     A            SRDESC    R               REFFLD(DS30)
     A            SRALPH    R               REFFLD(DS10)
     A******
     A            SRIPGM    R               REFFLD(PGM)
     A            SRCTIM    R               REFFLD(TIME)
     A            SRCDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            SRCUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CHANGED BY')
     A            SRIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A            SRITIM    R               REFFLD(TIME)
     A            SRIDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            SRSTAT    R               REFFLD(FLAG)
     A                                      COLHDG('STATUS')
