     A*  (C) Copyright ,1993
     A**
     A** BACK OFFICE USER AUTHORIZATION FILE.
     A**
     A* * * USER AUTHORIZATION FILE * * *
     A*
     A                                      REF(BKREFP)
     A          R PUA01                     TEXT('USER AUTHORIZATION')
     A            UAUSER    R               REFFLD(USER)
     A            UASEQ#    R               REFFLD(SEQ#)
     A            UADEPT    R               REFFLD(DEPT)
     A            UAJOB     R               REFFLD(JOB#)
     A******
     A            UAIPGM    R               REFFLD(PGM)
     A            UACTIM    R               REFFLD(TIME)
     A            UACDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            UACUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CHANGED BY')
     A            UAIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A            UAITIM    R               REFFLD(TIME)
     A            UAIDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            UASTAT    R               REFFLD(FLAG)
     A                                      COLHDG('STATUS')
     A          K UAUSER
     A          K UASEQ#
     A          K UADEPT
     A          K UAJOB
