     A                                      REF(*LIBL/IMOCP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  09                                  CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    22 RERRMSG    2    C6  -
     A                                        SCOUTCC31   Invalid Output Class -
     A                                      specified.E1    3     20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-22"},"items":[{"-
     A                                      id":"I0015F_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"I0015F_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"I-
     A                                      0015F_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/systools.png","data functio-
     A                                      n":"SystemToolbarSystools","show do-
     A                                      wn arrow":"Yes"},{"field type":"pan-
     A                                      el","panel style":"TransformButtonB-
     A                                      ar","id":"I0015F_SCR01_ButtonBar","-
     A                                      top":"35px","left":"1036px","width"-
     A                                      :"187px","height":"28px","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      ","locked in place":"true"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1040px","id":"I0015F-
     A                                      _SCR01_BtnSave","tool tip":"Save","-
     A                                      onclick":"SystemToolbarSave","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/save.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "I0015F_SCR01_BtnRefresh","tool tip-
     A                                      ":"Refresh","onclick":"SystemToolba-
     A                                      rRefresh","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/refresh.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1092px","id":"I0015F_SCR01_Bt-
     A                                      nSearch","tool tip":"Search","oncli-
     A                                      ck":"SystemToolbarSearch","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/search.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1118px","id":"-
     A                                      I0015F_SCR01_BtnDiaryItems","tool t-
     A                                      ip":"Diary/Work Items - IDARTS","on-
     A                                      click":"SystemToolbarDiary","backgr-
     A                                      ound image":{"fieldName":"DryIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1144px","id":"I0015-
     A                                      F_SCR01_BtnSystemMessages","tool ti-
     A                                      p":"System Messages","onclick":"Sys-
     A                                      temToolbarMessages","background ima-
     A                                      ge":{"fieldName":"MsgIcnUR')
     A                                  1  4HTML('L","dataLength":"128","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"}}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1196px","id"-
     A                                      :"I0015F_SCR01_BtnHelp","tool tip":-
     A                                      "Help","onclick":"SystemToolbarHelp-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/help.p-
     A                                      ng'')"},{"id":"I0015F_SCR01_ImgSysT-
     A                                      oolBottom","field type":"image","im-
     A                                      age source":"/profoundui/userdata/i-
     A                                      mages/systool/butbarbot.png","left"-
     A                                      :"1036px","top":"64px","width":"187-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"stationary","visibility":"hi-
     A                                      dden"},{"id":"I0015F_SCR01_MainTabP-
     A                                      anel","field type":"tab panel","tab-
     A                                       panel style":"Transform","tab name-
     A                                      s":{"fieldName":"SCPRDS","dataLengt-
     A                                      h":"40","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"I00-
     A                                      15F_SCR01_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCFILE"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCFILE","designValu-
     A                                      e":"[SCFILE]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none","dataLength":"10"},"-
     A                                      css class":"output-field","left":"2-
     A                                      81px","cursor column":"2","top":"11-
     A                                      0px","cursor row":"1","css class 2"-
     A                                      :"top-line","description":"FILE NAM-
     A                                      E","parent tab panel":"I0015F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant1","field type":"outpu-
     A                                      t field","value":"Output Class Prof-
     A                                      ile","css class":"constant","left":-
     A                                      "456px","cursor column":"27","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                       2":"top-line","css class 3":"HI","-
     A                                      parent tab panel":"I0015F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"id":-
     A                                      "SCRECF","field type":"output field-
     A                                      ","value":{"fieldName":"SCRECF","de-
     A                                      signValue":"[SCRECF]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"10"},"css class":"output-field","-
     A                                      left":"764px","cursor column":"71",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class 2":"top-line","description":-
     A                                      "RECORD FORMAT NAME","parent tab pa-
     A                                      nel":"I0015F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"I0015F_SCR01-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"I0015F_SCR01_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"I0015F_SCR01_BtnHiddenSearch","va-
     A                                      lue":"btnSearch","top":"150px","res-
     A                                      ponse":{"fieldName":"btnSearch","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"I0015F_SCR01_Bt-
     A                                      nHiddenDiaryItems","value":"btnDiar-
     A                                      y","top":"175px","response":{"field-
     A                                      Name":"btnDiary","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant2",-
     A                                      "field type":"output field","value"-
     A                                      :"Type information, press Enter.","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"190px"-
     A                                      ,"cursor row":"5","parent tab panel-
     A                                      ":"I0015F_SCR01_MainTabPan')
     A                                  1  5HTML('el","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"I0015F_SCR01_BtnHid-
     A                                      denSystemMessages","value":"btnMess-
     A                                      age","top":"200px","response":{"fie-
     A                                      ldName":"btnMessage","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"I0015F_SCR01_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant3","fi-
     A                                      eld type":"output field","value":"O-
     A                                      utput class            :","css clas-
     A                                      s":"constant","left":"295px","curso-
     A                                      r column":"4","top":"230px","cursor-
     A                                       row":"7","parent tab panel":"I0015-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCOUTC","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCOUTC","designValue":"[SCOUTC]-
     A                                      ","refField":"OCOUTC","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      491px","cursor column":"32","top":"-
     A                                      230px","cursor row":"7","width":"15-
     A                                      px","css class 3":"UL","css class 4-
     A                                      ":"HI","error message":"Invalid Out-
     A                                      put Class specified.","error condit-
     A                                      ion":{"fieldName":"20","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","parent tab panel"-
     A                                      :"I0015F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 5":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      I0015F_SCR01_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"I0-
     A                                      015F_SCR01_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"I0015F_SCR01_Bt-
     A                                      nHiddenHelp","value":"btnHelp","top-
     A                                      ":"300px","response":{"fieldName":"-
     A                                      btnHelp","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant4","field t-
     A                                      ype":"output field","value":" ","cs-
     A                                      s class":"constant","visibility":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "365px","cursor column":"14","top":-
     A                                      "530px","cursor row":"22","css clas-
     A                                      s 2":"BLU","parent tab panel":"I001-
     A                                      5F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF03","field type":"button"-
     A                                      ,"value":"Exit","shortcut key":"F3"-
     A                                      ,"left":"14px","top":"183px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF10",-
     A                                      "field type":"button","visibility":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"valu-
     A                                      e":"Search","shortcut key":"F10","l-
     A                                      eft":"14px","top":"216px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnHELP","fi-
     A                                      eld type":"button","shortcut key":"-
     A                                      Alt-F1","bypass validation":"true",-
     A                                      "value":"HELP","response":{"fieldNa-
     A                                      me":"*IN10","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"249-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFILE        10A  H
     A            SCPRDS        40A  H
     A            SCRECF        10A  H
     A            SCOUTC    R        H      REFFLD(OCOUTC)
     A          R SCR02
     A  10 11 20
     A  21 22 23
     A  24 09 64                            CA01(10 'Response Indicator *IN10')
     A  40                                  CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                  1  2HTML('QPUIREC7    RROWS      2    C-
     A                                      1    1C2    23 RERRMSG    2    C6  -
     A                                        SCDESCC28   Description must be e-
     A                                      ntered.E1    3     20RERRMSG    2  -
     A                                        C6    SCACTNC26   Action must be -
     A                                      "H" or "T".E1    3     21RERRMSG   -
     A                                       2    C6    SCFTIMC21   Invalid tim-
     A                                      e entered.E1    3     22RERRMSG    -
     A                                      2    C6    SCFTIMC42   From & To Ti-
     A                                      me must be in ascending order.E1   -
     A                                       3     24RERRMSG    2    C6    SCTT-
     A                                      IMC21   Invalid time entered.E1    -
     A                                      3     23RERRMSG    2    C6    SCTTI-
     A                                      MC42   From & To Time must be in as-
     A                                      cending order.E1    3     24')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"valid command ke-
     A                                      y":{"fieldName":"*IN11","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"overlay ran-
     A                                      ge":"1-23"},"items":[{"id":"I0015F_-
     A                                      SCR02_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"I0015F_SCR02_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"I0015F_SCR02_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"I0-
     A                                      015F_SCR02_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"I0015F_SCR02_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1066px","id":"I0015F_SCR0-
     A                                      2_BtnRefresh","tool tip":"Refresh",-
     A                                      "onclick":"SystemToolbarRefresh","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/refresh.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1092px-
     A                                      ","id":"I0015F_SCR02_BtnSearch","to-
     A                                      ol tip":"Search","onclick":"SystemT-
     A                                      oolbarSearch","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/search.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1118px","id":"I0015F_SCR02-
     A                                      _BtnDiaryItems","tool tip":"Diary/W-
     A                                      ork Items - IDARTS","onclick":"Syst-
     A                                      emToolbarDiary","background image":-
     A                                      {"fieldName":"DryIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px",')
     A                                  1  4HTML('"top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"I0-
     A                                      015F_SCR02_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"I0015F_SCR-
     A                                      02_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/help.png'')"},{"id-
     A                                      ":"I0015F_SCR02_ImgSysToolBottom","-
     A                                      field type":"image","image source":-
     A                                      "/profoundui/userdata/images/systoo-
     A                                      l/butbarbot.png","left":"1036px","t-
     A                                      op":"64px","width":"187px","locked -
     A                                      in place":"true","css class":"stati-
     A                                      onary","visibility":"hidden"},{"id"-
     A                                      :"I0015F_SCR02_MainTabPanel","field-
     A                                       type":"tab panel","tab panel style-
     A                                      ":"Transform","tab names":{"fieldNa-
     A                                      me":"SCPRDS","dataLength":"40","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "},"active tab":"0","left":"250px",-
     A                                      "top":"70px","width":"970px","heigh-
     A                                      t":"657px","z index":"8","locked in-
     A                                       place":"true","css class":"tab-pan-
     A                                      el","css class 2":"stationary"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"I0015F_SCR02_Bt-
     A                                      nHiddenSave","value":"btnSave","top-
     A                                      ":"100px","response":{"fieldName":"-
     A                                      btnSave","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"SCR02_SCFILE","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCFILE","designValue":"[S-
     A                                      CFILE]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"10"},"css cl-
     A                                      ass":"output-field","left":"288px",-
     A                                      "cursor column":"3","top":"110px","-
     A                                      cursor row":"1","css class 2":"top--
     A                                      line","description":"FILE NAME","pa-
     A                                      rent tab panel":"I0015F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant5","field type":"output fiel-
     A                                      d","value":"Output Class Profile","-
     A                                      css class":"constant","left":"477px-
     A                                      ","cursor column":"30","top":"110px-
     A                                      ","cursor row":"1","css class 2":"t-
     A                                      op-line","css class 3":"HI","parent-
     A                                       tab panel":"I0015F_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 4"-
     A                                      :"profound-converted"},{"id":"SCR02-
     A                                      _SCRECF","field type":"output field-
     A                                      ","value":{"fieldName":"SCRECF","de-
     A                                      signValue":"[SCRECF]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"false",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"10"},"css class":"output-field","-
     A                                      left":"764px","cursor column":"71",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class 2":"top-line","description":-
     A                                      "RECORD FORMAT NAME","parent tab pa-
     A                                      nel":"I0015F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"I0015F_SCR02-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"I0015F_SCR02_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"SCMODE","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCMODE","designValue":"[SC-
     A                                      MODE]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"10"},"css cla-
     A                                      ss":"output-field","visibility":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      764px","cursor column":"71","top":"-
     A                                      150px","cursor row":"3","css class -
     A                                      2":"HI","description":"ADD')
     A                                  1  5HTML('/UPDATE MODE","parent tab pan-
     A                                      el":"I0015F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"I0015F_SCR02_BtnHiddenSearch","v-
     A                                      alue":"btnSearch","top":"150px","re-
     A                                      sponse":{"fieldName":"btnSearch","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"I0015F_SCR02_B-
     A                                      tnHiddenDiaryItems","value":"btnDia-
     A                                      ry","top":"175px","response":{"fiel-
     A                                      dName":"btnDiary","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant7"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Type information, press Enter.",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"190px-
     A                                      ","cursor row":"5","parent tab pane-
     A                                      l":"I0015F_SCR02_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant6","fi-
     A                                      eld type":"output field","value":"S-
     A                                      tatus:","css class":"constant","lef-
     A                                      t":"771px","cursor column":"72","to-
     A                                      p":"190px","cursor row":"5","parent-
     A                                       tab panel":"I0015F_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCSTA-
     A                                      T","field type":"output field","val-
     A                                      ue":{"fieldName":"SCSTAT","designVa-
     A                                      lue":"[SCSTAT]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"1"},-
     A                                      "css class":"output-field","left":"-
     A                                      827px","cursor column":"80","top":"-
     A                                      190px","cursor row":"5","descriptio-
     A                                      n":"Status","parent tab panel":"I00-
     A                                      15F_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"I0015-
     A                                      F_SCR02_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"I0015F_SCR02-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant8","field type":"output fie-
     A                                      ld","value":"Output class          -
     A                                        :","css class":"constant","left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      230px","cursor row":"7","parent tab-
     A                                       panel":"I0015F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCR02_SCO-
     A                                      UTC","field type":"output field","v-
     A                                      alue":{"fieldName":"SCOUTC","design-
     A                                      Value":"[SCOUTC]","refField":"OCOUT-
     A                                      C","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"477px","cursor column":"3-
     A                                      0","top":"230px","cursor row":"7","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"I0015F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant9","fie-
     A                                      ld type":"output field","value":"De-
     A                                      scription             :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"250px","cursor -
     A                                      row":"8","parent tab panel":"I0015F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCDESC","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCDESC","designValue":"[SCDESC]"-
     A                                      ,"refField":"OCDESC","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"4-
     A                                      77px","cursor column":"30","top":"2-
     A                                      50px","cursor row":"8","width":"281-
     A                                      px","read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"error message":"D-
     A                                      escription must be entered.","error-
     A                                       condition":{"fieldName":"20","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"1 message","parent tab-
     A                                       panel":"I0015F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 5":"pr-
     A                                      ofound-converted"},{"field')
     A                                  1  6HTML(' type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"I0015F_SCR02_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant10","field type":"outpu-
     A                                      t field","value":"Transmission cons-
     A                                      traints:","css class":"constant","l-
     A                                      eft":"295px","cursor column":"4","t-
     A                                      op":"270px","cursor row":"9","paren-
     A                                      t tab panel":"I0015F_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"I0015F_SCR02_BtnHiddenI-
     A                                      mageQueue","value":"btnImgQue","top-
     A                                      ":"275px","response":{"fieldName":"-
     A                                      btnImgQue","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant11","fiel-
     A                                      d type":"output field","value":"Act-
     A                                      ion                  :","css class"-
     A                                      :"constant","left":"295px","cursor -
     A                                      column":"6","top":"290px","cursor r-
     A                                      ow":"10","parent tab panel":"I0015F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d","width":"175px"},{"id":"SCACTN",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCACTN","designV-
     A                                      alue":"[SCACTN]","refField":"OCACTN-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase"},"text transform":"uppe-
     A                                      rcase","left":"477px","cursor colum-
     A                                      n":"30","top":"290px","cursor row":-
     A                                      "10","width":"8px","css class 3":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 4":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"er-
     A                                      ror message":"Action must be \"H\" -
     A                                      or \"T\".","error condition":{"fiel-
     A                                      dName":"21","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"I0015F_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 5":"profound-converted"}-
     A                                      ,{"id":"constant12","field type":"o-
     A                                      utput field","value":"H=Hold, T=Tra-
     A                                      nsmit","css class":"constant","left-
     A                                      ":"512px","cursor column":"35","top-
     A                                      ":"290px","cursor row":"10","parent-
     A                                       tab panel":"I0015F_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"I0015F_SCR02_BtnHiddenHe-
     A                                      lp","value":"btnHelp","top":"300px"-
     A                                      ,"response":{"fieldName":"btnHelp",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant13","field type":"ou-
     A                                      tput field","value":"From time     -
     A                                                :","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"6"-
     A                                      ,"top":"310px","cursor row":"11","p-
     A                                      arent tab panel":"I0015F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted","width":-
     A                                      "175px"},{"id":"SCFTIM","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCFTIM","designValue":"[SCF-
     A                                      TIM]","refField":"OCFTIM","dataType-
     A                                      ":"reference","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"-999.00","num-
     A                                      BlankFill":"true","edtWrd":"''  :  -
     A                                      :  ''"},"left":"477px","cursor colu-
     A                                      mn":"30","top":"310px","cursor row"-
     A                                      :"11","width":"57px","text align":"-
     A                                      right","css class 3":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"error message"-
     A                                      :"Invalid time entered.","error con-
     A                                      dition":{"fieldName":"22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       2":"From & To Time must be in asce-
     A                                      nding order.","error condition 2":{-
     A                                      "fieldName":"24","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"parent tab panel"-
     A                                      :"I0015F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 5":"profound--
     A                                      converted"},{"id":"constan')
     A                                  1  7HTML('t14","field type":"output fie-
     A                                      ld","value":"To time               -
     A                                        :","css class":"constant","left":-
     A                                      "295px","cursor column":"6","top":"-
     A                                      330px","cursor row":"12","parent ta-
     A                                      b panel":"I0015F_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted","width":"175px"}-
     A                                      ,{"id":"SCTTIM","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCTTIM","designValue":"[SCTTIM]","r-
     A                                      efField":"OCTTIM","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"-999.00","numBlankFil-
     A                                      l":"true","edtWrd":"''  :  :  ''"},-
     A                                      "left":"477px","cursor column":"30"-
     A                                      ,"top":"330px","cursor row":"12","w-
     A                                      idth":"57px","text align":"right","-
     A                                      css class 3":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 4":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"error message":"Invali-
     A                                      d time entered.","error condition":-
     A                                      {"fieldName":"23","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "2 messages","error message 2":"Fro-
     A                                      m & To Time must be in ascending or-
     A                                      der.","error condition 2":{"fieldNa-
     A                                      me":"24","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"I0015F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 5":"profound-converte-
     A                                      d"},{"id":"SCCMDD","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CCMDD","designValue":"[SCCMDD]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none","d-
     A                                      ataLength":"10"},"css class":"outpu-
     A                                      t-field","left":"743px","cursor col-
     A                                      umn":"68","top":"550px","cursor row-
     A                                      ":"23","description":"F23=DELETE","-
     A                                      parent tab panel":"I0015F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "btnSubmit","field type":"button","-
     A                                      value":"Enter","shortcut key":"Ente-
     A                                      r","left":"14px","top":"150px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF03-
     A                                      ","field type":"button","value":"Ex-
     A                                      it","shortcut key":"F3","left":"14p-
     A                                      x","top":"183px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF12","field type"-
     A                                      :"button","value":"Cancel  ","short-
     A                                      cut key":"F12","left":"14px","top":-
     A                                      "216px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF20","field type":"button"-
     A                                      ,"visibility":{"fieldName":"N09 and-
     A                                       N40","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"value":"Change st-
     A                                      atus","shortcut key":"F20","left":"-
     A                                      14px","top":"249px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnCF23","field ty-
     A                                      pe":"button","visibility":{"fieldNa-
     A                                      me":"64","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"value":"F23","-
     A                                      shortcut key":"F23","left":"14px","-
     A                                      top":"282px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnHELP","field type":"bu-
     A                                      tton","shortcut key":"Alt-F1","bypa-
     A                                      ss validation":"true","value":"HELP-
     A                                      ","response":{"fieldName":"*IN10","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"l-
     A                                      eft":"14px","top":"315px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCCMDD        10A  H
     A            SCFILE        10A  H
     A            SCMODE        10A  H
     A            SCPRDS        40A  H
     A            SCRECF        10A  H
     A            SCSTAT         1A  H
     A            SCACTN    R        H      REFFLD(OCACTN)
     A            SCDESC    R        H      REFFLD(OCDESC)
     A            SCFTIM    R        H      REFFLD(OCFTIM)
     A            SCOUTC    R        H      REFFLD(OCOUTC)
     A            SCTTIM    R        H      REFFLD(OCTTIM)
     A          R SCR99
     A  10 11                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"I0015F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"I0015F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"I0015F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n source":"/profoundui/userdata/ima-
     A                                      ges/systool/systools.png","data fun-
     A                                      ction":"SystemToolbarSystools","sho-
     A                                      w down arrow":"Yes"},{"field type":-
     A                                      "panel","panel style":"TransformBut-
     A                                      tonBar","id":"I0015F_SCR99_ButtonBa-
     A                                      r","top":"35px","left":"1036px","wi-
     A                                      dth":"187px","height":"28px","css c-
     A                                      lass":"stationary","visibility":"hi-
     A                                      dden","locked in place":"true"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1040px","id":"I0-
     A                                      015F_SCR99_BtnSave","tool tip":"Sav-
     A                                      e","onclick":"SystemToolbarSave","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/save.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1066px","-
     A                                      id":"I0015F_SCR99_BtnRefresh","tool-
     A                                       tip":"Refresh","onclick":"SystemTo-
     A                                      olbarRefresh","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/refresh.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1092px","id":"I0015F_SCR9-
     A                                      9_BtnSearch","tool tip":"Search","o-
     A                                      nclick":"SystemToolbarSearch","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/search.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1118px","i-
     A                                      d":"I0015F_SCR99_BtnDiaryItems","to-
     A                                      ol tip":"Diary/Work Items - IDARTS"-
     A                                      ,"onclick":"SystemToolbarDiary","ba-
     A                                      ckground image":{"fieldName":"DryIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1144px","id":"I-
     A                                      0015F_SCR99_BtnSystemMessages","too-
     A                                      l tip":"System Messages","onclick":-
     A                                      "SystemToolbarMessages","background-
     A                                       image":{"fieldName":"MsgIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"f')
     A                                  1  4HTML('alse","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"I0015F_SCR99_BtnHelp","tool t-
     A                                      ip":"Help","onclick":"SystemToolbar-
     A                                      Help","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/he-
     A                                      lp.png'')"},{"id":"I0015F_SCR99_Img-
     A                                      SysToolBottom","field type":"image"-
     A                                      ,"image source":"/profoundui/userda-
     A                                      ta/images/systool/butbarbot.png","l-
     A                                      eft":"1036px","top":"64px","width":-
     A                                      "187px","locked in place":"true","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden"},{"id":"I0015F_SCR99_Main-
     A                                      TabPanel","field type":"tab panel",-
     A                                      "tab panel style":"Transform","tab -
     A                                      names":"Tab 1","active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"I00-
     A                                      15F_SCR99_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"I0015F_-
     A                                      SCR99_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"I0015F_SCR99_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCERR","f-
     A                                      ield type":"password field","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","input only":"true","value":{"fie-
     A                                      ldName":"SCERR","designValue":"[SCE-
     A                                      RR]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"1"},"text t-
     A                                      ransform":"uppercase","left":"288px-
     A                                      ","cursor column":"3","top":"150px"-
     A                                      ,"cursor row":"3","width":"8px","re-
     A                                      ad only":"true","css class 3":"PR-U-
     A                                      L","description":"ERROR DUMMY FIELD-
     A                                      ","parent tab panel":"I0015F_SCR99_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"I0015F_SCR99_Bt-
     A                                      nHiddenSearch","value":"btnSearch",-
     A                                      "top":"150px","response":{"fieldNam-
     A                                      e":"btnSearch","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"I0015F_SCR99_BtnHiddenDiaryItems-
     A                                      ","value":"btnDiary","top":"175px",-
     A                                      "response":{"fieldName":"btnDiary",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"I0015F_SCR99-
     A                                      _BtnHiddenSystemMessages","value":"-
     A                                      btnMessage","top":"200px","response-
     A                                      ":{"fieldName":"btnMessage","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"I0015F_SCR99_BtnHid-
     A                                      denWorkSubmitJob","value":"btnWrksb-
     A                                      mjob","top":"225px","response":{"fi-
     A                                      eldName":"btnWrkJob","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"I0015F_SCR99_BtnHiddenWork-
     A                                      PrinterOutput","value":"btnWrkprtou-
     A                                      t","top":"250px","response":{"field-
     A                                      Name":"btnWrkPrnt","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility"')
     A                                  1  5HTML(':"hidden","id":"I0015F_SCR99_-
     A                                      BtnHiddenImageQueue","value":"btnIm-
     A                                      gQue","top":"275px","response":{"fi-
     A                                      eldName":"btnImgQue","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"I0015F_SCR99_BtnHiddenHelp-
     A                                      ","value":"btnHelp","top":"300px","-
     A                                      response":{"fieldName":"btnHelp","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"btnSubmit","field type":"butto-
     A                                      n","value":"Enter","shortcut key":"-
     A                                      Enter","left":"14px","top":"150px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF03","field type":"button","value"-
     A                                      :"Exit","shortcut key":"F3","left":-
     A                                      "14px","top":"183px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnHELP","field t-
     A                                      ype":"button","shortcut key":"Alt-F-
     A                                      1","bypass validation":"true","valu-
     A                                      e":"HELP","response":{"fieldName":"-
     A                                      *IN10","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"left":"14px","top":"216px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR          1A  H
