     A*  (C) Copyright INFINITY SOFTWARE SYSTEMS, INC. 1998
     A**
     A* * * FOR DISPLAY OF USER PROFILES  ***
     A*
     A          R QLIDOBJD                  PFILE(IAUSP)
     A          K ODOBNM
