     A*  (C) Copyright INFINTIY SOFTWARE SYSTEMS, INC.,  1997
     A**
     A** BATCH NOTES      ****
     A**
     A* * * BATCH NOTES FILE      * * *
     A*
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A          R PBN01                     TEXT('BATCH NOTES RCD')
     A            BNBCHI        12          TEXT('BATCH ID')
     A            BNCM75        75          TEXT('BATCH NOTE DATA')
     A            BNASQ#         5  0       TEXT('NOTE SEQUENCE NUMBER')
     A            BNCDAT         8  0       COLHDG('NOTE DATE')
     A            BNPNAM        10
     A                                      COLHDG('PGM THAT' 'WROTE IT')
     A            BNTRDT         8  0       TEXT('TRANS DATE')
     A            BNTRTM         6  0
     A                                      COLHDG('TRANS' 'TIME')
     A            BNSECL         3  0
     A                                      COLHDG('SECURITY' 'LEVEL')
     A            BNSBYL         1
     A                                      COLHDG('SECURE' 'BY' 'LEVEL-Y/N')
     A*
     A            BNPRFL         1          COLHDG('PROTECT' 'FLAG')
     A*** THIS FLAG ALSO USED TO SPECIFY A SYSTEM GENERATED RMRK, BY TYPE
     A***   FOR EXAMPLE AN "H" IN THIS FLD COULD REPRESENT SYS GEN'D HISTORY
     A***   RCDS FOR A BATCH HISTORY.  ANY NON-BLANK HERE MEANS (NO MODS
     A***   ALLOWED ON THIS RECORD!!!!).
     A*
     A***** LAST MAINT INFO  *****
     A            BNSTAT         1          COLHDG('RCD STATUS')
     A*
     A            BNIUSR        10          TEXT('INIT USER')
     A            BNIPGM        10          TEXT('INIT PGM')
     A            BNITIM         6S 0       TEXT('INIT TIME')
     A            BNIDT          6S 0       TEXT('INIT DATE')
     A            BNLUSR        10          TEXT('USER LAST MAINT')
     A            BNLPGM        10          TEXT('LAST MAINT PGM')
     A            BNLTIM         6S 0       TEXT('LAST MAINT TIME')
     A            BNLDT          6S 0       TEXT('LAST MAINT DATE')
     A*
     A            BNFL01         1          TEXT('**FUTURE USE FLG 01 **')
     A            BNFL02         1          TEXT('**FUTURE USE FLG 02 **')
     A            BNFL03         1          TEXT('**FUTURE USE FLG 03 **')
     A            BNFL04         1          TEXT('**FUTURE USE FLG 04 **')
     A            BNFL05         1          TEXT('**FUTURE USE FLG 05 **')
     A            BNCHR5         5          TEXT('**FUTURE USE A5  01 **')
     A*
     A*
