     A*  (C) Copyright INFINITY SOFTWARE SYSTEMS, INC. 1997
     A**
     A** DOCUMENT    NOTES ****
     A**
     A* * * DOC   IMAGE NOTES  FILE * * * (SORT = ENTERED ORDER)
     A*
     A          R PDN01                     PFILE(IMDNP)
     A          K DNDCID
     A          K DNASQ#
     A          S DNSTAT                    COMP(NE 'I')
