     A*  (C) Copyright INFINITY SOFTWARE SYSTEMS, INC., 2003
     A*
     A* DOC NOTES FILE
     A*
     A*****************************************************************
     A* CREATED ON 11/20/2003 BY C:62 FOR PROJECT 114IGG
     A*****************************************************************
     A* REVISIONS:
     A*
     A*****************************************************************
     A*
     A          R PDN01                     PFILE(IMDNP)
     A          K DNDCID
     A          K DNIUSR
     A          S DNSTAT                    COMP(NE 'I')
