     A*  (C) Copyright INFINITY SOFTWARE SYSTEMS, INC., 1997
     A**
     A** INDEX QUEUE LGL FILE -  DOC ID , NOT YET INDEXED
     A**
     A          R PIE01                     PFILE(IMIEP)
     A          K IEDCID
     A          S IESTAT                    COMP(NE 'D')
