     A* (C)COPYRIGHT - INFINITY SOFTWARE SYSTEMS, INC. 1999
     A*
     A**  SYSTEM WIDE DEFAULT VALUES
     A*
     A          R PSY01                     TEXT('SYSTEM WIDE VALUES')
     A*
     A            SYFL01         1          COLHDG('FLG' '01')
     A            SYFL02         1          COLHDG('FLG' '02')
     A            SYFL03         1          COLHDG('FLG' '03')
     A            SYFL04         1          COLHDG('FLG' '04')
     A            SYFL05         1          COLHDG('FLG' '05')
     A            SYFL06         1          COLHDG('FLG' '06')
     A            SYFL07         1          COLHDG('FLG' '07')
     A            SYFL08         1          COLHDG('FLG' '08')
     A            SYFL09         1          COLHDG('FLG' '09')
     A            SYFL10         1          COLHDG('FLG' '10')
     A*
     A            SY0201         2          COLHDG('DEFAULT COVER ID')
     A            SY0202         2          COLHDG('ALPHA 2' '02')
     A            SY0203         2          COLHDG('ALPHA 2' '03')
     A            SY0204         2          COLHDG('ALPHA 2' '04')
     A            SY0205         2          COLHDG('ALPHA 2' '05')
     A            SY0206         2          COLHDG('ALPHA 2' '06')
     A            SY0207         2          COLHDG('ALPHA 2' '07')
     A            SY0208         2          COLHDG('ALPHA 2' '08')
     A            SY0209         2          COLHDG('ALPHA 2' '09')
     A            SY0210         2          COLHDG('ALPHA 2' '10')
     A*
     A            SY0501         5          COLHDG('ALPHA 5' '01')
     A            SY0502         5          COLHDG('ALPHA 5' '02')
     A            SY0503         5          COLHDG('ALPHA 5' '03')
     A            SY0504         5          COLHDG('ALPHA 5' '04')
     A            SY0505         5          COLHDG('ALPHA 5' '05')
     A            SY0506         5          COLHDG('ALPHA 5' '06')
     A            SY0507         5          COLHDG('ALPHA 5' '07')
     A            SY0508         5          COLHDG('ALPHA 5' '08')
     A            SY0509         5          COLHDG('ALPHA 5' '09')
     A            SY0510         5          COLHDG('ALPHA 5' '10')
     A*
     A            SY1001        10          COLHDG('ALPHA 10' '01')
     A            SY1002        10          COLHDG('ALPHA 10' '02')
     A            SY1003        10          COLHDG('ALPHA 10' '03')
     A            SY1004        10          COLHDG('ALPHA 10' '04')
     A            SY1005        10          COLHDG('ALPHA 10' '05')
     A            SY1006        10          COLHDG('ALPHA 10' '06')
     A            SY1007        10          COLHDG('ALPHA 10' '07')
     A            SY1008        10          COLHDG('ALPHA 10' '08')
     A            SY1009        10          COLHDG('ALPHA 10' '09')
     A            SY1010        10          COLHDG('ALPHA 10' '10')
     A*
     A            SY1201        12          COLHDG('A 12' '01')
     A            SY1202        12          COLHDG('A 12' '02')
     A            SY1203        12          COLHDG('A 12' '03')
     A            SY1204        12          COLHDG('A 12' '04')
     A            SY1205        12          COLHDG('A 12' '05')
     A            SY1206        12          COLHDG('A 12' '06')
     A            SY1207        12          COLHDG('A 12' '07')
     A            SY1208        12          COLHDG('A 12' '08')
     A            SY1209        12          COLHDG('A 12' '09')
     A            SY1210        12          COLHDG('A 12' '10')
     A*
     A            SY2001        20          COLHDG('ALPHA 20' '01')
     A            SY2002        20          COLHDG('ALPHA 20' '02')
     A            SY2003        20          COLHDG('ALPHA 20' '03')
     A            SY2004        20          COLHDG('ALPHA 20' '04')
     A            SY2005        20          COLHDG('ALPHA 20' '05')
     A            SY2006        20          COLHDG('ALPHA 20' '06')
     A            SY2007        20          COLHDG('ALPHA 20' '07')
     A            SY2008        20          COLHDG('ALPHA 20' '08')
     A            SY2009        20          COLHDG('ALPHA 20' '09')
     A            SY2010        20          COLHDG('ALPHA 20' '10')
      *
     A            SY4001        40          COLHDG('ALPHA 40' '01')
     A            SY4002        40          COLHDG('ALPHA 40' '02')
     A            SY4003        40          COLHDG('ALPHA 40' '03')
     A            SY4004        40          COLHDG('ALPHA 40' '04')
     A            SY4005        40          COLHDG('ALPHA 40' '05')
     A            SY4006        40          COLHDG('ALPHA 40' '06')
     A            SY4007        40          COLHDG('ALPHA 40' '06')
     A            SY4008        40          COLHDG('ALPHA 40' '07')
     A            SY4009        40          COLHDG('ALPHA 40' '09')
     A            SY4010        40          COLHDG('ALPHA 40' '10')
      *
     A            SY6001        60          COLHDG('ALPHA 60' '01')
     A            SY6002        60          COLHDG('ALPHA 60' '02')
     A            SY6003        60          COLHDG('ALPHA 60' '03')
     A            SY6004        60          COLHDG('ALPHA 60' '04')
     A            SY6005        60          COLHDG('ALPHA 60' '05')
     A            SY6006        60          COLHDG('ALPHA 60' '06')
     A            SY6007        60          COLHDG('ALPHA 60' '07')
     A            SY6008        60          COLHDG('ALPHA 60' '08')
     A            SY6009        60          COLHDG('ALPHA 60' '09')
     A            SY6010        60          COLHDG('ALPHA 60' '10')
      *
     A            SY5N01         5  0       COLHDG('NUM 5 0' '01')
     A            SY5N02         5  0       COLHDG('NUM 5 0' '02')
     A            SY5N03         5  0       COLHDG('NUM 5 0' '03')
     A            SY5N04         5  0       COLHDG('NUM 5 0' '04')
     A            SY5N05         5  0       COLHDG('NUM 5 0' '05')
     A            SY5N06         5  0       COLHDG('NUM 5 0' '06')
     A            SY5N07         5  0       COLHDG('NUM 5 0' '07')
     A            SY5N08         5  0       COLHDG('NUM 5 0' '08')
     A            SY5N09         5  0       COLHDG('NUM 5 0' '09')
     A            SY5N10         5  0       COLHDG('NUM 5 0' '10')
      *
     A            SY9N01         5  0       COLHDG('NUM 9 0' '01')
     A            SY9N02         5  0       COLHDG('NUM 9 0' '02')
     A            SY9N03         5  0       COLHDG('NUM 9 0' '03')
     A            SY9N04         5  0       COLHDG('NUM 9 0' '04')
     A            SY9N05         5  0       COLHDG('NUM 9 0' '05')
     A            SY9N06         5  0       COLHDG('NUM 9 0' '06')
     A            SY9N07         5  0       COLHDG('NUM 9 0' '07')
     A            SY9N08         5  0       COLHDG('NUM 9 0' '08')
     A            SY9N09         5  0       COLHDG('NUM 9 0' '09')
     A            SY9N10         5  0       COLHDG('NUM 9 0' '10')
      *
     A            SY5201         5  2       COLHDG('NUM 5 2' '01')
     A            SY5202         5  2       COLHDG('NUM 5 2' '02')
     A            SY5203         5  2       COLHDG('NUM 5 2' '03')
     A            SY5204         5  2       COLHDG('NUM 5 2' '04')
     A            SY5205         5  2       COLHDG('NUM 5 2' '05')
     A            SY5206         5  2       COLHDG('NUM 5 2' '06')
     A            SY5207         5  2       COLHDG('NUM 5 2' '07')
     A            SY5208         5  2       COLHDG('NUM 5 2' '08')
     A            SY5209         5  2       COLHDG('NUM 5 2' '09')
     A            SY5210         5  2       COLHDG('NUM 5 2' '10')
      *
     A            SY9201         9  2       COLHDG('NUM 9 2' '01')
     A            SY9202         9  2       COLHDG('NUM 9 2' '02')
     A            SY9203         9  2       COLHDG('NUM 9 2' '03')
     A            SY9204         9  2       COLHDG('NUM 9 2' '04')
     A            SY9205         9  2       COLHDG('NUM 9 2' '05')
     A            SY9206         9  2       COLHDG('NUM 9 2' '06')
     A            SY9207         9  2       COLHDG('NUM 9 2' '07')
     A            SY9208         9  2       COLHDG('NUM 9 2' '08')
     A            SY9209         9  2       COLHDG('NUM 9 2' '09')
     A            SY9210         9  2       COLHDG('NUM 9 2' '10')
      *
     A            SYD801         8  0       COLHDG('DATE 8 0' '01')
     A            SYD802         8  0       COLHDG('DATE 8 0' '02')
     A            SYD803         8  0       COLHDG('DATE 8 0' '03')
     A            SYD804         8  0       COLHDG('DATE 8 0' '04')
     A            SYD805         8  0       COLHDG('DATE 8 0' '05')
     A            SYD806         8  0       COLHDG('DATE 8 0' '06')
     A            SYD807         8  0       COLHDG('DATE 8 0' '07')
     A            SYD808         8  0       COLHDG('DATE 8 0' '08')
     A            SYD809         8  0       COLHDG('DATE 8 0' '09')
     A            SYD810         8  0       COLHDG('DATE 8 0' '10')
      *
     A            SYD701         7  0       COLHDG('DATE 7 0' '01')
     A            SYD702         7  0       COLHDG('DATE 7 0' '02')
     A            SYD703         7  0       COLHDG('DATE 7 0' '03')
     A            SYD704         7  0       COLHDG('DATE 7 0' '04')
     A            SYD705         7  0       COLHDG('DATE 7 0' '05')
     A            SYD706         7  0       COLHDG('DATE 7 0' '06')
     A            SYD707         7  0       COLHDG('DATE 7 0' '07')
     A            SYD708         7  0       COLHDG('DATE 7 0' '08')
     A            SYD709         7  0       COLHDG('DATE 7 0' '09')
     A            SYD710         7  0       COLHDG('DATE 7 0' '10')
     A*
     A            SYSTAT         1          COLHDG('STATUS')
     A***** LAST MAINT INFO  *****
     A*
     A            SYIUSR        10          TEXT('INIT USER')
     A            SYIPGM        10          TEXT('INIT PGM')
     A            SYITIM         6S 0       TEXT('INIT TIME')
     A            SYIDT          7S 0       TEXT('INIT DATE')
     A            SYLUSR        10          TEXT('USER LAST MAINT')
     A            SYLPGM        10          TEXT('LAST MAINT PGM')
     A            SYLTIM         6S 0       TEXT('LAST MAINT TIME')
     A            SYLDT          7S 0       TEXT('LAST MAINT DATE')
     A*
