     A*  (C) Copyright Progressive Data Solutions, Inc., 1997
     A*%%TS  SD  19930126  083818  KASSI       REL-V2R1M1  5738-PW1
     A*  91/09/24  11:49:56    KASSI       REL-R03M00  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BKREFP)
     A                                      CHGINPDFT(CS)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CF03
     A                                      ALTHELP
     A                                      HELP
     A                                      VLDCMDKEY(11)
     A*  91/09/24  11:49:56    KASSI       REL-R03M00  5728-PW1
     A          R SCR01
     A*%%TS  SD  19930126  083818  KASSI       REL-V2R1M1  5738-PW1
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      KEEP
     A            SCFILE    R        O  1  3REFFLD(FLE)
     A            SCRECF    R        O  2  1REFFLD(RECF)
     A            SCUSER    R        O  3  1REFFLD(USER)
     A                                 23  3'F1=Help'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 12'F3=Exit'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                  1 30'Install A/P System'
     A                                      DSPATR(HI)
     A                                  7  3'Resource Name for Support Line:'
     A                                  9  3'Controller Adr for Remote WS..:'
     A            SCRES          6A  B  7 36DFTVAL('LIN011')
     A            SCADR1         2A  B  9 36DFTVAL('05')
     A                                  5  3'Tape Drive Device Name........:'
     A            SCDEV          8A  B  5 36DFTVAL('TAP01')
     A                                 11  3'Controller Adr for Pass-thru..:'
     A            SCADR2         2   B 11 36DFTVAL('04')
     A          R SCR02
     A*%%TS  SD  19930125  163640  KASSI       REL-V2R1M1  5738-PW1
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A            SCFILE    R        O  1  3REFFLD(FLE)
     A            SCRECF    R        O  1 71REFFLD(RECF)
     A            SCUSER    R        O  2 70REFFLD(USER)
     A                                 23  3'F1=Help'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                 23 12'F3=Exit'
     A                                      COLOR(BLU)
     A                                      DSPATR(HI)
     A                                  1 30'Install A/P System'
     A                                      DSPATR(HI)
     A                                  5 18'THE INSTALLATION DID NOT COMPLETE -
     A                                      NORMALLY'
     A                                      DSPATR(RI)
     A                                  7 18'Errors have occurred during the in-
     A                                      stallation'
     A                                  8 18'of the Accounts Payable System.  I-
     A                                      f possible,'
     A                                  9 18'remain signed on and call the TMR -
     A                                      Support Line'
     A                                 10 18'for assistance:'
     A                                 12 22'TMR Support Line:  (407) 880-2200'
     A          R SCR99
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
