     A                                      REF(*LIBL/IMFRP)
     A          R WDW01
     A  11 21 22
     A  23 24 25
     A  26 27 28                            CA01(11 'Response Indicator *IN11')
     A  06                                  CA02(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                  1  2HTML('QPUIREC15   ROVERLAY   0     -
     A                                      RWINDOW    0     RROWS      2    C1-
     A                                          1C2    12 RERRMSG    2    C6   -
     A                                       SCSELPC25   You must make a select-
     A                                      ionE1    3     21RERRMSG    2    C6-
     A                                          SCSELPC26   Only one selection -
     A                                      allowedE1    3     22RERRMSG    2  -
     A                                        C6    SCSELPC23   Enter a valid v-
     A                                      alue (1)E1    3     23RERRMSG    2 -
     A                                         C6    SCOUTQC23   Invalid Outq S-
     A                                      pecified.E1    3     26RERRMSG    2-
     A                                          C6    SCCPYSC21   Copies must b-
     A                                      e 1-999.E1    3     27RERRMSG    2 -
     A                                         C6    SCSELIC25   You must make -
     A                                      a selectionE1    3     21RERRMSG   -
     A                                       2    C6    SCSELIC26   Only one se-
     A                                      lection allowedE1    3     22RERRMS-
     A                                      G    2    C6    SCSELIC23   Enter a-
     A                                       valid value (1)E1    3     28RERRM-
     A                                      SG    2    C6    SCSELFC25   You mu-
     A                                      st make a selectionE1    3     21RE-
     A                                      RRMSG    2    C6    SCSELFC26   Onl-
     A                                      y one Selection allowedE1    3     -
     A                                      22RERRMSG    2    C6    SCSELFC23  -
     A                                       Enter a valid value (1)E1    3    -
     A                                       24RERRMSG    2    C6    SCRCIDC31 -
     A                                        Invalid Recipient ID specified.E1-
     A                                          3     25')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"10","window left":"22","set off"-
     A                                      :{"fieldName":"*IN21","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 2":{"-
     A                                      fieldName":"*IN22","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 3":{"fie-
     A                                      ldName":"*IN23","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 4":{"fieldN-
     A                                      ame":"*IN24","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 5":{"fieldName-
     A                                      ":"*IN25","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 6":{"fieldName":"-
     A                                      *IN26","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 7":{"fieldName":"*IN-
     A                                      27","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 8":{"fieldName":"*IN27"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"1-12"},"items":[{"id":"WDW01","-
     A                                      field type":"panel","panel style":"-
     A                                      Transform Dialog","text align":"cen-
     A                                      ter","left":"5px","top":"5px","heig-
     A                                      ht":"423px","width":"394px","z inde-
     A                                      x":"8","locked in place":"true"},{"-
     A                                      id":"SCFILE","field type":"output f-
     A                                      ield","value":{"fieldName":"SCFILE"-
     A                                      ,"designValue":"[SCFILE]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none","dataLen-
     A                                      gth":"10"},"css class":"output-fiel-
     A                                      d","left":"22px","cursor column":"1-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant2",-
     A                                      "field type":"output field","value"-
     A                                      :"PRINT/FAX SELECTION SCREEN","css -
     A                                      class":"constant","left":"106px","c-
     A                                      ursor column":"13","top":"65px","cu-
     A                                      rsor row":"1","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCPRDS","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCPRDS","designValue":"[S-
     A                                      CPRDS]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"10"},"css cl-
     A                                      ass":"output-field","left":"295px",-
     A                                      "cursor column":"40","top":"65px","-
     A                                      cursor row":"1","css class 2":"HI",-
     A                                      "description":"PROGRAM NAME","visib-
     A                                      ility":"hidden","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant3",-
     A                                      "field type":"output field","value"-
     A                                      :"Type options, press Enter.","css -
     A                                      class":"constant","left":"22px","cu-
     A                                      rsor column":"1","top":"105px","cur-
     A                                      sor row":"3","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant7","fi-
     A                                      eld type":"output field","value":"1-
     A                                      =Select","css class":"constant","le-
     A                                      ft":"50px","cursor column":"5","top-
     A                                      ":"125px","cursor row":"4","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant1","field type":"output fie-
     A                                      ld","value":"Opt","css class":"cons-
     A                                      tant","left":"22px","cursor column"-
     A                                      :"1","top":"145px","cursor row":"5"-
     A                                      ,"css class 2":"HI","css class 3":"-
     A                                      profound-converted"},{"id":"SCSELP"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCSELP","design-
     A                                      Value":"[SCSELP]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase","dataLength"-
     A                                      :"1"},"text transform":"uppercase",-
     A                                      "left":"29px","cursor column":"2","-
     A                                      top":"165px","cursor row":"6","widt-
     A                                      h":"8px","css class 3":{"fieldName"-
     A                                      :"N06","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"error message":"You-
     A                                       must make a selection","error cond-
     A                                      ition":{"fieldName":"21","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"3 messages","error message -
     A                                      2":"Only one selection allowed","er-
     A                                      ror condition 2":{"fieldName":"22",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error message 3":"Enter a valid va-
     A                                      lue (1)","error condition 3":{"fiel-
     A                                      dName":"23","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"description":"Selectio-
     A                                      n Field","css class 4":"profound-co-
     A                                      nverted"},{"id":"constant4","field -
     A                                      type":"output field","value":"Print-
     A                                      (AS/400)","css class":"constant","l-
     A                                      eft":"50px","cursor column":"5","to-
     A                                      p":"165px","cursor row":"6","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant8","field type":"output fi-
     A                                      eld","value":"Outq:","css class":"c-
     A                                      onstant","left":"162px","cursor col-
     A                                      umn":"21","top":"165px","cursor row-
     A                                      ":"6","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCOUTQ","fie')
     A                                  1  4HTML('ld type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCOUTQ","desig-
     A                                      nValue":"[SCOUTQ]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","dataLength-
     A                                      ":"10"},"text transform":"uppercase-
     A                                      ","left":"204px","cursor column":"2-
     A                                      7","top":"165px","cursor row":"6","-
     A                                      width":"71px","error message":"Inva-
     A                                      lid Outq Specified.","error conditi-
     A                                      on":{"fieldName":"26","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant9",-
     A                                      "field type":"output field","value"-
     A                                      :"Copies:","css class":"constant","-
     A                                      left":"281px","cursor column":"38",-
     A                                      "top":"165px","cursor row":"6","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCCPYS","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCCP-
     A                                      YS","designValue":"[SCCPYS]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"3","decPos":"0","numBlankF-
     A                                      ill":"true"},"left":"337px","cursor-
     A                                       column":"46","top":"165px","cursor-
     A                                       row":"6","width":"22px","text alig-
     A                                      n":"right","error message":"Copies -
     A                                      must be 1-999.","error condition":{-
     A                                      "fieldName":"27","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","css class 3":"profound--
     A                                      converted"},{"id":"SCSELI","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCSELI","designValue":"[-
     A                                      SCSELI]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase","dataLength":"1"},"te-
     A                                      xt transform":"uppercase","left":"2-
     A                                      9px","cursor column":"2","top":"205-
     A                                      px","cursor row":"8","width":"8px",-
     A                                      "css class 3":{"fieldName":"N06","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"error message":"You must mak-
     A                                      e a selection","error condition":{"-
     A                                      fieldName":"21","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"3-
     A                                       messages","error message 2":"Only -
     A                                      one selection allowed","error condi-
     A                                      tion 2":{"fieldName":"22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssage 3":"Enter a valid value (1)",-
     A                                      "error condition 3":{"fieldName":"2-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"description":"Selection Field",-
     A                                      "css class 4":"profound-converted"}-
     A                                      ,{"id":"constant10","field type":"o-
     A                                      utput field","value":"Print(Image P-
     A                                      rinter)","css class":"constant","le-
     A                                      ft":"50px","cursor column":"5","top-
     A                                      ":"205px","cursor row":"8","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCSELF","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCSELF",-
     A                                      "designValue":"[SCSELF]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase","data-
     A                                      Length":"1"},"text transform":"uppe-
     A                                      rcase","left":"29px","cursor column-
     A                                      ":"2","top":"245px","cursor row":"1-
     A                                      0","width":"8px","css class 3":{"fi-
     A                                      eldName":"N06","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "UL","customFalse":""},"error messa-
     A                                      ge":"You must make a selection","er-
     A                                      ror condition":{"fieldName":"21","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"3 messages","error -
     A                                      message 2":"Only one Selection allo-
     A                                      wed","error condition 2":{"fieldNam-
     A                                      e":"22","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message 3":"Enter a -
     A                                      valid value (1)","error condition 3-
     A                                      ":{"fieldName":"24","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"description":"-
     A                                      Selection Field","css class 4":"pro-
     A                                      found-converted"},{"id":"constant5"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Fax Image   ","css class":"const-
     A                                      ant","left":"50px","cursor column":-
     A                                      "5","top":"245px","cursor row":"10"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant6","field type":"o-
     A                                      utput field","value":"Recipient ID:-
     A                                      ","css class":"constant","left":"14-
     A                                      8px","cursor column":"19","top":"24-
     A                                      5px","cursor row":"10","css class 2-
     A                                      ":"profound-converted"},{"id":"SCRC-
     A                                      ID","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCRCID","des-
     A                                      ignValue":"[SCRCID]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"10"},"text transform":"upperca-
     A                                      se","left":"246px","cursor column":-
     A                                      "33","top":"245px","cursor')
     A                                  1  5HTML(' row":"10","width":"71px","er-
     A                                      ror message":"Invalid Recipient ID -
     A                                      specified.","error condition":{"fie-
     A                                      ldName":"25","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","css class 3":"profound-conv-
     A                                      erted"},{"id":"btnSubmit","field ty-
     A                                      pe":"button","value":"Enter","short-
     A                                      cut key":"Enter","left":"14px","top-
     A                                      ":"350px","width":"80px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF03","field type":"button-
     A                                      ","value":"Exit","shortcut key":"F3-
     A                                      ","left":"104px","top":"350px","wid-
     A                                      th":"80px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF05"-
     A                                      ,"field type":"button","value":"Rec-
     A                                      ipient srch","shortcut key":"F5","l-
     A                                      eft":"194px","top":"350px","width":-
     A                                      "80px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF12","fi-
     A                                      eld type":"button","value":"Cancel -
     A                                       ","shortcut key":"F12","left":"284-
     A                                      px","top":"350px","width":"80px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnHELP","field type"-
     A                                      :"button","shortcut key":"Alt-F1","-
     A                                      onclick":"pui.showHelp()","value":"-
     A                                      HELP","left":"14px","top":"383px","-
     A                                      width":"80px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","visibility":"hidden","cursor":"-
     A                                      default"}]}')
     A            SCCPYS         3S 0H
     A            SCFILE        10A  H
     A            SCOUTQ        10A  H
     A            SCPRDS        10A  H
     A            SCRCID        10A  H
     A            SCSELF         1A  H
     A            SCSELI         1A  H
     A            SCSELP         1A  H
     A          R SCR99
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    RASSUME    0     -
     A                                      RROWS      2    C1    3C1    3 FSCE-
     A                                      RR     INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","valid command key"-
     A                                      :{"fieldName":"*IN11","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"overlay range-
     A                                      ":"3-3"},"items":[{"id":"IS202F_SCR-
     A                                      99_avKeys","field type":"output fie-
     A                                      ld","value":{"fieldName":"AV_KEYS",-
     A                                      "dataLength":"1134","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[AV_KEYS]"},"left":"0px","top-
     A                                      ":"0px","visibility":"hidden"},{"id-
     A                                      ":"IS202F_SCR99_action","field type-
     A                                      ":"html container","white space":"n-
     A                                      ormal","left":"0px","top":"10px","w-
     A                                      idth":"230px","css class":"action-p-
     A                                      anel-converted","height":"700px","h-
     A                                      tml":"<div class=\"top\"></div><div-
     A                                       class=\"imagetop\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_top.png-
     A                                      \" /></div><div class=\"menulinks\"-
     A                                      ></div><div class=\"imagebottom\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_bottom.png\" /></div><div cl-
     A                                      ass=\"bottom\"></div>"},{"field typ-
     A                                      e":"icon menu button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"32px","z index":"20"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1170px","id":"IS202F_SCR99_Btn-
     A                                      IconMenuSystemTools","tool tip":"Sy-
     A                                      stem Tools","icon alignment":"middl-
     A                                      e left","icon width":"16px","icon h-
     A                                      eight":"24px","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"IS2-
     A                                      02F_SCR99_ButtonBar","top":"35px","-
     A                                      left":"1036px","width":"187px","hei-
     A                                      ght":"28px","css class":"stationary-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1040px","id":"IS202F_SCR99_BtnSav-
     A                                      e","tool tip":"Save","onclick":"Sys-
     A                                      temToolbarSave","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/save.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1066px","id":"IS202F_SCR99-
     A                                      _BtnRefresh","tool tip":"Refresh","-
     A                                      onclick":"SystemToolbarRefresh","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/refresh.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1092px"-
     A                                      ,"id":"IS202F_SCR99_BtnSearch","too-
     A                                      l tip":"Search","onclick":"SystemTo-
     A                                      olbarSearch","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/search.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1118px","id":"IS202F_SCR99_-
     A                                      BtnDiaryItems","tool tip":"Diary/Wo-
     A                                      rk Items - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"IS202F_SCR99_BtnSy-
     A                                      stemMessages","tool tip":"System Me-
     A                                      ssages","onclick":"SystemToolbarMes-
     A                                      sages","background image":{"fieldNa-
     A                                      me":"MsgIcnURL","dataLengt')
     A                                  1  4HTML('h":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1196px","id":"IS202F_SCR9-
     A                                      9_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"IS202F_SCR99_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "IS202F_SCR99_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":"Tab 1","a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"IS202F_SCR99_BtnHidd-
     A                                      enSave","value":"btnSave","top":"10-
     A                                      0px","response":{"fieldName":"btnSa-
     A                                      ve","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"IS202F_SCR99_fkeyMenu","-
     A                                      field type":"menu","left":"10px","t-
     A                                      op":"120px","height":"350px","width-
     A                                      ":"230px","hover background color":-
     A                                      "#9AAA61","hover text color":"#FFFF-
     A                                      FF","border color":"#4C6106","menu -
     A                                      option indent":"10px","background c-
     A                                      olor":"#758B27","css class":"action-
     A                                      -menu","css class 2":"stationary","-
     A                                      z index":"101"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"IS202F_SCR99_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCERR","field type":"passw-
     A                                      ord field","css class":"input","css-
     A                                       class 2":"textbox","input only":"t-
     A                                      rue","value":{"fieldName":"SCERR","-
     A                                      designValue":"[SCERR]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"1"},"text transform":"upperc-
     A                                      ase","left":"288px","cursor column"-
     A                                      :"3","top":"150px","cursor row":"3"-
     A                                      ,"width":"8px","read only":"true","-
     A                                      css class 3":"PR-UL","parent tab pa-
     A                                      nel":"IS202F_SCR99_MainTabPanel","p-
     A                                      arent tab":"0","css class 4":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"IS202F_SCR99_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"IS202F_SCR99_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"IS202F_SCR99_BtnHiddenSystem-
     A                                      Messages","value":"btnMessage","top-
     A                                      ":"200px","response":{"fieldName":"-
     A                                      btnMessage","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      IS202F_SCR99_BtnHiddenWorkSubmitJob-
     A                                      ","value":"btnWrksbmjob","top":"225-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Job","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"IS202F_-
     A                                      SCR99_BtnHiddenWorkPrinterOutput","-
     A                                      value":"btnWrkprtout","top":"250px"-
     A                                      ,"response":{"fieldName":"btnWrkPrn-
     A                                      t","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true')
     A                                  1  5HTML('","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"IS202F_SCR99_BtnHiddenImageQu-
     A                                      eue","value":"btnImgQue","top":"275-
     A                                      px","response":{"fieldName":"btnImg-
     A                                      Que","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"IS202F_-
     A                                      SCR99_BtnHiddenHelp","value":"btnHe-
     A                                      lp","top":"300px","response":{"fiel-
     A                                      dName":"btnHelp","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnHELP","field typ-
     A                                      e":"button","shortcut key":"Alt-F1"-
     A                                      ,"onclick":"pui.showHelp()","value"-
     A                                      :"HELP","left":"14px","top":"183px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR          1A  H
