     A                                      REF(*LIBL/IMFRP)
     A          R WDW02
     A  11 20 21
     A  22 23 24
     A  25 26 27                            CA01(11 'Response Indicator *IN11')
     A  28 29 30
     A  31                                  CA02(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                  1  2HTML('QPUIREC13   RWINDOW    0     -
     A                                      RROWS      2    C1    2C2    20 RER-
     A                                      RMSG    2    C6    SCFPH#C28   Fax -
     A                                      Phone # must be entered.E1    3    -
     A                                       20RERRMSG    2    C6    SCSDDTC21 -
     A                                        Invalid Date entered.E1    3     -
     A                                      21RERRMSG    2    C6    SCSDDTC56  -
     A                                       Send Date must be greater than or -
     A                                      equal to current date.E1    3     2-
     A                                      2RERRMSG    2    C6    SCSDTMC21   -
     A                                      Invalid Time entered.E1    3     23-
     A                                      RERRMSG    2    C6    SCSDTMC59   S-
     A                                      end Time not within allowed transmi-
     A                                      ssion period for class.E1    3     -
     A                                      24RERRMSG    2    C6    SCCVRIC19  -
     A                                       Cover Id is invalidE1    3     28R-
     A                                      ERRMSG    2    C6    SCCPTIC24   He-
     A                                      ading must be entered.E1    3     2-
     A                                      5RERRMSG    2    C6    SCCPT1C30   -
     A                                      Claimant Name Cannot be BlanksE1   -
     A                                       3     26RERRMSG    2    C6    SCCL-
     A                                      M#C29   Claimant Name Cannot be Bla-
     A                                      nkE1    3     29RERRMSG    2    C5 -
     A                                         SCDOIC29   Date of Injury must b-
     A                                      e valid.E1    3     30RERRMSG    2 -
     A                                         C6    SCCPCMC38   From/Return ca-
     A                                      nnot be equal to Blanks.E1    3    -
     A                                       27')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"2","window left":"2","return cur-
     A                                      sor record":{"fieldName":"RCD","dat-
     A                                      aLength":"10","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none"},"return cursor field-
     A                                      ":{"fieldName":"FLD","dataLength":"-
     A                                      10","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne"},"return cursor position":{"fie-
     A                                      ldName":"POS","dataLength":"4","dec-
     A                                      Pos":"0","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","dataType":"zoned","format-
     A                                      ting":"Number","units":"","negNum":-
     A                                      "-999.00"},"set off":{"fieldName":"-
     A                                      *IN20","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 2":{"fieldName":"*IN-
     A                                      21","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 3":{"fieldName":"*IN22"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 4":{"fieldName":"*IN23","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 5":{"fieldName":"*IN24","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 6":{"fieldName":"*IN25","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      7":{"fieldName":"*IN26","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 8":-
     A                                      {"fieldName":"*IN27","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set off 9":{"f-
     A                                      ieldName":"*IN28","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 10":{"fie-
     A                                      ldName":"*IN29","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 11":{"field-
     A                                      Name":"*IN30","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 12":{"fieldNa-
     A                                      me":"*IN31","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"valid command key":{"fi-
     A                                      eldName":"*IN11","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"overlay range":"2--
     A                                      20"},"items":[{"id":"POS","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"POS","d-
     A                                      esignValue":"[POS]","dataType":"zon-
     A                                      ed","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"true","zeroF-
     A                                      ill":"true","curSym":"","units":"",-
     A                                      "negNum":"-999.00","dataLength":"4"-
     A                                      ,"decPos":"0"},"left":"0px","top":"-
     A                                      -30px","width":"28px","text align":-
     A                                      "right","css class":"profound-conve-
     A                                      rted"},{"id":"RCD","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"RCD","designVa-
     A                                      lue":"[RCD]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"10"},"le-
     A                                      ft":"0px","top":"-30px","css class"-
     A                                      :"profound-converted"},{"id":"SCCPT-
     A                                      2","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"SCCPT2","designValue":"[SCCPT2-
     A                                      ]","refField":"FRCPT2","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"none"},"left"-
     A                                      :"0px","top":"-30px","description":-
     A                                      "Cover Page \"to\" line2","css clas-
     A                                      s":"profound-converted"},{"id":"FLD-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"FLD","designValue":"[FLD]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"10"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"WDW02","field type":"p-
     A                                      anel","panel style":"Transform Dial-
     A                                      og","text align":"center","left":"5-
     A                                      px","top":"5px","height":"550px","w-
     A                                      idth":"541px","z index":"8","locked-
     A                                       in place":"true"},{"id":"constant1-
     A                                      ","field type":"output field","valu-
     A                                      e":"Send Fax","css class":"constant-
     A                                      ","left":"239px","cursor column":"3-
     A                                      2","top":"85px","cursor row":"2","c-
     A                                      ss class 2":"HI","css class 3":"pro-
     A                                      found-converted"},{"id":"constant2"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Type information, press Enter:",-
     A                                      "css class":"constant","left":"36px-
     A                                      ","cursor column":"3","top":"105px"-
     A                                      ,"cursor row":"3","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      ","field type":"output field","valu-
     A                                      e":"Recipient ID. . . . . . .","css-
     A                                       class":"constant","left":"50px","c-
     A                                      ursor column":"5","top":"125px","cu-
     A                                      rsor row":"4","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCRCID","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCRCID","designValue":"[S-
     A                                      CRCID]","refField":"FRRCID","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","tr')
     A                                  1  4HTML('imTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"232px","cursor colum-
     A                                      n":"31","top":"125px","cursor row":-
     A                                      "4","css class 2":"HI","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant4","field type":"output field",-
     A                                      "value":"Output Class:","css class"-
     A                                      :"constant","left":"400px","cursor -
     A                                      column":"55","top":"125px","cursor -
     A                                      row":"4","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCOUTC","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCOUTC","designValue":"[SCOUTC-
     A                                      ]","refField":"FROUTC","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"498px-
     A                                      ","cursor column":"69","top":"125px-
     A                                      ","cursor row":"4","css class 2":"H-
     A                                      I","description":"Output Class","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant5","field type":"outpu-
     A                                      t field","value":"Recipient ID Desc-
     A                                      ription.","css class":"constant","l-
     A                                      eft":"50px","cursor column":"5","to-
     A                                      p":"145px","cursor row":"5","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCDESC","field type":"output field-
     A                                      ","value":{"fieldName":"SCDESC","de-
     A                                      signValue":"[SCDESC]","refField":"F-
     A                                      RDESC","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"232px","cursor column-
     A                                      ":"31","top":"145px","cursor row":"-
     A                                      5","css class 2":"profound-converte-
     A                                      d"},{"id":"constant6","field type":-
     A                                      "output field","value":"Facsimile P-
     A                                      hone Number. .","css class":"consta-
     A                                      nt","left":"50px","cursor column":"-
     A                                      5","top":"165px","cursor row":"6","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCFPH#","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CFPH#","designValue":"[SCFPH#]","re-
     A                                      fField":"FRFPH#","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","left":"232px-
     A                                      ","cursor column":"31","top":"165px-
     A                                      ","cursor row":"6","width":"225px",-
     A                                      "css class 3":"UL","error message":-
     A                                      "Fax Phone # must be entered.","err-
     A                                      or condition":{"fieldName":"20","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"1 message","descript-
     A                                      ion":"Fax Phone #","css class 4":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      7","field type":"output field","val-
     A                                      ue":"Send Date and Time. . . .","cs-
     A                                      s class":"constant","left":"50px","-
     A                                      cursor column":"5","top":"185px","c-
     A                                      ursor row":"7","css class 2":"profo-
     A                                      und-converted"},{"id":"SCSDDT","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCSDDT","designValue-
     A                                      ":"[SCSDDT]","refField":"DT8 SCREFP-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00","numBlankFill":"true"},"left"-
     A                                      :"232px","cursor column":"31","top"-
     A                                      :"185px","cursor row":"7","width":"-
     A                                      57px","text align":"right","css cla-
     A                                      ss 3":"UL","error message":"Invalid-
     A                                       Date entered.","error condition":{-
     A                                      "fieldName":"21","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      2 messages","error message 2":"Send-
     A                                       Date must be greater than or equal-
     A                                       to current date.","error condition-
     A                                       2":{"fieldName":"22","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"description"-
     A                                      :"Send Date","css class 4":"profoun-
     A                                      d-converted"},{"id":"SCSDTM","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCSDTM","designValue":-
     A                                      "[SCSDTM]","refField":"FRDSTM","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00",-
     A                                      "numBlankFill":"true"},"left":"302p-
     A                                      x","cursor column":"41","top":"185p-
     A                                      x","cursor row":"7","width":"43px",-
     A                                      "text align":"right","css class 3":-
     A                                      "UL","set focus":{"fieldName":"31",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"error message":"Invalid Tim-
     A                                      e entered.","error condition":{"fie-
     A                                      ldName":"23","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"2 me-
     A                                      ssages","error message 2":"Send Tim-
     A                                      e not within allowed transmission p-
     A                                      eriod for class.","error condition -
     A                                      2":{"fieldName":"24","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"description":-
     A                                      "Send Time","css class 4":"profound-
     A                                      -converted"},{"id":"constant8","fie-
     A                                      ld type":"output field","value":"Co-
     A                                      ver Page Information:","css class":-
     A                                      "constant","left":"50px","cursor co-
     A                                      lumn":"5","top":"205px","cursor row-
     A                                      ":"8","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCCVRI","fie')
     A                                  1  5HTML('ld type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCCVRI","desig-
     A                                      nValue":"[SCCVRI]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase","dataLength-
     A                                      ":"2"},"text transform":"uppercase"-
     A                                      ,"left":"232px","cursor column":"31-
     A                                      ","top":"205px","cursor row":"8","w-
     A                                      idth":"15px","error message":"Cover-
     A                                       Id is invalid","error condition":{-
     A                                      "fieldName":"28","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","css class 3":"profound--
     A                                      converted"},{"id":"SCCVRD","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCCVRD","designValue":"[SCCV-
     A                                      RD]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"35"},"css class-
     A                                      ":"output-field","left":"267px","cu-
     A                                      rsor column":"36","top":"205px","cu-
     A                                      rsor row":"8","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant9","f-
     A                                      ield type":"output field","value":"-
     A                                      To/Company  . . . . . .","css class-
     A                                      ":"constant","left":"64px","cursor -
     A                                      column":"7","top":"225px","cursor r-
     A                                      ow":"9","css class 2":"profound-con-
     A                                      verted"},{"id":"SCCPTI","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCCPTI","designValue":"[SCC-
     A                                      PTI]","refField":"FRCPTI","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"232px","cursor column":"31","to-
     A                                      p":"225px","cursor row":"9","width"-
     A                                      :"281px","css class 3":"UL","error -
     A                                      message":"Heading must be entered."-
     A                                      ,"error condition":{"fieldName":"25-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error messages":"1 message","des-
     A                                      cription":"cover page  Heading","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      id":"constant12","field type":"outp-
     A                                      ut field","value":"Claimant Name . -
     A                                      . . . .","css class":"constant","le-
     A                                      ft":"64px","cursor column":"7","top-
     A                                      ":"265px","cursor row":"11","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCCPT1","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCCPT1"-
     A                                      ,"designValue":"[SCCPT1]","refField-
     A                                      ":"FRCPT1","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"232px","cur-
     A                                      sor column":"31","top":"265px","cur-
     A                                      sor row":"11","width":"281px","css -
     A                                      class 3":"UL","error message":"Clai-
     A                                      mant Name Cannot be Blanks","error -
     A                                      condition":{"fieldName":"26","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","description-
     A                                      ":"cover page \"to\" line 1","css c-
     A                                      lass 4":"profound-converted"},{"id"-
     A                                      :"constant13","field type":"output -
     A                                      field","value":"Claim Number  . . .-
     A                                       . .","css class":"constant","left"-
     A                                      :"64px","cursor column":"7","top":"-
     A                                      285px","cursor row":"12","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      CLM#","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCCLM#","d-
     A                                      esignValue":"[SCCLM#]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"24"},"text transform":"upper-
     A                                      case","left":"232px","cursor column-
     A                                      ":"31","top":"285px","cursor row":"-
     A                                      12","width":"169px","error message"-
     A                                      :"Claimant Name Cannot be Blank","e-
     A                                      rror condition":{"fieldName":"29","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant14","field type":"output f-
     A                                      ield","value":"DOI:","css class":"c-
     A                                      onstant","left":"407px","cursor col-
     A                                      umn":"56","top":"285px","cursor row-
     A                                      ":"12","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCDOI","field type":-
     A                                      "date field","css class":"input","c-
     A                                      ss class 2":"date-field","value":{"-
     A                                      fieldName":"SCDOI","designValue":"[-
     A                                      SCDOI]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"8","decPos":-
     A                                      "0","edtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"left":"442px","cu-
     A                                      rsor column":"61","top":"285px","cu-
     A                                      rsor row":"12","width":"71px","erro-
     A                                      r message":"Date of Injury must be -
     A                                      valid.","error condition":{"fieldNa-
     A                                      me":"30","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"1 messag-
     A                                      e","css class 3":"profound-converte-
     A                                      d"},{"id":"constant11","field type"-
     A                                      :"output field","value":"From/Retur-
     A                                      n Phone . . .","css class":"constan-
     A                                      t","left":"64px","cursor column":"7-
     A                                      ","top":"325px","cursor row":"14","-
     A                                      css class 2":"profound-con')
     A                                  1  6HTML('verted"},{"id":"SCCPCM","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCCPCM","designValue"-
     A                                      :"[SCCPCM]","refField":"FRCPCM","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"232px","cursor column":"3-
     A                                      1","top":"325px","cursor row":"14",-
     A                                      "width":"281px","error message":"Fr-
     A                                      om/Return cannot be equal to Blanks-
     A                                      .","error condition":{"fieldName":"-
     A                                      27","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","d-
     A                                      escription":"Cover Page \"from\" li-
     A                                      ne 1","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant10","field ty-
     A                                      pe":"output field","value":"Message-
     A                                       . . . . . . . .","css class":"cons-
     A                                      tant","left":"64px","cursor column"-
     A                                      :"7","top":"365px","cursor row":"16-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCCPT3","field type":"tex-
     A                                      tbox","css class":"input","css clas-
     A                                      s 2":"textbox","value":{"fieldName"-
     A                                      :"SCCPT3","designValue":"[SCCPT3]",-
     A                                      "refField":"FRCPT3","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"uppercase"},"tex-
     A                                      t transform":"uppercase","left":"23-
     A                                      2px","cursor column":"31","top":"36-
     A                                      5px","cursor row":"16","width":"281-
     A                                      px","css class 3":"UL","description-
     A                                      ":"Cover Page \"to\" line3","css cl-
     A                                      ass 4":"profound-converted"},{"id":-
     A                                      "SCCPF1","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCCPF1"-
     A                                      ,"designValue":"[SCCPF1]","refField-
     A                                      ":"FRCPF1","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"232px","cur-
     A                                      sor column":"31","top":"385px","cur-
     A                                      sor row":"17","width":"281px","css -
     A                                      class 3":"UL","description":"Cover -
     A                                      Page Comment Line 1","css class 4":-
     A                                      "profound-converted"},{"id":"SCCPF2-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCCPF2","desig-
     A                                      nValue":"[SCCPF2]","refField":"FRCP-
     A                                      F2","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase"},"text transform":"up-
     A                                      percase","left":"232px","cursor col-
     A                                      umn":"31","top":"405px","cursor row-
     A                                      ":"18","width":"281px","css class 3-
     A                                      ":"UL","description":"Cover page Co-
     A                                      mment line2","css class 4":"profoun-
     A                                      d-converted"},{"id":"SCCPF3","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCCPF3","designValue":-
     A                                      "[SCCPF3]","refField":"FRCPF3","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"232px","cursor column":"31-
     A                                      ","top":"425px","cursor row":"19","-
     A                                      width":"281px","css class 3":"UL","-
     A                                      description":"Cover Page Comment li-
     A                                      ne3","css class 4":"profound-conver-
     A                                      ted"},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "510px","width":"80px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF05","field type":"button",-
     A                                      "value":"Recip Srch","shortcut key"-
     A                                      :"F5","left":"104px","top":"510px",-
     A                                      "width":"80px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F10","field type":"button","value":-
     A                                      "Search","shortcut key":"F10","left-
     A                                      ":"194px","top":"510px","width":"80-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF12","field-
     A                                       type":"button","value":"Cancel  ",-
     A                                      "shortcut key":"F12","left":"284px"-
     A                                      ,"top":"510px","width":"80px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnHELP","field type":"b-
     A                                      utton","shortcut key":"Alt-F1","onc-
     A                                      lick":"pui.showHelp()","value":"HEL-
     A                                      P","left":"374px","top":"510px","wi-
     A                                      dth":"80px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"visibility":"hidden","cursor":"de-
     A                                      fault"}]}')
     A            FLD           10A  H
     A            POS            4S 0H
     A            RCD           10A  H
     A            SCCLM#        24A  H
     A            SCCVRD        35A  H
     A            SCCVRI         2A  H
     A            SCDOI          8S 0H
     A            SCCPCM    R        H      REFFLD(FRCPCM)
     A            SCCPF1    R        H      REFFLD(FRCPF1)
     A            SCCPF2    R        H      REFFLD(FRCPF2)
     A            SCCPF3    R        H      REFFLD(FRCPF3)
     A            SCCPT1    R        H      REFFLD(FRCPT1)
     A            SCCPT2    R        H      REFFLD(FRCPT2)
     A            SCCPT3    R        H      REFFLD(FRCPT3)
     A            SCCPTI    R        H      REFFLD(FRCPTI)
     A            SCDESC    R        H      REFFLD(FRDESC)
     A            SCFPH#    R        H      REFFLD(FRFPH#)
     A            SCOUTC    R        H      REFFLD(FROUTC)
     A            SCRCID    R        H      REFFLD(FRRCID)
     A            SCSDDT    R        H      REFFLD(DT8 SCREFP)
     A            SCSDTM    R        H      REFFLD(FRDSTM)
     A          R SCR99
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    RASSUME    0     -
     A                                      RROWS      2    C1    3C1    3 FSCE-
     A                                      RR     INPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "assume":"true","valid command key"-
     A                                      :{"fieldName":"*IN11","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"overlay range-
     A                                      ":"3-3"},"items":[{"id":"ISCVAAF_SC-
     A                                      R99_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"ISCVAAF_SCR99_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"ISCVAAF_SCR99_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      ISCVAAF_SCR99_ButtonBar","top":"35p-
     A                                      x","left":"1036px","width":"187px",-
     A                                      "height":"28px","css class":"statio-
     A                                      nary","visibility":"hidden","locked-
     A                                       in place":"true"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1040px","id":"ISCVAAF_SCR99_B-
     A                                      tnSave","tool tip":"Save","onclick"-
     A                                      :"SystemToolbarSave","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/save.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1066px","id":"ISCVAAF-
     A                                      _SCR99_BtnRefresh","tool tip":"Refr-
     A                                      esh","onclick":"SystemToolbarRefres-
     A                                      h","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/refre-
     A                                      sh.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      092px","id":"ISCVAAF_SCR99_BtnSearc-
     A                                      h","tool tip":"Search","onclick":"S-
     A                                      ystemToolbarSearch","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/search.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1118px","id":"ISCVAA-
     A                                      F_SCR99_BtnDiaryItems","tool tip":"-
     A                                      Diary/Work Items - IDARTS","onclick-
     A                                      ":"SystemToolbarDiary","background -
     A                                      image":{"fieldName":"DryIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1144px","id":"ISCVAAF_SC-
     A                                      R99_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","')
     A                                  1  4HTML('dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1196px","id":"IS-
     A                                      CVAAF_SCR99_BtnHelp","tool tip":"He-
     A                                      lp","onclick":"SystemToolbarHelp","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/help.png'-
     A                                      ')"},{"id":"ISCVAAF_SCR99_ImgSysToo-
     A                                      lBottom","field type":"image","imag-
     A                                      e source":"/profoundui/userdata/ima-
     A                                      ges/systool/butbarbot.png","left":"-
     A                                      1036px","top":"64px","width":"187px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en"},{"id":"ISCVAAF_SCR99_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":"Tab 1","active tab":"0","left":"-
     A                                      250px","top":"70px","width":"970px"-
     A                                      ,"height":"657px","z index":"8","lo-
     A                                      cked in place":"true","css class":"-
     A                                      tab-panel","css class 2":"stationar-
     A                                      y"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"ISCVAAF_-
     A                                      SCR99_BtnHiddenSave","value":"btnSa-
     A                                      ve","top":"100px","response":{"fiel-
     A                                      dName":"btnSave","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"ISCVAAF_SCR-
     A                                      99_fkeyMenu","field type":"menu","l-
     A                                      eft":"10px","top":"120px","height":-
     A                                      "350px","width":"230px","hover back-
     A                                      ground color":"#9AAA61","hover text-
     A                                       color":"#FFFFFF","border color":"#-
     A                                      4C6106","menu option indent":"10px"-
     A                                      ,"background color":"#758B27","css -
     A                                      class":"action-menu","css class 2":-
     A                                      "stationary","z index":"101"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"ISCVAAF_SCR99_Btn-
     A                                      HiddenRefresh","value":"btnRefresh"-
     A                                      ,"top":"125px","response":{"fieldNa-
     A                                      me":"btnRefresh","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"SCERR","fie-
     A                                      ld type":"password field","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "input only":"true","value":{"field-
     A                                      Name":"SCERR","designValue":"[SCERR-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"upp-
     A                                      ercase","dataLength":"1"},"text tra-
     A                                      nsform":"uppercase","left":"288px",-
     A                                      "cursor column":"3","top":"150px","-
     A                                      cursor row":"3","width":"8px","read-
     A                                       only":"true","css class 3":"PR-UL"-
     A                                      ,"parent tab panel":"ISCVAAF_SCR99_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"ISCVAAF_SCR99_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"ISCVAAF_SCR99_BtnHiddenDiaryIte-
     A                                      ms","value":"btnDiary","top":"175px-
     A                                      ","response":{"fieldName":"btnDiary-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"ISCVAAF_SC-
     A                                      R99_BtnHiddenSystemMessages","value-
     A                                      ":"btnMessage","top":"200px","respo-
     A                                      nse":{"fieldName":"btnMessage","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"ISCVAAF_SCR99_Bt-
     A                                      nHiddenWorkSubmitJob","value":"btnW-
     A                                      rksbmjob","top":"225px","response":-
     A                                      {"fieldName":"btnWrkJob","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"ISCVAAF_SCR99_BtnHidde-
     A                                      nWorkPrinterOutput","value":"btnWrk-
     A                                      prtout","top":"250px","response":{"-
     A                                      fieldName":"btnWrkPrnt","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","l')
     A                                  1  5HTML('ocked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"ISCVAAF_-
     A                                      SCR99_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"ISCVAAF_SCR99_BtnHid-
     A                                      denHelp","value":"btnHelp","top":"3-
     A                                      00px","response":{"fieldName":"btnH-
     A                                      elp","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"btnSubmit","field type"-
     A                                      :"button","value":"Enter","shortcut-
     A                                       key":"Enter","left":"14px","top":"-
     A                                      150px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnHELP","field type":"button",-
     A                                      "shortcut key":"Alt-F1","onclick":"-
     A                                      pui.showHelp()","value":"HELP","lef-
     A                                      t":"14px","top":"183px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR          1A  H
