     A          R SCR01
     A  07 20 21
     A  22 23 24
     A  25 26 27                            CA01(07 'Response Indicator *IN07')
     A  52                                  CA02(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                  1  2HTML('QPUIREC11   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSG    2    C6    SCBDSCC34   Batc-
     A                                      h Description Can not be BlankE1   -
     A                                       3     22RERRMSG    2    C5    SCCO-
     A                                      #C11   Invalid keyE1    3     27RER-
     A                                      RMSG    2    C5    SCFNDC11   Inval-
     A                                      id keyE1    3     27RERRMSG    2   -
     A                                       C5    SCFYRC11   Invalid keyE1    -
     A                                      3     27RERRMSG    2    C6    SCCAS-
     A                                      EC11   Invalid keyE1    3     27RER-
     A                                      RMSG    2    C6    SC#DCSC32   Valu-
     A                                      e must be greater than zero.E1    3-
     A                                           20RERRMSG    2    C6    SC#PGS-
     A                                      C32   Value must be greater than ze-
     A                                      ro.E1    3     21RERRMSG    2    C6-
     A                                          SCDOCTC25   Document type is in-
     A                                      valid.E1    3     23RERRMSG    2   -
     A                                       C6    SCCDATC12   Invalid dateE1  -
     A                                        3     52')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN52","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"overlay":"true","valid comma-
     A                                      nd key":{"fieldName":"*IN07","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"overla-
     A                                      y range":"1-23"},"items":[{"id":"IS-
     A                                      DS80F_SCR01_avKeys","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      AV_KEYS","dataLength":"1134","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[AV_KEYS]"},"left":"-
     A                                      0px","top":"0px","visibility":"hidd-
     A                                      en"},{"id":"ISDS80F_SCR01_action","-
     A                                      field type":"html container","white-
     A                                       space":"normal","left":"0px","top"-
     A                                      :"10px","width":"230px","css class"-
     A                                      :"action-panel-converted","height":-
     A                                      "700px","html":"<div class=\"top\">-
     A                                      </div><div class=\"imagetop\"><img -
     A                                      src=\"/profoundui/userdata/images/b-
     A                                      ar_top.png\" /></div><div class=\"m-
     A                                      enulinks\"></div><div class=\"image-
     A                                      bottom\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_bottom.png\" /></d-
     A                                      iv><div class=\"bottom\"></div>"},{-
     A                                      "field type":"icon menu button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"32px","z i-
     A                                      ndex":"20","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1170px","id":"ISDS80-
     A                                      F_SCR01_BtnIconMenuSystemTools","to-
     A                                      ol tip":"System Tools","icon alignm-
     A                                      ent":"middle left","icon width":"16-
     A                                      px","icon height":"24px","icon sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/systools.png","data function"-
     A                                      :"SystemToolbarSystools","show down-
     A                                       arrow":"Yes"},{"field type":"panel-
     A                                      ","panel style":"TransformButtonBar-
     A                                      ","id":"ISDS80F_SCR01_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"ISDS80F-
     A                                      _SCR01_BtnSave","tool tip":"Save","-
     A                                      onclick":"SystemToolbarSave","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/save.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "ISDS80F_SCR01_BtnRefresh","tool ti-
     A                                      p":"Refresh","onclick":"SystemToolb-
     A                                      arRefresh","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/refresh.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1092px","id":"ISDS80F_SCR01_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none"')
     A                                  1  4HTML(',"border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1118px","id":"ISDS80F_SCR01_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"ISDS80F_SCR01_BtnSyste-
     A                                      mMessages","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"ISDS80F_SCR01_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"ISDS80F_SCR01_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"ISDS80F_SCR01_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":"Tab 1","active tab":"0",-
     A                                      "left":"250px","top":"70px","width"-
     A                                      :"970px","height":"657px","z index"-
     A                                      :"8","locked in place":"true","css -
     A                                      class":"tab-panel","css class 2":"s-
     A                                      tationary"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      ISDS80F_SCR01_BtnHiddenSave","value-
     A                                      ":"btnSave","top":"100px","response-
     A                                      ":{"fieldName":"btnSave","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"SCF-
     A                                      ILE","field type":"output field","v-
     A                                      alue":{"fieldName":"SCFILE","design-
     A                                      Value":"[SCFILE]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"8"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "110px","cursor row":"1","css class-
     A                                       2":"top-line","description":"FILE -
     A                                      NAME","parent tab panel":"ISDS80F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant1","field type":"o-
     A                                      utput field","value":"Claim Direct -
     A                                      Scan Process","css class":"constant-
     A                                      ","left":"449px","cursor column":"2-
     A                                      6","top":"110px","cursor row":"1","-
     A                                      css class 2":"top-line","css class -
     A                                      3":"HI","parent tab panel":"ISDS80F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"SCRECF","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CRECF","designValue":"[SCRECF]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none","d-
     A                                      ataLength":"10"},"css class":"outpu-
     A                                      t-field","left":"757px","cursor col-
     A                                      umn":"70","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","des-
     A                                      cription":"RECORD FORMAT","parent t-
     A                                      ab panel":"ISDS80F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"ISDS80-
     A                                      F_SCR01_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"ISDS80F_SCR0-
     A                                      1_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt2","field type":"output field","v-
     A                                      alue":"Batch ID     :","css class":-
     A                                      "constant","left":"288px","cursor c-
     A                                      olumn":"3","top":"150px","')
     A                                  1  5HTML('cursor row":"3","parent tab p-
     A                                      anel":"ISDS80F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCBCHI","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCBCHI","designValue":-
     A                                      "[SCBCHI]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none","dataLength":"12"},"css-
     A                                       class":"output-field","left":"393p-
     A                                      x","cursor column":"18","top":"150p-
     A                                      x","cursor row":"3","description":"-
     A                                      BATCH ID","parent tab panel":"ISDS8-
     A                                      0F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant3","field type-
     A                                      ":"output field","value":"-","css c-
     A                                      lass":"constant","left":"484px","cu-
     A                                      rsor column":"31","top":"150px","cu-
     A                                      rsor row":"3","parent tab panel":"I-
     A                                      SDS80F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCBDSC","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCBDSC","designValue":"[SC-
     A                                      BDSC]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","dataLength":"40-
     A                                      "},"left":"498px","cursor column":"-
     A                                      33","top":"150px","cursor row":"3",-
     A                                      "width":"281px","css class 3":"UL",-
     A                                      "set focus":"true","error message":-
     A                                      "Batch Description Can not be Blank-
     A                                      ","error condition":{"fieldName":"2-
     A                                      2","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"ISDS80F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 4":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"ISDS80F_SCR01_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      ISDS80F_SCR01_BtnHiddenDiaryItems",-
     A                                      "value":"btnDiary","top":"175px","r-
     A                                      esponse":{"fieldName":"btnDiary","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant4","field type":"outpu-
     A                                      t field","value":"Enter the Documen-
     A                                      t index, the # of pages in each doc-
     A                                      ument, the # of     ","css class":"-
     A                                      constant","left":"302px","cursor co-
     A                                      lumn":"5","top":"190px","cursor row-
     A                                      ":"5","css class 2":"HI","parent ta-
     A                                      b panel":"ISDS80F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"ISDS80F_SCR01_BtnHiddenSys-
     A                                      temMessages","value":"btnMessage","-
     A                                      top":"200px","response":{"fieldName-
     A                                      ":"btnMessage","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant5","f-
     A                                      ield type":"output field","value":"-
     A                                      documents in this batch, the total -
     A                                      # of pages you expect to process, a-
     A                                      nd","css class":"constant","left":"-
     A                                      302px","cursor column":"5","top":"2-
     A                                      10px","cursor row":"6","css class 2-
     A                                      ":"HI","parent tab panel":"ISDS80F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"ISDS80F_S-
     A                                      CR01_BtnHiddenWorkSubmitJob","value-
     A                                      ":"btnWrksbmjob","top":"225px","res-
     A                                      ponse":{"fieldName":"btnWrkJob","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant6","field type":"output-
     A                                       field","value":"and the document t-
     A                                      ype to be scanned. Press ENTER to s-
     A                                      tart the process.  ","css class":"c-
     A                                      onstant","left":"302px","cursor col-
     A                                      umn":"5","top":"230px","cursor row"-
     A                                      :"7","css class 2":"HI","parent tab-
     A                                       panel":"ISDS80F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"ISDS80F_SCR01_BtnHiddenWork-
     A                                      PrinterOutput","value":"btnWrkprtou-
     A                                      t","top":"250px","response":{"field-
     A                                      Name":"btnWrkPrnt","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant7-
     A                                      ","field type":"output field","valu-
     A                                      e":"Co #:","css class":"constant","-
     A                                      left":"288px","cursor column":"3","-
     A                                      top":"270px","cursor row":"9","css -
     A                                      class 2":"HI","parent tab panel":"I-
     A                                      SDS80F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCCO#","field type-
     A                                      ":"output field","value":{')
     A                                  1  6HTML('"fieldName":"SCCO#","designVa-
     A                                      lue":"[SCCO#]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"3"},"-
     A                                      css class":"output-field","left":"3-
     A                                      30px","cursor column":"9","top":"27-
     A                                      0px","cursor row":"9","error messag-
     A                                      e":"Invalid key","error condition":-
     A                                      {"fieldName":"27","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","parent tab panel":"ISD-
     A                                      S80F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant8","field ty-
     A                                      pe":"output field","value":"Fund:",-
     A                                      "css class":"constant","left":"372p-
     A                                      x","cursor column":"15","top":"270p-
     A                                      x","cursor row":"9","css class 2":"-
     A                                      HI","parent tab panel":"ISDS80F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"SCFND","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      FND","designValue":"[SCFND]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"4"},"text transform":"-
     A                                      uppercase","left":"414px","cursor c-
     A                                      olumn":"21","top":"270px","cursor r-
     A                                      ow":"9","width":"29px","error messa-
     A                                      ge":"Invalid key","error condition"-
     A                                      :{"fieldName":"27","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"IS-
     A                                      DS80F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant9","field t-
     A                                      ype":"output field","value":"Fund y-
     A                                      ear:","css class":"constant","left"-
     A                                      :"456px","cursor column":"27","top"-
     A                                      :"270px","cursor row":"9","css clas-
     A                                      s 2":"HI","parent tab panel":"ISDS8-
     A                                      0F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCFYR","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCFYR","designValue":"[SCFYR]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase","dataLength":"3"},"text transf-
     A                                      orm":"uppercase","left":"533px","cu-
     A                                      rsor column":"38","top":"270px","cu-
     A                                      rsor row":"9","width":"22px","error-
     A                                       message":"Invalid key","error cond-
     A                                      ition":{"fieldName":"27","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"1 message","parent tab pane-
     A                                      l":"ISDS80F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant10","-
     A                                      field type":"output field","value":-
     A                                      "Case#:","css class":"constant","le-
     A                                      ft":"575px","cursor column":"44","t-
     A                                      op":"270px","cursor row":"9","css c-
     A                                      lass 2":"HI","parent tab panel":"IS-
     A                                      DS80F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"SCCASE","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCCASE","designValue":"[SCC-
     A                                      ASE]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase","dataLength":"6"},"text -
     A                                      transform":"uppercase","left":"624p-
     A                                      x","cursor column":"51","top":"270p-
     A                                      x","cursor row":"9","width":"43px",-
     A                                      "error message":"Invalid key","erro-
     A                                      r condition":{"fieldName":"27","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"ISDS80F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"ISDS80F_SCR01_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"ISD-
     A                                      S80F_SCR01_BtnHiddenHelp","value":"-
     A                                      btnHelp","top":"300px","response":{-
     A                                      "fieldName":"btnHelp","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt11","field type":"output field","-
     A                                      value":"Nbr of pages -or- 0 :","css-
     A                                       class":"constant","left":"288px","-
     A                                      cursor column":"3","top":"310px","c-
     A                                      ursor row":"11","parent tab panel":-
     A                                      "ISDS80F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCDLIM","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCDLIM","designValue":"[-
     A                                      SCDLIM]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00","dataLength":"3","')
     A                                  1  7HTML('decPos":"0","numBlankFill":"t-
     A                                      rue"},"left":"442px","cursor column-
     A                                      ":"25","top":"310px","cursor row":"-
     A                                      11","width":"22px","text align":"ri-
     A                                      ght","css class 3":"UL","descriptio-
     A                                      n":"DOCUMENT DELM","parent tab pane-
     A                                      l":"ISDS80F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 4":"profou-
     A                                      nd-converted"},{"id":"constant12","-
     A                                      field type":"output field","value":-
     A                                      "If the # of pages varies, Key 000 -
     A                                      and","css class":"constant","left":-
     A                                      "512px","cursor column":"35","top":-
     A                                      "310px","cursor row":"11","parent t-
     A                                      ab panel":"ISDS80F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt13","field type":"output field","-
     A                                      value":"document separator sheets."-
     A                                      ,"css class":"constant","left":"512-
     A                                      px","cursor column":"35","top":"330-
     A                                      px","cursor row":"12","parent tab p-
     A                                      anel":"ISDS80F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant14-
     A                                      ","field type":"output field","valu-
     A                                      e":"Expected # of docs  :","css cla-
     A                                      ss":"constant","left":"288px","curs-
     A                                      or column":"3","top":"370px","curso-
     A                                      r row":"14","parent tab panel":"ISD-
     A                                      S80F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SC#DCS","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SC#DCS","designValue":"[SC#D-
     A                                      CS]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","dataLength":"5","decPos":"0","-
     A                                      numBlankFill":"true"},"left":"442px-
     A                                      ","cursor column":"25","top":"370px-
     A                                      ","cursor row":"14","width":"36px",-
     A                                      "text align":"right","css class 3":-
     A                                      "UL","error message":"Value must be-
     A                                       greater than zero.","error conditi-
     A                                      on":{"fieldName":"20","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"1 message","description":"DOCS-
     A                                       INM BATCH","parent tab panel":"ISD-
     A                                      S80F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 4":"profound-conv-
     A                                      erted"},{"id":"constant15","field t-
     A                                      ype":"output field","value":"The nu-
     A                                      mber of","css class":"constant","le-
     A                                      ft":"512px","cursor column":"35","t-
     A                                      op":"370px","cursor row":"14","pare-
     A                                      nt tab panel":"ISDS80F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant16","field type":"output fiel-
     A                                      d","value":"documents","css class":-
     A                                      "constant","left":"610px","cursor c-
     A                                      olumn":"49","top":"370px","cursor r-
     A                                      ow":"14","css class 2":"UL","parent-
     A                                       tab panel":"ISDS80F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant17","field type":"output field"-
     A                                      ,"value":"you expect this","css cla-
     A                                      ss":"constant","left":"680px","curs-
     A                                      or column":"59","top":"370px","curs-
     A                                      or row":"14","parent tab panel":"IS-
     A                                      DS80F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant18","field -
     A                                      type":"output field","value":"batch-
     A                                       to contain.","css class":"constant-
     A                                      ","left":"512px","cursor column":"3-
     A                                      5","top":"390px","cursor row":"15",-
     A                                      "parent tab panel":"ISDS80F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant19","field type":"output-
     A                                       field","value":"Expected # of page-
     A                                      s :","css class":"constant","left":-
     A                                      "288px","cursor column":"3","top":"-
     A                                      430px","cursor row":"17","parent ta-
     A                                      b panel":"ISDS80F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SC#PGS"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SC#PGS","design-
     A                                      Value":"[SC#PGS]","dataType":"zoned-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00","dataLength":"5","-
     A                                      decPos":"0","numBlankFill":"true"},-
     A                                      "left":"442px","cursor column":"25"-
     A                                      ,"top":"430px","cursor row":"17","w-
     A                                      idth":"36px","text align":"right","-
     A                                      css class 3":"UL","error message":"-
     A                                      Value must be greater than zero.","-
     A                                      error condition":{"fieldName":"21",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"1 message","descr-
     A                                      iption":"DOCS INM BATCH","parent ta-
     A                                      b panel":"ISDS80F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t20","field type":"output field","v-
     A                                      alue":"The number of","css class":"-
     A                                      constant","left":"512px","cursor co-
     A                                      lumn":"35","top":"430px","cursor ro-
     A                                      w":"17","parent tab panel":"ISDS80F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"constant21","field type"-
     A                                      :"output field","value":"pages","cs-
     A                                      s class":"constant","left":"610px",-
     A                                      "cursor column":"49","top":"430px",-
     A                                      "cursor row":"17","css class 2":"UL-
     A                                      ","parent tab panel":"ISDS80F_SCR01-
     A                                      _MainTabPanel","parent tab')
     A                                  1  8HTML('":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant22","fi-
     A                                      eld type":"output field","value":"y-
     A                                      ou expect this","css class":"consta-
     A                                      nt","left":"652px","cursor column":-
     A                                      "55","top":"430px","cursor row":"17-
     A                                      ","parent tab panel":"ISDS80F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant23","field type":"outp-
     A                                      ut field","value":"batch to contain-
     A                                      .","css class":"constant","left":"5-
     A                                      12px","cursor column":"35","top":"4-
     A                                      50px","cursor row":"18","parent tab-
     A                                       panel":"ISDS80F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      24","field type":"output field","va-
     A                                      lue":"Document type       :","css c-
     A                                      lass":"constant","left":"288px","cu-
     A                                      rsor column":"3","top":"490px","cur-
     A                                      sor row":"20","parent tab panel":"I-
     A                                      SDS80F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCDOCT","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCDOCT","designValue":"[SC-
     A                                      DOCT]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase","dataLength":"8"},"text-
     A                                       transform":"uppercase","left":"442-
     A                                      px","cursor column":"25","top":"490-
     A                                      px","cursor row":"20","width":"57px-
     A                                      ","css class 3":"UL","error message-
     A                                      ":"Document type is invalid.","erro-
     A                                      r condition":{"fieldName":"23","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"ISDS80F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t25","field type":"output field","v-
     A                                      alue":"Darts Comment Date:","css cl-
     A                                      ass":"constant","left":"554px","cur-
     A                                      sor column":"41","top":"490px","cur-
     A                                      sor row":"20","parent tab panel":"I-
     A                                      SDS80F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCCDAT","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCCDAT","designValue":"[SC-
     A                                      CDAT]","dataType":"zoned","formatti-
     A                                      ng":"Date","dataLength":"6","decPos-
     A                                      ":"0","dateFormat":"m/d/y","locale"-
     A                                      :"en_US"},"left":"694px","cursor co-
     A                                      lumn":"61","top":"490px","cursor ro-
     A                                      w":"20","width":"57px","css class 3-
     A                                      ":"UL","error message":"Invalid dat-
     A                                      e","error condition":{"fieldName":"-
     A                                      52","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","p-
     A                                      arent tab panel":"ISDS80F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"id":-
     A                                      "btnSubmit","field type":"button","-
     A                                      value":"Enter","shortcut key":"Ente-
     A                                      r","left":"14px","top":"150px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF03-
     A                                      ","field type":"button","value":"Ex-
     A                                      it","shortcut key":"F3","left":"14p-
     A                                      x","top":"183px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF05","field type"-
     A                                      :"button","value":"Claim search","s-
     A                                      hortcut key":"F5","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF10","field type":"butt-
     A                                      on","value":"Document type search",-
     A                                      "shortcut key":"F10","left":"14px",-
     A                                      "top":"249px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnHELP","field type":"b-
     A                                      utton","shortcut key":"Alt-F1","onc-
     A                                      lick":"pui.showHelp()","value":"HEL-
     A                                      P","left":"14px","top":"282px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SC#DCS         5S 0H
     A            SC#PGS         5S 0H
     A            SCBCHI        12A  H
     A            SCBDSC        40A  H
     A            SCCASE         6A  H
     A            SCCDAT         6S 0H
     A            SCCO#          3A  H
     A            SCDLIM         3S 0H
     A            SCDOCT         8A  H
     A            SCFILE         8A  H
     A            SCFND          4A  H
     A            SCFYR          3A  H
     A            SCRECF        10A  H
     A          R SCR99
     A  07                                  CA01(07 'Response Indicator *IN07')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN07","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"ISDS80F_SCR99_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"ISDS80F_SCR9-
     A                                      9_action","field type":"html contai-
     A                                      ner","white space":"normal","left":-
     A                                      "0px","top":"10px","width":"230px",-
     A                                      "css class":"action-panel-converted-
     A                                      ","height":"700px","html":"<div cla-
     A                                      ss=\"top\"></div><div class=\"image-
     A                                      top\"><img src=\"/profoundui/userda-
     A                                      ta/images/bar_top.png\" /></div><di-
     A                                      v class=\"menulinks\"></div><div cl-
     A                                      ass=\"imagebottom\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_bottom.-
     A                                      png\" /></div><div class=\"bottom\"-
     A                                      ></div>"},{"field type":"icon menu -
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "32px","z index":"20","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1170px","-
     A                                      id":"ISDS80F_SCR99_BtnIconMenuSyste-
     A                                      mTools","tool tip":"System Tools","-
     A                                      icon alignment":"middle left","icon-
     A                                       width":"16px","icon height":"24px"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"ISDS80F_SCR99_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"ISDS80F_SCR99_BtnSave","tool ti-
     A                                      p":"Save","onclick":"SystemToolbarS-
     A                                      ave","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sav-
     A                                      e.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      66px","id":"ISDS80F_SCR99_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"ISD-
     A                                      S80F_SCR99_BtnSearch","tool tip":"S-
     A                                      earch","onclick":"SystemToolbarSear-
     A                                      ch","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/sear-
     A                                      ch.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      118px","id":"ISDS80F_SCR99_BtnDiary-
     A                                      Items","tool tip":"Diary/Work Items-
     A                                       - IDARTS","onclick":"SystemToolbar-
     A                                      Diary","background image":{"fieldNa-
     A                                      me":"DryIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1144p-
     A                                      x","id":"ISDS80F_SCR99_BtnSystemMes-
     A                                      sages","tool tip":"System Messages"-
     A                                      ,"onclick":"SystemToolbarMessages",-
     A                                      "background image":{"fieldName":"Ms-
     A                                      gIcnURL","dataLength":"128')
     A                                  1  4HTML('","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1196px","id":"ISDS80F_SCR99_BtnH-
     A                                      elp","tool tip":"Help","onclick":"S-
     A                                      ystemToolbarHelp","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/help.png'')"},{"id":"ISDS-
     A                                      80F_SCR99_ImgSysToolBottom","field -
     A                                      type":"image","image source":"/prof-
     A                                      oundui/userdata/images/systool/butb-
     A                                      arbot.png","left":"1036px","top":"6-
     A                                      4px","width":"187px","locked in pla-
     A                                      ce":"true","css class":"stationary"-
     A                                      ,"visibility":"hidden"},{"id":"ISDS-
     A                                      80F_SCR99_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":"Tab 1","activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"ISDS80F_SCR99_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"ISDS80F_SCR99_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"ISDS80F_SCR99_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SCERR","field type":"passwo-
     A                                      rd field","css class":"input","css -
     A                                      class 2":"textbox","input only":"tr-
     A                                      ue","value":{"fieldName":"SCERR","d-
     A                                      esignValue":"[SCERR]","dataType":"c-
     A                                      har","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase","dataLen-
     A                                      gth":"1"},"text transform":"upperca-
     A                                      se","left":"288px","cursor column":-
     A                                      "3","top":"150px","cursor row":"3",-
     A                                      "width":"8px","read only":"true","c-
     A                                      ss class 3":"PR","description":"ERR-
     A                                       FLD","parent tab panel":"ISDS80F_S-
     A                                      CR99_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 4":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"ISDS80F_SC-
     A                                      R99_BtnHiddenSearch","value":"btnSe-
     A                                      arch","top":"150px","response":{"fi-
     A                                      eldName":"btnSearch","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"ISDS80F_SCR99_BtnHiddenDia-
     A                                      ryItems","value":"btnDiary","top":"-
     A                                      175px","response":{"fieldName":"btn-
     A                                      Diary","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"ISDS8-
     A                                      0F_SCR99_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"ISDS80F_SCR-
     A                                      99_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"ISDS80F_SCR99_Btn-
     A                                      HiddenWorkPrinterOutput","value":"b-
     A                                      tnWrkprtout","top":"250px","respons-
     A                                      e":{"fieldName":"btnWrkPrnt","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75p')
     A                                  1  5HTML('x","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"ISD-
     A                                      S80F_SCR99_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"ISDS80F_SCR99_B-
     A                                      tnHiddenHelp","value":"btnHelp","to-
     A                                      p":"300px","response":{"fieldName":-
     A                                      "btnHelp","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"btnSubmit","field -
     A                                      type":"button","value":"Enter","sho-
     A                                      rtcut key":"Enter","left":"14px","t-
     A                                      op":"150px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF03","field type":"but-
     A                                      ton","value":"Exit","shortcut key":-
     A                                      "F3","left":"14px","top":"183px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnHE-
     A                                      LP","field type":"button","shortcut-
     A                                       key":"Alt-F1","onclick":"pui.showH-
     A                                      elp()","value":"HELP","left":"14px"-
     A                                      ,"top":"216px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR          1A  H
