     A                                      REF(*LIBL/SCREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 21
     A  22 29 31
     A  32 33 91                            CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    23 RERRMSG    2    C6  -
     A                                        SCYEARC40   YEAR MUST BE ENTERED -
     A                                      FOR THIS INDEX TYPEE1    3     29')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN21","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN22","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN29","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN31","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN32","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN33","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN91","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"return cursor record":-
     A                                      {"fieldName":"HREC","dataLength":"1-
     A                                      0","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"return cursor field":{"fieldNa-
     A                                      me":"HFLD","dataLength":"10","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none"},"vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"HFLD","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"HFLD","designValue":"[-
     A                                      HFLD]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none","dataLength":"10"},"left":"0-
     A                                      px","top":"-30px","css class":"prof-
     A                                      ound-converted"},{"id":"HREC","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"HRE-
     A                                      C","designValue":"[HREC]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"ISGD82F_SCR01_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"ISGD82F_SCR01-
     A                                      _action","field type":"html contain-
     A                                      er","white space":"normal","left":"-
     A                                      0px","top":"10px","width":"230px","-
     A                                      css class":"action-panel-converted"-
     A                                      ,"height":"700px","html":"<div clas-
     A                                      s=\"top\"></div><div class=\"imaget-
     A                                      op\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_top.png\" /></div><div-
     A                                       class=\"menulinks\"></div><div cla-
     A                                      ss=\"imagebottom\"><img src=\"/prof-
     A                                      oundui/userdata/images/bar_bottom.p-
     A                                      ng\" /></div><div class=\"bottom\">-
     A                                      </div>"},{"field type":"icon menu b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      32px","z index":"20","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1170px","i-
     A                                      d":"ISGD82F_SCR01_BtnIconMenuSystem-
     A                                      Tools","tool tip":"System Tools","i-
     A                                      con alignment":"middle left","icon -
     A                                      width":"16px","icon height":"24px",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"ISGD82F_SCR01_But-
     A                                      tonBar","top":"35px","left":"1036px-
     A                                      ","width":"187px","height":"28px","-
     A                                      css class":"stationary","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1040px","id-
     A                                      ":"ISGD82F_SCR01_BtnSave","tool tip-
     A                                      ":"Save","onclick":"SystemToolbarSa-
     A                                      ve","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/save-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"106-
     A                                      6px","id":"ISGD82F_SCR01_BtnRefresh-
     A                                      ","tool tip":"Refresh","onclick":"S-
     A                                      ystemToolbarRefresh","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/refresh.png'')"},{"fie-
     A                                      ld type":"button","css cla')
     A                                  1  4HTML('ss":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"109-
     A                                      2px","id":"ISGD82F_SCR01_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"ISGD82F_-
     A                                      SCR01_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1144px","id":"ISGD82F_SCR0-
     A                                      1_BtnSystemMessages","tool tip":"Sy-
     A                                      stem Messages","onclick":"SystemToo-
     A                                      lbarMessages","background image":{"-
     A                                      fieldName":"MsgIcnURL","dataLength"-
     A                                      :"128","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"}},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1196px","id":"ISGD82F_SCR01_BtnHe-
     A                                      lp","tool tip":"Help","onclick":"Sy-
     A                                      stemToolbarHelp","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/help.png'')"},{"id":"ISGD8-
     A                                      2F_SCR01_ImgSysToolBottom","field t-
     A                                      ype":"image","image source":"/profo-
     A                                      undui/userdata/images/systool/butba-
     A                                      rbot.png","left":"1036px","top":"64-
     A                                      px","width":"187px","locked in plac-
     A                                      e":"true","css class":"stationary",-
     A                                      "visibility":"hidden"},{"id":"ISGD8-
     A                                      2F_SCR01_MainTabPanel","field type"-
     A                                      :"tab panel","tab panel style":"Tra-
     A                                      nsform","tab names":{"fieldName":"S-
     A                                      CPRDS","designValue":"[SCPRDS]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none"},"active tab":-
     A                                      "0","left":"250px","top":"70px","wi-
     A                                      dth":"970px","height":"657px","z in-
     A                                      dex":"8","locked in place":"true","-
     A                                      css class":"tab-panel","css class 2-
     A                                      ":"stationary"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"ISGD82F_SCR01_BtnHiddenSave","v-
     A                                      alue":"btnSave","top":"100px","resp-
     A                                      onse":{"fieldName":"btnSave","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "Q1USER","field type":"output field-
     A                                      ","value":{"fieldName":"Q1USER","de-
     A                                      signValue":"[Q1USER]","refField":"U-
     A                                      SER","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","parent ta-
     A                                      b panel":"ISGD82F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","css class 3":"HI-
     A                                      ","description":"COMPANY NAME","par-
     A                                      ent tab panel":"ISGD82F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 4":"profound-converted"},{"id":"c-
     A                                      onstant1","field type":"output fiel-
     A                                      d","left":"778px","cursor column":"-
     A                                      73","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab panel":"ISGD8-
     A                                      2F_SCR01_MainTabPanel","pa')
     A                                  1  5HTML('rent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"ISGD82F-
     A                                      _SCR01_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"ISGD82F_SCR01-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"Q1PGM",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"Q1PGM","designValue"-
     A                                      :"[Q1PGM]","refField":"DS10","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      130px","cursor row":"2","parent tab-
     A                                       panel":"ISGD82F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCPRDS",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCPRDS","designValue-
     A                                      ":"[SCPRDS]","refField":"NAME","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"414px","cursor column":"21","top-
     A                                      ":"130px","cursor row":"2","css cla-
     A                                      ss 2":"HI","description":"PROGRAM N-
     A                                      AME","parent tab panel":"ISGD82F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 3"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant2","field type":"output field","-
     A                                      value":"SCR01","css class":"constan-
     A                                      t","left":"799px","cursor column":"-
     A                                      76","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"ISGD82F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"ISGD82F_SCR01_Bt-
     A                                      nHiddenSearch","value":"btnSearch",-
     A                                      "top":"150px","response":{"fieldNam-
     A                                      e":"btnSearch","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant3","f-
     A                                      ield type":"output field","value":"-
     A                                      Key Type:","css class":"constant","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"170px","cursor row":"4","pare-
     A                                      nt tab panel":"ISGD82F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      KTYP","field type":"output field","-
     A                                      value":{"fieldName":"SCKTYP","desig-
     A                                      nValue":"[SCKTYP]","refField":"CODE-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"351px","cursor column":"12-
     A                                      ","top":"170px","cursor row":"4","p-
     A                                      arent tab panel":"ISGD82F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"ISGD82F_SCR01_BtnH-
     A                                      iddenDiaryItems","value":"btnDiary"-
     A                                      ,"top":"175px","response":{"fieldNa-
     A                                      me":"btnDiary","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant4","f-
     A                                      ield type":"output field","value":"-
     A                                      Description:","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"190px","cursor row":"5","p-
     A                                      arent tab panel":"ISGD82F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCDESC","field type":"output field-
     A                                      ","value":{"fieldName":"SCDESC","de-
     A                                      signValue":"[SCDESC]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"372px","cursor column":-
     A                                      "15","top":"190px","cursor row":"5"-
     A                                      ,"parent tab panel":"ISGD82F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"ISGD82F_SCR01_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"ISGD82F_SCR01_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","respon')
     A                                  1  6HTML('se":{"fieldName":"btnWrkJob",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant5","field type":"out-
     A                                      put field","value":"To see the corr-
     A                                      esponding DARTS records,","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"230px","cursor-
     A                                       row":"7","css class 2":"BLU","pare-
     A                                      nt tab panel":"ISGD82F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant6","field type":"output field-
     A                                      ","value":"type choices, press Ente-
     A                                      r.","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"2-
     A                                      50px","cursor row":"8","css class 2-
     A                                      ":"BLU","parent tab panel":"ISGD82F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"ISGD82F_-
     A                                      SCR01_BtnHiddenWorkPrinterOutput","-
     A                                      value":"btnWrkprtout","top":"250px"-
     A                                      ,"response":{"fieldName":"btnWrkPrn-
     A                                      t","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"ISGD82F_S-
     A                                      CR01_BtnHiddenImageQueue","value":"-
     A                                      btnImgQue","top":"275px","response"-
     A                                      :{"fieldName":"btnImgQue","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant7","field type":"output field-
     A                                      ","value":"Carrier:","css class":"c-
     A                                      onstant","left":"295px","cursor col-
     A                                      umn":"4","top":"290px","cursor row"-
     A                                      :"10","parent tab panel":"ISGD82F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCARR","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCCARR","designValue":"[SCCARR]","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00","-
     A                                      dataLength":"3","decPos":"0","numBl-
     A                                      ankFill":"true"},"left":"358px","cu-
     A                                      rsor column":"13","top":"290px","cu-
     A                                      rsor row":"10","width":"22px","text-
     A                                       align":"right","css class 3":"HI",-
     A                                      "css class 4":"UL","set focus":{"fi-
     A                                      eldName":"31","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"parent tab pa-
     A                                      nel":"ISGD82F_SCR01_MainTabPanel","-
     A                                      parent tab":"0","css class 5":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"ISGD82F_SCR01_BtnHiddenHelp","-
     A                                      value":"btnHelp","top":"300px","res-
     A                                      ponse":{"fieldName":"btnHelp","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant8","field type":"output f-
     A                                      ield","value":"Client :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"330px","cursor -
     A                                      row":"12","parent tab panel":"ISGD8-
     A                                      2F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCCLNT","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCCLNT","designValue":"[SCCLNT-
     A                                      ]","dataType":"zoned","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"999.0-
     A                                      0","dataLength":"5","decPos":"0","n-
     A                                      umBlankFill":"true"},"left":"358px"-
     A                                      ,"cursor column":"13","top":"330px"-
     A                                      ,"cursor row":"12","width":"36px","-
     A                                      text align":"right","css class 3":"-
     A                                      HI","css class 4":"UL","set focus":-
     A                                      {"fieldName":"33","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"parent ta-
     A                                      b panel":"ISGD82F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 5":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t9","field type":"output field","va-
     A                                      lue":"Year   :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"370px","cursor row":"14"-
     A                                      ,"parent tab panel":"ISGD82F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCYEAR","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCYE-
     A                                      AR","designValue":"[SCYEAR]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"999.00","dataL-
     A                                      ength":"3","decPos":"0","numBlankFi-
     A                                      ll":"true"},"left":"358px","cursor -
     A                                      column":"13","top":"370px","cursor -
     A                                      row":"14","width":"22px","text alig-
     A                                      n":"right","css class 3":"UL","css -
     A                                      class 4":"HI","error message":"YEAR-
     A                                       MUST BE ENTERED FOR THIS INDEX TYP-
     A                                      E","error condition":{"fieldName":"-
     A                                      29","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 me')
     A                                  1  7HTML('ssage","parent tab panel":"IS-
     A                                      GD82F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 5":"profound-con-
     A                                      verted"},{"id":"SCDFT","field type"-
     A                                      :"password field","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCDFT","designValue":-
     A                                      "[SCDFT]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"3","decPos-
     A                                      ":"0"},"left":"337px","cursor colum-
     A                                      n":"10","top":"410px","cursor row":-
     A                                      "16","width":"22px","read only":"tr-
     A                                      ue","css class 3":"PR-UL","parent t-
     A                                      ab panel":"ISGD82F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 4":-
     A                                      "profound-converted"},{"id":"btnSub-
     A                                      mit","field type":"button","value":-
     A                                      "Enter","shortcut key":"Enter","lef-
     A                                      t":"14px","top":"150px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF03","fiel-
     A                                      d type":"button","value":"Exit","sh-
     A                                      ortcut key":"F3","left":"14px","top-
     A                                      ":"183px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF10","field type":"butto-
     A                                      n","value":"Search","shortcut key":-
     A                                      "F10","left":"14px","top":"216px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F12","field type":"button","value":-
     A                                      "Cancel","shortcut key":"F12","left-
     A                                      ":"14px","top":"249px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF13","field-
     A                                       type":"button","value":"Chg user p-
     A                                      arms","shortcut key":"F13","left":"-
     A                                      14px","top":"282px","width":"100px"-
     A                                      ,"height":"23px","css class":"butto-
     A                                      n","auto arrange":"true","cursor":"-
     A                                      default"},{"id":"btnHELP","field ty-
     A                                      pe":"button","shortcut key":"Alt-F1-
     A                                      ","bypass validation":"true","value-
     A                                      ":"HELP","response":{"fieldName":"*-
     A                                      IN10","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"left":"14px","top":"315px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCCARR         3S 0H
     A            SCCLNT         5S 0H
     A            SCDFT          3S 0H
     A            SCYEAR         3S 0H
     A            Q1PGM     R        H      REFFLD(DS10)
     A            Q1USER    R        H      REFFLD(USER)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDESC    R        H      REFFLD(NAME)
     A            SCKTYP    R        H      REFFLD(CODE)
     A            SCPRDS    R        H      REFFLD(NAME)
