     A                                      REF(*LIBL/SCREFP)
     A          R SCR01
     A  07 20 21
     A  22 23 24
     A  25 26 27                            CA01(07 'Response Indicator *IN07')
     A  31 32 33
     A  35 41 42
     A  43 44 46                            CA02(20 'Response Indicator *IN20')
     A  47 48 51
     A  52 53 54
     A  55 57 58                            CA03(21 'Response Indicator *IN21')
     A  80 81 82
     A  83 84 85
     A  86 87 91                            CA04(22 'Response Indicator *IN22')
     A  92 93 94
     A  95 96 98
     A  56 69                               CA05(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(41 'Response Indicator *IN41')
     A                                      SETOF(42 'Response Indicator *IN42')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                      SETOF(44 'Response Indicator *IN44')
     A                                      SETOF(46 'Response Indicator *IN46')
     A                                      SETOF(47 'Response Indicator *IN47')
     A                                      SETOF(48 'Response Indicator *IN48')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(54 'Response Indicator *IN54')
     A                                      SETOF(55 'Response Indicator *IN55')
     A                                      SETOF(57 'Response Indicator *IN57')
     A                                      SETOF(58 'Response Indicator *IN58')
     A                                      SETOF(80 'Response Indicator *IN80')
     A                                      SETOF(81 'Response Indicator *IN81')
     A                                      SETOF(82 'Response Indicator *IN82')
     A                                      SETOF(83 'Response Indicator *IN83')
     A                                      SETOF(84 'Response Indicator *IN84')
     A                                      SETOF(85 'Response Indicator *IN85')
     A                                      SETOF(86 'Response Indicator *IN86')
     A                                      SETOF(87 'Response Indicator *IN87')
     A                                      SETOF(91 'Response Indicator *IN91')
     A                                      SETOF(92 'Response Indicator *IN92')
     A                                      SETOF(93 'Response Indicator *IN93')
     A                                      SETOF(94 'Response Indicator *IN94')
     A                                      SETOF(95 'Response Indicator *IN95')
     A                                      SETOF(96 'Response Indicator *IN96')
     A                                  1  2HTML('QPUIREC34   ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    24 RER-
     A                                      RMSG    2    C6    SCFRPGC74   From-
     A                                       and To Page must be Less than the -
     A                                      # or Pages in the original Document-
     A                                      E1    3     80RERRMSG    2    C6   -
     A                                       SCFRPGC43   To Page must be greate-
     A                                      r than the From Page.E1    3     81-
     A                                      RERRMSG    2    C6    SCFRPGC47   F-
     A                                      rom page cannot be Less than or Equ-
     A                                      al to Zero.E1    3     84RERRMSG   -
     A                                       2    C6    SCTOPGC74   From and To-
     A                                       Page must be Less than the # or Pa-
     A                                      ges in the original DocumentE1    3-
     A                                           80RERRMSG    2    C6    SCTOPG-
     A                                      C43   To Page must be greater than -
     A                                      the From Page.E1    3     81RERRMSG-
     A                                          2    C6    SCTOPGC45   To page -
     A                                      cannot be Less than or Equal to Zer-
     A                                      o.E1    3     85RERRMSG    2    C6 -
     A                                         SCTDCTC26   To Doc Type must be -
     A                                      valid.E1    3     87RERRMSG    2   -
     A                                       C5    SCTOQC26   To Queue ID must -
     A                                      be valid.E1    3     82RERRMSG    2-
     A                                          C5    SCTOQC59   To Queue must -
     A                                      be entered AND/OR Indexing must be -
     A                                      performed.E1    3     86RERRMSG    -
     A                                      2    C6    SCINDXC19   Must be "Y" -
     A                                      or "N".E1    3     83RERRMSG    2  -
     A                                        C6    SCINDXC59   To Queue must b-
     A                                      e entered AND/OR Indexing must be p-
     A                                      erformed.E1    3     86RERRMSGID  5-
     A                                          C6    SCFEINC7    SCM0642C6    -
     A                                      SCMESGC5    *LIBLC0    E1    3     -
     A                                      21RERRMSGID  5    C5    SCMODC7    -
     A                                      SCM0642C6    SCMESGC5    *LIBLC0   -
     A                                       E1    3     21RERRMSGID  5    C6  -
     A                                        SCDEPTC7    SCM0512C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     55RERRMS-
     A                                      GID  5    C6    SCDEPTC7    SCM0501-
     A                                      C6    SCMESGC5    *LIBLC0    E1    -
     A                                      3     51RERRMSGID  5    C6    SCDEP-
     A                                      TC7    SCM0503C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     41RERRMSGID  5 -
     A                                         C6    SCDEPTC7    SCM0545C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     2-
     A                                      4RERRMSGID  5    C6    SCDEPTC7    -
     A                                      SCM0548C6    SCMESGC5    *LIBLC0   -
     A                                       E1    3     25RERRMSGID  5    C6  -
     A                                        SCDEPTC7    SCM0609C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     26RERRMS-
     A                                      GID  5    C6    SCDEPTC7    SCM0610-
     A                                      C6    SCMESGC5    *LIBLC0    E1    -
     A                                      3     27RERRMSGID  5    C6    SCCDA-
     A                                      TC7    SCM0500C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     52RERRMSGID  5 -
     A                                         C6    SCRMTYC7    SCM0512C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     5-
     A                                      5RERRMSGID  5    C6    SCRMTYC7    -
     A                                      SCM0501C6    SCMESGC5    *LIBLC0   -
     A                                       E1    3     51RERRMSGID  5    C6  -
     A                                        SCRMTYC7    SCM0503C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     41RERRMS-
     A                                      GID  5    C6    SCRMTYC7    SCM0545-
     A                                      C6    SCMESGC5    *LIBLC0    E1    -
     A                                      3     24RERRMSGID  5    C6    SCRMT-
     A                                      YC7    SCM0548C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     25RERRMSGID  5 -
     A                                         C6    SCRMTYC7    SCM0609C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     2-
     A                                      6RERRMSGID  5    C6    SCRMTYC7    -
     A                                      SCM0610C6    SCMESGC5    *LIBLC0   -
     A                                       E1    3     27RERRMSGID  5    C6  -
     A                                        SCCOMMC7    SCM0503C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     53RERRMS-
     A                                      GID  5    C6    SCDITPC7    SCM0502-
     A                                      C6    SCMESGC5    *LIBLC0    E1    -
     A                                      3     35RERRMSGID  5    C6    SCDIT-
     A                                      PC7    SCM0605C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     44RERRMSGID  5 -
     A                                         C6    SCDUSRC7    SCM0612C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     5-
     A                                      8')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"RCD","dataLength":"10","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none"},"return c-
     A                                      ursor field":{"fieldName":"FLD","da-
     A                                      taLength":"10","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"return cursor posi-
     A                                      tion":{"fieldName":"POS","dataLengt-
     A                                      h":"4","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","dataType":"zon-
     A                                      ed","formatting":"Number","units":"-
     A                                      ","negNum":"-999.00"},"overlay":"tr-
     A                                      ue","description":"ADD A REMARK","s-
     A                                      et off":{"fieldName":"*IN20","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 2":{"fieldName":"*IN21","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 3-
     A                                      ":{"fieldName":"*IN22","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 4":{-
     A                                      "fieldName":"*IN23","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 5":{"fi-
     A                                      eldName":"*IN24","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"set off 6":{"field-
     A                                      Name":"*IN25","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 7":{"fieldNam-
     A                                      e":"*IN26","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"set off 8":{"fieldName":-
     A                                      "*IN27","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 9":{"fieldName":"*I-
     A                                      N31","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 10":{"fieldName":"*IN3-
     A                                      2","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 11":{"fieldName":"*IN33"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 12":{"fieldName":"*IN35","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 13":{"fieldName":"*IN41","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 14":{"fieldName":"*IN42","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 15":{"fieldName":"*IN43","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       16":{"fieldName":"*IN44","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      7":{"fieldName":"*IN46","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 18"-
     A                                      :{"fieldName":"*IN47","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 19":{-
     A                                      "fieldName":"*IN48","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 20":{"f-
     A                                      ieldName":"*IN51","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 21":{"fie-
     A                                      ldName":"*IN52","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 22":{"field-
     A                                      Name":"*IN53","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 23":{"fieldNa-
     A                                      me":"*IN54","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 24":{"fieldName-
     A                                      ":"*IN55","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 25":{"fieldName":-
     A                                      "*IN57","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 26":{"fieldName":"*-
     A                                      IN58","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 27":{"fieldName":"*IN-
     A                                      91","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 28":{"fieldName":"*IN92-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 29":{"fieldName":"*IN93",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      set off 30":{"fieldName":"*IN94","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"se-
     A                                      t off 31":{"fieldName":"*IN95","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 32":{"fieldName":"*IN96","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"set of-
     A                                      f 33":{"fieldName":"*IN80","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"set off -
     A                                      34":{"fieldName":"*IN81","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 35-
     A                                      ":{"fieldName":"*IN82","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"set off 36":-
     A                                      {"fieldName":"*IN83","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"set o')
     A                                  1  4HTML('ff 37":{"fieldName":"*IN84","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 38":{"fieldName":"*IN85","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 39":{"fieldName":"*IN86","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 40":{"fieldName":"*IN87","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"valid c-
     A                                      ommand key":{"fieldName":"*IN07","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-24"},"items":[{"id"-
     A                                      :"SCKEY","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCKEY","designValue":"[S-
     A                                      CKEY]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "none","dataLength":"40"},"left":"0-
     A                                      px","top":"-30px","css class":"prof-
     A                                      ound-converted"},{"id":"SCARMK","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      CARMK","designValue":"[SCARMK]","re-
     A                                      fField":"FLAG","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCPGFL","field t-
     A                                      ype":"output field","visibility":"h-
     A                                      idden","value":{"fieldName":"SCPGFL-
     A                                      ","designValue":"[SCPGFL]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none"},"left":"0px","top":-
     A                                      "-30px","css class":"profound-conve-
     A                                      rted"},{"id":"SCDCTP","field type":-
     A                                      "output field","visibility":"hidden-
     A                                      ","value":{"fieldName":"SCDCTP","de-
     A                                      signValue":"[SCDCTP]","refField":"C-
     A                                      MDCTP SDCMP","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"none"},"left":"0px","to-
     A                                      p":"-30px","description":"IMAGE Doc-
     A                                      ument Type","css class":"profound-c-
     A                                      onverted"},{"id":"SCPNAM","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"SCPNAM"-
     A                                      ,"designValue":"[SCPNAM]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"left":"0px","top":"-30px-
     A                                      ","css class":"profound-converted"}-
     A                                      ,{"id":"POS","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"POS","designValue":"-
     A                                      [POS]","dataType":"zoned","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","dataLength":"4","decPos":"0"-
     A                                      },"left":"0px","top":"-30px","width-
     A                                      ":"28px","text align":"right","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "SCFL05","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCFL05","designValue":"[-
     A                                      SCFL05]","refField":"CMFL05 SDCMP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one"},"left":"0px","top":"-30px","d-
     A                                      escription":"Storage Location - \"O-
     A                                      \"-Optical, \" \" or \"D\"-DASD","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SCIPTH","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCIPTH","designValue"-
     A                                      :"[SCIPTH]","refField":"CMUSER SDCM-
     A                                      P","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none"},"left":"0px","top":"-30px"-
     A                                      ,"description":"IMAGE PATH","css cl-
     A                                      ass":"profound-converted"},{"id":"S-
     A                                      CDCID","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"SCDCID","designValue":"[SC-
     A                                      DCID]","refField":"CMDCID SDCMP","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"FLD","field type":"output field",-
     A                                      "visibility":"hidden","value":{"fie-
     A                                      ldName":"FLD","designValue":"[FLD]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"10"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"SCPIDX","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"SCPIDX"-
     A                                      ,"designValue":"[SCPIDX]","refField-
     A                                      ":"CMPIDX SDCMP","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"true","curSym":"","units":""-
     A                                      ,"negNum":"-999.00"},"left":"0px","-
     A                                      top":"-30px","width":"35px","text a-
     A                                      lign":"right","description":"IMAGE -
     A                                      PATH","css class":"profound-convert-
     A                                      ed"},{"id":"SCAPID","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SCAPID","desi-
     A                                      gnValue":"[SCAPID]","refField":"CMA-
     A                                      PID SDCMP","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true')
     A                                  1  5HTML('","textTransform":"none"},"le-
     A                                      ft":"0px","top":"-30px","descriptio-
     A                                      n":"Data Application ID","css class-
     A                                      ":"profound-converted"},{"id":"SCID-
     A                                      OC","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"SCIDOC","designValue":"[SCIDO-
     A                                      C]","refField":"CMIDOC SDCMP","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none"}-
     A                                      ,"left":"0px","top":"-30px","descri-
     A                                      ption":"IMAGE Document Name","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      SCQPTY","field type":"output field"-
     A                                      ,"visibility":"hidden","value":{"fi-
     A                                      eldName":"SCQPTY","designValue":"[S-
     A                                      CQPTY]","refField":"CMQPTY SDCMP","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne"},"left":"0px","top":"-30px","de-
     A                                      scription":"IMAGE queue Priority","-
     A                                      css class":"profound-converted"},{"-
     A                                      id":"SCIMGF","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SCIMGF","designValue-
     A                                      ":"[SCIMGF]","refField":"CMIMGF SDC-
     A                                      MP","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"none"},"left":"0px","top":"-30px-
     A                                      ","description":"IMAGE FLAG","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      SCDDSC","field type":"output field"-
     A                                      ,"visibility":"hidden","value":{"fi-
     A                                      eldName":"SCDDSC","designValue":"[S-
     A                                      CDDSC]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none","dataLength":"40"},"left":"-
     A                                      0px","top":"-30px","css class":"pro-
     A                                      found-converted"},{"id":"SCIQUE","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      SCIQUE","designValue":"[SCIQUE]","r-
     A                                      efField":"CMUSER SDCMP","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none"},"left-
     A                                      ":"0px","top":"-30px","description"-
     A                                      :"IMAGE QUEUE","css class":"profoun-
     A                                      d-converted"},{"id":"RCD","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"RCD","d-
     A                                      esignValue":"[RCD]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"SCDOCT","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCDOCT","designValue":"-
     A                                      [SCDOCT]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none","dataLength":"8"},"left":-
     A                                      "0px","top":"-30px","css class":"pr-
     A                                      ofound-converted"},{"id":"ISIS06F_S-
     A                                      CR01_avKeys","field type":"output f-
     A                                      ield","value":{"fieldName":"AV_KEYS-
     A                                      ","dataLength":"1134","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[AV_KEYS]"},"left":"0px","t-
     A                                      op":"0px","visibility":"hidden"},{"-
     A                                      id":"ISIS06F_SCR01_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"ISIS06F_SCR01-
     A                                      _BtnIconMenuSystemTools","tool tip"-
     A                                      :"System Tools","icon alignment":"m-
     A                                      iddle left","icon width":"16px","ic-
     A                                      on height":"24px","icon source":"/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ystools.png","data function":"Syste-
     A                                      mToolbarSystools","show down arrow"-
     A                                      :"Yes"},{"field type":"panel","pane-
     A                                      l style":"TransformButtonBar","id":-
     A                                      "ISIS06F_SCR01_ButtonBar","top":"35-
     A                                      px","left":"1036px","width":"187px"-
     A                                      ,"height":"28px","css class":"stati-
     A                                      onary","visibility":"hidden","locke-
     A                                      d in place":"true"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1040px","id":"ISIS06F_SCR01_-
     A                                      BtnSave","tool tip":"Save","onclick-
     A                                      ":"SystemToolbarSave","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/save.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background')
     A                                  1  6HTML(' color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"ISIS06F_SCR01_BtnRefresh",-
     A                                      "tool tip":"Refresh","onclick":"Sys-
     A                                      temToolbarRefresh","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/refresh.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1092px","id":"ISIS06-
     A                                      F_SCR01_BtnSearch","tool tip":"Sear-
     A                                      ch","onclick":"SystemToolbarSearch"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/search.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1118-
     A                                      px","id":"ISIS06F_SCR01_BtnDiaryIte-
     A                                      ms","tool tip":"Diary/Work Items - -
     A                                      IDARTS","onclick":"SystemToolbarDia-
     A                                      ry","background image":{"fieldName"-
     A                                      :"DryIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1144px",-
     A                                      "id":"ISIS06F_SCR01_BtnSystemMessag-
     A                                      es","tool tip":"System Messages","o-
     A                                      nclick":"SystemToolbarMessages","ba-
     A                                      ckground image":{"fieldName":"MsgIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1196px","id":"I-
     A                                      SIS06F_SCR01_BtnHelp","tool tip":"H-
     A                                      elp","onclick":"SystemToolbarHelp",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/help.png-
     A                                      '')"},{"id":"ISIS06F_SCR01_ImgSysTo-
     A                                      olBottom","field type":"image","ima-
     A                                      ge source":"/profoundui/userdata/im-
     A                                      ages/systool/butbarbot.png","left":-
     A                                      "1036px","top":"64px","width":"187p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den"},{"id":"ISIS06F_SCR01_MainTabP-
     A                                      anel","field type":"tab panel","tab-
     A                                       panel style":"Transform","tab name-
     A                                      s":"Tab 1","active tab":"0","left":-
     A                                      "250px","top":"70px","width":"970px-
     A                                      ","height":"657px","z index":"8","l-
     A                                      ocked in place":"true","css class":-
     A                                      "tab-panel","css class 2":"stationa-
     A                                      ry"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"ISIS06F-
     A                                      _SCR01_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant12-
     A                                      ","field type":"output field","valu-
     A                                      e":"ISIS06F","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class 2":"top-line","parent tab p-
     A                                      anel":"ISIS06F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant23-
     A                                      ","field type":"output field","valu-
     A                                      e":"Split Document Image","css clas-
     A                                      s":"constant","left":"463px","curso-
     A                                      r column":"28","top":"110px","curso-
     A                                      r row":"1","css class 2":"top-line"-
     A                                      ,"css class 3":"HI","parent tab pan-
     A                                      el":"ISIS06F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 4":"profo-
     A                                      und-converted"},{"id":"constant13",-
     A                                      "field type":"output field","value"-
     A                                      :"SCR01","css class":"constant","le-
     A                                      ft":"785px","cursor column":"74","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","parent tab pane-
     A                                      l":"ISIS06F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"ISIS06F_SCR01-
     A                                      _fkeyMenu","field type":"m')
     A                                  1  7HTML('enu","left":"10px","top":"120-
     A                                      px","height":"350px","width":"230px-
     A                                      ","hover background color":"#9AAA61-
     A                                      ","hover text color":"#FFFFFF","bor-
     A                                      der color":"#4C6106","menu option i-
     A                                      ndent":"10px","background color":"#-
     A                                      758B27","css class":"action-menu","-
     A                                      css class 2":"stationary","z index"-
     A                                      :"101"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"ISIS-
     A                                      06F_SCR01_BtnHiddenRefresh","value"-
     A                                      :"btnRefresh","top":"125px","respon-
     A                                      se":{"fieldName":"btnRefresh","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant29","field type":"output -
     A                                      field","value":"Original Document --
     A                                      ------------------------------------
     A                                      -----------------------","css class-
     A                                      ":"constant","left":"274px","cursor-
     A                                       column":"1","top":"130px","cursor -
     A                                      row":"2","css class 2":"HI","parent-
     A                                       tab panel":"ISIS06F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant16","field type":"output field"-
     A                                      ,"value":"Document ID/Path:","css c-
     A                                      lass":"constant","left":"274px","cu-
     A                                      rsor column":"1","top":"150px","cur-
     A                                      sor row":"3","parent tab panel":"IS-
     A                                      IS06F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCDOCI","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCDOCI","designValue":"[SCDOCI]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"12"},"css class":"-
     A                                      output-field","left":"407px","curso-
     A                                      r column":"20","top":"150px","curso-
     A                                      r row":"3","parent tab panel":"ISIS-
     A                                      06F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant18","field ty-
     A                                      pe":"output field","value":"-","css-
     A                                       class":"constant","left":"498px","-
     A                                      cursor column":"33","top":"150px","-
     A                                      cursor row":"3","parent tab panel":-
     A                                      "ISIS06F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCPTH","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPTH","designValue":"[SCPTH]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"40"},"css class":"-
     A                                      output-field","left":"512px","curso-
     A                                      r column":"35","top":"150px","curso-
     A                                      r row":"3","parent tab panel":"ISIS-
     A                                      06F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"ISIS0-
     A                                      6F_SCR01_BtnHiddenSearch","value":"-
     A                                      btnSearch","top":"150px","response"-
     A                                      :{"fieldName":"btnSearch","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant19","field type":"output fiel-
     A                                      d","value":"Batch ID        :","css-
     A                                       class":"constant","left":"274px","-
     A                                      cursor column":"1","top":"170px","c-
     A                                      ursor row":"4","parent tab panel":"-
     A                                      ISIS06F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCBCHI","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCBCHI","designValue":"[SCBCH-
     A                                      I]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"12"},"css class"-
     A                                      :"output-field","left":"407px","cur-
     A                                      sor column":"20","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"IS-
     A                                      IS06F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant17","field -
     A                                      type":"output field","value":"-","c-
     A                                      ss class":"constant","left":"498px"-
     A                                      ,"cursor column":"33","top":"170px"-
     A                                      ,"cursor row":"4","parent tab panel-
     A                                      ":"ISIS06F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCBDSC","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCBDSC","designValue":"[SC-
     A                                      BDSC]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"40"},"css cla-
     A                                      ss":"output-field","left":"512px","-
     A                                      cursor column":"35","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "ISIS06F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      ISIS06F_SCR01_BtnHiddenDiaryItems",-
     A                                      "value":"btnDiary","top":"175px","r-
     A                                      esponse":{"fieldName":"btnDiary","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant22","field type":"outp-
     A                                      ut field","value":"Scan Rep:","css -
     A                                      class":"constant","left":"274px","c-
     A                                      ursor column":"1","top":"190px","cu-
     A                                      rsor row":"5","parent tab ')
     A                                  1  8HTML('panel":"ISIS06F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCS-
     A                                      REP","field type":"output field","v-
     A                                      alue":{"fieldName":"SCSREP","design-
     A                                      Value":"[SCSREP]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none","dataLength":"8"-
     A                                      },"css class":"output-field","left"-
     A                                      :"344px","cursor column":"11","top"-
     A                                      :"190px","cursor row":"5","parent t-
     A                                      ab panel":"ISIS06F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt20","field type":"output field","-
     A                                      value":"# of Pages:","css class":"c-
     A                                      onstant","left":"421px","cursor col-
     A                                      umn":"22","top":"190px","cursor row-
     A                                      ":"5","parent tab panel":"ISIS06F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SC#PGS","field type":"outp-
     A                                      ut field","value":{"fieldName":"SC#-
     A                                      PGS","designValue":"[SC#PGS]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"6","decPos":"0"},"css clas-
     A                                      s":"output-field","left":"505px","c-
     A                                      ursor column":"34","top":"190px","c-
     A                                      ursor row":"5","width":"42px","text-
     A                                       align":"right","parent tab panel":-
     A                                      "ISIS06F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant21","fie-
     A                                      ld type":"output field","value":"Sc-
     A                                      an Date/Time:","css class":"constan-
     A                                      t","left":"568px","cursor column":"-
     A                                      43","top":"190px","cursor row":"5",-
     A                                      "parent tab panel":"ISIS06F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSDAT","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCSDAT","-
     A                                      designValue":"[SCSDAT]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","dataLength"-
     A                                      :"8","decPos":"0","edtWrd":"''  /  -
     A                                      /    ''"},"css class":"output-field-
     A                                      ","left":"680px","cursor column":"5-
     A                                      9","top":"190px","cursor row":"5","-
     A                                      width":"70px","text align":"right",-
     A                                      "parent tab panel":"ISIS06F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCSTIM","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCSTIM","-
     A                                      designValue":"[SCSTIM]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","dataLength"-
     A                                      :"6","decPos":"0","edtWrd":"''  :  -
     A                                      :  ''"},"css class":"output-field",-
     A                                      "left":"757px","cursor column":"70"-
     A                                      ,"top":"190px","cursor row":"5","wi-
     A                                      dth":"56px","text align":"right","p-
     A                                      arent tab panel":"ISIS06F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"ISIS06F_SCR01_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant1","field type":"output field","-
     A                                      value":"Security Level:","css class-
     A                                      ":"constant","left":"687px","cursor-
     A                                       column":"60","top":"210px","cursor-
     A                                       row":"6","css class 2":{"fieldName-
     A                                      ":"56","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 3":{"fiel-
     A                                      dName":"56","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"visibility":{"-
     A                                      fieldName":"N56","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"hidden","customFalse":"visible"}-
     A                                      ,"parent tab panel":"ISIS06F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 4":"profound-converted"},{"i-
     A                                      d":"SCSECL","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCSE-
     A                                      CL","designValue":"[SCSECL]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"3","decPos":"0"},"left":"7-
     A                                      99px","cursor column":"76","top":"2-
     A                                      10px","cursor row":"6","width":"22p-
     A                                      x","css class 3":{"fieldName":"56",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"RI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "56","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"visibility":{"fieldNa-
     A                                      me":"N56","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"hidd-
     A                                      en","customFalse":"visible"},"read -
     A                                      only":{"fieldName":"N56","')
     A                                  1  9HTML('dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"N56","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"parent tab panel-
     A                                      ":"ISIS06F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"ISIS06F_SCR01_BtnHiddenWorkSubmit-
     A                                      Job","value":"btnWrksbmjob","top":"-
     A                                      225px","response":{"fieldName":"btn-
     A                                      WrkJob","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant30","field t-
     A                                      ype":"output field","value":"New (S-
     A                                      plit) Document ---------------------
     A                                      ------------------------------------
     A                                      -- ","css class":"constant","left":-
     A                                      "274px","cursor column":"1","top":"-
     A                                      230px","cursor row":"7","css class -
     A                                      2":"HI","parent tab panel":"ISIS06F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant24","field type"-
     A                                      :"output field","value":"Split info-
     A                                      :","css class":"constant","left":"2-
     A                                      74px","cursor column":"1","top":"25-
     A                                      0px","cursor row":"8","parent tab p-
     A                                      anel":"ISIS06F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"ISIS06F_SCR01_BtnHiddenWorkPr-
     A                                      interOutput","value":"btnWrkprtout"-
     A                                      ,"top":"250px","response":{"fieldNa-
     A                                      me":"btnWrkPrnt","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant25"-
     A                                      ,"field type":"output field","value-
     A                                      ":"From page:","css class":"constan-
     A                                      t","left":"351px","cursor column":"-
     A                                      12","top":"270px","cursor row":"9",-
     A                                      "parent tab panel":"ISIS06F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCFRPG","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCFRP-
     A                                      G","designValue":"[SCFRPG]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"3","decPos":"0","numBlankFi-
     A                                      ll":"true"},"left":"428px","cursor -
     A                                      column":"23","top":"270px","cursor -
     A                                      row":"9","width":"22px","text align-
     A                                      ":"right","set focus":"true","css c-
     A                                      lass 3":"UL","css class 4":"HI","er-
     A                                      ror message":"From and To Page must-
     A                                       be Less than the # or Pages in the-
     A                                       original Document","error conditio-
     A                                      n":{"fieldName":"80","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"3 messages","error message 2":"-
     A                                      To Page must be greater than the Fr-
     A                                      om Page.","error condition 2":{"fie-
     A                                      ldName":"81","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message 3":"Fro-
     A                                      m page cannot be Less than or Equal-
     A                                       to Zero.","error condition 3":{"fi-
     A                                      eldName":"84","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"range low":"1","rang-
     A                                      e high":"999","parent tab panel":"I-
     A                                      SIS06F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 5":"profound-co-
     A                                      nverted"},{"id":"constant26","field-
     A                                       type":"output field","value":"To P-
     A                                      age:","css class":"constant","left"-
     A                                      :"470px","cursor column":"29","top"-
     A                                      :"270px","cursor row":"9","parent t-
     A                                      ab panel":"ISIS06F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCTOPG-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCTOPG","desig-
     A                                      nValue":"[SCTOPG]","dataType":"zone-
     A                                      d","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"-999.00","dataLength":"3-
     A                                      ","decPos":"0","numBlankFill":"true-
     A                                      "},"left":"533px","cursor column":"-
     A                                      38","top":"270px","cursor row":"9",-
     A                                      "width":"22px","text align":"right"-
     A                                      ,"css class 3":"HI","css class 4":"-
     A                                      UL","error message":"From and To Pa-
     A                                      ge must be Less than the # or Pages-
     A                                       in the original Document","error c-
     A                                      ondition":{"fieldName":"80","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"3 messages","error messa-
     A                                      ge 2":"To Page must be greater than-
     A                                       the From Page.","error condition 2-
     A                                      ":{"fieldName":"81","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      3":"To page cannot be Less than or -
     A                                      Equal to Zero.","error condition 3"-
     A                                      :{"fieldName":"85","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"range low":"1",-
     A                                      "range high":"999","parent tab pane-
     A                                      l":"ISIS06F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 5')
     A                                  1 10HTML('":"profound-converted"},{"id"-
     A                                      :"constant31","field type":"output -
     A                                      field","value":"Doc Type:","css cla-
     A                                      ss":"constant","left":"575px","curs-
     A                                      or column":"44","top":"270px","curs-
     A                                      or row":"9","parent tab panel":"ISI-
     A                                      S06F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCTDCT","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCTDCT","designValue":"[SCTD-
     A                                      CT]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase","dataLength":"8"},"text t-
     A                                      ransform":"uppercase","left":"645px-
     A                                      ","cursor column":"54","top":"270px-
     A                                      ","cursor row":"9","width":"57px","-
     A                                      css class 3":"UL","error message":"-
     A                                      To Doc Type must be valid.","error -
     A                                      condition":{"fieldName":"87","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","parent tab -
     A                                      panel":"ISIS06F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"ISIS06F_SCR01_BtnHiddenImage-
     A                                      Queue","value":"btnImgQue","top":"2-
     A                                      75px","response":{"fieldName":"btnI-
     A                                      mgQue","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"ISIS0-
     A                                      6F_SCR01_BtnHiddenHelp","value":"bt-
     A                                      nHelp","top":"300px","response":{"f-
     A                                      ieldName":"btnHelp","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      7","field type":"output field","val-
     A                                      ue":"AGENT","css class":"constant",-
     A                                      "left":"274px","cursor column":"1",-
     A                                      "top":"310px","cursor row":"11","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "ISIS06F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant14","fie-
     A                                      ld type":"output field","value":"In-
     A                                      dex","css class":"constant","left":-
     A                                      "323px","cursor column":"8","top":"-
     A                                      310px","cursor row":"11","parent ta-
     A                                      b panel":"ISIS06F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t15","field type":"output field","v-
     A                                      alue":"** NOTES **","css class":"co-
     A                                      nstant","left":"400px","cursor colu-
     A                                      mn":"19","top":"310px","cursor row"-
     A                                      :"11","css class 2":"HI","css class-
     A                                       3":"RI","visibility":{"fieldName":-
     A                                      "N69","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"hidden",-
     A                                      "customFalse":"visible"},"parent ta-
     A                                      b panel":"ISIS06F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t27","field type":"output field","v-
     A                                      alue":"To Queue:","css class":"cons-
     A                                      tant","left":"575px","cursor column-
     A                                      ":"44","top":"310px","cursor row":"-
     A                                      11","parent tab panel":"ISIS06F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCTOQ","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      TOQ","designValue":"[SCTOQ]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"10"},"text transform":-
     A                                      "uppercase","left":"645px","cursor -
     A                                      column":"54","top":"310px","cursor -
     A                                      row":"11","width":"71px","css class-
     A                                       3":"UL","error message":"To Queue -
     A                                      ID must be valid.","error condition-
     A                                      ":{"fieldName":"82","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"2 messages","error message 2":"T-
     A                                      o Queue must be entered AND/OR Inde-
     A                                      xing must be performed.","error con-
     A                                      dition 2":{"fieldName":"86","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"parent-
     A                                       tab panel":"ISIS06F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant28","field type":"output field"-
     A                                      ,"value":"Index?-","css class":"con-
     A                                      stant","left":"736px","cursor colum-
     A                                      n":"67","top":"310px","cursor row":-
     A                                      "11","parent tab panel":"ISIS06F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCINDX","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCINDX","designValue":"[SCINDX]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"1"},"text transfor-
     A                                      m":"uppercase","left":"792px","curs-
     A                                      or column":"75","top":"310px","curs-
     A                                      or row":"11","width":"8px","css cla-
     A                                      ss 3":"UL","css class 4":"HI","erro-
     A                                      r message":"Must be \"Y\" or \"N\".-
     A                                      ","error condition":{"fieldName":"8-
     A                                      3","dataType":"expression"')
     A                                  1 11HTML(',"formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "2 messages","error message 2":"To -
     A                                      Queue must be entered AND/OR Indexi-
     A                                      ng must be performed.","error condi-
     A                                      tion 2":{"fieldName":"86","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"valid va-
     A                                      lues":"Y,N","parent tab panel":"ISI-
     A                                      S06F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 5":"profound-conv-
     A                                      erted"},{"id":"constant11","field t-
     A                                      ype":"output field","value":"______-
     A                                      ___________________________________-
     A                                      ___________________________________-
     A                                      ___","css class":"constant","left":-
     A                                      "274px","cursor column":"1","top":"-
     A                                      330px","cursor row":"12","parent ta-
     A                                      b panel":"ISIS06F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t8","field type":"output field","va-
     A                                      lue":"Agent Fein:","css class":"con-
     A                                      stant","left":"274px","cursor colum-
     A                                      n":"1","top":"350px","cursor row":"-
     A                                      13","parent tab panel":"ISIS06F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCFEIN","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CFEIN","designValue":"[SCFEIN]","re-
     A                                      fField":"PREF01/FEIN *LIBL/SCREFP",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","numBlankFill":"true"},"left":"-
     A                                      358px","cursor column":"13","top":"-
     A                                      350px","cursor row":"13","width":"6-
     A                                      4px","text align":"right","css clas-
     A                                      s 3":"CS","css class 4":"UL","error-
     A                                       message id":"SCM0642","error messa-
     A                                      ge file":"SCMESG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"21","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"error messages":"1-
     A                                       message","parent tab panel":"ISIS0-
     A                                      6F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 5":"profound-conver-
     A                                      ted"},{"id":"constant9","field type-
     A                                      ":"output field","value":"Mod:","cs-
     A                                      s class":"constant","left":"442px",-
     A                                      "cursor column":"25","top":"350px",-
     A                                      "cursor row":"13","parent tab panel-
     A                                      ":"ISIS06F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCMOD","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCMOD","designValue":"[-
     A                                      SCMOD]","refField":"PREF01/MOD *LIB-
     A                                      L/WREFP","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00","numBlankFill":"true"}-
     A                                      ,"left":"477px","cursor column":"30-
     A                                      ","top":"350px","cursor row":"13","-
     A                                      width":"22px","text align":"right",-
     A                                      "css class 3":"CS","css class 4":"U-
     A                                      L","error message id":"SCM0642","er-
     A                                      ror message file":"SCMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"21","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"1 message","parent tab pane-
     A                                      l":"ISIS06F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 5":"profou-
     A                                      nd-converted"},{"id":"constant6","f-
     A                                      ield type":"output field","value":"-
     A                                      Department:","css class":"constant"-
     A                                      ,"left":"274px","cursor column":"1"-
     A                                      ,"top":"390px","cursor row":"15","p-
     A                                      arent tab panel":"ISIS06F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCDEPT","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCDEPT"-
     A                                      ,"designValue":"[SCDEPT]","refField-
     A                                      ":"CMRMCD SDCMP 2","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"358-
     A                                      px","cursor column":"13","top":"390-
     A                                      px","cursor row":"15","width":"15px-
     A                                      ","css class 3":{"fieldName":"N98",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"CS","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N98","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"read only":{"fieldNa-
     A                                      me":"20 or 98","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 5"-
     A                                      :{"fieldName":"20 or 98","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"e-
     A                                      rror message id":"SCM0512","error m-
     A                                      essage file":"SCMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"55","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"7 messages","error message id 2"-
     A                                      :"SCM0501","error message file 2":"-
     A                                      SCMESG","error message library 2":"-
     A                                      *LIBL","error condition 2":{"fieldN-
     A                                      ame":"51","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message i')
     A                                  1 12HTML('d 3":"SCM0503","error message-
     A                                       file 3":"SCMESG","error message li-
     A                                      brary 3":"*LIBL","error condition 3-
     A                                      ":{"fieldName":"41","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error message -
     A                                      id 4":"SCM0545","error message file-
     A                                       4":"SCMESG","error message library-
     A                                       4":"*LIBL","error condition 4":{"f-
     A                                      ieldName":"24","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error message id 5"-
     A                                      :"SCM0548","error message file 5":"-
     A                                      SCMESG","error message library 5":"-
     A                                      *LIBL","error condition 5":{"fieldN-
     A                                      ame":"25","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error message id 6":"SCM-
     A                                      0609","error message file 6":"SCMES-
     A                                      G","error message library 6":"*LIBL-
     A                                      ","error condition 6":{"fieldName":-
     A                                      "26","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error message id 7":"SCM0610"-
     A                                      ,"error message file 7":"SCMESG","e-
     A                                      rror message library 7":"*LIBL","er-
     A                                      ror condition 7":{"fieldName":"27",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "parent tab panel":"ISIS06F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant5","field type":"output -
     A                                      field","value":"Dt:","css class":"c-
     A                                      onstant","left":"274px","cursor col-
     A                                      umn":"1","top":"430px","cursor row"-
     A                                      :"17","css class 2":"HI","parent ta-
     A                                      b panel":"ISIS06F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCCDAT"-
     A                                      ,"field type":"date field","css cla-
     A                                      ss":"input","css class 2":"date-fie-
     A                                      ld","value":{"fieldName":"SCCDAT","-
     A                                      designValue":"[SCCDAT]","refField":-
     A                                      "CMCDAT SDCMP 8 00","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"-999.00","edtWrd":"-
     A                                      ''  /  /    ''","dateFormat":"m/d/Y-
     A                                      "},"left":"302px","cursor column":"-
     A                                      5","top":"430px","cursor row":"17",-
     A                                      "width":"71px","css class 3":"CS","-
     A                                      css class 4":"UL","error message id-
     A                                      ":"SCM0500","error message file":"S-
     A                                      CMESG","error message library":"*LI-
     A                                      BL","error condition":{"fieldName":-
     A                                      "52","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"1 message","-
     A                                      parent tab panel":"ISIS06F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 5":"profound-converted"},{"id"-
     A                                      :"constant4","field type":"output f-
     A                                      ield","value":"Ty:","css class":"co-
     A                                      nstant","left":"379px","cursor colu-
     A                                      mn":"16","top":"430px","cursor row"-
     A                                      :"17","css class 2":"HI","parent ta-
     A                                      b panel":"ISIS06F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCRMTY"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCRMTY","design-
     A                                      Value":"[SCRMTY]","refField":"CMRMC-
     A                                      D SDCMP 3","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"407px","cur-
     A                                      sor column":"20","top":"430px","cur-
     A                                      sor row":"17","width":"22px","css c-
     A                                      lass 3":{"fieldName":"N98","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"CS","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N98","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"read only":{"fieldName":"20 -
     A                                      or 98","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"20 or 98","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"error mes-
     A                                      sage id":"SCM0512","error message f-
     A                                      ile":"SCMESG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"55","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"7 mes-
     A                                      sages","error message id 2":"SCM050-
     A                                      1","error message file 2":"SCMESG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"51-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 3":"SCM0503","e-
     A                                      rror message file 3":"SCMESG","erro-
     A                                      r message library 3":"*LIBL","error-
     A                                       condition 3":{"fieldName":"41","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 4":"SCM0545","error -
     A                                      message file 4":"SCMESG","error mes-
     A                                      sage library 4":"*LIBL","error cond-
     A                                      ition 4":{"fieldName":"24","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essage id 5":"SCM0548","error messa-
     A                                      ge file 5":"SCMESG","error message -
     A                                      library 5":"*LIBL","error condition-
     A                                       5":{"fieldName":"25","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      e id 6":"SCM0609","error m')
     A                                  1 13HTML('essage file 6":"SCMESG","erro-
     A                                      r message library 6":"*LIBL","error-
     A                                       condition 6":{"fieldName":"26","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 7":"SCM0610","error -
     A                                      message file 7":"SCMESG","error mes-
     A                                      sage library 7":"*LIBL","error cond-
     A                                      ition 7":{"fieldName":"27","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"ISIS06F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant10","field type":"output field",-
     A                                      "value":"Comment:","css class":"con-
     A                                      stant","left":"435px","cursor colum-
     A                                      n":"24","top":"430px","cursor row":-
     A                                      "17","css class 2":"HI","parent tab-
     A                                       panel":"ISIS06F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SCCOMM",-
     A                                      "field type":"text area","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCCOMM","desig-
     A                                      nValue":"[SCCOMM]","refField":"CMCO-
     A                                      MM SDCMP","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true"},"left":-
     A                                      "498px","cursor column":"33","top":-
     A                                      "430px","cursor row":"17","width":"-
     A                                      336px","height":"80px","css class 3-
     A                                      ":"CS","css class 4":"UL","error me-
     A                                      ssage id":"SCM0503","error message -
     A                                      file":"SCMESG","error message libra-
     A                                      ry":"*LIBL","error condition":{"fie-
     A                                      ldName":"53","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"1 me-
     A                                      ssage","parent tab panel":"ISIS06F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 5":"profound-converted-
     A                                      "},{"id":"constant3","field type":"-
     A                                      output field","value":"Diary Type:"-
     A                                      ,"css class":"constant","left":"288-
     A                                      px","cursor column":"3","top":"530p-
     A                                      x","cursor row":"22","css class 2":-
     A                                      "HI","parent tab panel":"ISIS06F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCDITP","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCDITP","designValue":"[SCDITP]","r-
     A                                      efField":"FLAG","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"372px"-
     A                                      ,"cursor column":"15","top":"530px"-
     A                                      ,"cursor row":"22","width":"8px","r-
     A                                      ead only":{"fieldName":"20","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":{"fieldName":"20","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"css class 4":"CS","css class -
     A                                      5":"UL","error message id":"SCM0502-
     A                                      ","error message file":"SCMESG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"35","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r messages":"2 messages","error mes-
     A                                      sage id 2":"SCM0605","error message-
     A                                       file 2":"SCMESG","error message li-
     A                                      brary 2":"*LIBL","error condition 2-
     A                                      ":{"fieldName":"44","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"ISIS06F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"constant2","-
     A                                      field type":"output field","value":-
     A                                      "Diary User:","css class":"constant-
     A                                      ","left":"393px","cursor column":"1-
     A                                      8","top":"530px","cursor row":"22",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"ISIS06F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCDUSR","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCDUSR","designValue"-
     A                                      :"[SCDUSR]","refField":"CMUSER SDCM-
     A                                      P","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"477px","cursor colu-
     A                                      mn":"30","top":"530px","cursor row"-
     A                                      :"22","width":"71px","css class 3":-
     A                                      "CS","css class 4":"UL","error mess-
     A                                      age id":"SCM0612","error message fi-
     A                                      le":"SCMESG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"58","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"1 mess-
     A                                      age","description":"Diary User","pa-
     A                                      rent tab panel":"ISIS06F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 5":"profound-converted"},{"id":"-
     A                                      SCRETN","field type":"password fiel-
     A                                      d","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CRETN","designValue":"[SCRETN]","re-
     A                                      fField":"FLAG","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","left":"393px",-
     A                                      "cursor column":"18","top":"550px",-
     A                                      "cursor row":"23","width":"8px","va-
     A                                      lid values":"Y,N, ","parent tab pan-
     A                                      el":"ISIS06F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class ')
     A                                  1 14HTML('3":"profound-converted"},{"id-
     A                                      ":"SCCML1","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCCML1","-
     A                                      designValue":"[SCCML1]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"78"},"css class":"output-field"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"570px","cursor row":"24","d-
     A                                      escription":"CMD KEYS","parent tab -
     A                                      panel":"ISIS06F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"Enter","left":-
     A                                      "14px","top":"150px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF03","field t-
     A                                      ype":"button","value":"F3","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF05","field type":"button","v-
     A                                      alue":"F5","shortcut key":"F5","lef-
     A                                      t":"14px","top":"216px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF06","fiel-
     A                                      d type":"button","value":"F6","shor-
     A                                      tcut key":"F6","left":"14px","top":-
     A                                      "249px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF07","field type":"button"-
     A                                      ,"value":"F7","shortcut key":"F7","-
     A                                      left":"14px","top":"282px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF08","f-
     A                                      ield type":"button","value":"F8","s-
     A                                      hortcut key":"F8","left":"14px","to-
     A                                      p":"315px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF09","field type":"butt-
     A                                      on","value":"F9","shortcut key":"F9-
     A                                      ","left":"14px","top":"348px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF10"-
     A                                      ,"field type":"button","value":"F10-
     A                                      ","shortcut key":"F10","left":"14px-
     A                                      ","top":"381px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF12","field type":-
     A                                      "button","value":"F12","shortcut ke-
     A                                      y":"F12","left":"14px","top":"414px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF13","field type":"button","valu-
     A                                      e":"F13","shortcut key":"F13","left-
     A                                      ":"14px","top":"447px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF16","field-
     A                                       type":"button","value":"F16","shor-
     A                                      tcut key":"F16","left":"14px","top"-
     A                                      :"480px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF17","field type":"button-
     A                                      ","value":"F17","shortcut key":"F17-
     A                                      ","left":"14px","top":"513px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF20"-
     A                                      ,"field type":"button","value":"F20-
     A                                      ","shortcut key":"F20","left":"14px-
     A                                      ","top":"546px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnCF23","field type":-
     A                                      "button","value":"F23","shortcut ke-
     A                                      y":"F23","left":"14px","top":"579px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF24","field type":"button","valu-
     A                                      e":"F24","shortcut key":"F24","left-
     A                                      ":"14px","top":"612px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnHELP","field-
     A                                       type":"button","shortcut key":"Alt-
     A                                      -F1","onclick":"pui.showHelp()","va-
     A                                      lue":"HELP","left":"14px","top":"64-
     A                                      5px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            FLD           10A  H
     A            MSGICNURL    128A  H
     A            POS            4S 0H
     A            RCD           10A  H
     A            SC#PGS         6S 0H
     A            SCBCHI        12A  H
     A            SCBDSC        40A  H
     A            SCCML1        78A  H
     A            SCDDSC        40A  H
     A            SCDOCI        12A  H
     A            SCDOCT         8A  H
     A            SCFRPG         3S 0H
     A            SCINDX         1A  H
     A            SCKEY         40A  H
     A            SCPNAM        10A  H
     A            SCPTH         40A  H
     A            SCSDAT         8S 0H
     A            SCSECL         3S 0H
     A            SCSREP         8A  H
     A            SCSTIM         6S 0H
     A            SCTDCT         8A  H
     A            SCTOPG         3S 0H
     A            SCTOQ         10A  H
     A            SCAPID    R        H      REFFLD(CMAPID SDCMP)
     A            SCARMK    R        H      REFFLD(FLAG)
     A            SCCDAT    R    8 00H      REFFLD(CMCDAT SDCMP)
     A            SCCOMM    R        H      REFFLD(CMCOMM SDCMP)
     A            SCDCID    R        H      REFFLD(CMDCID SDCMP)
     A            SCDCTP    R        H      REFFLD(CMDCTP SDCMP)
     A            SCDEPT    R    2   H      REFFLD(CMRMCD SDCMP)
     A            SCDITP    R        H      REFFLD(FLAG)
     A            SCDUSR    R        H      REFFLD(CMUSER SDCMP)
     A            SCFEIN    R        H      REFFLD(PREF01/FEIN *LIBL/SCREFP)
     A            SCFL05    R        H      REFFLD(CMFL05 SDCMP)
     A            SCIDOC    R        H      REFFLD(CMIDOC SDCMP)
     A            SCIMGF    R        H      REFFLD(CMIMGF SDCMP)
     A            SCIPTH    R        H      REFFLD(CMUSER SDCMP)
     A            SCIQUE    R        H      REFFLD(CMUSER SDCMP)
     A            SCMOD     R        H      REFFLD(PREF01/MOD *LIBL/WREFP)
     A            SCPGFL    R        H      REFFLD(FLAG)
     A            SCPIDX    R        H      REFFLD(CMPIDX SDCMP)
     A            SCQPTY    R        H      REFFLD(CMQPTY SDCMP)
     A            SCRETN    R        H      REFFLD(FLAG)
     A            SCRMTY    R    3   H      REFFLD(CMRMCD SDCMP)
     A          R SCR99
     A  07                                  CA01(07 'Response Indicator *IN07')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN07","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"ISIS06F_SCR99_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"ISIS06F_SCR9-
     A                                      9_action","field type":"html contai-
     A                                      ner","white space":"normal","left":-
     A                                      "0px","top":"10px","width":"230px",-
     A                                      "css class":"action-panel-converted-
     A                                      ","height":"700px","html":"<div cla-
     A                                      ss=\"top\"></div><div class=\"image-
     A                                      top\"><img src=\"/profoundui/userda-
     A                                      ta/images/bar_top.png\" /></div><di-
     A                                      v class=\"menulinks\"></div><div cl-
     A                                      ass=\"imagebottom\"><img src=\"/pro-
     A                                      foundui/userdata/images/bar_bottom.-
     A                                      png\" /></div><div class=\"bottom\"-
     A                                      ></div>"},{"field type":"icon menu -
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "32px","z index":"20","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1170px","-
     A                                      id":"ISIS06F_SCR99_BtnIconMenuSyste-
     A                                      mTools","tool tip":"System Tools","-
     A                                      icon alignment":"middle left","icon-
     A                                       width":"16px","icon height":"24px"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"ISIS06F_SCR99_Bu-
     A                                      ttonBar","top":"35px","left":"1036p-
     A                                      x","width":"187px","height":"28px",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1040px","i-
     A                                      d":"ISIS06F_SCR99_BtnSave","tool ti-
     A                                      p":"Save","onclick":"SystemToolbarS-
     A                                      ave","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sav-
     A                                      e.png'')"},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"10-
     A                                      66px","id":"ISIS06F_SCR99_BtnRefres-
     A                                      h","tool tip":"Refresh","onclick":"-
     A                                      SystemToolbarRefresh","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/refresh.png'')"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1092px","id":"ISI-
     A                                      S06F_SCR99_BtnSearch","tool tip":"S-
     A                                      earch","onclick":"SystemToolbarSear-
     A                                      ch","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/sear-
     A                                      ch.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      118px","id":"ISIS06F_SCR99_BtnDiary-
     A                                      Items","tool tip":"Diary/Work Items-
     A                                       - IDARTS","onclick":"SystemToolbar-
     A                                      Diary","background image":{"fieldNa-
     A                                      me":"DryIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1144p-
     A                                      x","id":"ISIS06F_SCR99_BtnSystemMes-
     A                                      sages","tool tip":"System Messages"-
     A                                      ,"onclick":"SystemToolbarMessages",-
     A                                      "background image":{"fieldName":"Ms-
     A                                      gIcnURL","dataLength":"128')
     A                                  1  4HTML('","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1196px","id":"ISIS06F_SCR99_BtnH-
     A                                      elp","tool tip":"Help","onclick":"S-
     A                                      ystemToolbarHelp","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/help.png'')"},{"id":"ISIS-
     A                                      06F_SCR99_ImgSysToolBottom","field -
     A                                      type":"image","image source":"/prof-
     A                                      oundui/userdata/images/systool/butb-
     A                                      arbot.png","left":"1036px","top":"6-
     A                                      4px","width":"187px","locked in pla-
     A                                      ce":"true","css class":"stationary"-
     A                                      ,"visibility":"hidden"},{"id":"ISIS-
     A                                      06F_SCR99_MainTabPanel","field type-
     A                                      ":"tab panel","tab panel style":"Tr-
     A                                      ansform","tab names":"Tab 1","activ-
     A                                      e tab":"0","left":"250px","top":"70-
     A                                      px","width":"970px","height":"657px-
     A                                      ","z index":"8","locked in place":"-
     A                                      true","css class":"tab-panel","css -
     A                                      class 2":"stationary"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"ISIS06F_SCR99_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"ISIS06F_SCR99_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"ISIS06F_SCR99_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SCERR","field type":"passwo-
     A                                      rd field","css class":"input","css -
     A                                      class 2":"textbox","input only":"tr-
     A                                      ue","value":{"fieldName":"SCERR","d-
     A                                      esignValue":"[SCERR]","refField":"F-
     A                                      LAG","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase"},"text transform":"u-
     A                                      ppercase","left":"288px","cursor co-
     A                                      lumn":"3","top":"150px","cursor row-
     A                                      ":"3","width":"8px","read only":"tr-
     A                                      ue","css class 3":"PR","parent tab -
     A                                      panel":"ISIS06F_SCR99_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"ISIS06F_SCR99_BtnHiddenSearc-
     A                                      h","value":"btnSearch","top":"150px-
     A                                      ","response":{"fieldName":"btnSearc-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"ISIS06F_S-
     A                                      CR99_BtnHiddenDiaryItems","value":"-
     A                                      btnDiary","top":"175px","response":-
     A                                      {"fieldName":"btnDiary","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"ISIS06F_SCR99_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"ISIS06F_SCR99_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      ISIS06F_SCR99_BtnHiddenWorkPrinterO-
     A                                      utput","value":"btnWrkprtout","top"-
     A                                      :"250px","response":{"fieldName":"b-
     A                                      tnWrkPrnt","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in plac')
     A                                  1  5HTML('e":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"ISIS06F_SCR99_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"ISIS06F_SCR99_BtnHiddenHelp","val-
     A                                      ue":"btnHelp","top":"300px","respon-
     A                                      se":{"fieldName":"btnHelp","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"150px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF03",-
     A                                      "field type":"button","value":"F3",-
     A                                      "shortcut key":"F3","left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnHELP","field type":"bu-
     A                                      tton","shortcut key":"Alt-F1","oncl-
     A                                      ick":"pui.showHelp()","value":"HELP-
     A                                      ","left":"14px","top":"216px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
