     A          R RCDPANEL
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdPanel","description":"Base P-
     A                                      anel for Work with Fee Schedule Rul-
     A                                      es Maintenance","overlay":"true","a-
     A                                      ssume":"true"},"items":[{"id":"BtnT-
     A                                      abClick","field type":"button","css-
     A                                       class":"button","value":"Tab Click-
     A                                      ","response":{"fieldName":"BtnTabCl-
     A                                      k","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"1115px","top":"15px","width-
     A                                      ":"100px","visibility":"hidden"},{"-
     A                                      id":"HeadingFSRules","field type":"-
     A                                      output field","css class":"heading"-
     A                                      ,"description":"Work with State Rul-
     A                                      es Maintenance","value":"State Rule-
     A                                      s Maintenance","left":"255px","top"-
     A                                      :"20px","width":"345px","heading ty-
     A                                      pe":"Page Title"},{"id":"TxbSCCO#",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","description":"SCCO# box","-
     A                                      value":{"fieldName":"scCo#","refFie-
     A                                      ld":"elco# wdelp","numSep":"false",-
     A                                      "zeroBalance":"false","numBlankFill-
     A                                      ":"false","zeroFill":"false","noExt-
     A                                      raSpaces":"false","curSym":"","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scCo#]"},"left":"93-
     A                                      0px","top":"40px","width":"70px","c-
     A                                      ss class 2":"textbox","visibility":-
     A                                      "hidden"},{"id":"btnSave","field ty-
     A                                      pe":"button","css class":"button","-
     A                                      value":"Save","response":{"fieldNam-
     A                                      e":"BtnSave","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"left":"1015px","top":"40-
     A                                      px","width":"100px","visibility":"h-
     A                                      idden","shortcut key":"Enter"},{"id-
     A                                      ":"btnRefresh","field type":"button-
     A                                      ","css class":"button","value":"Ref-
     A                                      resh","response":{"fieldName":"BtnR-
     A                                      efresh","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"left":"1115px","top":"40px","-
     A                                      width":"100px","visibility":"hidden-
     A                                      "},{"id":"TabFSRules","field type":-
     A                                      "tab panel","css class":"tab-panel"-
     A                                      ,"left":"250px","top":"70px","heigh-
     A                                      t":{"fieldName":"pnlHeight","dataLe-
     A                                      ngth":"5","decPos":"0","numSep":"fa-
     A                                      lse","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"false","-
     A                                      noExtraSpaces":"false","curSym":"",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":"p-
     A                                      x","designValue":""},"width":"970px-
     A                                      ","z index":"8","tab panel style":"-
     A                                      CompSuite Tab Panel","tab names":"S-
     A                                      tate Rules Maintenance ","active ta-
     A                                      b":{"fieldName":"tabIndex1","dataLe-
     A                                      ngth":"5","decPos":"0","numSep":"fa-
     A                                      lse","zeroBalance":"false","numBlan-
     A                                      kFill":"false","zeroFill":"false","-
     A                                      noExtraSpaces":"false","curSym":"",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":""-
     A                                      },"visibility":{"fieldName":"visPnl-
     A                                      1","customTrue":"","c')
     A                                  1  2HTML('ustomFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"visible / hidden"}},{"i-
     A                                      d":"TabBCP","field type":"tab panel-
     A                                      ","css class":"tab-panel","left":"2-
     A                                      50px","top":{"fieldName":"Pnl2Top",-
     A                                      "dataLength":"5","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces":"false","curS-
     A                                      ym":"","dataType":"zoned","formatti-
     A                                      ng":"Number","negNum":"-999.00","un-
     A                                      its":"px","designValue":"310px"},"h-
     A                                      eight":{"fieldName":"Pnl2Height","d-
     A                                      ataLength":"5","decPos":"0","numSep-
     A                                      ":"false","zeroBalance":"false","nu-
     A                                      mBlankFill":"false","zeroFill":"fal-
     A                                      se","noExtraSpaces":"false","curSym-
     A                                      ":"","dataType":"zoned","formatting-
     A                                      ":"Number","negNum":"-999.00","unit-
     A                                      s":"px","designValue":"110px"},"wid-
     A                                      th":"970px","tab panel style":"Tran-
     A                                      sform Tab Panel","tab names":"Bille-
     A                                      d Information,Compared To Informati-
     A                                      on,Processing Information","active -
     A                                      tab":{"fieldName":"TabIndex2","data-
     A                                      Length":"5","decPos":"0","numSep":"-
     A                                      false","zeroBalance":"false","numBl-
     A                                      ankFill":"false","zeroFill":"false"-
     A                                      ,"noExtraSpaces":"false","curSym":"-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","negNum":"-999.00","units":-
     A                                      ""},"ontabclick":"pui.click(\"BtnTa-
     A                                      bClick\")","visibility":{"fieldName-
     A                                      ":"visPnl2","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"}},{"id":"BtnFSAd-
     A                                      dCancel","field type":"button","css-
     A                                       class":"button","value":"Cancel","-
     A                                      response":{"fieldName":"BtnCanFS","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"sho-
     A                                      rtcut key":"Escape","left":"1110px"-
     A                                      ,"top":{"fieldName":"TopCan","dataL-
     A                                      ength":"5","decPos":"0","numSep":"f-
     A                                      alse","zeroBalance":"false","numBla-
     A                                      nkFill":"false","zeroFill":"false",-
     A                                      "noExtraSpaces":"false","curSym":""-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","negNum":"-999.00","units":"-
     A                                      px","designValue":"435px"},"width":-
     A                                      "100px","cursor":"default","visibil-
     A                                      ity":{"fieldName":"visPnl2","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"tool tip":"Cancel will prompt on -
     A                                      State Rules Maintenance screen"}]}')
     A            BTNCANFS       1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNTABCLK      1A  H
     A            PNL2HEIGHT     5S 0H
     A            PNL2TOP        5S 0H
     A            PNLHEIGHT      5S 0H
     A            TABINDEX1      5S 0H
     A            TABINDEX2      5S 0H
     A            TOPCAN         5S 0H
     A            VISPNL1        1A  H
     A            VISPNL2        1A  H
     A            SCCO#     R        H      REFFLD(ELCO# WDELP)
     A          R SFLSTRULES                SFL
     A            QPUI000001     1A  O  2  2
     A            SCDESC        60A  H
     A            SCEFFDT        8S 0H
     A            SCFSCOPY       1A  H
     A            SCFSDLT        1A  H
     A            SCFSEDIT       1A  H
     A            SCFSINQ        1A  H
     A            SCNXTCHG       1A  H
     A            SCPCAT        10A  H
     A            SCPRTY         3S 0H
     A            SCRRNFS        9S 0H
     A            SCRULE#        9S 0H
     A            SCSFLSEL       1A  H
     A            SCSTAT         1A  H
     A          R QSFLCTL001                SFLCTL(SFLSTRULES)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLRCDRULES')
     A          R RCDRULES
     A                                  1  2HTML('QPUICTL1    SFLSTRULES6    RS-
     A                                      FLDSP    0    FSCSFLDSP  RSFLDSPCTL-
     A                                       0    FSCSFLDSP  RSFLINZ    0    FS-
     A                                      CSFLINZ  RSFLCLR    0    FSCSFLCLR -
     A                                       RSFLPAG    1    C2    16 RSFLSIZ  -
     A                                        1    C4    9999 1    RSFLNXTCHG 0-
     A                                          FSCNXTCHG  3    ROVERLAY   0   -
     A                                        RASSUME    0     RROWS      2    -
     A                                      C1    1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdRules","design overlay forma-
     A                                      ts":"rcdPanel","description":"Work -
     A                                      With State Rules Maintenance","exte-
     A                                      rnal css":"label","overlay":"true",-
     A                                      "overlay range":"1-1","assume":"tru-
     A                                      e"},"items":[{"id":"TxbRowSel","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","description":"Row Selection","-
     A                                      value":{"fieldName":"scRowSel","dat-
     A                                      aLength":"5","decPos":"0","numSep":-
     A                                      "false","zeroBalance":"false","numB-
     A                                      lankFill":"false","zeroFill":"false-
     A                                      ","noExtraSpaces":"false","curSym":-
     A                                      "","dataType":"zoned","formatting":-
     A                                      "Number","negNum":"-999.00","units"-
     A                                      :"","designValue":"[scRowSel]"},"le-
     A                                      ft":"580px","top":"25px","width":"7-
     A                                      0px","css class 2":"textbox","visib-
     A                                      ility":"hidden"},{"id":"LblState","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"State","left":-
     A                                      "260px","top":"100px","width":"40px-
     A                                      "},{"id":"OutState","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":{"fieldName":"scState"-
     A                                      ,"dataLength":"50","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[scState]"},"left":"260px","to-
     A                                      p":"115px","height":"15px","width":-
     A                                      "160px"},{"id":"HdgFSRules","field -
     A                                      type":"output field","css class":"h-
     A                                      eading","value":"State Rules Mainte-
     A                                      nance","left":"260px","top":"135px"-
     A                                      ,"width":"180px","heading type":"Se-
     A                                      ction Header"},{"id":"sflStRules","-
     A                                      field type":"grid","css class":"sub-
     A                                      filegrid","left":"260px","top":"170-
     A                                      px","number of rows":"17","number o-
     A                                      f columns":"7","column widths":"68,-
     A                                      94,50,78,360,44,173","column headin-
     A                                      gs":"Rule Number,Effective Date,Pri-
     A                                      ority,Category,Description,Status,"-
     A                                      ,"header height":"21","row height":-
     A                                      "20","csv export":"true","export wi-
     A                                      th headings":"true","sortable colum-
     A                                      ns":"true","find option":"true","fi-
     A                                      lter option":"true","persist state"-
     A                                      :"true","resizable columns":"true",-
     A                                      "movable columns":"true","height":"-
     A                                      341px","width":"868px","parent tab"-
     A                                      :"1","record format name":"sflStRul-
     A                                      es","export file name":"data","disp-
     A                                      lay subfile":{"fieldName":"scSflDsp-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"display control record":{"fi-
     A                                      eldName":"scSflDsp","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"initialize-
     A                                       subfile":{"fieldName":"scSflInz","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"clear subfile":{"fieldName":"sc-
     A                                      SflClr","customTrue":"","customFals-
     A                                      e":"","dataType":"ind')
     A                                  1  2HTML('icator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"su-
     A                                      bfile size":"9999","subfile record -
     A                                      number":{"fieldName":"scSflRRN","da-
     A                                      taLength":"5","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","noExtraSpaces":"false","curSym"-
     A                                      :"","dataType":"zoned","formatting"-
     A                                      :"Number","negNum":"-999.00","units-
     A                                      ":""},"subfile next changed":{"fiel-
     A                                      dName":"scnxtchg","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"cursor recor-
     A                                      d number":{"fieldName":"scSflRRN","-
     A                                      dataLength":"5","decPos":"0","numSe-
     A                                      p":"false","zeroBalance":"false","n-
     A                                      umBlankFill":"false","zeroFill":"fa-
     A                                      lse","noExtraSpaces":"false","curSy-
     A                                      m":"","dataType":"zoned","formattin-
     A                                      g":"Number","negNum":"-999.00","uni-
     A                                      ts":""},"selection field":{"fieldNa-
     A                                      me":"scSFLSel","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"description":"State Ru-
     A                                      les Maintenance","header text align-
     A                                      ":"right,center,center,center,left,-
     A                                      center,","row selection":"single"},-
     A                                      {"id":"BtnFSAdd","field type":"butt-
     A                                      on","css class":"button","value":"A-
     A                                      dd","response":{"fieldName":"BtnFSA-
     A                                      dd","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"left":"955px","top":"515px","widt-
     A                                      h":"80px","visibility":{"fieldName"-
     A                                      :"dspMode","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      hidden / visible"},"tool tip":"Use -
     A                                      to add a new rule for the current s-
     A                                      tate."},{"id":"BtnFSRoll","field ty-
     A                                      pe":"button","css class":"button","-
     A                                      value":"Rollover","response":{"fiel-
     A                                      dName":"BtnFSRoll","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"left":"1045px","to-
     A                                      p":"515px","width":"80px","visibili-
     A                                      ty":{"fieldName":"dspMode","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"hidden / visible"},-
     A                                      "tool tip":"Copies the desired stat-
     A                                      e fee schedule rules for a specific-
     A                                       effective date to the new effectiv-
     A                                      e date. Normally you Rollover to th-
     A                                      e same state but just change the ef-
     A                                      fective date when a new Fee Schedul-
     A                                      e is published.\n"},{"id":"BtnExitF-
     A                                      S","field type":"button","css class-
     A                                      ":"button","value":"Exit","response-
     A                                      ":{"fieldName":"BtnExit","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"left":"1045p-
     A                                      x","top":"545px","width":"80px","cu-
     A                                      rsor":"default","tool tip":"To exit-
     A                                       the menu option."},{"id":"BtnWCSRC-
     A                                      lrFilter","field type')
     A                                  1  2HTML('":"button","css class":"butto-
     A                                      n","value":"Clear Filter","response-
     A                                      ":{"fieldName":"btnClrFltr","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"left":"58-
     A                                      5px","top":"145px","width":"100px",-
     A                                      "z index":"50","cursor":"default","-
     A                                      visibility":{"fieldName":"dspClrFlt-
     A                                      r","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"visible -
     A                                      / hidden"},"tool tip":"Clear Filter-
     A                                      ."},{"id":"BtnFSRfilter","field typ-
     A                                      e":"button","css class":"button","v-
     A                                      alue":"Filter","response":{"fieldNa-
     A                                      me":"btnFilter","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"left":"475px","top"-
     A                                      :"145px","width":"100px","z index":-
     A                                      "50","cursor":"default","tool tip":-
     A                                      "Filter records. Note that only the-
     A                                       first 9,999 records are displayed -
     A                                      due to the maximum allowed by the P-
     A                                      rofound UI.  A message will appear -
     A                                      in this case.  This is also where y-
     A                                      ou can change the status.  Normally-
     A                                       you display rules for a certain ef-
     A                                      fective date or rules that contain -
     A                                      a certain description.  Note: The m-
     A                                      ost current state rules are last in-
     A                                       sequence.\n"},{"id":"TxbFSRMsg","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"output-field","description":"Me-
     A                                      ssage for State Rules Maintenance s-
     A                                      creen","value":{"fieldName":"scFSRM-
     A                                      sg","dataLength":"120","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scFSRMsg]"},"font weight"-
     A                                      :"bold","text align":"left","left":-
     A                                      "265px","top":"545px","width":"765p-
     A                                      x","visibility":{"fieldName":"vsbFS-
     A                                      RMsg","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"}},{"id":"OutRule#","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"output-field","value":{"fieldNam-
     A                                      e":"scRule#","dataLength":"9","decP-
     A                                      os":"0","numSep":"false","zeroBalan-
     A                                      ce":"true","numBlankFill":"false","-
     A                                      zeroFill":"false","noExtraSpaces":"-
     A                                      false","curSym":"","dataType":"zone-
     A                                      d","formatting":"Number","negNum":"-
     A                                      999.00","units":"","designValue":"[-
     A                                      scRule#]"},"text align":"right","le-
     A                                      ft":"5px","top":"5px","width":"60px-
     A                                      ","grid":"sflStRules","column":"0"}-
     A                                      ,{"id":"OutEffDate","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":{"fieldName":"scEffDt"-
     A                                      ,"dataLength":"8","decPos":"0","num-
     A                                      Sep":"false","zeroBalance":"false",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","edt-
     A                                      Wrd":"''  /  /    ''","curSym":"","-
     A                                      dataType":"zoned","formatting":"Num-
     A                                      ber","negNum":"-999.00","units":"",-
     A                                      "designValue":"[scEff')
     A                                  1  2HTML('Dt]"},"text align":"right","l-
     A                                      eft":"10px","top":"5px","width":"70-
     A                                      px","grid":"sflStRules","column":"1-
     A                                      "},{"id":"OutPriority","field type"-
     A                                      :"output field","css class":"output-
     A                                      -field","value":{"fieldName":"scPrt-
     A                                      y","dataLength":"3","decPos":"0","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"numBlankFill":"false","zeroFill":-
     A                                      "false","noExtraSpaces":"false","cu-
     A                                      rSym":"","dataType":"zoned","format-
     A                                      ting":"Number","negNum":"999.00","u-
     A                                      nits":"","designValue":"[scPrty]"},-
     A                                      "text align":"center","left":"8px",-
     A                                      "top":"5px","width":"30px","grid":"-
     A                                      sflStRules","column":"2"},{"id":"Ou-
     A                                      tProcCat","field type":"output fiel-
     A                                      d","css class":"output-field","valu-
     A                                      e":{"fieldName":"scPCat","dataLengt-
     A                                      h":"10","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scPCa-
     A                                      t]"},"text align":"center","left":"-
     A                                      5px","top":"5px","width":"70px","gr-
     A                                      id":"sflStRules","column":"3"},{"id-
     A                                      ":"OutDesc","field type":"output fi-
     A                                      eld","css class":"output-field","va-
     A                                      lue":{"fieldName":"scDesc","dataLen-
     A                                      gth":"60","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scD-
     A                                      esc]"},"text align":"left","left":"-
     A                                      5px","top":"5px","width":"275px","g-
     A                                      rid":"sflStRules","column":"4"},{"i-
     A                                      d":"OutFSRulesRRN","field type":"ou-
     A                                      tput field","css class":"output-fie-
     A                                      ld","value":{"fieldName":"scRRNFS",-
     A                                      "dataLength":"9","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"t-
     A                                      rue","noExtraSpaces":"false","curSy-
     A                                      m":"","dataType":"zoned","formattin-
     A                                      g":"Number","negNum":"-999.00","uni-
     A                                      ts":"","designValue":"[scRRNFS]"},"-
     A                                      left":"290px","top":"5px","width":"-
     A                                      60px","visibility":"hidden","grid":-
     A                                      "sflStRules","column":"4"},{"id":"O-
     A                                      utStatus","field type":"output fiel-
     A                                      d","css class":"output-field","valu-
     A                                      e":{"fieldName":"scStat","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[scStat-
     A                                      ]"},"text align":"center","left":"7-
     A                                      px","top":"5px","width":"30px","gri-
     A                                      d":"sflStRules","column":"5"},{"id"-
     A                                      :"LnkRuleEdit","field type":"hyperl-
     A                                      ink","css class":"link","value":"Ed-
     A                                      it","left":"5px","top":"5px","respo-
     A                                      nse":{"fieldName":"scFSEdit","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"tool tip-
     A                                      ":"Update information in the rule."-
     A                                      ,"grid":"sflStRules","column":"6"},-
     A                                      {"id":"LnkRuleCopy","')
     A                                  1  2HTML('field type":"hyperlink","css -
     A                                      class":"link","value":"Copy","left"-
     A                                      :"35px","top":"5px","response":{"fi-
     A                                      eldName":"scFSCopy","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"tool tip":"Copy c-
     A                                      urrent rule to a new rule.","grid":-
     A                                      "sflStRules","column":"6"},{"id":"L-
     A                                      nkRuleDelete","field type":"hyperli-
     A                                      nk","css class":"link","value":"Del-
     A                                      ete","left":"70px","top":"5px","res-
     A                                      ponse":{"fieldName":"scFSDlt","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"tool ti-
     A                                      p":"Delete entire rule.","grid":"sf-
     A                                      lStRules","column":"6"},{"id":"LnkI-
     A                                      nquiry","field type":"hyperlink","c-
     A                                      ss class":"link","value":"Inquiry",-
     A                                      "left":"115px","top":"5px","respons-
     A                                      e":{"fieldName":"scFSInq","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"tool tip":"-
     A                                      View all information in the rule.",-
     A                                      "grid":"sflStRules","column":"6"}]}-
     A                                      ')
     A            BTNCLRFLTR     1A  H
     A            BTNEXIT        1A  H
     A            BTNFILTER      1A  H
     A            BTNFSADD       1A  H
     A            BTNFSROLL      1A  H
     A            DSPCLRFLTR     1A  H
     A            DSPMODE        1A  H
     A            SCFSRMSG     120A  H
     A            SCROWSEL       5S 0H
     A            SCSFLCLR       1A  H
     A            SCSFLDSP       1A  H
     A            SCSFLINZ       1A  H
     A            SCSFLRRN       5S 0H
     A            SCSTATE       50A  H
     A            VSBFSRMSG      1A  H
     A          R POPADDEDIT
     A                                  1  2HTML('QPUIREC8    RWINDOW    0     -
     A                                      RASSUME    0     REMSG      2    C1-
     A                                      6   TxbEffectiveDateFMSEFFDTE  FERE-
     A                                      FFDTE  REMSG      2    C10   TxbExp-
     A                                      DateFMSEXPDTE  FEREXPDTE  REMSG    -
     A                                        2    C10   TxbProcCatFMSPCATE   F-
     A                                      ERPCATE   REMSG      2    C11   Txb-
     A                                      BillTypeFMSBILLTYPEFERBILLTYPEREMSG-
     A                                            2    C7    TxbDescFMSDESCE   -
     A                                      FERDESCE   REMSGID    5    C11   Tx-
     A                                      bCodeTypeFMSCODETYPEC6    WMESGGC5 -
     A                                         *LIBLC0    FERCODETYPE')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"PopAddEdit","show as window":"t-
     A                                      rue","assume":"true","description":-
     A                                      "State Rules Primary Information"},-
     A                                      "items":[{"id":"PnlStateRulesPrimar-
     A                                      yInformataion","field type":"panel"-
     A                                      ,"css class":"panel","value":{"fiel-
     A                                      dName":"scFSHdg","dataLength":"100"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scFSHdg]"},"-
     A                                      left":"260px","top":"170px","width"-
     A                                      :"620px","height":"300px","panel st-
     A                                      yle":"Transform Dialog","z index":"-
     A                                      8","locked in place":"true"},{"id":-
     A                                      "LblStateFS","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      State","left":"265px","top":"205px"-
     A                                      ,"width":"40px"},{"id":"TxbStateFS"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scSt-
     A                                      ateE","dataLength":"2","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scStateE]"},"text align":-
     A                                      "left","disabled":"true","left":"26-
     A                                      5px","top":"220px","width":"185px",-
     A                                      "css class 2":"textbox","choices da-
     A                                      tabase file":"STSTP","choice option-
     A                                      s field":"TRIM(STKEY)|| '' - '' ||T-
     A                                      RIM(STNAME)","choice values field":-
     A                                      "STKEY","tool tip":"State abbreviat-
     A                                      ion associated with the fee schedul-
     A                                      e (Default)."},{"id":"LblEffectiveD-
     A                                      ate","field type":"output field","c-
     A                                      ss class":"label","value":"Effectiv-
     A                                      e Date","left":"265px","top":"245px-
     A                                      ","width":"90px"},{"id":"Image1","f-
     A                                      ield type":"image","css class":"ima-
     A                                      ge","image source":"/profoundui/use-
     A                                      rdata/images/asterisk_orange_small.-
     A                                      png","left":"350px","top":"245px","-
     A                                      height":"8px","width":"8px","css cl-
     A                                      ass 2":"required-icon"},{"id":"LblE-
     A                                      xpDate","field type":"output field"-
     A                                      ,"css class":"label","value":"Expir-
     A                                      ation Date","left":"455px","top":"2-
     A                                      45px","width":"100px"},{"id":"LblNx-
     A                                      tRule#","field type":"output field"-
     A                                      ,"css class":"label","value":"Next -
     A                                      Rule#","left":"635px","top":"245px"-
     A                                      ,"width":"70px"},{"id":"LblRulePrio-
     A                                      rity","field type":"output field","-
     A                                      css class":"label","value":"Rule Pr-
     A                                      iority","left":"770px","top":"245px-
     A                                      ","width":"75px"},{"id":"TxbEffecti-
     A                                      veDate","field type":"date field","-
     A                                      css class":"date-field","value":{"f-
     A                                      ieldName":"scEffDtE","dataLength":"-
     A                                      8","decPos":"0","numSep":"false","z-
     A                                      eroBalance":"false","numBlankFill":-
     A                                      "false","zeroFill":"false","noExtra-
     A                                      Spaces":"false","edtWrd":"''  /  / -
     A                                         ''","curSym":"","dataType":"zone-
     A                                      d","formatting":"Number","negNum":"-
     A                                      -999.00","units":"","designValue":"-
     A                                      [scEffDtE]"},"left":"265px","top":"-
     A                                      260px","width":"80px"')
     A                                  1  2HTML(',"error messages":"1 message"-
     A                                      ,"disabled":{"fieldName":"dspEffdt"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"error message":{"fieldName":"-
     A                                      msEffDtE","dataLength":"100","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      ,"error condition":{"fieldName":"er-
     A                                      EffDtE","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error enhanced mode":"1","too-
     A                                      l tip":"Effective date of the fee s-
     A                                      chedule (Required). "},{"id":"TxbEx-
     A                                      pDate","field type":"date field","c-
     A                                      ss class":"date-field","value":{"fi-
     A                                      eldName":"scExpDtE","dataLength":"8-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"false","numBlankFill":"-
     A                                      false","zeroFill":"false","noExtraS-
     A                                      paces":"false","edtWrd":"''  /  /  -
     A                                        ''","curSym":"","dataType":"zoned-
     A                                      ","formatting":"Number","negNum":"--
     A                                      999.00","units":"","designValue":"[-
     A                                      scExpDtE]"},"left":"455px","top":"2-
     A                                      60px","width":"80px","error message-
     A                                      s":"1 message","disabled":{"fieldNa-
     A                                      me":"inquiry","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"error message":{-
     A                                      "fieldName":"msExpDtE","dataLength"-
     A                                      :"100","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"error condition":{"f-
     A                                      ieldName":"erExpDtE","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode":"1","tool tip":"Date the fee s-
     A                                      chedule expires."},{"id":"txbNxtRul-
     A                                      e#","field type":"textbox","css cla-
     A                                      ss":"input","value":{"fieldName":"s-
     A                                      cRule#E","dataLength":"9","decPos":-
     A                                      "0","numSep":"true","zeroBalance":"-
     A                                      true","numBlankFill":"false","zeroF-
     A                                      ill":"false","noExtraSpaces":"false-
     A                                      ","curSym":"","dataType":"zoned","f-
     A                                      ormatting":"Number","negNum":"999.0-
     A                                      0","units":"","designValue":"[scRul-
     A                                      e#E]"},"text align":"right","left":-
     A                                      "635px","top":"260px","width":"75px-
     A                                      ","css class 2":"textbox","disabled-
     A                                      ":"true","tool tip":"Rule number as-
     A                                      signed by the system (Default)."},{-
     A                                      "id":"TxbRulePriority","field type"-
     A                                      :"textbox","css class":"input","val-
     A                                      ue":{"fieldName":"scPrtyE","dataLen-
     A                                      gth":"3","decPos":"0","numSep":"tru-
     A                                      e","zeroBalance":"true","numBlankFi-
     A                                      ll":"false","zeroFill":"false","noE-
     A                                      xtraSpaces":"true","curSym":"","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","negNum":"999.00","units":"","des-
     A                                      ignValue":"[scPrtyE]"},"text align"-
     A                                      :"right","left":"770p')
     A                                  1  2HTML('x","top":"260px","width":"40p-
     A                                      x","css class 2":"textbox","disable-
     A                                      d":{"fieldName":"inquiry","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"tool-
     A                                       tip":"Ranking within the State man-
     A                                      dated guidelines. Valid values are -
     A                                      000 to 999. Higher ranked rules are-
     A                                       processed first."},{"id":"LblProcC-
     A                                      at","field type":"output field","cs-
     A                                      s class":"label","value":"Procedure-
     A                                       Category","left":"265px","top":"28-
     A                                      5px","width":"125px"},{"id":"Image2-
     A                                      ","field type":"image","css class":-
     A                                      "image","image source":"/profoundui-
     A                                      /userdata/images/asterisk_orange_sm-
     A                                      all.png","left":"380px","top":"285p-
     A                                      x","height":"8px","width":"8px","cs-
     A                                      s class 2":"required-icon"},{"id":"-
     A                                      LblFSBkPage#","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "FS Book Page#","left":"455px","top-
     A                                      ":"285px","width":"125px"},{"id":"L-
     A                                      blInfo","field type":"output field"-
     A                                      ,"css class":"label","value":"Info"-
     A                                      ,"left":"635px","top":"285px","widt-
     A                                      h":"75px"},{"id":"LblBillType","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"label","value":"Bill Type","left"-
     A                                      :"770px","top":"285px","width":"55p-
     A                                      x"},{"id":"Image3","field type":"im-
     A                                      age","css class":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/a-
     A                                      sterisk_orange_small.png","left":"8-
     A                                      20px","top":"285px","height":"8px",-
     A                                      "width":"8px","css class 2":"requir-
     A                                      ed-icon"},{"id":"TxbProcCat","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","value":{"fieldName":"scPCatE","d-
     A                                      ataLength":"10","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scPCatE]"},"text transform":"upp-
     A                                      ercase","error messages":"1 message-
     A                                      ","choices database file":"FTGTP","-
     A                                      choice options field":"TRIM(GTKEY)|-
     A                                      | '' - '' ||TRIM(GTDESC)","choice v-
     A                                      alues field":"GTKEY","choices selec-
     A                                      tion criteria":"GTSTAT<>''I'' and G-
     A                                      TTBID = ''PCAT''","contains match":-
     A                                      "true","left":"265px","top":"300px"-
     A                                      ,"width":"175px","css class 2":"tex-
     A                                      tbox","disabled":{"fieldName":"inqu-
     A                                      iry","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"error message":{"fieldNam-
     A                                      e":"msPCatE","dataLength":"100","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"},"error condition":{"fieldName":-
     A                                      "erPCatE","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error enhanced mode":"1","t-
     A                                      ool tip":"Defines the Category Type-
     A                                       of Guideline/Procedu')
     A                                  1  2HTML('re.\t"},{"id":"TxbFSBkPage#",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","value":{"fieldName":"scFSB-
     A                                      Pg#","dataLength":"3","decPos":"0",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","numBlankFill":"false","zeroFil-
     A                                      l":"true","noExtraSpaces":"false","-
     A                                      curSym":"","dataType":"zoned","form-
     A                                      atting":"Number","negNum":"999.00",-
     A                                      "units":"","designValue":"[scFSBPg#-
     A                                      ]"},"text transform":"uppercase","c-
     A                                      ontains match":"true","left":"455px-
     A                                      ","top":"300px","width":"40px","css-
     A                                       class 2":"textbox","disabled":{"fi-
     A                                      eldName":"inquiry","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"tool tip":"-
     A                                      Page# where the rule exists in the -
     A                                      fee schedule/guidelines manual for -
     A                                      that state."},{"id":"TxbInfo","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","value":{"fieldName":"scInfoE","-
     A                                      dataLength":"15","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[scInfoE]"},"text align":"left",-
     A                                      "left":"635px","top":"300px","width-
     A                                      ":"110px","css class 2":"textbox","-
     A                                      disabled":{"fieldName":"inquiry","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"tool tip":"Additional info."},{"-
     A                                      id":"TxbBillType","field type":"sel-
     A                                      ect box","css class":"input","value-
     A                                      ":{"fieldName":"scBillTypE","dataLe-
     A                                      ngth":"1","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scB-
     A                                      illTypE]"},"text align":"left","lef-
     A                                      t":"770px","top":"300px","width":"7-
     A                                      0px","css class 2":"dropdown","erro-
     A                                      r messages":"1 message","choices":"-
     A                                      Dental,Hospital,Physician,Pharmacy"-
     A                                      ,"choice values":"D,H,P,X","disable-
     A                                      d":{"fieldName":"inquiry","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message":{"fieldName":"msBillTypE-
     A                                      ","dataLength":"100","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"},"error -
     A                                      condition":{"fieldName":"erBillTypE-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error enhanced mode":"1","tool tip"-
     A                                      :"Bill types are: P [Physician], H -
     A                                      [Hospital], D [Dental], X [Pharmacy-
     A                                      ]."},{"id":"LblDesc","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"Description","left":"265px"-
     A                                      ,"top":"325px","width":"75px"},{"id-
     A                                      ":"Image4","field typ')
     A                                  1  2HTML('e":"image","css class":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/asterisk_orange_small.pn-
     A                                      g","left":"335px","top":"325px","he-
     A                                      ight":"8px","width":"8px","css clas-
     A                                      s 2":"required-icon"},{"id":"LblSta-
     A                                      tus","field type":"output field","c-
     A                                      ss class":"label","value":"Status",-
     A                                      "left":"770px","top":"325px","width-
     A                                      ":"50px"},{"id":"TxbDesc","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      value":{"fieldName":"scDescE","data-
     A                                      Length":"60","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scDescE]"},"text align":"left","lef-
     A                                      t":"265px","top":"340px","width":"3-
     A                                      10px","css class 2":"textbox","erro-
     A                                      r messages":"1 message","disabled":-
     A                                      {"fieldName":"inquiry","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage":{"fieldName":"msDescE","dat-
     A                                      aLength":"100","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"},"error condit-
     A                                      ion":{"fieldName":"erDescE","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error enh-
     A                                      anced mode":"1","tool tip":"Brief d-
     A                                      escription of the rule used to aid -
     A                                      in understanding the rules purpose -
     A                                      and in filtering to find certain ru-
     A                                      les."},{"id":"DrpStatus","field typ-
     A                                      e":"select box","css class":"input"-
     A                                      ,"value":{"fieldName":"scStatusE","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scStatusE]"},"text align":"left"-
     A                                      ,"left":"770px","top":"340px","widt-
     A                                      h":"70px","css class 2":"Dropbox","-
     A                                      visibility":"visible","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"choices":-
     A                                      "Active,Inactive","choice values":"-
     A                                      A,I","tool tip":"Active or Inactive-
     A                                      "},{"id":"LblCodeType","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Code Type","left":"265px"-
     A                                      ,"top":"365px","width":"70px"},{"id-
     A                                      ":"LblCltNo","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      Client number","left":"635px","top"-
     A                                      :"365px","width":"95px"},{"id":"Txb-
     A                                      CodeType","field type":"select box"-
     A                                      ,"css class":"input","value":{"fiel-
     A                                      dName":"scCodeTypE","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","')
     A                                  1  2HTML('textTransform":"none","design-
     A                                      Value":"[scCodeTypE]"},"text align"-
     A                                      :"left","left":"265px","top":"380px-
     A                                      ","width":"240px","css class 2":"dr-
     A                                      opdown","error messages":"1 message-
     A                                      ","error message id":{"fieldName":"-
     A                                      msCodeTypE","dataLength":"10","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      },"error message file":"WMESGG","er-
     A                                      ror message library":"*LIBL","error-
     A                                       condition":{"fieldName":"erCodeTyp-
     A                                      E","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error enhanced mode":"1","choices"-
     A                                      :",CPT CODE,REASONABLE AND CUSTOMAR-
     A                                      Y CODE","choice values":",C,R","dis-
     A                                      abled":{"fieldName":"inquiry","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      tool tip":"Code types are: C [Proce-
     A                                      dure/HCPCS/Service Code], R [Reason-
     A                                      able and Customary Code]."},{"id":"-
     A                                      TxbCltNo","field type":"textbox","c-
     A                                      ss class":"input","value":{"fieldNa-
     A                                      me":"scCltNoE","dataLength":"3","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"true","numBlankFill":"false"-
     A                                      ,"zeroFill":"true","noExtraSpaces":-
     A                                      "false","curSym":"","dataType":"zon-
     A                                      ed","formatting":"Number","negNum":-
     A                                      "999.00","units":"","designValue":"-
     A                                      [scCltNoE]"},"text align":"right","-
     A                                      left":"635px","top":"380px","width"-
     A                                      :"40px","css class 2":"textbox","di-
     A                                      sabled":{"fieldName":"inquiry","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "tool tip":"Client Number is used t-
     A                                      o create client specific rules."},{-
     A                                      "id":"BtnNextFS","field type":"butt-
     A                                      on","css class":"button","value":"N-
     A                                      ext","response":{"fieldName":"BtnNe-
     A                                      xtFSP","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"shortcut key":"Enter","left":"-
     A                                      650px","top":"420px","width":"100px-
     A                                      ","cursor":"default","tool tip":"Br-
     A                                      ings up the State Rules Maintenance-
     A                                       Tab Panel (Billed Information, Com-
     A                                      pared To Information and Processing-
     A                                       Information).  "},{"id":"BtnFSPCan-
     A                                      cel","field type":"button","css cla-
     A                                      ss":"button","value":"Cancel","resp-
     A                                      onse":{"fieldName":"BtnCanFSP","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"shortc-
     A                                      ut key":"Escape","left":"760px","to-
     A                                      p":"420px","width":"100px","cursor"-
     A                                      :"default","tool tip":"Returns to t-
     A                                      he State Rules Maintenance screen."-
     A                                      }]}')
     A            BTNCANFSP      1A  H
     A            BTNNEXTFSP     1A  H
     A            DSPEFFDT       1A  H
     A            ERBILLTYPE     1A  H
     A            ERCODETYPE     1A  H
     A            ERDESCE        1A  H
     A            EREFFDTE       1A  H
     A            EREXPDTE       1A  H
     A            ERPCATE        1A  H
     A            INQUIRY        1A  H
     A            MSBILLTYPE   100A  H
     A            MSCODETYPE    10A  H
     A            MSDESCE      100A  H
     A            MSEFFDTE     100A  H
     A            MSEXPDTE     100A  H
     A            MSPCATE      100A  H
     A            SCBILLTYPE     1A  H
     A            SCCLTNOE       3S 0H
     A            SCCODETYPE     1A  H
     A            SCDESCE       60A  H
     A            SCEFFDTE       8S 0H
     A            SCEXPDTE       8S 0H
     A            SCFSBPG#       3S 0H
     A            SCFSHDG      100A  H
     A            SCINFOE       15A  H
     A            SCPCATE       10A  H
     A            SCPRTYE        3S 0H
     A            SCRULE#E       9S 0H
     A            SCSTATEE       2A  H
     A            SCSTATUSE      1A  H
     A          R RCDROLLOVR
     A                                  1  2HTML('QPUIREC9    ROVERLAY   0     -
     A                                      RWINDOW    0     RASSUME    0     R-
     A                                      EMSG      2    C17   DrpCopyFromSta-
     A                                      teRFMSFSTATER FERFSTATER REMSG     -
     A                                       2    C21   TxbFromEffectiveDateRFM-
     A                                      SFEFFDTR FERFEFFDTR REMSG      2   -
     A                                       C11   TxbProcCatRFMSPCATR   FERPCA-
     A                                      TR   REMSG      2    C12   txbNxtRu-
     A                                      le#RFMSRULE#R  FERRULE#R  REMSG    -
     A                                        2    C11   DrpToStateRFMSTOSTATER-
     A                                      FERTOSTATERREMSG      2    C19   Tx-
     A                                      bToEffectiveDateRFMSTOEFFDTRFERTOEF-
     A                                      FDTR')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdRollovr","description":"Proc-
     A                                      ess Rollover","assume":"true","show-
     A                                       as window":"true","overlay":"true"-
     A                                      },"items":[{"id":"PnlStateRulesPrim-
     A                                      aryInformataion","field type":"pane-
     A                                      l","css class":"panel","panel style-
     A                                      ":"Transform Dialog","value":"State-
     A                                       Rules Rollover","left":"260px","to-
     A                                      p":"170px","height":"330px","width"-
     A                                      :"400px","z index":"8","locked in p-
     A                                      lace":"true"},{"id":"LblCopyFromSta-
     A                                      teR","field type":"output field","c-
     A                                      ss class":"label","value":"Copy Fro-
     A                                      m State","left":"265px","top":"200p-
     A                                      x","width":"100px"},{"id":"Image1",-
     A                                      "field type":"image","css class":"i-
     A                                      mage","image source":"/profoundui/u-
     A                                      serdata/images/asterisk_orange_smal-
     A                                      l.png","left":"360px","top":"200px"-
     A                                      ,"height":"8px","width":"8px","css -
     A                                      class 2":"required-icon"},{"id":"Dr-
     A                                      pCopyFromStateR","field type":"sele-
     A                                      ct box","css class":"input","value"-
     A                                      :{"fieldName":"scFStateR","dataLeng-
     A                                      th":"2","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scFSt-
     A                                      ateR]"},"text align":"left","choice-
     A                                      s database file":"STSTP","choice op-
     A                                      tions field":"TRIM(STKEY)|| '' - ''-
     A                                       ||TRIM(STNAME)","choice values fie-
     A                                      ld":"STKEY","left":"265px","top":"2-
     A                                      15px","width":"190px","css class 2"-
     A                                      :"textbox","error messages":"1 mess-
     A                                      age","error message":{"fieldName":"-
     A                                      msFStateR","dataLength":"100","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      },"error condition":{"fieldName":"e-
     A                                      rFStateR","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error enhanced mode":"1","o-
     A                                      rder by":"STKEY","tool tip":"Copy F-
     A                                      rom State"},{"id":"LblFromEffective-
     A                                      DateR","field type":"output field",-
     A                                      "css class":"label","value":"Effect-
     A                                      ive Date","left":"265px","top":"240-
     A                                      px","width":"90px"},{"id":"Image2",-
     A                                      "field type":"image","css class":"i-
     A                                      mage","image source":"/profoundui/u-
     A                                      serdata/images/asterisk_orange_smal-
     A                                      l.png","left":"350px","top":"240px"-
     A                                      ,"height":"8px","width":"8px","css -
     A                                      class 2":"required-icon"},{"id":"Tx-
     A                                      bFromEffectiveDateR","field type":"-
     A                                      date field","css class":"date-field-
     A                                      ","value":{"fieldName":"scFEffDtR",-
     A                                      "dataLength":"8","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces":"false","edtW-
     A                                      rd":"''  /  /    ''","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scFEffDtR]"},"error -
     A                                      messages":"1 message"')
     A                                  1  2HTML(',"left":"265px","top":"255px"-
     A                                      ,"width":"80px","error message":{"f-
     A                                      ieldName":"msFEffDtR","dataLength":-
     A                                      "100","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"},"error condition":{"fi-
     A                                      eldName":"erFEffDtR","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error enhanced m-
     A                                      ode":"1","tool tip":"Effective date-
     A                                       of the fee schedule "},{"id":"LblP-
     A                                      rocCatR","field type":"output field-
     A                                      ","css class":"label","value":"Proc-
     A                                      edure Category","left":"265px","top-
     A                                      ":"280px","width":"125px"},{"id":"T-
     A                                      xbProcCatR","field type":"textbox",-
     A                                      "css class":"input","value":{"field-
     A                                      Name":"scPCatR","dataLength":"10","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scPCatR]"},"te-
     A                                      xt transform":"uppercase","error me-
     A                                      ssages":"1 message","choices databa-
     A                                      se file":"FTGTL","choice options fi-
     A                                      eld":"TRIM(GTKEY)|| '' - '' ||TRIM(-
     A                                      GTDESC)","choice values field":"GTK-
     A                                      EY","choices selection criteria":"G-
     A                                      TSTAT<>''I'' and GTTBID = ''PCAT''"-
     A                                      ,"contains match":"true","left":"26-
     A                                      5px","top":"295px","width":"320px",-
     A                                      "css class 2":"textbox","error mess-
     A                                      age":{"fieldName":"msPCatR","dataLe-
     A                                      ngth":"100","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"},"error condition-
     A                                      ":{"fieldName":"erPCatR","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode":"1","tool tip":"Defines th-
     A                                      e Category Type of Guideline/Proced-
     A                                      ure"},{"id":"LblRule#R","field type-
     A                                      ":"output field","css class":"label-
     A                                      ","value":"Rule#","left":"265px","t-
     A                                      op":"320px","width":"70px"},{"id":"-
     A                                      txbNxtRule#R","field type":"textbox-
     A                                      ","css class":"input","value":{"fie-
     A                                      ldName":"scRule#R","dataLength":"9"-
     A                                      ,"decPos":"0","numSep":"true","zero-
     A                                      Balance":"true","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"999.00","units":"","designValu-
     A                                      e":"[scRule#R]"},"text align":"righ-
     A                                      t","left":"265px","top":"335px","wi-
     A                                      dth":"75px","css class 2":"textbox"-
     A                                      ,"error messages":"1 message","erro-
     A                                      r message":{"fieldName":"msRule#R",-
     A                                      "dataLength":"100","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"},"error co-
     A                                      ndition":{"fieldName"')
     A                                  1  2HTML(':"erRule#R","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                      ":"1","tool tip":"Rule number assig-
     A                                      ned by the system "},{"id":"line1",-
     A                                      "field type":"horizontal line","css-
     A                                       class":"line","line style":"Dotted-
     A                                      ","left":"260px","top":"350px","hei-
     A                                      ght":"20px","width":"395px"},{"id":-
     A                                      "LblToStateR","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Copy To State","left":"265px","top-
     A                                      ":"375px","width":"100px"},{"id":"I-
     A                                      mage3","field type":"image","css cl-
     A                                      ass":"image","image source":"/profo-
     A                                      undui/userdata/images/asterisk_oran-
     A                                      ge_small.png","left":"345px","top":-
     A                                      "375px","height":"8px","width":"8px-
     A                                      ","css class 2":"required-icon"},{"-
     A                                      id":"DrpToStateR","field type":"sel-
     A                                      ect box","css class":"input","value-
     A                                      ":{"fieldName":"scToStateR","dataLe-
     A                                      ngth":"2","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scT-
     A                                      oStateR]"},"text align":"left","cho-
     A                                      ices database file":"STSTP","choice-
     A                                       options field":"TRIM(STKEY)|| '' --
     A                                       '' ||TRIM(STNAME)","choice values -
     A                                      field":"STKEY","left":"265px","top"-
     A                                      :"390px","width":"190px","css class-
     A                                       2":"textbox","error messages":"1 m-
     A                                      essage","error message":{"fieldName-
     A                                      ":"msToStateR","dataLength":"100","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"},"error condition":{"fieldName-
     A                                      ":"erToStateR","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error enhanced mode":"-
     A                                      1","order by":"STKEY","tool tip":"C-
     A                                      opy To State"},{"id":"LblToEffectiv-
     A                                      eDateR","field type":"output field"-
     A                                      ,"css class":"label","value":"Effec-
     A                                      tive Date","left":"265px","top":"41-
     A                                      5px","width":"90px"},{"id":"Image4"-
     A                                      ,"field type":"image","css class":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/asterisk_orange_sma-
     A                                      ll.png","left":"350px","top":"415px-
     A                                      ","height":"8px","width":"8px","css-
     A                                       class 2":"required-icon"},{"id":"T-
     A                                      xbToEffectiveDateR","field type":"d-
     A                                      ate field","css class":"date-field"-
     A                                      ,"value":{"fieldName":"scToEffDtR",-
     A                                      "dataLength":"8","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"false","-
     A                                      numBlankFill":"false","zeroFill":"f-
     A                                      alse","noExtraSpaces":"false","edtW-
     A                                      rd":"''  /  /    ''","curSym":"","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","negNum":"-999.00","units":"","-
     A                                      designValue":"[scToEffDtR]"},"error-
     A                                       messages":"1 message","left":"265p-
     A                                      x","top":"430px","width":"80px","er-
     A                                      ror message":{"fieldN')
     A                                  1  2HTML('ame":"msToEffDtR","dataLength-
     A                                      ":"100","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"},"error condition":{"-
     A                                      fieldName":"erToEffDtR","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error enhance-
     A                                      d mode":"1","tool tip":"Effective d-
     A                                      ate of the fee schedule "},{"id":"B-
     A                                      tnEnterRoll","field type":"button",-
     A                                      "css class":"button","value":"Enter-
     A                                      ","response":{"fieldName":"BtnEntRo-
     A                                      ll","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"shortcut key":"Enter","left":"440-
     A                                      px","top":"465px","width":"100px","-
     A                                      cursor":"default","visibility":"vis-
     A                                      ible","tool tip":"Enter to Copy"},{-
     A                                      "id":"BtnCancelRoll","field type":"-
     A                                      button","css class":"button","value-
     A                                      ":"Cancel","response":{"fieldName":-
     A                                      "BtnCanRoll","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"shortcut key":"Escape","-
     A                                      left":"550px","top":"465px","width"-
     A                                      :"100px","cursor":"default","visibi-
     A                                      lity":"visible","tool tip":"Cancel"-
     A                                      }]}')
     A            BTNCANROLL     1A  H
     A            BTNENTROLL     1A  H
     A            ERFEFFDTR      1A  H
     A            ERFSTATER      1A  H
     A            ERPCATR        1A  H
     A            ERRULE#R       1A  H
     A            ERTOEFFDTR     1A  H
     A            ERTOSTATER     1A  H
     A            MSFEFFDTR    100A  H
     A            MSFSTATER    100A  H
     A            MSPCATR      100A  H
     A            MSRULE#R     100A  H
     A            MSTOEFFDTR   100A  H
     A            MSTOSTATER   100A  H
     A            SCFEFFDTR      8S 0H
     A            SCFSTATER      2A  H
     A            SCPCATR       10A  H
     A            SCRULE#R       9S 0H
     A            SCTOEFFDTR     8S 0H
     A            SCTOSTATER     2A  H
     A          R RCDBILLINF
     A                                  1  2HTML('QPUIREC6    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 REMSG      2    C12   -
     A                                      TxbTProcCodeFMSBTCD    FERBTCD    R-
     A                                      EMSG      2    C11   TxbFAccDateFMS-
     A                                      FADT    FERFADT    REMSG      2    -
     A                                      C11   TxbTAccDateFMSTADT    FERTADT-
     A                                          ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdBillInf","description":"Bill-
     A                                      ed Information","assume":"true","sh-
     A                                      ow as window":"false","overlay":"tr-
     A                                      ue","overlay range":"1-1","onload":-
     A                                      "document.body.style.background = \-
     A                                      "#EBF5FF\"; ","design overlay forma-
     A                                      ts":"rcdPanel"},"items":[{"id":"Hdg-
     A                                      BillInfo","field type":"output fiel-
     A                                      d","css class":"heading","value":"B-
     A                                      illed Information","left":"260px","-
     A                                      top":"100px","width":"160px","headi-
     A                                      ng type":"Section Header","text ali-
     A                                      gn":"left"},{"id":"LblSpecCode","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"label","value":"Specialty Code",-
     A                                      "left":"260px","top":"135px","width-
     A                                      ":"105px"},{"id":"LblPCIN","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Prof/Tech Component I-
     A                                      ndicator","left":"565px","top":"135-
     A                                      px","width":"190px"},{"id":"LblMod5-
     A                                      0IN","field type":"output field","c-
     A                                      ss class":"label","value":"Modifier-
     A                                       50 Indicator","left":"870px","top"-
     A                                      :"135px","width":"135px"},{"id":"Tx-
     A                                      bSpCd","field type":"textbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"scSpCd","dataLength":"3","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scSpCd]"},"text align-
     A                                      ":"left","left":"260px","top":"150p-
     A                                      x","width":"200px","css class 2":"t-
     A                                      extbox","choices database file":"FT-
     A                                      SPP","choice options field":"TRIM(S-
     A                                      PKEY)|| '' - '' ||TRIM(SPDESC)","ch-
     A                                      oice values field":"SPKEY","choices-
     A                                       selection criteria":"SPSTAT<>''I''-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"contains match":"true","set f-
     A                                      ocus":"true","tool tip":"Provider S-
     A                                      pecialty Code."},{"id":"LblBlank","-
     A                                      field type":"checkbox","css class":-
     A                                      "label","value":{"fieldName":"scBSP-
     A                                      B","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scBSPB]"},"left":"470px","to-
     A                                      p":"150px","width":"50px","label":"-
     A                                      Blank","checked value":"Y","disable-
     A                                      d":{"fieldName":"inquiry","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"tool-
     A                                       tip":"Flag used to require a blank-
     A                                       in the Specialty Code field."},{"i-
     A                                      d":"TxbPCIN","field type":"select b-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"scPCIn","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":')
     A                                  1  2HTML('"[scPCIn]"},"text align":"lef-
     A                                      t","left":"565px","top":"150px","wi-
     A                                      dth":"250px","css class 2":"textbox-
     A                                      ","choices database file":"FTGTP","-
     A                                      choice options field":"TRIM(GTKEY)|-
     A                                      | '' - '' ||TRIM(GTDESC)","choice v-
     A                                      alues field":"GTKEY","choices selec-
     A                                      tion criteria":{"fieldName":"SelBPC-
     A                                      In","dataLength":"100","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"disa-
     A                                      bled":{"fieldName":"inquiry","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"o-
     A                                      rder by":"GTKEY","blank option":"tr-
     A                                      ue","tool tip":"Matches the Procedu-
     A                                      re/HCPCS/Service Code Prof/Tech Com-
     A                                      ponent Indicator, e.g., 26/TC canno-
     A                                      t be used with physician codes, Con-
     A                                      cept does not apply, etc. "},{"id":-
     A                                      "DrpMod50IN","field type":"select b-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"sc50IN","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[sc50IN]"},"t-
     A                                      ext align":"left","left":"870px","t-
     A                                      op":"150px","width":"250px","css cl-
     A                                      ass 2":"textbox","choices selection-
     A                                       criteria":{"fieldName":"selB50IN",-
     A                                      "dataLength":"100","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"},"disabled-
     A                                      ":{"fieldName":"inquiry","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"choic-
     A                                      es database file":"FTGTP","choice o-
     A                                      ptions field":"TRIM(GTKEY)|| '' - '-
     A                                      ' ||TRIM(GTDESC)","choice values fi-
     A                                      eld":"GTKEY","order by":"GTKEY","bl-
     A                                      ank option":"true","tool tip":"Matc-
     A                                      hes the Procedure/HCPCS/Service Cod-
     A                                      e Modifier 50 Indicator, e.g., 150%-
     A                                       adjustment does not apply, Concept-
     A                                       does not apply, etc."},{"id":"LblB-
     A                                      RT","field type":"output field","cs-
     A                                      s class":"label","value":"By Report-
     A                                      ","left":"260px","top":"175px","wid-
     A                                      th":"70px"},{"id":"LblProcCode","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"label","value":"From Procedure C-
     A                                      ode","left":"565px","top":"175px","-
     A                                      width":"125px"},{"id":"Image1","fie-
     A                                      ld type":"image","css class":"image-
     A                                      ","image source":"/profoundui/userd-
     A                                      ata/images/asterisk_orange_small.pn-
     A                                      g","left":"690px","top":"175px","he-
     A                                      ight":"8px","width":"8px","css clas-
     A                                      s 2":"required-icon"},{"id":"LblTPr-
     A                                      ocCode","field type":"output field"-
     A                                      ,"css class":"label","value":"To Pr-
     A                                      ocedure Code","left":"870px","top":-
     A                                      "175px","width":"110px"},{"id":"Txb-
     A                                      BRT","field type":"se')
     A                                  1  2HTML('lect box","css class":"input"-
     A                                      ,"value":{"fieldName":"scBRT","data-
     A                                      Length":"1","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[s-
     A                                      cBRT]"},"text align":"left","left":-
     A                                      "260px","top":"190px","width":"250p-
     A                                      x","css class 2":"textbox","disable-
     A                                      d":{"fieldName":"inquiry","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"choi-
     A                                      ces database file":"FTGTP","choice -
     A                                      options field":"TRIM(GTKEY)|| '' - -
     A                                      '' ||TRIM(GTDESC)","choice values f-
     A                                      ield":"GTKEY","choices selection cr-
     A                                      iteria":{"fieldName":"SelBBRT","dat-
     A                                      aLength":"100","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"},"order by":"G-
     A                                      TKEY","blank option":"true","tool t-
     A                                      ip":"The primary purpose of this fi-
     A                                      eld is to determine if a procedure -
     A                                      is paid By-Report (set to Y). This -
     A                                      field may be used for other busines-
     A                                      s purposes.  For instance, if X is -
     A                                      entered and it matches the billed c-
     A                                      ode By-Report value, then it will d-
     A                                      eny with a message that the service-
     A                                       is not covered.\n"},{"id":"TxbProc-
     A                                      Code","field type":"textbox","css c-
     A                                      lass":"input","value":{"fieldName":-
     A                                      "scBFCD","dataLength":"11","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"uppercas-
     A                                      e","designValue":"[scBFCD]"},"text -
     A                                      align":"left","left":"565px","top":-
     A                                      "190px","width":"75px","css class 2-
     A                                      ":"textbox","disabled":{"fieldName"-
     A                                      :"inquiry","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"text transform":"up-
     A                                      percase","tool tip":"Beginning of P-
     A                                      rocedure/HCPCS/Service Code range."-
     A                                      },{"id":"TxbTProcCode","field type"-
     A                                      :"textbox","css class":"input","val-
     A                                      ue":{"fieldName":"scBTCd","dataLeng-
     A                                      th":"11","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [scBTCd]"},"text align":"left","lef-
     A                                      t":"870px","top":"190px","width":"7-
     A                                      5px","css class 2":"textbox","disab-
     A                                      led":{"fieldName":"inquiry","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"al-
     A                                      low blanks":"false","error message"-
     A                                      :{"fieldName":"msBTCd","dataLength"-
     A                                      :"100","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Te')
     A                                  1  2HTML('xt","textTransform":"none"},"-
     A                                      error condition":{"fieldName":"erBT-
     A                                      Cd","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error enhanced mode":"1","error m-
     A                                      essages":"1 message","text transfor-
     A                                      m":"uppercase","tool tip":"End of P-
     A                                      rocedure/HCPCS/Service Code range."-
     A                                      },{"id":"LblFromMod","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"From Modifier","left":"260p-
     A                                      x","top":"215px","width":"115px"},{-
     A                                      "id":"LblToMod","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"To Modifier","left":"870px","top-
     A                                      ":"215px","width":"90px"},{"id":"Tx-
     A                                      bFromMod","field type":"textbox","c-
     A                                      ss class":"input","value":{"fieldNa-
     A                                      me":"scBfMd","dataLength":"2","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scBfMd]"},"text al-
     A                                      ign":"left","left":"260px","top":"2-
     A                                      30px","width":"250px","css class 2"-
     A                                      :"textbox","disabled":{"fieldName":-
     A                                      "inquiry","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"choices database fil-
     A                                      e":{"fieldName":"ChFTPMPxx","dataLe-
     A                                      ngth":"10","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"},"choice options f-
     A                                      ield":"TRIM(PMKEY)|| '' - '' ||TRIM-
     A                                      (PMDESC)","choice values field":"PM-
     A                                      KEY","choices selection criteria":{-
     A                                      "fieldName":"selBfMd","dataLength":-
     A                                      "100","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"},"contains match":"true-
     A                                      ","tool tip":"Beginning of Procedur-
     A                                      e/HCPCS/Service Code Modifier range-
     A                                      ."},{"id":"Cbxval","field type":"ch-
     A                                      eckbox","css class":"label","value"-
     A                                      :{"fieldName":"scVal","dataLength":-
     A                                      "1","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scVal]"},-
     A                                      "checked value":"Y","label":"From M-
     A                                      odifier has a Value","left":"565px"-
     A                                      ,"top":"230px","width":"50px","disa-
     A                                      bled":{"fieldName":"inquiry","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"t-
     A                                      ool tip":"Sets a flag requiring the-
     A                                       modifier to have a value in the as-
     A                                      sociated field of the Procedure/HCP-
     A                                      CS/Service Code."},{"id":"TxbToMod"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scBt-
     A                                      Md","dataLength":"2","trimLeading":-
     A                                      "false","trimTrailing')
     A                                  1  2HTML('":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[scBtMd]-
     A                                      "},"text align":"left","left":"870p-
     A                                      x","top":"230px","width":"250px","c-
     A                                      ss class 2":"textbox","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"choices d-
     A                                      atabase file":{"fieldName":"ChFTPMP-
     A                                      xx","dataLength":"10","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"},"choic-
     A                                      e options field":"TRIM(PMKEY)|| '' -
     A                                      - '' ||TRIM(PMDESC)","choice values-
     A                                       field":"PMKEY","choices selection -
     A                                      criteria":{"fieldName":"selBtMd","d-
     A                                      ataLength":"100","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"},"contains m-
     A                                      atch":"true","tool tip":"End of Pro-
     A                                      cedure/HCPCS/Service Code Modifier -
     A                                      range.\t"},{"id":"LblFHspTypS","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"label","value":"From Hospital Typ-
     A                                      e of Service","left":"260px","top":-
     A                                      "255px","width":"175px"},{"id":"Lbl-
     A                                      FHspTypSSts","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      Status","left":"480px","top":"255px-
     A                                      ","width":"45px"},{"id":"LblTHspTyp-
     A                                      S","field type":"output field","css-
     A                                       class":"label","value":"To Hospita-
     A                                      l Type of Service","left":"565px","-
     A                                      top":"255px","width":"175px"},{"id"-
     A                                      :"LblTHspTypSSts","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"Status","left":"785px","top":"-
     A                                      255px","width":"45px"},{"id":"LblSp-
     A                                      lRuleUsg","field type":"output fiel-
     A                                      d","css class":"label","value":"Spe-
     A                                      cial Rule Usage ","left":"870px","t-
     A                                      op":"255px","width":"115px"},{"id":-
     A                                      "TxbFHspTypS","field type":"select -
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"scFToS","dataLength":"2-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scFToS]"},"-
     A                                      text align":"left","left":"260px","-
     A                                      top":"270px","width":"210px","css c-
     A                                      lass 2":"textbox","disabled":{"fiel-
     A                                      dName":"inquiry","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"choices datab-
     A                                      ase file":"FTGTP","choice options f-
     A                                      ield":"TRIM(GTKEY)|| '' - '' ||TRIM-
     A                                      (GTDESC)","choice values field":"GT-
     A                                      KEY","choices selection criteria":{-
     A                                      "fieldName":"SelBFTos","dataLength"-
     A                                      :"100","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false"')
     A                                  1  2HTML(',"dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      order by":"GTKEY","blank option":"t-
     A                                      rue","tool tip":"From Hospital Type-
     A                                       of Service.  Used to select bills -
     A                                      of certain types, e.g. outpatient, -
     A                                      ASC ,etc."},{"id":"TxbFHspTypS2","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","value":{"fieldName":"scFTSS"-
     A                                      ,"dataLength":"1","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"uppercase","desig-
     A                                      nValue":"[scFTSS]"},"text align":"l-
     A                                      eft","left":"480px","top":"270px","-
     A                                      width":"10px","css class 2":"textbo-
     A                                      x","disabled":{"fieldName":"inquiry-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"text transform":"uppercase",-
     A                                      "tool tip":"Hospital Type of Servic-
     A                                      e Status"},{"id":"TxbTHspTypS","fie-
     A                                      ld type":"select box","css class":"-
     A                                      input","value":{"fieldName":"scTToS-
     A                                      ","dataLength":"2","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[scTToS]"},"text align":"left"-
     A                                      ,"left":"565px","top":"270px","widt-
     A                                      h":"210px","css class 2":"textbox",-
     A                                      "disabled":{"fieldName":"inquiry","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"choices database file":"FTGTP",-
     A                                      "choice options field":"TRIM(GTKEY)-
     A                                      || '' - '' ||TRIM(GTDESC)","choice -
     A                                      values field":"GTKEY","choices sele-
     A                                      ction criteria":{"fieldName":"SelBT-
     A                                      Tos","dataLength":"100","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"},"ord-
     A                                      er by":"GTKEY","blank option":"true-
     A                                      ","tool tip":"To Hospital Type of S-
     A                                      ervices.  Used to select bills of c-
     A                                      ertain types, e.g., outpatient, ASC-
     A                                      , etc."},{"id":"TxbTHspTypS2","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","value":{"fieldName":"scTTSS","d-
     A                                      ataLength":"1","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"uppercase","designVa-
     A                                      lue":"[scTTSS]"},"text align":"left-
     A                                      ","left":"785px","top":"270px","wid-
     A                                      th":"10px","css class 2":"textbox",-
     A                                      "disabled":{"fieldName":"inquiry","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"text transform":"uppercase","to-
     A                                      ol tip":"Hospital Type of Service S-
     A                                      tatus"},{"id":"TxbSplRuleUsg","fiel-
     A                                      d type":"select box","css class":"i-
     A                                      nput","value":{"field')
     A                                  1  2HTML('Name":"scBMRI","dataLength":"-
     A                                      1","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[scBMRI]"},-
     A                                      "text align":"left","left":"870px",-
     A                                      "top":"270px","width":"250px","css -
     A                                      class 2":"textbox","disabled":{"fie-
     A                                      ldName":"inquiry","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"choices data-
     A                                      base file":"FTGTP","choice options -
     A                                      field":"TRIM(GTKEY)|| '' - '' ||TRI-
     A                                      M(GTDESC)","choice values field":"G-
     A                                      TKEY","choices selection criteria":-
     A                                      {"fieldName":"SelBMRI","dataLength"-
     A                                      :"100","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"blank option":"true"-
     A                                      ,"order by":"GTKEY","tool tip":"Det-
     A                                      ermines what Procedure/HCPCS/Servic-
     A                                      e Codes are included in the rule. P-
     A                                      rocedure/HCPCS/Service Codes must b-
     A                                      e flagged accordingly in the state -
     A                                      code file.  This is used when range-
     A                                      s are not contiguous, and it would -
     A                                      require too many rules.  You could -
     A                                      have the range from 97001 to 97949 -
     A                                      but flag the codes so that only cod-
     A                                      es with Q = PT Evaluation are inclu-
     A                                      ded in the count."},{"id":"LblFHspB-
     A                                      ill","field type":"output field","c-
     A                                      ss class":"label","value":"From Hos-
     A                                      pital Type of Bill","left":"260px",-
     A                                      "top":"295px","width":"160px"},{"id-
     A                                      ":"LblTHspBill","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"To Hospital Type of Bill","left"-
     A                                      :"565px","top":"295px","width":"150-
     A                                      px"},{"id":"LblFPlaceSv","field typ-
     A                                      e":"output field","css class":"labe-
     A                                      l","value":"From Place of Service",-
     A                                      "left":"870px","top":"295px","width-
     A                                      ":"145px"},{"id":"TxbFHspBill","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","value":{"fieldName":"scFToB","-
     A                                      dataLength":"3","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scFToB]"},"text align":"left","l-
     A                                      eft":"260px","top":"310px","width":-
     A                                      "250px","css class 2":"textbox","di-
     A                                      sabled":{"fieldName":"inquiry","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "choices database file":"FTGTP","ch-
     A                                      oice options field":"TRIM(GTKEY)|| -
     A                                      '' - '' ||TRIM(GTDESC)","choice val-
     A                                      ues field":"GTKEY","choices selecti-
     A                                      on criteria":{"fieldName":"SelBFToB-
     A                                      ","dataLength":"100","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"')
     A                                  1  2HTML('none"},"contains match":"true-
     A                                      ","tool tip":"From Type of Bill (us-
     A                                      ed on Hospital bills). "},{"id":"Tx-
     A                                      bTHspBill","field type":"textbox","-
     A                                      css class":"input","value":{"fieldN-
     A                                      ame":"scTToB","dataLength":"3","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scTToB]"},"text a-
     A                                      lign":"left","left":"565px","top":"-
     A                                      310px","width":"250px","css class 2-
     A                                      ":"textbox","disabled":{"fieldName"-
     A                                      :"inquiry","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"choices database fi-
     A                                      le":"FTGTP","choice options field":-
     A                                      "TRIM(GTKEY)|| '' - '' ||TRIM(GTDES-
     A                                      C)","choice values field":"GTKEY","-
     A                                      choices selection criteria":{"field-
     A                                      Name":"SelBTToB","dataLength":"100"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"},"contains match":"true","to-
     A                                      ol tip":"To Type of Bill (used on H-
     A                                      ospital bills)."},{"id":"TxbFPlaceS-
     A                                      v","field type":"textbox","css clas-
     A                                      s":"input","value":{"fieldName":"sc-
     A                                      BFPS","dataLength":"3","decPos":"0"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","numBlankFill":"false","zeroFi-
     A                                      ll":"false","noExtraSpaces":"false"-
     A                                      ,"curSym":"","dataType":"zoned","fo-
     A                                      rmatting":"Number","negNum":"999.00-
     A                                      ","units":"","designValue":"[scBFPS-
     A                                      ]"},"text align":"left","left":"870-
     A                                      px","top":"310px","width":"250px","-
     A                                      css class 2":"textbox","disabled":{-
     A                                      "fieldName":"inquiry","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"choices -
     A                                      database file":{"fieldName":"chFTPS-
     A                                      Pxx","dataLength":"10","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"choi-
     A                                      ce options field":"TRIM(PSPOS)|| ''-
     A                                       - '' ||TRIM(PSDESC)","choice value-
     A                                      s field":"PSPOS","choices selection-
     A                                       criteria":{"fieldName":"SelBFPS","-
     A                                      dataLength":"100","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"},"contains -
     A                                      match":"true","tool tip":"From Plac-
     A                                      e of Service (used on Physician and-
     A                                       Hospital bills)."},{"id":"LblTPlac-
     A                                      eSv","field type":"output field","c-
     A                                      ss class":"label","value":"To Place-
     A                                       of Service","left":"260px","top":"-
     A                                      335px","width":"115px"},{"id":"LblF-
     A                                      UT","field type":"output field","cs-
     A                                      s class":"label","value":"Follow-Up-
     A                                       Days Logic Type","left":"565px","t-
     A                                      op":"335px","width":"')
     A                                  1  2HTML('185px"},{"id":"LblAneCalTyp",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","value":"Anesthesia Ca-
     A                                      lculation Type","left":"870px","top-
     A                                      ":"335px","width":"170px"},{"id":"T-
     A                                      xbTPlaceSv","field type":"textbox",-
     A                                      "css class":"input","value":{"field-
     A                                      Name":"scBTPS","dataLength":"3","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","numBlankFill":"false-
     A                                      ","zeroFill":"false","noExtraSpaces-
     A                                      ":"false","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"999.00","units":"","designValue"-
     A                                      :"[scBTPS]"},"text align":"left","l-
     A                                      eft":"260px","top":"350px","width":-
     A                                      "250px","css class 2":"textbox","di-
     A                                      sabled":{"fieldName":"inquiry","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "choices database file":{"fieldName-
     A                                      ":"chFTPSPxx","dataLength":"10","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"},"choice options field":"TRIM(PS-
     A                                      POS)|| '' - '' ||TRIM(PSDESC)","cho-
     A                                      ice values field":"PSPOS","choices -
     A                                      selection criteria":{"fieldName":"S-
     A                                      elBTPS","dataLength":"100","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      contains match":"true","tool tip":"-
     A                                      To Place of Service (used on Physic-
     A                                      ian and Hospital bills).\t"},{"id":-
     A                                      "TxbFUT","field type":"select box",-
     A                                      "css class":"input","value":{"field-
     A                                      Name":"scBFUT","dataLength":"1","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scBFUT]"},"text -
     A                                      align":"left","left":"565px","top":-
     A                                      "350px","width":"250px","css class -
     A                                      2":"textbox","disabled":{"fieldName-
     A                                      ":"inquiry","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"choices database f-
     A                                      ile":"FTGTP","choice options field"-
     A                                      :"TRIM(GTKEY)|| '' - '' ||TRIM(GTDE-
     A                                      SC)","choice values field":"GTKEY",-
     A                                      "choices selection criteria":{"fiel-
     A                                      dName":"SelBFUT","dataLength":"100"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"},"order by":"GTKEY","blank o-
     A                                      ption":"true","tool tip":"Some stat-
     A                                      es have different Follow up day log-
     A                                      ic.  Some states flag certain codes-
     A                                       to allow an office visit on the sa-
     A                                      me day, or to allow with a message,-
     A                                       etc.  The rule compares Follow up -
     A                                      Days Logic type with the Follow Up -
     A                                      Day flag in the Proce')
     A                                  1  2HTML('dure/HCPCS/Service Code."},{"-
     A                                      id":"TxbAneCalTyp","field type":"se-
     A                                      lect box","css class":"input","valu-
     A                                      e":{"fieldName":"scTAne","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"uppercase","designValue":"[s-
     A                                      cTAne]"},"text align":"left","left"-
     A                                      :"870px","top":"350px","width":"250-
     A                                      px","css class 2":"textbox","disabl-
     A                                      ed":{"fieldName":"inquiry","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"cho-
     A                                      ices database file":"FTGTP","choice-
     A                                       options field":"TRIM(GTKEY)|| '' --
     A                                       '' ||TRIM(GTDESC)","choice values -
     A                                      field":"GTKEY","choices selection c-
     A                                      riteria":{"fieldName":"SelBTAne","d-
     A                                      ataLength":"100","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"},"order by":-
     A                                      "GTKEY","blank option":"true","tool-
     A                                       tip":"Type of anesthesia calculati-
     A                                      on. Varies by state."},{"id":"LblDr-
     A                                      ugType","field type":"output field"-
     A                                      ,"css class":"label","value":"Drug -
     A                                      Type","left":"260px","top":"375px",-
     A                                      "width":"80px"},{"id":"LblBodyPart"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value":"Body Part","-
     A                                      left":"565px","top":"375px","width"-
     A                                      :"70px"},{"id":"LblPrvGrp","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Provider Peer Group",-
     A                                      "left":"870px","top":"375px","width-
     A                                      ":"125px"},{"id":"TxbDrugType","fie-
     A                                      ld type":"select box","css class":"-
     A                                      input","value":{"fieldName":"scPTyp-
     A                                      ","dataLength":"2","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[scPTyp]"},"text align":"left"-
     A                                      ,"left":"260px","top":"390px","widt-
     A                                      h":"250px","css class 2":"textbox",-
     A                                      "disabled":{"fieldName":"inquiry","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"choices database file":"FTGTP",-
     A                                      "choice options field":"TRIM(GTKEY)-
     A                                      || '' - '' ||TRIM(GTDESC)","choice -
     A                                      values field":"GTKEY","choices sele-
     A                                      ction criteria":{"fieldName":"SelBP-
     A                                      Typ","dataLength":"100","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"},"ord-
     A                                      er by":"GTKEY","blank option":"true-
     A                                      ","tool tip":"Used to determine if -
     A                                      this is a brand name drug calculati-
     A                                      on or a generic drug calculation.  -
     A                                      01 for brand name and 07 for generi-
     A                                      c are typically used.\t"},{"id":"Tx-
     A                                      bBodyPart","field typ')
     A                                  1  2HTML('e":"select box","css class":"-
     A                                      input","value":{"fieldName":"scBPrt-
     A                                      ","dataLength":"2","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[scBPrt]"},"text align":"left"-
     A                                      ,"left":"565px","top":"390px","widt-
     A                                      h":"250px","css class 2":"textbox",-
     A                                      "disabled":{"fieldName":"inquiry","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"choices database file":{"fieldN-
     A                                      ame":"chFTPAPxx","dataLength":"10",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"choice options field":"TRIM-
     A                                      (PAKEY)|| '' - '' ||TRIM(PADESC)","-
     A                                      choice values field":"PAKEY","choic-
     A                                      es selection criteria":{"fieldName"-
     A                                      :"SelBPrt","dataLength":"100","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      },"order by":"PAKEY","blank option"-
     A                                      :"true","tool tip":"Part of body as-
     A                                      sociated with the Procedure/HCPCS/S-
     A                                      ervice Code."},{"id":"TxbPrvGrp","f-
     A                                      ield type":"select box","css class"-
     A                                      :"input","value":{"fieldName":"scPG-
     A                                      rp","dataLength":"5","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scPGrp]"},"text align":"lef-
     A                                      t","left":"870px","top":"390px","wi-
     A                                      dth":"250px","css class 2":"textbox-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"choices database file":{"fiel-
     A                                      dName":"chFTFTPxx","dataLength":"10-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"},"choice options field":"TR-
     A                                      IM(FTKEY)|| '' - '' ||TRIM(FTDESC)"-
     A                                      ,"choice values field":"FTKEY","cho-
     A                                      ices selection criteria":{"fieldNam-
     A                                      e":"SelBPGrp","dataLength":"100","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"},"blank option":"true","order b-
     A                                      y":"FTKEY","tool tip":"Used to dete-
     A                                      rmine if the provider has a peer gr-
     A                                      oup set up.  Checks the providers p-
     A                                      eer group.  "},{"id":"LblSpecValPro-
     A                                      cCode","field type":"output field",-
     A                                      "css class":"label","value":"Check -
     A                                      Specific Value in Procedure Code ",-
     A                                      "left":"260px","top":"415px","width-
     A                                      ":"235px"},{"id":"Lbl')
     A                                  1  2HTML('CCSRuleUsg","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"Correct Coding Special Rule Us-
     A                                      age","left":"565px","top":"415px","-
     A                                      width":"205px"},{"id":"LblServiceTy-
     A                                      pe","field type":"output field","cs-
     A                                      s class":"label","value":"Type of S-
     A                                      ervice","left":"870px","top":"415px-
     A                                      ","width":"105px"},{"id":"TxbSpecVa-
     A                                      lProcCode","field type":"select box-
     A                                      ","css class":"input","value":{"fie-
     A                                      ldName":"scAVAL","dataLength":"1","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scAVAL]"},"tex-
     A                                      t align":"left","left":"260px","top-
     A                                      ":"430px","width":"250px","css clas-
     A                                      s 2":"textbox","disabled":{"fieldNa-
     A                                      me":"inquiry","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"choices database-
     A                                       file":"FTGTP","choice options fiel-
     A                                      d":"TRIM(GTKEY)|| '' - '' ||TRIM(GT-
     A                                      DESC)","choice values field":"GTKEY-
     A                                      ","choices selection criteria":{"fi-
     A                                      eldName":"SelBAVAL","dataLength":"1-
     A                                      00","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"},"order by":"GTKEY","blan-
     A                                      k option":"true","tool tip":"Determ-
     A                                      ines how to calculate based on whet-
     A                                      her an amount is established for AS-
     A                                      C or MRA."},{"id":"TxbCCSRuleUsg","-
     A                                      field type":"select box","css class-
     A                                      ":"input","value":{"fieldName":"scC-
     A                                      Cod","dataLength":"1","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scCCod]"},"text align":"le-
     A                                      ft","left":"565px","top":"430px","w-
     A                                      idth":"250px","css class 2":"textbo-
     A                                      x","disabled":{"fieldName":"inquiry-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"choices database file":"FTGT-
     A                                      P","choice options field":"TRIM(GTK-
     A                                      EY)|| '' - '' ||TRIM(GTDESC)","choi-
     A                                      ce values field":"GTKEY","choices s-
     A                                      election criteria":{"fieldName":"Se-
     A                                      lBCCod","dataLength":"100","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      order by":"GTKEY","blank option":"t-
     A                                      rue","tool tip":"These values deter-
     A                                      mine how to pay or deny Correct Cod-
     A                                      ing Edit Pairs. For instance, if yo-
     A                                      u want to allow the code with a mod-
     A                                      ifier or just pay and give a messag-
     A                                      e.  These values should rarely chan-
     A                                      ge so not much maintenanceis requir-
     A                                      ed."},{"id":"TxbServiceType","field-
     A                                       type":"textbox","css')
     A                                  1  2HTML(' class":"input","value":{"fie-
     A                                      ldName":"scBToS","dataLength":"3","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"[scBToS]"},"tex-
     A                                      t align":"left","left":"870px","top-
     A                                      ":"430px","width":"250px","css clas-
     A                                      s 2":"textbox","disabled":{"fieldNa-
     A                                      me":"inquiry","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"choices database-
     A                                       file":"FTTSP","choice options fiel-
     A                                      d":"TRIM(SUBSTR(TSKEY,3,8))|| '' - -
     A                                      '' ||TRIM(TSDESC)","choice values f-
     A                                      ield":"TSKEY","choices selection cr-
     A                                      iteria":{"fieldName":"SelBTos","dat-
     A                                      aLength":"100","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"},"contains mat-
     A                                      ch":"true","tool tip":"Type of Serv-
     A                                      ice."},{"id":"LblMod2","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"From Modifier 2","left":"-
     A                                      260px","top":"455px","width":"105px-
     A                                      "},{"id":"LblMod3","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"From Modifier 3","left":"565p-
     A                                      x","top":"455px","width":"105px"},{-
     A                                      "id":"LblMod4","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"From Modifier 4","left":"870px","-
     A                                      top":"455px","width":"105px"},{"id"-
     A                                      :"TxbMod2","field type":"textbox","-
     A                                      css class":"input","value":{"fieldN-
     A                                      ame":"scBMD2","dataLength":"2","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scBMD2]"},"text a-
     A                                      lign":"left","left":"260px","top":"-
     A                                      470px","width":"250px","css class 2-
     A                                      ":"textbox","disabled":{"fieldName"-
     A                                      :"inquiry","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"choices database fi-
     A                                      le":{"fieldName":"ChFTPMPxx","dataL-
     A                                      ength":"10","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"},"choice options -
     A                                      field":"TRIM(PMKEY)|| '' - '' ||TRI-
     A                                      M(PMDESC)","choice values field":"P-
     A                                      MKEY","choices selection criteria":-
     A                                      {"fieldName":"SelBMD2","dataLength"-
     A                                      :"100","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"contains match":"tru-
     A                                      e","tool tip":"This field points to-
     A                                       the state''s Procedure/HCPCS/Servi-
     A                                      ce Code Modifier screen."},{"id":"T-
     A                                      xbMod3","field type":"textbox","css-
     A                                       class":"input","valu')
     A                                  1  2HTML('e":{"fieldName":"scBMD3","dat-
     A                                      aLength":"2","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scBMD3]"},"text align":"left","left-
     A                                      ":"565px","top":"470px","width":"25-
     A                                      0px","css class 2":"textbox","disab-
     A                                      led":{"fieldName":"inquiry","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"ch-
     A                                      oices database file":{"fieldName":"-
     A                                      ChFTPMPxx","dataLength":"10","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      ,"choice options field":"TRIM(PMKEY-
     A                                      )|| '' - '' ||TRIM(PMDESC)","choice-
     A                                       values field":"PMKEY","choices sel-
     A                                      ection criteria":{"fieldName":"SelB-
     A                                      MD2","dataLength":"100","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"},"con-
     A                                      tains match":"true","tool tip":"Thi-
     A                                      s field points to the state''s Proc-
     A                                      edure/HCPCS/Service Code Modifier s-
     A                                      creen."},{"id":"TxbMod4","field typ-
     A                                      e":"textbox","css class":"input","v-
     A                                      alue":{"fieldName":"scBMD4","dataLe-
     A                                      ngth":"2","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scB-
     A                                      MD4]"},"text align":"left","left":"-
     A                                      870px","top":"470px","width":"250px-
     A                                      ","css class 2":"textbox","disabled-
     A                                      ":{"fieldName":"inquiry","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"choic-
     A                                      es database file":{"fieldName":"ChF-
     A                                      TPMPxx","dataLength":"10","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"},"c-
     A                                      hoice options field":"TRIM(PMKEY)||-
     A                                       '' - '' ||TRIM(PMDESC)","choice va-
     A                                      lues field":"PMKEY","choices select-
     A                                      ion criteria":{"fieldName":"SelBMD2-
     A                                      ","dataLength":"100","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"},"contai-
     A                                      ns match":"true","tool tip":"This f-
     A                                      ield points to the state''s Procedu-
     A                                      re/HCPCS/Service Code Modifier scre-
     A                                      en."},{"id":"LblMod51","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Modifier 51 Indicator","l-
     A                                      eft":"260px","top":"495px","width":-
     A                                      "125px"},{"id":"LblMod62","field ty-
     A                                      pe":"output field","css class":"lab-
     A                                      el","value":"Modifier 62 Indicator"-
     A                                      ,"left":"565px","top"')
     A                                  1  2HTML(':"495px","width":"125px"},{"i-
     A                                      d":"LblMod66","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Modifier 66 Indicator","left":"870-
     A                                      px","top":"495px","width":"155px"},-
     A                                      {"id":"TxbMod51","field type":"sele-
     A                                      ct box","css class":"input","value"-
     A                                      :{"fieldName":"sc51IN","dataLength"-
     A                                      :"1","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[sc51IN]"-
     A                                      },"text align":"left","left":"260px-
     A                                      ","top":"510px","width":"250px","cs-
     A                                      s class 2":"textbox","disabled":{"f-
     A                                      ieldName":"inquiry","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"choices da-
     A                                      tabase file":"FTGTP","choice option-
     A                                      s field":"TRIM(GTKEY)|| '' - '' ||T-
     A                                      RIM(GTDESC)","choice values field":-
     A                                      "GTKEY","choices selection criteria-
     A                                      ":{"fieldName":"selB51IN","dataLeng-
     A                                      th":"100","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"},"order by":"GTKEY"-
     A                                      ,"blank option":"true","tool tip":"-
     A                                      This indicator is used by many diff-
     A                                      erent codes and will have different-
     A                                       values, e.g., Concept does not app-
     A                                      ly, No adjustment for multiple proc-
     A                                      edures, etc."},{"id":"TxbMod62","fi-
     A                                      eld type":"select box","css class":-
     A                                      "input","value":{"fieldName":"sc62I-
     A                                      N","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[sc62IN]"},"text align":"left-
     A                                      ","left":"565px","top":"510px","wid-
     A                                      th":"250px","css class 2":"textbox"-
     A                                      ,"disabled":{"fieldName":"inquiry",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"choices database file":"FTGTP"-
     A                                      ,"choice options field":"TRIM(GTKEY-
     A                                      )|| '' - '' ||TRIM(GTDESC)","choice-
     A                                       values field":"GTKEY","choices sel-
     A                                      ection criteria":{"fieldName":"SelB-
     A                                      62IN","dataLength":"100","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"or-
     A                                      der by":"GTKEY","blank option":"tru-
     A                                      e","tool tip":"This indicator is us-
     A                                      ed by many different codes and will-
     A                                       have different values, e.g., Conce-
     A                                      pt does not apply, Co-surgeons not -
     A                                      permitted, etc."},{"id":"TxbMod66",-
     A                                      "field type":"select box","css clas-
     A                                      s":"input","value":{"fieldName":"sc-
     A                                      66IN","dataLength":"1","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char",')
     A                                  1  2HTML('"formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[sc66I-
     A                                      N]"},"text align":"left","left":"87-
     A                                      0px","top":"510px","width":"250px",-
     A                                      "css class 2":"textbox","disabled":-
     A                                      {"fieldName":"inquiry","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"choices-
     A                                       database file":"FTGTP","choice opt-
     A                                      ions field":"TRIM(GTKEY)|| '' - '' -
     A                                      ||TRIM(GTDESC)","choice values fiel-
     A                                      d":"GTKEY","choices selection crite-
     A                                      ria":{"fieldName":"SelB66IN","dataL-
     A                                      ength":"100","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"},"order by":"GTK-
     A                                      EY","blank option":"true","tool tip-
     A                                      ":"This indicator is used by many d-
     A                                      ifferent codes and will have differ-
     A                                      ent values, e.g., Concept does not -
     A                                      apply, Team-surgeons not permitted,-
     A                                       etc."},{"id":"LblAssSurg","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Assistant Surgeon Ind-
     A                                      icator","left":"260px","top":"535px-
     A                                      ","width":"170px"},{"id":"LblFAccDa-
     A                                      te","field type":"output field","cs-
     A                                      s class":"label","value":"From Acci-
     A                                      dent Date","left":"565px","top":"53-
     A                                      5px","width":"120px"},{"id":"LblTAc-
     A                                      cDate","field type":"output field",-
     A                                      "css class":"label","value":"To Acc-
     A                                      ident Date","left":"870px","top":"5-
     A                                      35px","width":"125px"},{"id":"TxbAs-
     A                                      sSurg","field type":"select box","c-
     A                                      ss class":"input","value":{"fieldNa-
     A                                      me":"sc80IN","dataLength":"1","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[sc80IN]"},"text al-
     A                                      ign":"left","left":"260px","top":"5-
     A                                      50px","width":"250px","css class 2"-
     A                                      :"textbox","disabled":{"fieldName":-
     A                                      "inquiry","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"choices database fil-
     A                                      e":"FTGTP","choice options field":"-
     A                                      TRIM(GTKEY)|| '' - '' ||TRIM(GTDESC-
     A                                      )","choice values field":"GTKEY","c-
     A                                      hoices selection criteria":{"fieldN-
     A                                      ame":"SelB80IN","dataLength":"100",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"order by":"GTKEY","blank op-
     A                                      tion":"true","tool tip":"This indic-
     A                                      ator is used by many different code-
     A                                      s and will have different values, e-
     A                                      .g., Concept does not apply, Assist-
     A                                      ant-surgeon may be paid, etc."},{"i-
     A                                      d":"TxbFAccDate","field type":"date-
     A                                       field","css class":"input","value"-
     A                                      :{"fieldName":"scFADt","dataLength"-
     A                                      :"8","decPos":"0","numSep":"false",-
     A                                      "zeroBalance":"false"')
     A                                  1  2HTML(',"numBlankFill":"false","zero-
     A                                      Fill":"false","noExtraSpaces":"fals-
     A                                      e","edtWrd":"''  /  /    ''","curSy-
     A                                      m":"","dataType":"zoned","formattin-
     A                                      g":"Number","negNum":"999.00","unit-
     A                                      s":"","designValue":"[scFADt]"},"re-
     A                                      quired":"false","error messages":"1-
     A                                       message","left":"565px","top":"550-
     A                                      px","width":"70px","css class 2":"d-
     A                                      ate input","disabled":{"fieldName":-
     A                                      "inquiry","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"error message":{"fie-
     A                                      ldName":"msFADt","dataLength":"100"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"},"error condition":{"fieldNa-
     A                                      me":"erFADt","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode":"1"-
     A                                      ,"tool tip":"Some rules are in effe-
     A                                      ct for certain accident dates."},{"-
     A                                      id":"TxbTAccDate","field type":"dat-
     A                                      e field","css class":"input","value-
     A                                      ":{"fieldName":"scTADt","dataLength-
     A                                      ":"8","decPos":"0","numSep":"false"-
     A                                      ,"zeroBalance":"false","numBlankFil-
     A                                      l":"false","zeroFill":"false","noEx-
     A                                      traSpaces":"false","edtWrd":"''  / -
     A                                       /    ''","curSym":"","dataType":"z-
     A                                      oned","formatting":"Number","negNum-
     A                                      ":"999.00","units":"","designValue"-
     A                                      :"[scTADt]"},"required":"false","er-
     A                                      ror messages":"1 message","left":"8-
     A                                      70px","top":"550px","width":"70px",-
     A                                      "css class 2":"date input","disable-
     A                                      d":{"fieldName":"inquiry","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message":{"fieldName":"msTADt","d-
     A                                      ataLength":"100","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"},"error cond-
     A                                      ition":{"fieldName":"erTADt","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error en-
     A                                      hanced mode":"1","tool tip":"Some r-
     A                                      ules are in effect for certain acci-
     A                                      dent dates."},{"id":"LblAPSI","fiel-
     A                                      d type":"output field","css class":-
     A                                      "label","value":"APC Payment Status-
     A                                       Indicator","left":"260px","top":"5-
     A                                      75px","width":"190px"},{"id":"LblIm-
     A                                      St","field type":"output field","cs-
     A                                      s class":"label","value":"Implant S-
     A                                      tatus","left":"565px","top":"575px"-
     A                                      ,"width":"105px"},{"id":"LblASPI","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"ASC Payment In-
     A                                      dicator","left":"870px","top":"575p-
     A                                      x","width":"155px"},{"id":"TxbAPSI"-
     A                                      ,"field type":"select box","css cla-
     A                                      ss":"input","value":{"fieldName":"s-
     A                                      cAPSI","dataLength":"')
     A                                  1  2HTML('1","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [scAPSI]"},"text align":"left","lef-
     A                                      t":"260px","top":"590px","width":"2-
     A                                      50px","css class 2":"textbox","disa-
     A                                      bled":{"fieldName":"inquiry","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      hoices database file":"FTGTP","choi-
     A                                      ce options field":"TRIM(GTKEY)|| ''-
     A                                       - '' ||TRIM(GTDESC)","choice value-
     A                                      s field":"GTKEY","choices selection-
     A                                       criteria":{"fieldName":"SelBAPSI",-
     A                                      "dataLength":"100","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"},"blank op-
     A                                      tion":"true","order by":"GTKEY","to-
     A                                      ol tip":"Represents Ambulatory Surg-
     A                                      ical Center (ASC) Payment Status In-
     A                                      dicators.  Codes are used primarily-
     A                                       with Texas (Medicare) state rules.-
     A                                        "},{"id":"TxbImSt","field type":"-
     A                                      select box","css class":"input","va-
     A                                      lue":{"fieldName":"scImSt","dataLen-
     A                                      gth":"1","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [scImSt]"},"text align":"left","lef-
     A                                      t":"565px","top":"590px","width":"2-
     A                                      50px","css class 2":"textbox","disa-
     A                                      bled":{"fieldName":"inquiry","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      hoices database file":"FTGTP","choi-
     A                                      ce values field":"GTKEY","choices s-
     A                                      election criteria":{"fieldName":"Se-
     A                                      lBIMST","dataLength":"100","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      choice options field":"TRIM(GTKEY)|-
     A                                      | '' - '' ||TRIM(GTDESC)","order by-
     A                                      ":"GTKEY","blank option":"true","to-
     A                                      ol tip":"Represent the status of im-
     A                                      plantable devices for billing.  Cod-
     A                                      es are used primarily with Texas (M-
     A                                      edicare) state rules. "},{"id":"Txb-
     A                                      ASPI","field type":"select box","cs-
     A                                      s class":"input","value":{"fieldNam-
     A                                      e":"scASPI","dataLength":"2","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"upperc-
     A                                      ase","designValue":"[scASPI]"},"tex-
     A                                      t align":"left","left":"870px","top-
     A                                      ":"590px","width":"250px","css clas-
     A                                      s 2":"textbox","disabled":{"fieldNa-
     A                                      me":"inquiry","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"ch')
     A                                  1  2HTML('oices database file":"FTGTP",-
     A                                      "choice values field":"GTKEY","choi-
     A                                      ces selection criteria":{"fieldName-
     A                                      ":"SelBASPI","dataLength":"100","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"},"choice options field":"TRIM(GT-
     A                                      KEY)|| '' - '' ||TRIM(GTDESC)","ord-
     A                                      er by":"GTKEY","blank option":"true-
     A                                      ","tool tip":"Represents Ambulatory-
     A                                       Surgical Center (ASC) Payment Indi-
     A                                      cators. Codes are used primarily wi-
     A                                      th Texas (Medicare) state rules"},{-
     A                                      "id":"CbxBInvl","field type":"check-
     A                                      box","css class":"checkbox","value"-
     A                                      :{"fieldName":"scBInvl","dataLength-
     A                                      ":"1","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[scBInvl-
     A                                      ]"},"checked value":"Y","label":"In-
     A                                      valid Procedure Code","left":"260px-
     A                                      ","top":"615px","width":"150px","di-
     A                                      sabled":{"fieldName":"inquiry","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "tool tip":"Certain Procedure/HCPCS-
     A                                      /Service Codes are not valid for a -
     A                                      particular State/Effective date.\n"-
     A                                      },{"id":"Cbxbast","field type":"che-
     A                                      ckbox","css class":"label","value":-
     A                                      {"fieldName":"scBAst","dataLength":-
     A                                      "1","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scBAst]"}-
     A                                      ,"checked value":"Y","label":"Aster-
     A                                      isk Procedure","left":"565px","top"-
     A                                      :"615px","width":"50px","disabled":-
     A                                      {"fieldName":"inquiry","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"tool ti-
     A                                      p":"No longer used."},{"id":"Cbxfud-
     A                                      ","field type":"checkbox","css clas-
     A                                      s":"checkbox","value":{"fieldName":-
     A                                      "scFUD","dataLength":"1","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[scFUD]"},"checked value-
     A                                      ":"Y","label":"Check Follow-Up Days-
     A                                      ","left":"870px","top":"615px","wid-
     A                                      th":"150px","disabled":{"fieldName"-
     A                                      :"inquiry","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"tool tip":"Flag use-
     A                                      d to require algorithm to verify ag-
     A                                      ainst Follow up days for other proc-
     A                                      edures billed for that case.\n"},{"-
     A                                      id":"Cbxnct","field type":"checkbox-
     A                                      ","css class":"checkbox","value":{"-
     A                                      fieldName":"scNCt","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill"')
     A                                  1  2HTML(':"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scNCt]"},"checked value":"Y-
     A                                      ","label":"No-Cut Procedure Pay in -
     A                                      Full","left":"260px","top":"640px",-
     A                                      "width":"150px","disabled":{"fieldN-
     A                                      ame":"inquiry","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"tool tip":"Dete-
     A                                      rmines if a procedure is a No-cut s-
     A                                      urgery code. No-cut codes are codes-
     A                                       that are exempt from Multiple Proc-
     A                                      edure Reductions."},{"id":"Cbxbsep"-
     A                                      ,"field type":"checkbox","css class-
     A                                      ":"checkbox","value":{"fieldName":"-
     A                                      scBSep","dataLength":"1","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[scBSep]"},"checked valu-
     A                                      e":"Y","label":"Separate Procedure"-
     A                                      ,"left":"565px","top":"640px","widt-
     A                                      h":"150px","disabled":{"fieldName":-
     A                                      "inquiry","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"tool tip":"Separate -
     A                                      Procedure Flag."},{"id":"CbxBDex","-
     A                                      field type":"checkbox","css class":-
     A                                      "checkbox","value":{"fieldName":"sc-
     A                                      BDex","dataLength":"1","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scBDex]"},"checked value"-
     A                                      :"Y","label":"Provider is Exempt fr-
     A                                      om DRG Calcs","left":"870px","top":-
     A                                      "640px","width":"150px","disabled":-
     A                                      {"fieldName":"inquiry","customTrue"-
     A                                      :"","customFalse":"","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"tool ti-
     A                                      p":"Certain facilities are exempt f-
     A                                      rom the DRG calculation. They have -
     A                                      to be flagged with an * in the prov-
     A                                      ider''s state information file. "},-
     A                                      {"id":"Cbxbsrg","field type":"check-
     A                                      box","css class":"checkbox","value"-
     A                                      :{"fieldName":"scBSrg","dataLength"-
     A                                      :"1","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[scBSrg]"-
     A                                      },"checked value":"Y","label":"Assi-
     A                                      stant Surgeon","left":"260px","top"-
     A                                      :"665px","width":"150px","disabled"-
     A                                      :{"fieldName":"inquiry","customTrue-
     A                                      ":"","customFalse":"","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"tool t-
     A                                      ip":"Determines if a Procedure/HCPC-
     A                                      S/Service Code allows an Assistant -
     A                                      Surgeon."},{"id":"Cbxbfhe","field t-
     A                                      ype":"checkbox","css class":"checkb-
     A                                      ox","value":{"fieldName":"scBFhe","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"tr')
     A                                  1  2HTML('ue","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scBFhe]"},"c-
     A                                      hecked value":"Y","label":"Health P-
     A                                      rofessional Shortage Area","left":"-
     A                                      565px","top":"665px","width":"150px-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"tool tip":"Determines if serv-
     A                                      ices were performed in a Health Pro-
     A                                      fessional Shortage Area."},{"id":"C-
     A                                      bxcomp","field type":"checkbox","cs-
     A                                      s class":"checkbox","value":{"field-
     A                                      Name":"scCoMP","dataLength":"1","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scCoMP]"},"check-
     A                                      ed value":"Y","label":"Charged Amou-
     A                                      nt <= Fee Schedule","left":"870px",-
     A                                      "top":"665px","width":"150px","disa-
     A                                      bled":{"fieldName":"inquiry","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"t-
     A                                      ool tip":"Checks to see if charged -
     A                                      <= ASC allowance."},{"id":"CbxBFAd"-
     A                                      ,"field type":"checkbox","css class-
     A                                      ":"checkbox","value":{"fieldName":"-
     A                                      scBFAd","dataLength":"1","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[scBFAd]"},"checked valu-
     A                                      e":"Y","label":"Add-on Procedure Co-
     A                                      de","left":"260px","top":"690px","w-
     A                                      idth":"150px","disabled":{"fieldNam-
     A                                      e":"inquiry","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"tool tip":"Certai-
     A                                      n Procedure/HCPCS/Service Codes are-
     A                                       Add-on for a Primary Code and are -
     A                                      flagged accordingly in the file."},-
     A                                      {"id":"line2","field type":"horizon-
     A                                      tal line","css class":"line","line -
     A                                      style":"Dotted","left":"250px","top-
     A                                      ":"700px","height":"20px","width":"-
     A                                      970px"},{"id":"HdgPAPartA","field t-
     A                                      ype":"output field","css class":"he-
     A                                      ading","value":"Pennsylvania Part A-
     A                                      ","left":"260px","top":"720px","wid-
     A                                      th":"160px","heading type":"Subsect-
     A                                      ion Header"},{"id":"CbxMeMa","field-
     A                                       type":"checkbox","css class":"chec-
     A                                      kbox","value":{"fieldName":"scMeMa"-
     A                                      ,"dataLength":"1","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scMeMa]"},"checked value":"Y",-
     A                                      "label":"Medicare# Match","left":"2-
     A                                      60px","top":"745px","width":"150px"-
     A                                      ,"disabled":{"fieldName":"inquiry",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator",')
     A                                  1  2HTML('"formatting":"Indicator","ind-
     A                                      Format":"true / false"},"tool tip":-
     A                                      "Requires the Medicare number on th-
     A                                      e bill to match the Medicare number-
     A                                       in the table file."},{"id":"CbxMRM-
     A                                      a","field type":"checkbox","css cla-
     A                                      ss":"checkbox","value":{"fieldName"-
     A                                      :"scMRMa","dataLength":"1","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scMRMa]"},"checked va-
     A                                      lue":"Y","label":"Pharmacy RCC Medi-
     A                                      care# Match","left":"565px","top":"-
     A                                      745px","width":"150px","disabled":{-
     A                                      "fieldName":"inquiry","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"tool tip-
     A                                      ":"Checks for a match in the Ratio -
     A                                      of Cost to Charged (RCC) file. Not -
     A                                      currently being used."},{"id":"CbxD-
     A                                      RMa","field type":"checkbox","css c-
     A                                      lass":"checkbox","value":{"fieldNam-
     A                                      e":"scDRMa","dataLength":"1","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scDRMa]"},"checked -
     A                                      value":"Y","label":"DRG RCC Medicar-
     A                                      e# Match","left":"870px","top":"745-
     A                                      px","width":"150px","disabled":{"fi-
     A                                      eldName":"inquiry","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"tool tip":"-
     A                                      Checks for a match for the Medicare-
     A                                       number and RCC value in the Prospe-
     A                                      ctive Payment System table.\n"},{"i-
     A                                      d":"CbxFEMa","field type":"checkbox-
     A                                      ","css class":"checkbox","value":{"-
     A                                      fieldName":"scFEMa","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scFEMa]"},"-
     A                                      checked value":"Y","label":"DRG Fed-
     A                                      eral Register Match","left":"260px"-
     A                                      ,"top":"770px","width":"150px","dis-
     A                                      abled":{"fieldName":"inquiry","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      tool tip":"Checks for a match for t-
     A                                      he DRG code in the DRG Federal Regi-
     A                                      ster."},{"id":"CbxPOMa","field type-
     A                                      ":"checkbox","css class":"checkbox"-
     A                                      ,"value":{"fieldName":"scPOMa","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scPOMa]"},"checked value":"Y","labe-
     A                                      l":"PPS Medicare# Match","left":"56-
     A                                      5px","top":"770px","width":"150px",-
     A                                      "disabled":{"fieldName":"inquiry","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","')
     A                                  1  2HTML('formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"tool tip":"-
     A                                      Checks for a match for the Medicare-
     A                                       number in the Prospective Payment -
     A                                      System table."},{"id":"CbxSVal","fi-
     A                                      eld type":"checkbox","css class":"c-
     A                                      heckbox","value":{"fieldName":"scSV-
     A                                      al","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scSVal]"},"checked value":"-
     A                                      Y","label":"Service Code has a Valu-
     A                                      e","left":"870px","top":"770px","wi-
     A                                      dth":"150px","disabled":{"fieldName-
     A                                      ":"inquiry","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"tool tip":"Checks -
     A                                      for a value for the Medicare number-
     A                                      /Service code in the Charge Master -
     A                                      file."},{"id":"CbxSCMa","field type-
     A                                      ":"checkbox","css class":"checkbox"-
     A                                      ,"value":{"fieldName":"scSCMa","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scSCMa]"},"checked value":"Y","labe-
     A                                      l":"Service Code Match","left":"260-
     A                                      px","top":"795px","width":"150px","-
     A                                      disabled":{"fieldName":"inquiry","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"tool tip":"Checks for a match fo-
     A                                      r the Medicare number/Service code -
     A                                      in the Charge Master file."},{"id":-
     A                                      "line2_copy","field type":"horizont-
     A                                      al line","css class":"line","line s-
     A                                      tyle":"Dotted","left":"250px","top"-
     A                                      :"810px","height":"20px","width":"9-
     A                                      70px"}]}')
     A            CHFTFTPXX     10A  H
     A            CHFTPAPXX     10A  H
     A            CHFTPMPXX     10A  H
     A            CHFTPSPXX     10A  H
     A            ERBTCD         1A  H
     A            ERFADT         1A  H
     A            ERTADT         1A  H
     A            INQUIRY        1A  H
     A            MSBTCD       100A  H
     A            MSFADT       100A  H
     A            MSTADT       100A  H
     A            SC50IN         1A  H
     A            SC51IN         1A  H
     A            SC62IN         1A  H
     A            SC66IN         1A  H
     A            SC80IN         1A  H
     A            SCAPSI         1A  H
     A            SCASPI         2A  H
     A            SCAVAL         1A  H
     A            SCBAST         1A  H
     A            SCBDEX         1A  H
     A            SCBFAD         1A  H
     A            SCBFCD        11A  H
     A            SCBFHE         1A  H
     A            SCBFMD         2A  H
     A            SCBFPS         3S 0H
     A            SCBFUT         1A  H
     A            SCBINVL        1A  H
     A            SCBMD2         2A  H
     A            SCBMD3         2A  H
     A            SCBMD4         2A  H
     A            SCBMRI         1A  H
     A            SCBPRT         2A  H
     A            SCBRT          1A  H
     A            SCBSEP         1A  H
     A            SCBSPB         1A  H
     A            SCBSRG         1A  H
     A            SCBTCD        11A  H
     A            SCBTMD         2A  H
     A            SCBTOS         3A  H
     A            SCBTPS         3S 0H
     A            SCCCOD         1A  H
     A            SCCOMP         1A  H
     A            SCDRMA         1A  H
     A            SCFADT         8S 0H
     A            SCFEMA         1A  H
     A            SCFTOB         3A  H
     A            SCFTOS         2A  H
     A            SCFTSS         1A  H
     A            SCFUD          1A  H
     A            SCIMST         1A  H
     A            SCMEMA         1A  H
     A            SCMRMA         1A  H
     A            SCNCT          1A  H
     A            SCPCIN         1A  H
     A            SCPGRP         5A  H
     A            SCPOMA         1A  H
     A            SCPTYP         2A  H
     A            SCSCMA         1A  H
     A            SCSPCD         3A  H
     A            SCSVAL         1A  H
     A            SCTADT         8S 0H
     A            SCTANE         1A  H
     A            SCTTOB         3A  H
     A            SCTTOS         2A  H
     A            SCTTSS         1A  H
     A            SCVAL          1A  H
     A            SELB50IN     100A  H
     A            SELB51IN     100A  H
     A            SELB62IN     100A  H
     A            SELB66IN     100A  H
     A            SELB80IN     100A  H
     A            SELBAPSI     100A  H
     A            SELBASPI     100A  H
     A            SELBAVAL     100A  H
     A            SELBBRT      100A  H
     A            SELBCCOD     100A  H
     A            SELBFMD      100A  H
     A            SELBFPS      100A  H
     A            SELBFTOB     100A  H
     A            SELBFTOS     100A  H
     A            SELBFUT      100A  H
     A            SELBIMST     100A  H
     A            SELBMD2      100A  H
     A            SELBMRI      100A  H
     A            SELBPCIN     100A  H
     A            SELBPGRP     100A  H
     A            SELBPRT      100A  H
     A            SELBPTYP     100A  H
     A            SELBTANE     100A  H
     A            SELBTMD      100A  H
     A            SELBTOS      100A  H
     A            SELBTPS      100A  H
     A            SELBTTOB     100A  H
     A            SELBTTOS     100A  H
     A          R RCDCMPINFO
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdCmpInfo","description":"Comp-
     A                                      ared to Information","assume":"true-
     A                                      ","show as window":"false","overlay-
     A                                      ":"true","overlay range":"1-1","onl-
     A                                      oad":"document.body.style.backgroun-
     A                                      d = \"#EBF5FF\"; ","design overlay -
     A                                      formats":"rcdPanel"},"items":[{"id"-
     A                                      :"HdgCmpInfo","field type":"output -
     A                                      field","css class":"heading","value-
     A                                      ":"Compared to Information","left":-
     A                                      "260px","top":"100px","width":"160p-
     A                                      x","heading type":"Section Header",-
     A                                      "text align":"left"},{"id":"LblFPro-
     A                                      cCode","field type":"output field",-
     A                                      "css class":"label","value":"From P-
     A                                      rocedure Code","left":"260px","top"-
     A                                      :"135px","width":"125px"},{"id":"Lb-
     A                                      lToProcCode","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      To Procedure Code","left":"565px","-
     A                                      top":"135px","width":"125px"},{"id"-
     A                                      :"TxbFProcCode","field type":"textb-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"scCFCd","dataLength":"11-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"uppercase","designValue":"[scCFCd-
     A                                      ]"},"text align":"left","left":"260-
     A                                      px","top":"150px","width":"60px","c-
     A                                      ss class 2":"textbox","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"text tran-
     A                                      sform":"uppercase","tool tip":"Begi-
     A                                      nning of Procedure/HCPCS/Service Co-
     A                                      de range"},{"id":"TxbToProcCode","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","value":{"fieldName":"scCTCd"-
     A                                      ,"dataLength":"11","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"uppercase","desi-
     A                                      gnValue":"[scCTCd]"},"text align":"-
     A                                      left","left":"565px","top":"150px",-
     A                                      "width":"60px","css class 2":"textb-
     A                                      ox","disabled":{"fieldName":"inquir-
     A                                      y","customTrue":"","customFalse":""-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"text transform":"uppercase"-
     A                                      ,"tool tip":"End of Procedure/HCPCS-
     A                                      /Service Code range"},{"id":"CbxCPT-
     A                                      S","field type":"checkbox","css cla-
     A                                      ss":"checkbox","value":{"fieldName"-
     A                                      :"scCPTS","dataLength":"1","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scCPTS]"},"checked va-
     A                                      lue":"Y","label":"Billed Same as Co-
     A                                      mpared Procedure Code","left":"870p-
     A                                      x","top":"150px","width":"150px","d-
     A                                      isabled":{"fieldName":"inquiry","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"')
     A                                  1  2HTML('true / false"},"tool tip":"Fl-
     A                                      ag used to verify exact match again-
     A                                      st Billed Procedure/HCPCS/Service C-
     A                                      ode"},{"id":"LblEFProcCode","field -
     A                                      type":"output field","css class":"l-
     A                                      abel","value":"Exclude From Procedu-
     A                                      re Code","left":"260px","top":"175p-
     A                                      x","width":"180px"},{"id":"LblETPro-
     A                                      cCode","field type":"output field",-
     A                                      "css class":"label","value":"Exclud-
     A                                      e To Procedure Code","left":"565px"-
     A                                      ,"top":"175px","width":"170px"},{"i-
     A                                      d":"LblLoss","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      Stop Loss Payment Threshold","left"-
     A                                      :"870px","top":"175px","width":"185-
     A                                      px"},{"id":"TxbEFProcCode","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "value":{"fieldName":"scEFCd","data-
     A                                      Length":"11","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"uppercase","designValu-
     A                                      e":"[scEFCd]"},"text align":"left",-
     A                                      "left":"260px","top":"190px","width-
     A                                      ":"60px","css class 2":"textbox","d-
     A                                      isabled":{"fieldName":"inquiry","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"text transform":"uppercase","tool-
     A                                       tip":"From Procedure/HCPCS/Service-
     A                                       Code that will be excluded in the -
     A                                      comparison."},{"id":"TxbETProcCode"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scET-
     A                                      Cd","dataLength":"11","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"uppercase","d-
     A                                      esignValue":"[scETCd]"},"text align-
     A                                      ":"left","left":"565px","top":"190p-
     A                                      x","width":"60px","css class 2":"te-
     A                                      xtbox","disabled":{"fieldName":"inq-
     A                                      uiry","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"text transform":"upperca-
     A                                      se","tool tip":"To Procedure/HCPC/S-
     A                                      ervice Code that will be excluded i-
     A                                      n the comparison."},{"id":"TxbLoss"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scLo-
     A                                      ss","dataLength":"9","decPos":"2","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","numBlankFill":"false","zeroFill"-
     A                                      :"false","noExtraSpaces":"false","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","negNum":"-999.00",-
     A                                      "units":"","designValue":"[scLoss]"-
     A                                      },"text align":"right","left":"870p-
     A                                      x","top":"190px","width":"90px","cs-
     A                                      s class 2":"textbox","disabled":{"f-
     A                                      ieldName":"inquiry","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"tool tip":-
     A                                      "Maximum amount for stop loss.  Whe-
     A                                      n the payment exceeds this amount t-
     A                                      he state requires cal')
     A                                  1  2HTML('culations to limit the paymen-
     A                                      t to stop high losses."},{"id":"Lbl-
     A                                      Tlos","field type":"output field","-
     A                                      css class":"label","value":"Stop Lo-
     A                                      ss Payment Threshold Type","left":"-
     A                                      260px","top":"215px","width":"225px-
     A                                      "},{"id":"LblCMRI","field type":"ou-
     A                                      tput field","css class":"label","va-
     A                                      lue":"Special Rule Use","left":"565-
     A                                      px","top":"215px","width":"110px"},-
     A                                      {"id":"LblCPoS","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"Place of Service","left":"870px"-
     A                                      ,"top":"215px","width":"115px"},{"i-
     A                                      d":"TxbTlos","field type":"select b-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"scTlos","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scTlos]"},"t-
     A                                      ext align":"left","left":"260px","t-
     A                                      op":"230px","width":"250px","css cl-
     A                                      ass 2":"textbox","disabled":{"field-
     A                                      Name":"inquiry","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"choices databa-
     A                                      se file":"FTGTP","choice options fi-
     A                                      eld":"TRIM(GTKEY)|| '' - '' ||TRIM(-
     A                                      GTDESC)","choice values field":"GTK-
     A                                      EY","choices selection criteria":"G-
     A                                      TSTAT <> ''I'' AND GTTBID =''SLTY''-
     A                                       ","order by":"GTKEY","blank option-
     A                                      ":"true","tool tip":"Type of stop l-
     A                                      oss logic to apply. Certain states -
     A                                      have their own calculations to stop-
     A                                       high losses."},{"id":"TxbCMRI","fi-
     A                                      eld type":"select box","css class":-
     A                                      "input","value":{"fieldName":"scCMR-
     A                                      I","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing":"true","blank-
     A                                      Fill":"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scCMRI]"},"text align":"left-
     A                                      ","left":"565px","top":"230px","wid-
     A                                      th":"250px","css class 2":"textbox"-
     A                                      ,"disabled":{"fieldName":"inquiry",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"choices database file":"FTGTP"-
     A                                      ,"choice options field":"TRIM(GTKEY-
     A                                      )|| '' - '' ||TRIM(GTDESC)","choice-
     A                                       values field":"GTKEY","choices sel-
     A                                      ection criteria":"GTSTAT <> ''I'' A-
     A                                      ND GTTBID =''RLUS'' ","order by":"G-
     A                                      TKEY","tool tip":"Determines what P-
     A                                      rocedure/HCPCS/Service Codes are in-
     A                                      cluded in the rule.  Procedure/HCPC-
     A                                      S/Service Codes must be flagged acc-
     A                                      ordingly in the state code file. Th-
     A                                      is is used when ranges are not cont-
     A                                      iguous, and it would require too ma-
     A                                      ny rules.  You could have the range-
     A                                       from 97001 to 97949 but flag the c-
     A                                      odes so that only codes with Q = PT-
     A                                       Evaluation are included in the cou-
     A                                      nt."},{"id":"TxbCPoS","field type":-
     A                                      "textbox","css class"')
     A                                  1  2HTML(':"input","value":{"fieldName"-
     A                                      :"scCPoS","dataLength":"3","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"false","numBlankFill":"false","ze-
     A                                      roFill":"false","noExtraSpaces":"fa-
     A                                      lse","curSym":"","dataType":"zoned"-
     A                                      ,"formatting":"Number","negNum":"-9-
     A                                      99.00","units":"","designValue":"[s-
     A                                      cCPoS]"},"text align":"left","left"-
     A                                      :"870px","top":"230px","width":"250-
     A                                      px","css class 2":"textbox","disabl-
     A                                      ed":{"fieldName":"inquiry","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"cho-
     A                                      ices database file":{"fieldName":"c-
     A                                      hFTPSPxx","dataLength":"10","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "choice options field":"TRIM(PSPOS)-
     A                                      || '' - '' ||TRIM(PSDESC)","choice -
     A                                      values field":"PSPOS","choices sele-
     A                                      ction criteria":"PSSTAT <> ''I''","-
     A                                      contains match":"true","tool tip":"-
     A                                      Place of Service to be used for com-
     A                                      parison."},{"id":"LblCMod","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Modifier","left":"260-
     A                                      px","top":"255px","width":"70px"},{-
     A                                      "id":"LblCPrt","field type":"output-
     A                                       field","css class":"label","value"-
     A                                      :"Body Area","left":"870px","top":"-
     A                                      255px","width":"70px"},{"id":"TxbCM-
     A                                      od","field type":"textbox","css cla-
     A                                      ss":"input","value":{"fieldName":"s-
     A                                      cCMod","dataLength":"2","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scCMod]"},"text align":"-
     A                                      left","left":"260px","top":"270px",-
     A                                      "width":"250px","css class 2":"text-
     A                                      box","disabled":{"fieldName":"inqui-
     A                                      ry","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"choices database file":{"f-
     A                                      ieldName":"ChFTPMPxx","dataLength":-
     A                                      "10","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"},"choice options field":-
     A                                      "TRIM(PMKEY)|| '' - '' ||TRIM(PMDES-
     A                                      C)","choice values field":"PMKEY","-
     A                                      choices selection criteria":"PMSTAT-
     A                                       <>''I''","contains match":"true","-
     A                                      tool tip":"Modifier to be used for -
     A                                      comparison"},{"id":"CbxIGMd","field-
     A                                       type":"checkbox","css class":"chec-
     A                                      kbox","value":{"fieldName":"scIGMd"-
     A                                      ,"dataLength":"1","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scIGMd]"},"checked value":"Y",-
     A                                      "label":"Ignore Procedure Code Modi-
     A                                      fier","left":"565px",')
     A                                  1  2HTML('"top":"270px","width":"150px"-
     A                                      ,"disabled":{"fieldName":"inquiry",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"tool tip":"Tells the program t-
     A                                      o ignore the modifier when checking-
     A                                       history. The Code in case history -
     A                                      could have a modifier billed or not-
     A                                      . "},{"id":"TxbCPrt","field type":"-
     A                                      textbox","css class":"input","value-
     A                                      ":{"fieldName":"scCPrt","dataLength-
     A                                      ":"2","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[scCPrt]-
     A                                      "},"text align":"left","left":"870p-
     A                                      x","top":"270px","width":"250px","c-
     A                                      ss class 2":"textbox","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"choices d-
     A                                      atabase file":{"fieldName":"chFTPAP-
     A                                      xx","dataLength":"10","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"},"choic-
     A                                      e options field":"TRIM(PAKEY)|| '' -
     A                                      - '' ||TRIM(PADESC)","choice values-
     A                                       field":"PAKEY","choices selection -
     A                                      criteria":"PASTAT <> ''I''","contai-
     A                                      ns match":"true","tool tip":"Body p-
     A                                      art to be used for comparison."},{"-
     A                                      id":"LblCToB","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Hospital Bill Type","left":"260px"-
     A                                      ,"top":"295px","width":"115px"},{"i-
     A                                      d":"Lbl#Prc","field type":"output f-
     A                                      ield","css class":"label","value":"-
     A                                      Check Number of Procedures","left":-
     A                                      "565px","top":"295px","width":"185p-
     A                                      x"},{"id":"TxbCToB","field type":"t-
     A                                      extbox","css class":"input","value"-
     A                                      :{"fieldName":"scCToB","dataLength"-
     A                                      :"3","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[scCToB]"-
     A                                      },"text align":"left","left":"260px-
     A                                      ","top":"310px","width":"250px","cs-
     A                                      s class 2":"textbox","disabled":{"f-
     A                                      ieldName":"inquiry","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"choices da-
     A                                      tabase file":"FTGTP","choice option-
     A                                      s field":"TRIM(GTKEY)|| '' - '' ||T-
     A                                      RIM(GTDESC)","choice values field":-
     A                                      "GTKEY","choices selection criteria-
     A                                      ":"GTSTAT <> ''I'' AND GTTBID = ''N-
     A                                      YBT''","contains match":"true","too-
     A                                      l tip":"Type of Bill (Used in the H-
     A                                      ospital fee schedule)"},{"id":"Txb#-
     A                                      Prc","field type":"textbox","css cl-
     A                                      ass":"input","value":{"fieldName":"-
     A                                      sc#Prc","dataLength":"5","decPos":"-
     A                                      0","numSep":"false","zeroBalance":"-
     A                                      false","numBlankFill"')
     A                                  1  2HTML(':"false","zeroFill":"false","-
     A                                      noExtraSpaces":"false","curSym":"",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":""-
     A                                      ,"designValue":"[sc#Prc]"},"text al-
     A                                      ign":"right","left":"565px","top":"-
     A                                      310px","width":"75px","css class 2"-
     A                                      :"textbox","disabled":{"fieldName":-
     A                                      "inquiry","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"tool tip":"Checks th-
     A                                      e number of procedures in case hist-
     A                                      ory past the limit set by the state-
     A                                      . The procedures could have been pa-
     A                                      id or denied."},{"id":"Cbx#GPC","fi-
     A                                      eld type":"checkbox","css class":"c-
     A                                      heckbox","value":{"fieldName":"sc#G-
     A                                      PC","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[sc#GPC]"},"checked value":"-
     A                                      Y","label":"Greater than Number of -
     A                                      Procedures","left":"870px","top":"3-
     A                                      10px","width":"150px","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"tool tip"-
     A                                      :"Checking this box will count the -
     A                                      procedures in case history only if -
     A                                      they were paid."},{"id":"LblCFDy","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"Check Number o-
     A                                      f Days in the Future","left":"260px-
     A                                      ","top":"335px","width":"220px"},{"-
     A                                      id":"Lbl#Day","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Check Number of Days  ","left":"56-
     A                                      5px","top":"335px","width":"140px"}-
     A                                      ,{"id":"TxbCFDy","field type":"text-
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"scCFDy","dataLength":"5-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"true","numBlankFill":"f-
     A                                      alse","zeroFill":"false","noExtraSp-
     A                                      aces":"false","curSym":"","dataType-
     A                                      ":"zoned","formatting":"Number","ne-
     A                                      gNum":"-999.00","units":"","designV-
     A                                      alue":"[scCFDy]"},"text align":"rig-
     A                                      ht","left":"260px","top":"350px","w-
     A                                      idth":"60px","css class 2":"textbox-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"tool tip":"The number of days-
     A                                       into the future the comparison sho-
     A                                      uld consider."},{"id":"Txb#Day","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","value":{"fieldName":"sc#Day",-
     A                                      "dataLength":"5","decPos":"0","numS-
     A                                      ep":"false","zeroBalance":"true","n-
     A                                      umBlankFill":"false","zeroFill":"fa-
     A                                      lse","noExtraSpaces":"false","curSy-
     A                                      m":"","dataType":"zoned","formattin-
     A                                      g":"Number","negNum":"-999.00","uni-
     A                                      ts":"","designValue":"[sc#Day]"},"t-
     A                                      ext align":"right","left":"565px","-
     A                                      top":"350px","width":')
     A                                  1  2HTML('"60px","css class 2":"textbox-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"tool tip":"Some procedures ca-
     A                                      n only be billed for a maximum numb-
     A                                      er of days."},{"id":"Cbx#Gdy","fiel-
     A                                      d type":"checkbox","css class":"che-
     A                                      ckbox","value":{"fieldName":"sc#Gdy-
     A                                      ","dataLength":"1","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"[sc#Gdy]"},"checked value":"Y"-
     A                                      ,"label":"Greater than Number of Da-
     A                                      ys","left":"870px","top":"350px","w-
     A                                      idth":"150px","disabled":{"fieldNam-
     A                                      e":"inquiry","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"tool tip":"The nu-
     A                                      mber of days greater than a require-
     A                                      d limit set by the state for paymen-
     A                                      t.\n"},{"id":"LblCPDy","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Check Number of Days in t-
     A                                      he Past","left":"260px","top":"375p-
     A                                      x","width":"210px"},{"id":"LblPTTM"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value":"Check Physic-
     A                                      al Therapy Hours","left":"565px","t-
     A                                      op":"375px","width":"180px"},{"id":-
     A                                      "LblTRMT","field type":"output fiel-
     A                                      d","css class":"label","value":"Num-
     A                                      ber of Days of Treatment","left":"8-
     A                                      70px","top":"375px","width":"180px"-
     A                                      },{"id":"TxbCPDy","field type":"tex-
     A                                      tbox","css class":"input","value":{-
     A                                      "fieldName":"scCPDy","dataLength":"-
     A                                      5","decPos":"0","numSep":"false","z-
     A                                      eroBalance":"true","numBlankFill":"-
     A                                      false","zeroFill":"false","noExtraS-
     A                                      paces":"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"","design-
     A                                      Value":"[scCPDy]"},"text align":"ri-
     A                                      ght","left":"260px","top":"390px","-
     A                                      width":"60px","css class 2":"textbo-
     A                                      x","disabled":{"fieldName":"inquiry-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"tool tip":"Number of days to-
     A                                       look in the past when counting pro-
     A                                      cedures."},{"id":"TxbPTTM","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "value":{"fieldName":"scPTTM","data-
     A                                      Length":"5","decPos":"2","numSep":"-
     A                                      false","zeroBalance":"false","numBl-
     A                                      ankFill":"false","zeroFill":"false"-
     A                                      ,"noExtraSpaces":"false","curSym":"-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","negNum":"-999.00","units":-
     A                                      "","designValue":"[scPTTM]"},"text -
     A                                      align":"right","left":"565px","top"-
     A                                      :"390px","width":"60px","css class -
     A                                      2":"textbox","disabled":{"fieldName-
     A                                      ":"inquiry","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator')
     A                                  1  2HTML('","indFormat":"true / false"}-
     A                                      ,"tool tip":"Total amount of Physic-
     A                                      al Therapy time allowed.  Enter as -
     A                                      hours, e.g 15 minutes is entered as-
     A                                       .25.\n"},{"id":"TxbTRMT","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      value":{"fieldName":"scTRMT","dataL-
     A                                      ength":"5","decPos":"0","numSep":"f-
     A                                      alse","zeroBalance":"true","numBlan-
     A                                      kFill":"false","zeroFill":"false","-
     A                                      noExtraSpaces":"false","curSym":"",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","negNum":"-999.00","units":""-
     A                                      ,"designValue":"[scTRMT]"},"text al-
     A                                      ign":"right","left":"870px","top":"-
     A                                      390px","width":"60px","css class 2"-
     A                                      :"textbox","disabled":{"fieldName":-
     A                                      "inquiry","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"tool tip":"Enter num-
     A                                      ber of days in the initial treatmen-
     A                                      t period. Tells the program to star-
     A                                      t counting history after the initia-
     A                                      l treatment period."},{"id":"LblCAP-
     A                                      CSI","field type":"output field","c-
     A                                      ss class":"label","value":"APC Stat-
     A                                      us Indicator","left":"260px","top":-
     A                                      "415px","width":"135px"},{"id":"Lbl-
     A                                      #DSD","field type":"output field","-
     A                                      css class":"label","value":"Number -
     A                                      of Days from Service Date","left":"-
     A                                      565px","top":"415px","width":"215px-
     A                                      "},{"id":"TxbCAPCSI","field type":"-
     A                                      select box","css class":"input","va-
     A                                      lue":{"fieldName":"scCAPCSI","dataL-
     A                                      ength":"2","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[sc-
     A                                      CAPCSI]"},"text align":"left","left-
     A                                      ":"260px","top":"430px","width":"25-
     A                                      0px","css class 2":"textbox","disab-
     A                                      led":{"fieldName":"inquiry","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"ch-
     A                                      oices database file":"FTGTP","choic-
     A                                      e options field":"TRIM(GTKEY)|| '' -
     A                                      - '' ||TRIM(GTDESC)","choice values-
     A                                       field":"GTKEY","choices selection -
     A                                      criteria":"GTSTAT <> ''I'' AND GTTB-
     A                                      ID = ''APSI''","order by":"GTKEY","-
     A                                      blank option":"true","tool tip":"Re-
     A                                      presents Ambulatory Surgical Center-
     A                                       (ASC) Status Indicators."},{"id":"-
     A                                      Txb#DSD","field type":"textbox","cs-
     A                                      s class":"input","value":{"fieldNam-
     A                                      e":"sc#DSD","dataLength":"3","decPo-
     A                                      s":"0","numSep":"false","zeroBalanc-
     A                                      e":"true","numBlankFill":"false","z-
     A                                      eroFill":"false","noExtraSpaces":"f-
     A                                      alse","curSym":"","dataType":"zoned-
     A                                      ","formatting":"Number","negNum":"--
     A                                      999.00","units":"","designValue":"[-
     A                                      sc#DSD]"},"text align":"right","lef-
     A                                      t":"565px","top":"430px","width":"9-
     A                                      0px","css class 2":"textbox","disab-
     A                                      led":{"fieldName":"inquiry","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","format')
     A                                  1  2HTML('ting":"Indicator","indFormat"-
     A                                      :"true / false"},"tool tip":"Used f-
     A                                      or Timely Filing to disallow proced-
     A                                      ures where the Carrier Received Dat-
     A                                      e is untimely, i.e. the bill was re-
     A                                      ceived maybe 90 or 100 days after t-
     A                                      he services were performed."},{"id"-
     A                                      :"CbxCSEP","field type":"checkbox",-
     A                                      "css class":"checkbox","value":{"fi-
     A                                      eldName":"scCSEP","dataLength":"1",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scCSEP]"},"ch-
     A                                      ecked value":"Y","label":"Separate -
     A                                      Procedure","left":"870px","top":"43-
     A                                      0px","width":"150px","disabled":{"f-
     A                                      ieldName":"inquiry","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"tool tip":-
     A                                      "Separate Procedure Flag."},{"id":"-
     A                                      CbxCAst","field type":"checkbox","c-
     A                                      ss class":"checkbox","value":{"fiel-
     A                                      dName":"scCAst","dataLength":"1","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scCAst]"},"chec-
     A                                      ked value":"Y","label":"Asterisk Pr-
     A                                      ocedure","left":"260px","top":"460p-
     A                                      x","width":"150px","disabled":{"fie-
     A                                      ldName":"inquiry","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"tool tip":"D-
     A                                      etermines if procedure code is an a-
     A                                      sterisk procedure. No longer used."-
     A                                      },{"id":"CbxHMRA","field type":"che-
     A                                      ckbox","css class":"checkbox","valu-
     A                                      e":{"fieldName":"scHMRA","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[scHMRA-
     A                                      ]"},"checked value":"Y","label":"Bi-
     A                                      lled > Compared Procedure Code Allo-
     A                                      wance","left":"565px","top":"460px"-
     A                                      ,"width":"150px","disabled":{"field-
     A                                      Name":"inquiry","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"tool tip":"MRA-
     A                                       for compared to Procedure/HCPCS/Se-
     A                                      rvice Code must be higher than bill-
     A                                      ed Procedure/HCPCS/Service Code''s -
     A                                      MRA.  An example of when this shoul-
     A                                      d be checked is for the Asterisk pr-
     A                                      ocedure.  If the MRA for the Office-
     A                                       Visit is greater than the MRA for -
     A                                      the Asterisk procedure then you wou-
     A                                      ld not reduce the starred procedure-
     A                                       by 50% not the O.V. This would req-
     A                                      uire two rules with this checked. N-
     A                                      o longer used."},{"id":"CbxMaj","fi-
     A                                      eld type":"checkbox","css class":"c-
     A                                      heckbox","value":{"fieldName":"scMa-
     A                                      j","dataLength":"1","trimLeading":"-
     A                                      false","trimTrailing"')
     A                                  1  2HTML(':"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[scMaj]"}-
     A                                      ,"checked value":"Y","label":"Major-
     A                                       Procedure Code","left":"870px","to-
     A                                      p":"460px","width":"150px","disable-
     A                                      d":{"fieldName":"inquiry","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"tool-
     A                                       tip":"Major Procedure Flag."},{"id-
     A                                      ":"CbxHsDt","field type":"checkbox"-
     A                                      ,"css class":"checkbox","value":{"f-
     A                                      ieldName":"scHsDt","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[scHsDt]"},"c-
     A                                      hecked value":"Y","label":"Check Cl-
     A                                      aim History","left":"260px","top":"-
     A                                      485px","width":"150px","disabled":{-
     A                                      "fieldName":"inquiry","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"tool tip-
     A                                      ":"Check case history for services.-
     A                                      "},{"id":"CbxCSDt","field type":"ch-
     A                                      eckbox","css class":"checkbox","val-
     A                                      ue":{"fieldName":"scCSDt","dataLeng-
     A                                      th":"1","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scCSD-
     A                                      t]"},"checked value":"Y","label":"C-
     A                                      heck Same Date of Service","left":"-
     A                                      565px","top":"485px","width":"150px-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"tool tip":"Used to find same -
     A                                      dates from current/historical bills-
     A                                      ."},{"id":"CbxCSPr","field type":"c-
     A                                      heckbox","css class":"checkbox","va-
     A                                      lue":{"fieldName":"scCSPr","dataLen-
     A                                      gth":"1","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[scCS-
     A                                      Pr]"},"checked value":"Y","label":"-
     A                                      Check Same Provider","left":"870px"-
     A                                      ,"top":"485px","width":"150px","dis-
     A                                      abled":{"fieldName":"inquiry","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      tool tip":"Used to find the same pr-
     A                                      ovider from current/historical bill-
     A                                      s."},{"id":"CbxCDPr","field type":"-
     A                                      checkbox","css class":"checkbox","v-
     A                                      alue":{"fieldName":"scCDPr","dataLe-
     A                                      ngth":"1","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scC-
     A                                      DPr]"},"checked value":"Y","label":-
     A                                      "Check Different Prov')
     A                                  1  2HTML('ider","left":"260px","top":"5-
     A                                      10px","width":"150px","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"tool tip"-
     A                                      :"Used to find different providers -
     A                                      from current/historical bill."},{"i-
     A                                      d":"CbxCSBl","field type":"checkbox-
     A                                      ","css class":"checkbox","value":{"-
     A                                      fieldName":"scCSBl","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scCSBl]"},"-
     A                                      checked value":"Y","label":"Check S-
     A                                      ame Bill","left":"565px","top":"510-
     A                                      px","width":"150px","disabled":{"fi-
     A                                      eldName":"inquiry","customTrue":"",-
     A                                      "customFalse":"","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"tool tip":"-
     A                                      Checks services on the same (curren-
     A                                      t) bill only."},{"id":"CbxMUnt","fi-
     A                                      eld type":"checkbox","css class":"c-
     A                                      heckbox","value":{"fieldName":"scMU-
     A                                      nt","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scMUnt]"},"checked value":"-
     A                                      Y","label":"Check Multiple Units","-
     A                                      left":"870px","top":"510px","width"-
     A                                      :"150px","disabled":{"fieldName":"i-
     A                                      nquiry","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"tool tip":"Used to cou-
     A                                      nt case history line items with mul-
     A                                      tiple units. Some clients have the -
     A                                      multiple units flag set on so that -
     A                                      when they enter line items in Provi-
     A                                      der Bills with multiple units the s-
     A                                      ystem does NOT split the line into -
     A                                      multiple lines.  If this is checked-
     A                                       then the adjudication program will-
     A                                       count the number of units for each-
     A                                       line instead of assuming each line-
     A                                       is one unit."},{"id":"CbxOvrd","fi-
     A                                      eld type":"checkbox","css class":"c-
     A                                      heckbox","value":{"fieldName":"scOv-
     A                                      rd","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scOvrd]"},"checked value":"-
     A                                      Y","label":"Exclude Overridden Serv-
     A                                      ices","left":"260px","top":"535px",-
     A                                      "width":"150px","disabled":{"fieldN-
     A                                      ame":"inquiry","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"tool tip":"Use -
     A                                      to exclude line items in case histo-
     A                                      ry that have been overridden to pay-
     A                                      ."},{"id":"CbxCTPC","field type":"c-
     A                                      heckbox","css class":"checkbox","va-
     A                                      lue":{"fieldName":"scCTPC","dataLen-
     A                                      gth":"1","trimLeading')
     A                                  1  2HTML('":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scCTPC]"},"checked -
     A                                      value":"Y","label":"Primary Code","-
     A                                      left":"565px","top":"535px","width"-
     A                                      :"150px","disabled":{"fieldName":"i-
     A                                      nquiry","customTrue":"","customFals-
     A                                      e":"","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"tool tip":"Used for Ad-
     A                                      d-on Code processing to check for a-
     A                                       Primary Code billed on the same da-
     A                                      y.\n"}]}')
     A            CHFTPAPXX     10A  H
     A            CHFTPMPXX     10A  H
     A            CHFTPSPXX     10A  H
     A            INQUIRY        1A  H
     A            SC#DAY         5S 0H
     A            SC#DSD         3S 0H
     A            SC#GDY         1A  H
     A            SC#GPC         1A  H
     A            SC#PRC         5S 0H
     A            SCCAPCSI       2A  H
     A            SCCAST         1A  H
     A            SCCDPR         1A  H
     A            SCCFCD        11A  H
     A            SCCFDY         5S 0H
     A            SCCMOD         2A  H
     A            SCCMRI         1A  H
     A            SCCPDY         5S 0H
     A            SCCPOS         3S 0H
     A            SCCPRT         2A  H
     A            SCCPTS         1A  H
     A            SCCSBL         1A  H
     A            SCCSDT         1A  H
     A            SCCSEP         1A  H
     A            SCCSPR         1A  H
     A            SCCTCD        11A  H
     A            SCCTOB         3A  H
     A            SCCTPC         1A  H
     A            SCEFCD        11A  H
     A            SCETCD        11A  H
     A            SCHMRA         1A  H
     A            SCHSDT         1A  H
     A            SCIGMD         1A  H
     A            SCLOSS         9S 2H
     A            SCMAJ          1A  H
     A            SCMUNT         1A  H
     A            SCOVRD         1A  H
     A            SCPTTM         5S 2H
     A            SCTLOS         1A  H
     A            SCTRMT         5S 0H
     A          R RCDPROINFO
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RASSUME    0     RROWS      2    C1-
     A                                          1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdProInfo","description":"Proc-
     A                                      essing Information","assume":"true"-
     A                                      ,"show as window":"false","onload":-
     A                                      "document.body.style.background = \-
     A                                      "#EBF5FF\"; ","overlay":"true","ove-
     A                                      rlay range":"1-1","design overlay f-
     A                                      ormats":"rcdPanel"},"items":[{"id":-
     A                                      "HdgProInfo","field type":"output f-
     A                                      ield","css class":"heading","value"-
     A                                      :"Processing Information","left":"2-
     A                                      60px","top":"100px","width":"160px"-
     A                                      ,"heading type":"Section Header","t-
     A                                      ext align":"left"},{"id":"LblEobCd1-
     A                                      ","field type":"output field","css -
     A                                      class":"label","value":"EOB Code 1"-
     A                                      ,"left":"260px","top":"135px","widt-
     A                                      h":"75px"},{"id":"LblEobCd2","field-
     A                                       type":"output field","css class":"-
     A                                      label","value":"EOB Code 2","left":-
     A                                      "565px","top":"135px","width":"75px-
     A                                      "},{"id":"LblMsg","field type":"out-
     A                                      put field","css class":"label","val-
     A                                      ue":"Error Message 1","left":"870px-
     A                                      ","top":"135px","width":"100px"},{"-
     A                                      id":"TxbEobCd1","field type":"textb-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"scEobCd1","dataLength":"-
     A                                      6","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"uppercase","designValue":"[scEob-
     A                                      Cd1]"},"text align":"left","left":"-
     A                                      260px","top":"150px","width":"250px-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"choices database file":{"fiel-
     A                                      dName":"SelEOBFile","dataLength":"1-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"choice options field":"T-
     A                                      RIM(EBKEY)|| '' - '' ||TRIM(EBDESC)-
     A                                      ","choice values field":"EBKEY","ch-
     A                                      oices selection criteria":"EBSTAT <-
     A                                      > ''I''","contains match":"true","t-
     A                                      ool tip":"State or User Defined Exp-
     A                                      lanation of Reimbursement. This wil-
     A                                      l print on the EOB."},{"id":"TxbEob-
     A                                      Cd2","field type":"textbox","css cl-
     A                                      ass":"input","value":{"fieldName":"-
     A                                      scEobCd2","dataLength":"6","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"uppercas-
     A                                      e","designValue":"[scEobCd2]"},"tex-
     A                                      t align":"left","left":"565px","top-
     A                                      ":"150px","width":"250px","disabled-
     A                                      ":{"fieldName":"inquiry","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"choic-
     A                                      es database file":{"fieldName":"Sel-
     A                                      EOBFile","dataLength":"10","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"ch')
     A                                  1  2HTML('ar","formatting":"Text","text-
     A                                      Transform":"none"},"choice options -
     A                                      field":"TRIM(EBKEY)|| '' - '' ||TRI-
     A                                      M(EBDESC)","choice values field":"E-
     A                                      BKEY","choices selection criteria":-
     A                                      "EBSTAT <> ''I''","contains match":-
     A                                      "true","tool tip":"State or User De-
     A                                      fined Explanation of Reimbursement.-
     A                                       This will print on the EOB."},{"id-
     A                                      ":"TxbMsg","field type":"textbox","-
     A                                      css class":"input","value":{"fieldN-
     A                                      ame":"scMsg","dataLength":"7","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scMsg]"},"text ali-
     A                                      gn":"left","left":"870px","top":"15-
     A                                      0px","width":"250px","css class 2":-
     A                                      "textbox","disabled":{"fieldName":"-
     A                                      inquiry","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"choices database file-
     A                                      ":"FTMIP","choice options field":"T-
     A                                      RIM(MIMSG#)|| '' - '' ||TRIM(MIDESC-
     A                                      )","choice values field":"MIMSG#","-
     A                                      choices selection criteria":{"field-
     A                                      Name":"SelErrMsg","dataLength":"100-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"},"contains match":"true","t-
     A                                      ool tip":"Sapiens defined message e-
     A                                      xplaining Reimbursement. This will -
     A                                      NOT print on the EOB. This gives th-
     A                                      e Bill Review staff more detail on -
     A                                      the reimbursemen method. "},{"id":"-
     A                                      LblMsg2","field type":"output field-
     A                                      ","css class":"label","value":"Erro-
     A                                      r Message 2","left":"260px","top":"-
     A                                      175px","width":"115px"},{"id":"LblM-
     A                                      sg3","field type":"output field","c-
     A                                      ss class":"label","value":"Error Me-
     A                                      ssage 3","left":"565px","top":"175p-
     A                                      x","width":"100px"},{"id":"LblPMR",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","value":"Pay Fee Sched-
     A                                      ule Allowance","left":"870px","top"-
     A                                      :"175px","width":"170px"},{"id":"Tx-
     A                                      bMsg2","field type":"textbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"scMsg2","dataLength":"7","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scMsg2]"},"text align-
     A                                      ":"left","left":"260px","top":"190p-
     A                                      x","width":"250px","disabled":{"fie-
     A                                      ldName":"inquiry","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"choices data-
     A                                      base file":"FTMIP","choice options -
     A                                      field":"TRIM(MIMSG#)|| '' - '' ||TR-
     A                                      IM(MIDESC)","choice values field":"-
     A                                      MIMSG#","choices selection criteria-
     A                                      ":{"fieldName":"SelErrMsg","dataLen-
     A                                      gth":"100","trimLeading":"false","t-
     A                                      rimTrailing":"true","')
     A                                  1  2HTML('blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "},"contains match":"true","tool ti-
     A                                      p":"Sapiens defined message explain-
     A                                      ing Reimbursement. This will NOT pr-
     A                                      int on the EOB. This gives the Bill-
     A                                       Review staff more detail on the re-
     A                                      imbursement method. "},{"id":"TxbMs-
     A                                      g3","field type":"textbox","css cla-
     A                                      ss":"input","value":{"fieldName":"s-
     A                                      cMsg3","dataLength":"7","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scMsg3]"},"text align":"-
     A                                      left","left":"565px","top":"190px",-
     A                                      "width":"250px","css class 2":"text-
     A                                      box","disabled":{"fieldName":"inqui-
     A                                      ry","customTrue":"","customFalse":"-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"choices database file":"FT-
     A                                      MIP","choice options field":"TRIM(M-
     A                                      IMSG#)|| '' - '' ||TRIM(MIDESC)","c-
     A                                      hoice values field":"MIMSG#","choic-
     A                                      es selection criteria":{"fieldName"-
     A                                      :"SelErrMsg","dataLength":"100","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"},"contains match":"true","tool t-
     A                                      ip":"Sapiens defined message explai-
     A                                      ning Reimbursement. This will NOT p-
     A                                      rint on the EOB. This gives the Bil-
     A                                      l Review staff more detail on the r-
     A                                      eimbursement method. "},{"id":"TxbP-
     A                                      MR","field type":"select box","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"scPMR","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"uppercase-
     A                                      ","designValue":"[scPMR]"},"text al-
     A                                      ign":"left","left":"870px","top":"1-
     A                                      90px","width":"250px","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"choices d-
     A                                      atabase file":"FTGTP","choice optio-
     A                                      ns field":"TRIM(GTKEY)|| '' - '' ||-
     A                                      TRIM(GTDESC)","choice values field"-
     A                                      :"GTKEY","choices selection criteri-
     A                                      a":"GTSTAT <> ''I'' AND GTTBID = ''-
     A                                      MRTY''","order by":"GTKEY","blank o-
     A                                      ption":"true","tool tip":"Pay the S-
     A                                      tate Fee Schedule Allowance."},{"id-
     A                                      ":"LblAmt","field type":"output fie-
     A                                      ld","css class":"label","value":"Pa-
     A                                      y Flat/Additional Amount","left":"2-
     A                                      60px","top":"215px","width":"170px"-
     A                                      },{"id":"LblPct","field type":"outp-
     A                                      ut field","css class":"label","valu-
     A                                      e":"Pay a Percent of the Allowance"-
     A                                      ,"left":"565px","top":"215px","widt-
     A                                      h":"190px"},{"id":"LblPCh","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Pay the')
     A                                  1  2HTML(' Charge Amount","left":"870px-
     A                                      ","top":"215px","width":"150px"},{"-
     A                                      id":"TxbAmt","field type":"textbox"-
     A                                      ,"css class":"input","value":{"fiel-
     A                                      dName":"scAmt","dataLength":"9","de-
     A                                      cPos":"2","numSep":"false","zeroBal-
     A                                      ance":"true","numBlankFill":"false"-
     A                                      ,"zeroFill":"false","noExtraSpaces"-
     A                                      :"false","curSym":"","dataType":"zo-
     A                                      ned","formatting":"Number","negNum"-
     A                                      :"-999.00","units":"","designValue"-
     A                                      :"[scAmt]"},"text align":"right","l-
     A                                      eft":"260px","top":"230px","width":-
     A                                      "75px","css class 2":"textbox","dis-
     A                                      abled":{"fieldName":"inquiry","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      tool tip":"Enter either a flat amou-
     A                                      nt to be paid or an additional amou-
     A                                      nt to be paid as well as the State -
     A                                      Fee Schedule."},{"id":"TxbPct","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","value":{"fieldName":"scPct","d-
     A                                      ataLength":"5","decPos":"2","numSep-
     A                                      ":"false","zeroBalance":"true","num-
     A                                      BlankFill":"false","zeroFill":"fals-
     A                                      e","noExtraSpaces":"false","curSym"-
     A                                      :"","dataType":"zoned","formatting"-
     A                                      :"Number","negNum":"-999.00","units-
     A                                      ":"","designValue":"[scPct]"},"text-
     A                                       align":"right","left":"565px","top-
     A                                      ":"230px","width":"75px","css class-
     A                                       2":"textbox","disabled":{"fieldNam-
     A                                      e":"inquiry","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"tool tip":"Pays a-
     A                                       specific percent of the Maximum Al-
     A                                      lowance for the Code."},{"id":"TxbP-
     A                                      Ch","field type":"select box","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"scPCh","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scPCh]"},"text align":-
     A                                      "left","left":"870px","top":"230px"-
     A                                      ,"width":"250px","disabled":{"field-
     A                                      Name":"inquiry","customTrue":"","cu-
     A                                      stomFalse":"","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"choices databa-
     A                                      se file":"FTGTP","choice options fi-
     A                                      eld":"TRIM(GTKEY)|| '' - '' ||TRIM(-
     A                                      GTDESC)","choice values field":"GTK-
     A                                      EY","choices selection criteria":"G-
     A                                      TSTAT <> ''I'' AND GTTBID = ''CHTY'-
     A                                      '","order by":"GTKEY","blank option-
     A                                      ":"true","tool tip":"Pays the Bill -
     A                                      Charges or pays based on Billed Cha-
     A                                      rges."},{"id":"LblPAne","field type-
     A                                      ":"output field","css class":"label-
     A                                      ","value":"Pay Anesthesia/Hourly/Mi-
     A                                      leage/Rental Allowance","left":"260-
     A                                      px","top":"255px","width":"290px"},-
     A                                      {"id":"LblTMDv","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"Anesthesia Time Division in Minu-
     A                                      tes","left":"565px","top":"255px","-
     A                                      width":"215px"},{"id"')
     A                                  1  2HTML(':"LblRnd","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"Anesthesia Rounding Type","left"-
     A                                      :"870px","top":"255px","width":"160-
     A                                      px"},{"id":"TxbPAne","field type":"-
     A                                      select box","css class":"input","va-
     A                                      lue":{"fieldName":"scPAne","dataLen-
     A                                      gth":"1","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"uppercase","designValue":"-
     A                                      [scPAne]"},"text align":"left","lef-
     A                                      t":"260px","top":"270px","width":"2-
     A                                      50px","disabled":{"fieldName":"inqu-
     A                                      iry","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"choices database file":"F-
     A                                      TGTP","choice options field":"TRIM(-
     A                                      GTKEY)|| '' - '' ||TRIM(GTDESC)","c-
     A                                      hoice values field":"GTKEY","choice-
     A                                      s selection criteria":"GTSTAT <> ''-
     A                                      I'' AND GTTBID = ''ANRU''","order b-
     A                                      y":"GTKEY","blank option":"true","t-
     A                                      ool tip":"Uses anesthesia/Hourly/Mi-
     A                                      leage/Rental field allowance to cal-
     A                                      culate payment. Used for equipment -
     A                                      rental, Ambulance mileage, etc.  "}-
     A                                      ,{"id":"TxbTMDv","field type":"text-
     A                                      box","css class":"input","value":{"-
     A                                      fieldName":"scTMDv","dataLength":"3-
     A                                      ","decPos":"0","numSep":"false","ze-
     A                                      roBalance":"true","numBlankFill":"f-
     A                                      alse","zeroFill":"false","noExtraSp-
     A                                      aces":"false","curSym":"","dataType-
     A                                      ":"zoned","formatting":"Number","ne-
     A                                      gNum":"-999.00","units":"","designV-
     A                                      alue":"[scTMDv]"},"text align":"rig-
     A                                      ht","left":"565px","top":"270px","w-
     A                                      idth":"60px","css class 2":"textbox-
     A                                      ","disabled":{"fieldName":"inquiry"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"true / fal-
     A                                      se"},"tool tip":"Used in Anesthesia-
     A                                       to calculate time values. "},{"id"-
     A                                      :"TxbRnd","field type":"select box"-
     A                                      ,"css class":"input","value":{"fiel-
     A                                      dName":"scRnd","dataLength":"1","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"upp-
     A                                      ercase","designValue":"[scRnd]"},"t-
     A                                      ext align":"left","left":"870px","t-
     A                                      op":"270px","width":"250px","disabl-
     A                                      ed":{"fieldName":"inquiry","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"cho-
     A                                      ices database file":"FTGTP","choice-
     A                                       options field":"TRIM(GTKEY)|| '' --
     A                                       '' ||TRIM(GTDESC)","choice values -
     A                                      field":"GTKEY","choices selection c-
     A                                      riteria":"GTSTAT <> ''I'' AND GTTBI-
     A                                      D = ''ANRD''","order by":"GTKEY","b-
     A                                      lank option":"true","tool tip":"Use-
     A                                      d in Anesthesia. Rounding varies by-
     A                                       state.  "},{"id":"LblFTM","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Anesthe')
     A                                  1  2HTML('sia From Time in Minutes","le-
     A                                      ft":"260px","top":"295px","width":"-
     A                                      200px"},{"id":"LblTTM","field type"-
     A                                      :"output field","css class":"label"-
     A                                      ,"value":"Anesthesia To Time in Min-
     A                                      utes","left":"565px","top":"295px",-
     A                                      "width":"185px"},{"id":"LblAUnt","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Anesthesia Addi-
     A                                      tion Time Units","left":"870px","to-
     A                                      p":"295px","width":"190px"},{"id":"-
     A                                      TxbFTM","field type":"textbox","css-
     A                                       class":"input","value":{"fieldName-
     A                                      ":"scFTM","dataLength":"5","decPos"-
     A                                      :"0","numSep":"false","zeroBalance"-
     A                                      :"true","numBlankFill":"false","zer-
     A                                      oFill":"false","noExtraSpaces":"fal-
     A                                      se","curSym":"","dataType":"zoned",-
     A                                      "formatting":"Number","negNum":"-99-
     A                                      9.00","units":"","designValue":"[sc-
     A                                      FTM]"},"text align":"right","left":-
     A                                      "260px","top":"310px","width":"60px-
     A                                      ","css class 2":"textbox","disabled-
     A                                      ":{"fieldName":"inquiry","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"tool -
     A                                      tip":"Beginning range for time divi-
     A                                      sion, e.g. 1st minute. Some states -
     A                                      use different conversion factor bas-
     A                                      ed on the time division range."},{"-
     A                                      id":"TxbTTM","field type":"textbox"-
     A                                      ,"css class":"input","value":{"fiel-
     A                                      dName":"scTTM","dataLength":"5","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"true","numBlankFill":"false"-
     A                                      ,"zeroFill":"false","noExtraSpaces"-
     A                                      :"false","curSym":"","dataType":"zo-
     A                                      ned","formatting":"Number","negNum"-
     A                                      :"-999.00","units":"","designValue"-
     A                                      :"[scTTM]"},"text align":"right","l-
     A                                      eft":"565px","top":"310px","width":-
     A                                      "60px","css class 2":"textbox","dis-
     A                                      abled":{"fieldName":"inquiry","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      tool tip":"Ending range for time di-
     A                                      vision, e.g., 15th minute. Some sta-
     A                                      tes use different conversion factor-
     A                                       based on the time division range."-
     A                                      },{"id":"TxbAUnt","field type":"tex-
     A                                      tbox","css class":"input","value":{-
     A                                      "fieldName":"scAUnt","dataLength":"-
     A                                      3","decPos":"0","numSep":"false","z-
     A                                      eroBalance":"true","numBlankFill":"-
     A                                      false","zeroFill":"false","noExtraS-
     A                                      paces":"false","curSym":"","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      egNum":"-999.00","units":"","design-
     A                                      Value":"[scAUnt]"},"text align":"ri-
     A                                      ght","left":"870px","top":"310px","-
     A                                      width":"60px","css class 2":"textbo-
     A                                      x","disabled":{"fieldName":"inquiry-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"tool tip":"Adds a determined-
     A                                       number of Time Units to the units -
     A                                      (minutes) billed."},{"id":"LblConv"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"label","value"')
     A                                  1  2HTML(':"Conversion Factor 1 (Anesth-
     A                                      esia, etc)","left":"260px","top":"3-
     A                                      35px","width":"220px"},{"id":"LblCo-
     A                                      n2","field type":"output field","cs-
     A                                      s class":"label","value":"Conversio-
     A                                      n Factor 2 (Other)","left":"565px",-
     A                                      "top":"335px","width":"180px"},{"id-
     A                                      ":"LblPCPT","field type":"output fi-
     A                                      eld","css class":"label","value":"P-
     A                                      ay Procedure Code Fee Schedule Allo-
     A                                      wance","left":"870px","top":"335px"-
     A                                      ,"width":"260px"},{"id":"TxbConv","-
     A                                      field type":"textbox","css class":"-
     A                                      input","value":{"fieldName":"scConv-
     A                                      ","dataLength":"5","decPos":"2","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "numBlankFill":"false","zeroFill":"-
     A                                      false","noExtraSpaces":"false","cur-
     A                                      Sym":"","dataType":"zoned","formatt-
     A                                      ing":"Number","negNum":"-999.00","u-
     A                                      nits":"","designValue":"[scConv]"},-
     A                                      "text align":"right","left":"260px"-
     A                                      ,"top":"350px","width":"75px","css -
     A                                      class 2":"textbox","disabled":{"fie-
     A                                      ldName":"inquiry","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"tool tip":"P-
     A                                      rimarily used to multiply against A-
     A                                      nesthesia Time Units to calculate t-
     A                                      he allowed amount."},{"id":"TxbCon2-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","value":{"fieldName":"scC-
     A                                      on2","dataLength":"5","decPos":"2",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","noExtraSpaces":"false","-
     A                                      curSym":"","dataType":"zoned","form-
     A                                      atting":"Number","negNum":"-999.00"-
     A                                      ,"units":"","designValue":"[scCon2]-
     A                                      "},"text align":"right","left":"565-
     A                                      px","top":"350px","width":"90px","c-
     A                                      ss class 2":"textbox","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"tool tip"-
     A                                      :"Used to multiply against MRA for -
     A                                      reduction or increase."},{"id":"Txb-
     A                                      PCPT","field type":"textbox","css c-
     A                                      lass":"input","value":{"fieldName":-
     A                                      "scPCPT","dataLength":"5","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scPCPT]"},"text align"-
     A                                      :"left","left":"870px","top":"350px-
     A                                      ","width":"250px","css class 2":"te-
     A                                      xtbox","disabled":{"fieldName":"inq-
     A                                      uiry","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"choices database file":{-
     A                                      "fieldName":"chFMPRPxx","dataLength-
     A                                      ":"10","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none"},"choice values field"-
     A                                      :"PRCPT4","choices selection criter-
     A                                      ia":"PRSTAT <> ''I''"')
     A                                  1  2HTML(',"choice options field":"TRIM-
     A                                      (PRCPT4)|| '' - '' ||TRIM(PRDSC1)",-
     A                                      "contains match":"true","tool tip":-
     A                                      "Procedure/HCPCS/Service Code Value-
     A                                      :  Pay MRA for a specific Procedure-
     A                                       /HCPCS/Service code.              -
     A                                               "},{"id":"LblUnit","field -
     A                                      type":"output field","css class":"l-
     A                                      abel","value":"Pay Number of Units"-
     A                                      ,"left":"260px","top":"375px","widt-
     A                                      h":"130px"},{"id":"LblPPDMm","field-
     A                                       type":"output field","css class":"-
     A                                      label","value":"Pay Inpatient Per D-
     A                                      iem","left":"565px","top":"375px","-
     A                                      width":"140px"},{"id":"LblPOut","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"label","value":"Type of Outlier -
     A                                      Payment","left":"870px","top":"375p-
     A                                      x","width":"180px"},{"id":"TxbUnit"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","value":{"fieldName":"scUn-
     A                                      it","dataLength":"3","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","numBlankFill":"false","zeroFill"-
     A                                      :"false","noExtraSpaces":"false","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","negNum":"-999.00",-
     A                                      "units":"","designValue":"[scUnit]"-
     A                                      },"text align":"right","left":"260p-
     A                                      x","top":"390px","width":"75px","cs-
     A                                      s class 2":"textbox","disabled":{"f-
     A                                      ieldName":"inquiry","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"tool tip":-
     A                                      "Pays a determined number of units -
     A                                      regardless of entered amount."},{"i-
     A                                      d":"TxbPPDM","field type":"select b-
     A                                      ox","css class":"input","value":{"f-
     A                                      ieldName":"scPPDM","dataLength":"1"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "uppercase","designValue":"[scPPDM]-
     A                                      "},"text align":"left","left":"565p-
     A                                      x","top":"390px","width":"250px","d-
     A                                      isabled":{"fieldName":"inquiry","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"choices database file":"FTGTP","c-
     A                                      hoice options field":"TRIM(GTKEY)||-
     A                                       '' - '' ||TRIM(GTDESC)","choice va-
     A                                      lues field":"GTKEY","choices select-
     A                                      ion criteria":"GTSTAT <> ''I'' AND -
     A                                      GTTBID = ''TYPD''","order by":"GTKE-
     A                                      Y","blank option":"true","tool tip"-
     A                                      :"Pay using inpatient per diem calc-
     A                                      s. Enter the per diem amount in the-
     A                                       Pay Flat/Additional Amount field."-
     A                                      },{"id":"TxbPOut","field type":"sel-
     A                                      ect box","css class":"input","value-
     A                                      ":{"fieldName":"scPOut","dataLength-
     A                                      ":"1","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"uppercase","designValue":"[sc-
     A                                      POut]"},"text align":"left","left":-
     A                                      "870px","top":"390px","width":"250p-
     A                                      x","disabled":{"field')
     A                                  1  2HTML('Name":"inquiry","customTrue":-
     A                                      "","customFalse":"","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"choices -
     A                                      database file":"FTGTP","choice opti-
     A                                      ons field":"TRIM(GTKEY)|| '' - '' |-
     A                                      |TRIM(GTDESC)","choices selection c-
     A                                      riteria":"GTSTAT <> ''I'' AND GTTBI-
     A                                      D = ''OUTL''","choice values field"-
     A                                      :"GTKEY","order by":"GTKEY","blank -
     A                                      option":"true","tool tip":"Type of -
     A                                      Outlier calculation to use. This va-
     A                                      ries by state."},{"id":"LblPTTM_cop-
     A                                      y","field type":"output field","css-
     A                                       class":"label","value":"Pay Physic-
     A                                      al Therapy Per Visit Allowance","le-
     A                                      ft":"260px","top":"415px","width":"-
     A                                      250px"},{"id":"LblPARE","field type-
     A                                      ":"output field","css class":"label-
     A                                      ","value":"Mileage Type","left":"56-
     A                                      5px","top":"415px","width":"95px"},-
     A                                      {"id":"TxbPPTV","field type":"selec-
     A                                      t box","css class":"input","value":-
     A                                      {"fieldName":"scPPTV","dataLength":-
     A                                      "1","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"uppercase","designValue":"[scPP-
     A                                      TV]"},"text align":"left","left":"2-
     A                                      60px","top":"430px","width":"250px"-
     A                                      ,"disabled":{"fieldName":"inquiry",-
     A                                      "customTrue":"","customFalse":"","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"choices database file":"FTGTP"-
     A                                      ,"choice options field":"TRIM(GTKEY-
     A                                      )|| '' - '' ||TRIM(GTDESC)","choice-
     A                                       values field":"GTKEY","choices sel-
     A                                      ection criteria":"GTSTAT <> ''I'' A-
     A                                      ND GTTBID = ''TYPT''","order by":"G-
     A                                      TKEY","blank option":"true","tool t-
     A                                      ip":"Type of PT Per visit calculati-
     A                                      on to use. This varies by state.   -
     A                                            "},{"id":"TxbPARE","field typ-
     A                                      e":"select box","css class":"input"-
     A                                      ,"value":{"fieldName":"scPARE","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"uppercase","designValu-
     A                                      e":"[scPARE]"},"text align":"left",-
     A                                      "left":"565px","top":"430px","width-
     A                                      ":"250px","disabled":{"fieldName":"-
     A                                      inquiry","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"choices database file-
     A                                      ":"FTGTP","choice options field":"T-
     A                                      RIM(GTKEY)|| '' - '' ||TRIM(GTDESC)-
     A                                      ","choice values field":"GTKEY","ch-
     A                                      oices selection criteria":"GTSTAT <-
     A                                      > ''I'' AND GTTBID = ''ZRAR''","ord-
     A                                      er by":"GTKEY","blank option":"true-
     A                                      ","tool tip":"Ambulance Mileage Typ-
     A                                      e, e.g., Rural, Urban, etc."},{"id"-
     A                                      :"CbxPCVL","field type":"checkbox",-
     A                                      "css class":"checkbox","value":{"fi-
     A                                      eldName":"scPCVL","dataLength":"1",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":')
     A                                  1  2HTML('"false","rjZeroFill":"false",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","textTransform":"none","designVa-
     A                                      lue":"[scPCVL]"},"checked value":"Y-
     A                                      ","label":"Check for Professional C-
     A                                      omponent Value","left":"870px","top-
     A                                      ":"430px","width":"150px","disabled-
     A                                      ":{"fieldName":"inquiry","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"tool -
     A                                      tip":"Checks the Procedure code for-
     A                                       a valid value in the Professional -
     A                                      Component field."},{"id":"CbxTCVl",-
     A                                      "field type":"checkbox","css class"-
     A                                      :"checkbox","value":{"fieldName":"s-
     A                                      cTCVl","dataLength":"1","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scTCVl]"},"checked value-
     A                                      ":"Y","label":"Check for Technical -
     A                                      Component Value","left":"260px","to-
     A                                      p":"455px","width":"150px","disable-
     A                                      d":{"fieldName":"inquiry","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"tool-
     A                                       tip":"Checks the Procedure code fo-
     A                                      r a valid value in the Technical Co-
     A                                      mponent field. "},{"id":"CbxDis","f-
     A                                      ield type":"checkbox","css class":"-
     A                                      checkbox","value":{"fieldName":"scD-
     A                                      is","dataLength":"1","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scDis]"},"checked value":"Y-
     A                                      ","label":"Disallow the Service","l-
     A                                      eft":"565px","top":"455px","width":-
     A                                      "150px","disabled":{"fieldName":"in-
     A                                      quiry","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"tool tip":"Deny the pay-
     A                                      ment."},{"id":"CbxMR","field type":-
     A                                      "checkbox","css class":"checkbox","-
     A                                      value":{"fieldName":"scMR","dataLen-
     A                                      gth":"1","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[scMR-
     A                                      ]"},"checked value":"Y","label":"Pr-
     A                                      ocess Multiple Rules for Reducing P-
     A                                      ayment","left":"870px","top":"455px-
     A                                      ","width":"150px","disabled":{"fiel-
     A                                      dName":"inquiry","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"tool tip":"Te-
     A                                      lls the program to process this rul-
     A                                      e with calculated payment, message(-
     A                                      s) and EOB code, and then continue -
     A                                      on to the next rule.  This is norma-
     A                                      lly used for processing multiple mo-
     A                                      difiers or to assign an EOB code, e-
     A                                      .g., UCR codes."},{"id":"CbxPAS2","-
     A                                      field type":"checkbox","css class":-
     A                                      "checkbox","value":{"')
     A                                  1  2HTML('fieldName":"scPAS2","dataLeng-
     A                                      th":"1","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scPAS-
     A                                      2]"},"checked value":"Y","label":"P-
     A                                      rocess Bill a 2nd Time With Service-
     A                                      s Sorted by Date","left":"260px","t-
     A                                      op":"480px","width":"150px","disabl-
     A                                      ed":{"fieldName":"inquiry","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"too-
     A                                      l tip":"Used to perform a 2nd pass -
     A                                      on Physical Therapy codes. It will -
     A                                      use a different logical file sorted-
     A                                       by date (ascending).  An example o-
     A                                      f usage is only allowing 3 PT codes-
     A                                       in a 7-day period.  This requires -
     A                                      processing the line items in date o-
     A                                      rder not highest MRA order."},{"id"-
     A                                      :"CbxPFAC","field type":"checkbox",-
     A                                      "css class":"checkbox","value":{"fi-
     A                                      eldName":"scPFAC","dataLength":"1",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[scPFAC]"},"ch-
     A                                      ecked value":"Y","label":"Pay Facil-
     A                                      ity Fee Allowance","left":"565px","-
     A                                      top":"480px","width":"150px","disab-
     A                                      led":{"fieldName":"inquiry","custom-
     A                                      True":"","customFalse":"","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"to-
     A                                      ol tip":"Pays the ASC facility fee.-
     A                                      "},{"id":"CbxProf","field type":"ch-
     A                                      eckbox","css class":"checkbox","val-
     A                                      ue":{"fieldName":"scProf","dataLeng-
     A                                      th":"1","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scPro-
     A                                      f]"},"checked value":"Y","label":"P-
     A                                      ay Professional Component Allowance-
     A                                      ","left":"870px","top":"480px","wid-
     A                                      th":"150px","disabled":{"fieldName"-
     A                                      :"inquiry","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"tool tip":"Pay the -
     A                                      State Fee Schedule allowance for Pr-
     A                                      ofessional Component."},{"id":"CbxT-
     A                                      ech","field type":"checkbox","css c-
     A                                      lass":"checkbox","value":{"fieldNam-
     A                                      e":"scTech","dataLength":"1","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scTech]"},"checked -
     A                                      value":"Y","label":"Pay Technical C-
     A                                      omponent Allowance","left":"260px",-
     A                                      "top":"505px","width":"150px","disa-
     A                                      bled":{"fieldName":"inquiry","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"t-
     A                                      ool tip":"Pay the Sta')
     A                                  1  2HTML('te Fee Schedule allowance for-
     A                                       Technical Component."},{"id":"CbxP-
     A                                      PSC","field type":"checkbox","css c-
     A                                      lass":"checkbox","value":{"fieldNam-
     A                                      e":"scPPSC","dataLength":"1","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none",-
     A                                      "designValue":"[scPPSC]"},"checked -
     A                                      value":"Y","label":"Pay Per the Pro-
     A                                      viders Service Code","left":"565px"-
     A                                      ,"top":"505px","width":"150px","dis-
     A                                      abled":{"fieldName":"inquiry","cust-
     A                                      omTrue":"","customFalse":"","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      tool tip":"Pay according to the Ser-
     A                                      vice Code setup in the Provider fil-
     A                                      e."},{"id":"CbxPSRV","field type":"-
     A                                      checkbox","css class":"checkbox","v-
     A                                      alue":{"fieldName":"scPSRV","dataLe-
     A                                      ngth":"1","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[scP-
     A                                      SRV]"},"checked value":"Y","label":-
     A                                      "Pay Per the Providers Service Code-
     A                                       (non PA)","left":"870px","top":"50-
     A                                      5px","width":"150px","disabled":{"f-
     A                                      ieldName":"inquiry","customTrue":""-
     A                                      ,"customFalse":"","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"tool tip":-
     A                                      "Pay according to the Service Code -
     A                                      setup"},{"id":"CbxPRX","field type"-
     A                                      :"checkbox","css class":"checkbox",-
     A                                      "value":{"fieldName":"scPRX","dataL-
     A                                      ength":"1","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[sc-
     A                                      PRX]"},"checked value":"Y","label":-
     A                                      "Pay Pharmacy Average Wholesale Pri-
     A                                      ce","left":"260px","top":"530px","w-
     A                                      idth":"150px","disabled":{"fieldNam-
     A                                      e":"inquiry","customTrue":"","custo-
     A                                      mFalse":"","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"tool tip":"Pays P-
     A                                      rescription/NDC at Average Wholesal-
     A                                      e Price."},{"id":"CbxPPGp","field t-
     A                                      ype":"checkbox","css class":"checkb-
     A                                      ox","value":{"fieldName":"scPPGp","-
     A                                      dataLength":"1","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scPPGp]"},"checked value":"Y","l-
     A                                      abel":"Pay Per the Providers Peer G-
     A                                      roup","left":"565px","top":"530px",-
     A                                      "width":"150px","disabled":{"fieldN-
     A                                      ame":"inquiry","customTrue":"","cus-
     A                                      tomFalse":"","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"tool tip":"Pay -
     A                                      according to the Peer Group setup i-
     A                                      n the Provider file."},{"id":"CbxPD-
     A                                      if","field type":"che')
     A                                  1  2HTML('ckbox","css class":"checkbox"-
     A                                      ,"value":{"fieldName":"scPDif","dat-
     A                                      aLength":"1","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scPDif]"},"checked value":"Y","labe-
     A                                      l":"Pay Difference Between Charged -
     A                                      and Fee Schedule Allowance","left":-
     A                                      "870px","top":"530px","width":"150p-
     A                                      x","disabled":{"fieldName":"inquiry-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"tool tip":"If charged is gre-
     A                                      ater than the Fee Schedule allowanc-
     A                                      e then it uses the difference to ca-
     A                                      lculate the payment."},{"id":"line2-
     A                                      ","field type":"horizontal line","c-
     A                                      ss class":"line","line style":"Dott-
     A                                      ed","left":"250px","top":"545px","h-
     A                                      eight":"20px","width":"970px"},{"id-
     A                                      ":"HdgPAPartA","field type":"output-
     A                                       field","css class":"heading","valu-
     A                                      e":"Pennsylvania Part A","left":"26-
     A                                      0px","top":"565px","width":"160px",-
     A                                      "heading type":"Subsection Header"}-
     A                                      ,{"id":"LblPDRG","field type":"outp-
     A                                      ut field","css class":"label","valu-
     A                                      e":"Pay DRG Allowance","left":"260p-
     A                                      x","top":"585px","width":"125px"},{-
     A                                      "id":"TxbPDRG","field type":"select-
     A                                       box","css class":"input","value":{-
     A                                      "fieldName":"scPDRG","dataLength":"-
     A                                      1","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none","designValue":"[scPDRG]"},-
     A                                      "text align":"left","left":"260px",-
     A                                      "top":"600px","width":"250px","disa-
     A                                      bled":{"fieldName":"inquiry","custo-
     A                                      mTrue":"","customFalse":"","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      hoices database file":"FTGTP","choi-
     A                                      ce options field":"TRIM(GTKEY)|| ''-
     A                                       - '' ||TRIM(GTDESC)","choices sele-
     A                                      ction criteria":"GTSTAT <> ''I'' AN-
     A                                      D GTTBID = ''TDRG''","choice values-
     A                                       field":"GTKEY","order by":"GTKEY",-
     A                                      "blank option":"true","tool tip":"P-
     A                                      ays using the DRG rates."},{"id":"C-
     A                                      bxPCRF","field type":"checkbox","cs-
     A                                      s class":"checkbox","value":{"field-
     A                                      Name":"scPCRF","dataLength":"1","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scPCRF]"},"check-
     A                                      ed value":"Y","label":"Pay CORF All-
     A                                      owance","left":"565px","top":"600px-
     A                                      ","width":"150px","disabled":{"fiel-
     A                                      dName":"inquiry","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"tool tip":"Pa-
     A                                      ys using the CORF rates."},{"id":"C-
     A                                      bxPORC","field type":"checkbox","cs-
     A                                      s class":"checkbox","')
     A                                  1  2HTML('value":{"fieldName":"scPORC",-
     A                                      "dataLength":"1","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[scPORC]"},"checked value":"Y","-
     A                                      label":"Pay Outpatient RCC","left":-
     A                                      "870px","top":"600px","width":"150p-
     A                                      x","disabled":{"fieldName":"inquiry-
     A                                      ","customTrue":"","customFalse":"",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"tool tip":"Pays charged mult-
     A                                      iplied by the facilitie''s outpatie-
     A                                      nt Ratio of Cost to Charged. "},{"i-
     A                                      d":"CbxPASC","field type":"checkbox-
     A                                      ","css class":"checkbox","value":{"-
     A                                      fieldName":"scPASC","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scPASC]"},"-
     A                                      checked value":"Y","label":"Pay ASC-
     A                                       Allowance","left":"260px","top":"6-
     A                                      25px","width":"150px","disabled":{"-
     A                                      fieldName":"inquiry","customTrue":"-
     A                                      ","customFalse":"","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"tool tip"-
     A                                      :"Pays the Ambulatory Surgical Cent-
     A                                      er amount."},{"id":"CbxPPHI","field-
     A                                       type":"checkbox","css class":"chec-
     A                                      kbox","value":{"fieldName":"scPPHI"-
     A                                      ,"dataLength":"1","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scPPHI]"},"checked value":"Y",-
     A                                      "label":"Pay Inpatient Pharmacy All-
     A                                      owance","left":"565px","top":"625px-
     A                                      ","width":"150px","disabled":{"fiel-
     A                                      dName":"inquiry","customTrue":"","c-
     A                                      ustomFalse":"","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"tool tip":"Pa-
     A                                      ys the Pharmacy inpatient allowance-
     A                                       from the Charge Master."},{"id":"C-
     A                                      bxPPIR","field type":"checkbox","cs-
     A                                      s class":"checkbox","value":{"field-
     A                                      Name":"scPPIR","dataLength":"1","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[scPPIR]"},"check-
     A                                      ed value":"Y","label":"Pay Inpatien-
     A                                      t Pharmacy RCC","left":"870px","top-
     A                                      ":"625px","width":"150px","disabled-
     A                                      ":{"fieldName":"inquiry","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"tool -
     A                                      tip":"Pays the Pharmacy Inpatient R-
     A                                      CC."},{"id":"CbxPPHO","field type":-
     A                                      "checkbox","css class":"checkbox","-
     A                                      value":{"fieldName":"scPPHO","dataL-
     A                                      ength":"1","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"fa')
     A                                  1  2HTML('lse","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[scPPHO]"},"checke-
     A                                      d value":"Y","label":"Pay Outpatien-
     A                                      t Pharmacy Allowance","left":"260px-
     A                                      ","top":"650px","width":"150px","di-
     A                                      sabled":{"fieldName":"inquiry","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "tool tip":"Pays the Pharmacy outpa-
     A                                      tient allowance from the Charge Mas-
     A                                      ter."},{"id":"CbxPPOR","field type"-
     A                                      :"checkbox","css class":"checkbox",-
     A                                      "value":{"fieldName":"scPPOR","data-
     A                                      Length":"1","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[s-
     A                                      cPPOR]"},"checked value":"Y","label-
     A                                      ":"Pay Outpatient Pharmacy RCC","le-
     A                                      ft":"565px","top":"650px","width":"-
     A                                      150px","disabled":{"fieldName":"inq-
     A                                      uiry","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"tool tip":"Pays the Phar-
     A                                      macy outpatient RCC."},{"id":"CbxPS-
     A                                      NI","field type":"checkbox","css cl-
     A                                      ass":"checkbox","value":{"fieldName-
     A                                      ":"scPSNI","dataLength":"1","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[scPSNI]"},"checked v-
     A                                      alue":"Y","label":"Pay Inpatient Sk-
     A                                      illed Nursing Allowance","left":"87-
     A                                      0px","top":"650px","width":"150px",-
     A                                      "disabled":{"fieldName":"inquiry","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"tool tip":"Pays the Skilled Nur-
     A                                      se Inpatient rate."},{"id":"CbxPSNO-
     A                                      ","field type":"checkbox","css clas-
     A                                      s":"checkbox","value":{"fieldName":-
     A                                      "scPSNO","dataLength":"1","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scPSNO]"},"checked val-
     A                                      ue":"Y","label":"Pay Outpatient Ski-
     A                                      lled Nursing Allowance","left":"260-
     A                                      px","top":"675px","width":"150px","-
     A                                      disabled":{"fieldName":"inquiry","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"tool tip":"Pays the Skilled Nurs-
     A                                      e Inpatient rate."},{"id":"CbxPHHI"-
     A                                      ,"field type":"checkbox","css class-
     A                                      ":"checkbox","value":{"fieldName":"-
     A                                      scPHHI","dataLength":"1","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[scPHHI]"},"checked valu-
     A                                      e":"Y","label":"Pay I')
     A                                  1  2HTML('npatient Home Health Allowanc-
     A                                      e","left":"565px","top":"675px","wi-
     A                                      dth":"150px","disabled":{"fieldName-
     A                                      ":"inquiry","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"tool tip":"Pays th-
     A                                      e Home Health Inpatient rate."},{"i-
     A                                      d":"CbxPHHO","field type":"checkbox-
     A                                      ","css class":"checkbox","value":{"-
     A                                      fieldName":"scPHHO","dataLength":"1-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[scPHHO]"},"-
     A                                      checked value":"Y","label":"Pay Out-
     A                                      patient Home Health Allowance","lef-
     A                                      t":"870px","top":"675px","width":"1-
     A                                      50px","disabled":{"fieldName":"inqu-
     A                                      iry","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"tool tip":"Pays the Home -
     A                                      Health Outpatient rate."},{"id":"Lb-
     A                                      lPPTV","field type":"horizontal lin-
     A                                      e","css class":"line","line style":-
     A                                      "Dotted","left":"250px","top":"690p-
     A                                      x","height":"20px","width":"970px"}-
     A                                      ]}')
     A            CHFMPRPXX     10A  H
     A            INQUIRY        1A  H
     A            SCAMT          9S 2H
     A            SCAUNT         3S 0H
     A            SCCON2         5S 2H
     A            SCCONV         5S 2H
     A            SCDIS          1A  H
     A            SCEOBCD1       6A  H
     A            SCEOBCD2       6A  H
     A            SCFTM          5S 0H
     A            SCMR           1A  H
     A            SCMSG          7A  H
     A            SCMSG2         7A  H
     A            SCMSG3         7A  H
     A            SCPANE         1A  H
     A            SCPARE         1A  H
     A            SCPAS2         1A  H
     A            SCPASC         1A  H
     A            SCPCH          1A  H
     A            SCPCPT         5A  H
     A            SCPCRF         1A  H
     A            SCPCT          5S 2H
     A            SCPCVL         1A  H
     A            SCPDIF         1A  H
     A            SCPDRG         1A  H
     A            SCPFAC         1A  H
     A            SCPHHI         1A  H
     A            SCPHHO         1A  H
     A            SCPMR          1A  H
     A            SCPORC         1A  H
     A            SCPOUT         1A  H
     A            SCPPDM         1A  H
     A            SCPPGP         1A  H
     A            SCPPHI         1A  H
     A            SCPPHO         1A  H
     A            SCPPIR         1A  H
     A            SCPPOR         1A  H
     A            SCPPSC         1A  H
     A            SCPPTV         1A  H
     A            SCPROF         1A  H
     A            SCPRX          1A  H
     A            SCPSNI         1A  H
     A            SCPSNO         1A  H
     A            SCPSRV         1A  H
     A            SCRND          1A  H
     A            SCTCVL         1A  H
     A            SCTECH         1A  H
     A            SCTMDV         3S 0H
     A            SCTTM          5S 0H
     A            SCUNIT         3S 0H
     A            SELEOBFILE    10A  H
     A            SELERRMSG    100A  H
     A          R RCDFSRFLT
     A                                  1  2HTML('QPUIREC4    ROVERLAY   0     -
     A                                      RWINDOW    0     RASSUME    0     R-
     A                                      EMSG      2    C19   TxbEffectiveDa-
     A                                      teFltFMSEFFDTFLTFEREFFDTFLT')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"rcdFSRFlt","description":"State-
     A                                       Rules Maintenance Filter","overlay-
     A                                      ":"true","assume":"true","show as w-
     A                                      indow":"true"},"items":[{"id":"PnlF-
     A                                      SRfilter","field type":"panel","css-
     A                                       class":"dialog","panel style":"Tra-
     A                                      nsform Dialog","value":"State Rules-
     A                                       Maintenance Filter","left":"260px"-
     A                                      ,"top":"170px","height":"250px","wi-
     A                                      dth":"470px","locked in place":"tru-
     A                                      e"},{"id":"LblEffectiveDateFlt","fi-
     A                                      eld type":"output field","css class-
     A                                      ":"label","value":"Effective Date",-
     A                                      "left":"265px","top":"200px","width-
     A                                      ":"140px"},{"id":"LblBillTypeFlt","-
     A                                      field type":"output field","css cla-
     A                                      ss":"label","value":"System Type","-
     A                                      left":"450px","top":"200px","width"-
     A                                      :"110px"},{"id":"LblStatusFlt","fie-
     A                                      ld type":"output field","css class"-
     A                                      :"label","value":"Status","left":"6-
     A                                      30px","top":"200px","width":"90px"}-
     A                                      ,{"id":"TxbEffectiveDateFlt","field-
     A                                       type":"date field","css class":"da-
     A                                      te-field","value":{"fieldName":"scE-
     A                                      ffDtF","dataLength":"8","decPos":"0-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","numBlankFill":"false","zeroF-
     A                                      ill":"false","noExtraSpaces":"false-
     A                                      ","edtWrd":"''  /  /    ''","curSym-
     A                                      ":"","dataType":"zoned","formatting-
     A                                      ":"Number","negNum":"-999.00","unit-
     A                                      s":"","designValue":"[scEffDtF]"},"-
     A                                      error messages":"1 message","left":-
     A                                      "265px","top":"215px","width":"80px-
     A                                      ","error message":{"fieldName":"msE-
     A                                      ffDtFlt","dataLength":"100","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none"},-
     A                                      "error condition":{"fieldName":"erE-
     A                                      ffDtFlt","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error enhanced mode":"1","to-
     A                                      ol tip":"Effective date of the fee -
     A                                      schedule."},{"id":"DrpBillTypeFlt",-
     A                                      "field type":"select box","css clas-
     A                                      s":"input","value":{"fieldName":"sc-
     A                                      BillTypF","dataLength":"1","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[scBillTypF]"},"text a-
     A                                      lign":"left","choices":",Dental,Hos-
     A                                      pital,Physician,Pharmacy","choice v-
     A                                      alues":",D,H,P,X","left":"450px","t-
     A                                      op":"215px","width":"85px","css cla-
     A                                      ss 2":"dropdown","tool tip":"Bill t-
     A                                      ypes are: P [Physician], H [Hospita-
     A                                      l], D [Dental], X [Pharmacy]."},{"i-
     A                                      d":"DrpStatusFlt","field type":"sel-
     A                                      ect box","css class":"input","value-
     A                                      ":{"fieldName":"scStatF","dataLengt-
     A                                      h":"1","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designV')
     A                                  1  2HTML('alue":"[scStatF]"},"left":"63-
     A                                      0px","top":"215px","width":"75px","-
     A                                      css class 2":"dropdown","choices":"-
     A                                      ,Active,Inactive","choice values":"-
     A                                      ,A,I","tool tip":"Active or Inactiv-
     A                                      e"},{"id":"LblDescFlt","field type"-
     A                                      :"output field","css class":"output-
     A                                      -field","description":"Group","valu-
     A                                      e":"Description ( Contains)","font -
     A                                      weight":"bold","text align":"left",-
     A                                      "left":"265px","top":"240px","width-
     A                                      ":"140px"},{"id":"TxbDescFlt","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","value":{"fieldName":"scDescF","-
     A                                      dataLength":"60","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[scDescF]"},"left":"265px","top"-
     A                                      :"255px","width":"350px","css class-
     A                                       2":"transform-textbox","tool tip":-
     A                                      "Brief description of the rule used-
     A                                       to aid in understanding the rules -
     A                                      purpose and in filtering to find ce-
     A                                      rtain rules."},{"id":"LblEobCdFlt",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"label","value":"EOB Code","le-
     A                                      ft":"265px","top":"280px","width":"-
     A                                      140px"},{"id":"TxbEobCdFlt","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"value":{"fieldName":"scEobCdF","d-
     A                                      ataLength":"6","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"uppercase","designVa-
     A                                      lue":"[scEobCdF]"},"text align":"le-
     A                                      ft","choices database file":{"field-
     A                                      Name":"SelEOBFile","dataLength":"10-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"},"choice options field":"TR-
     A                                      IM(EBKEY)|| '' - '' ||TRIM(EBDESC)"-
     A                                      ,"choice values field":"EBKEY","cho-
     A                                      ices selection criteria":"EBSTAT <>-
     A                                       ''I''","contains match":"true","le-
     A                                      ft":"265px","top":"295px","width":"-
     A                                      350px","tool tip":"User Defined Exp-
     A                                      lanation of Reimbursement.  "},{"id-
     A                                      ":"LblMsgFlt","field type":"output -
     A                                      field","css class":"label","value":-
     A                                      "Error Message","left":"265px","top-
     A                                      ":"320px","width":"140px"},{"id":"T-
     A                                      xbMsgFlt","field type":"textbox","c-
     A                                      ss class":"input","value":{"fieldNa-
     A                                      me":"scMsgF","dataLength":"7","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      ,"designValue":"[scMsgF]"},"text al-
     A                                      ign":"left","choices database file"-
     A                                      :"FTMIP","choice options field":"TR-
     A                                      IM(MIMSG#)|| '' - '' ||TRIM(MIDESC)-
     A                                      ","choice values field":"MIMSG#","c-
     A                                      hoices selection criteria":{"fieldN-
     A                                      ame":"SelErrMsg","dataLength":"100"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill"')
     A                                  1  2HTML(':"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"},"contai-
     A                                      ns match":"true","left":"265px","to-
     A                                      p":"335px","width":"350px","css cla-
     A                                      ss 2":"textbox","tool tip":"Sapiens-
     A                                       defined message explaining Reimbur-
     A                                      sement.  This will NOT print on the-
     A                                       EOB.This gives the Bill Review sta-
     A                                      ff more detail on the reimbursement-
     A                                       method. "},{"id":"BtnfilCancel","f-
     A                                      ield type":"button","css class":"bu-
     A                                      tton","value":"Cancel","response":{-
     A                                      "fieldName":"BtnFltrCan","customTru-
     A                                      e":"","customFalse":"","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"shortcut key-
     A                                      ":"Escape","left":"500px","top":"38-
     A                                      0px","width":"100px","cursor":"defa-
     A                                      ult","tool tip":"Cancel"},{"id":"Bt-
     A                                      nfilApply","field type":"button","c-
     A                                      ss class":"button","value":"Apply F-
     A                                      ilter","response":{"fieldName":"Btn-
     A                                      FltrApp","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"shortcut key":"Enter","left"-
     A                                      :"615px","top":"380px","width":"100-
     A                                      px","cursor":"default","tool tip":"-
     A                                      Apply Filter"}]}')
     A            BTNFLTRAPP     1A  H
     A            BTNFLTRCAN     1A  H
     A            EREFFDTFLT     1A  H
     A            MSEFFDTFLT   100A  H
     A            SCBILLTYPF     1A  H
     A            SCDESCF       60A  H
     A            SCEFFDTF       8S 0H
     A            SCEOBCDF       6A  H
     A            SCMSGF         7A  H
     A            SCSTATF        1A  H
     A            SELEOBFILE    10A  H
     A            SELERRMSG    100A  H
