     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C1    1C2    13 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"1-13"},"items":[{"id":"N0582F_S-
     A                                      CR01_avKeys","field type":"output f-
     A                                      ield","value":{"fieldName":"AV_KEYS-
     A                                      ","dataLength":"1134","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[AV_KEYS]"},"left":"0px","t-
     A                                      op":"0px","visibility":"hidden"},{"-
     A                                      id":"N0582F_SCR01_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"N0582F_SCR01_B-
     A                                      tnIconMenuSystemTools","tool tip":"-
     A                                      System Tools","icon source":"/profo-
     A                                      undui/userdata/images/systool/systo-
     A                                      ols.png","data function":"SystemToo-
     A                                      lbarSystools","show down arrow":"Ye-
     A                                      s"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"N05-
     A                                      82F_SCR01_ButtonBar","top":"35px","-
     A                                      left":"1036px","width":"187px","hei-
     A                                      ght":"28px","css class":"stationary-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1040px","id":"N0582F_SCR01_BtnSav-
     A                                      e","tool tip":"Save","onclick":"Sys-
     A                                      temToolbarSave","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/save.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR01_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR01_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR01_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR01_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR01_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR01_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR01_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","designValue":"[SCPRDS]","refFie-
     A                                      ld":"NAME","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"active tab":"0",-
     A                                      "left":"250px","top":"70px","width"-
     A                                      :"970px","height":"657px","z index"-
     A                                      :"8","locked in place":"true","css -
     A                                      class":"tab-panel","css class 2":"s-
     A                                      tationary"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      N0582F_SCR01_BtnHiddenSave","value"-
     A                                      :"btnSave","top":"100px","response"-
     A                                      :{"fieldName":"btnSave","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCUS-
     A                                      ER","field type":"output field","va-
     A                                      lue":{"fieldName":"SCUSER","designV-
     A                                      alue":"[SCUSER]","refField":"USER",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"110px","cursor row":"1","css -
     A                                      class 2":"top-line","parent tab pan-
     A                                      el":"N0582F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCCONM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCONM","designValue":"[S-
     A                                      CCONM]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"41-
     A                                      4px","cursor column":"21","top":"11-
     A                                      0px","cursor row":"1","css class 2"-
     A                                      :"top-line","description":"COMPANY -
     A                                      NAME","parent tab panel":"N0582F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant1","field type":"ou-
     A                                      tput field","left":"778px","cursor -
     A                                      column":"73","top":"110px","cursor -
     A                                      row":"1","css class":"top-line","va-
     A                                      lue":"js: currentDate()","css class-
     A                                       2":"output-field","parent tab pane-
     A                                      l":"N0582F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"N0582F_SCR01_f-
     A                                      keyMenu","field type":"menu","left"-
     A                                      :"10px","top":"120px","height":"350-
     A                                      px","width":"230px","hover backgrou-
     A                                      nd color":"#9AAA61","hover text col-
     A                                      or":"#FFFFFF","border')
     A                                  1  2HTML(' color":"#4C6106","menu optio-
     A                                      n indent":"10px","background color"-
     A                                      :"#758B27","css class":"action-menu-
     A                                      ","css class 2":"stationary","z ind-
     A                                      ex":"101"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"N-
     A                                      0582F_SCR01_BtnHiddenRefresh","valu-
     A                                      e":"btnRefresh","top":"125px","resp-
     A                                      onse":{"fieldName":"btnRefresh","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant15","field type":"outpu-
     A                                      t field","value":"N0582F","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"130px","cursor-
     A                                       row":"2","parent tab panel":"N0582-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPRDS","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPRDS","designValue":"[SCPRDS]","r-
     A                                      efField":"NAME","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"414px","curs-
     A                                      or column":"21","top":"130px","curs-
     A                                      or row":"2","description":"PROGRAM -
     A                                      NAME","parent tab panel":"N0582F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant2","field type":"output field","-
     A                                      value":"SCR01","css class":"constan-
     A                                      t","left":"799px","cursor column":"-
     A                                      76","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"N0582F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant3","field type":"output f-
     A                                      ield","value":"Subscriber:","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"150px","curs-
     A                                      or row":"3","parent tab panel":"N05-
     A                                      82F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCSUB","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCSUB","designValue":"[SCSUB]","re-
     A                                      fField":"SUB#","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"false","zeroF-
     A                                      ill":"false","curSym":"","units":""-
     A                                      ,"negNum":"999.00"},"css class":"ou-
     A                                      tput-field","left":"365px","cursor -
     A                                      column":"14","top":"150px","cursor -
     A                                      row":"3","width":"35px","text align-
     A                                      ":"right","css class 2":"HI","paren-
     A                                      t tab panel":"N0582F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCSB-
     A                                      NM","field type":"output field","va-
     A                                      lue":{"fieldName":"SCSBNM","designV-
     A                                      alue":"[SCSBNM]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor')
     A                                  1  2HTML(' column":"21","top":"150px","-
     A                                      cursor row":"3","css class 2":"HI",-
     A                                      "parent tab panel":"N0582F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"N0582F_SCR01_BtnH-
     A                                      iddenSearch","value":"btnSearch","t-
     A                                      op":"150px","response":{"fieldName"-
     A                                      :"btnSearch","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant4","fie-
     A                                      ld type":"output field","value":"Gr-
     A                                      oup:","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "170px","cursor row":"4","parent ta-
     A                                      b panel":"N0582F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCFND","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFND","designValue":-
     A                                      "[SCFND]","refField":"FND","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"365-
     A                                      px","cursor column":"14","top":"170-
     A                                      px","cursor row":"4","width":"21px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :"HI","parent tab panel":"N0582F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"SCFNNM","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCFN-
     A                                      NM","designValue":"[SCFNNM]","refFi-
     A                                      eld":"NAME","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"414px","cursor c-
     A                                      olumn":"21","top":"170px","cursor r-
     A                                      ow":"4","css class 2":"HI","descrip-
     A                                      tion":"FUND NAME","parent tab panel-
     A                                      ":"N0582F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR01_BtnHiddenDiaryItems",-
     A                                      "value":"btnDiary","top":"175px","r-
     A                                      esponse":{"fieldName":"btnDiary","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant5","field type":"outpu-
     A                                      t field","value":"Case:","css class-
     A                                      ":"constant","left":"281px","cursor-
     A                                       column":"2","top":"190px","cursor -
     A                                      row":"5","parent tab panel":"N0582F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCYR","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCY-
     A                                      R","designValue":"[SCYR]","refField-
     A                                      ":"YR","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","')
     A                                  1  2HTML('zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00"},"css-
     A                                       class":"output-field","left":"323p-
     A                                      x","cursor column":"8","top":"190px-
     A                                      ","cursor row":"5","width":"14px","-
     A                                      text align":"right","css class 2":"-
     A                                      HI","parent tab panel":"N0582F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant6","field type":"outp-
     A                                      ut field","value":"-","css class":"-
     A                                      constant","left":"344px","cursor co-
     A                                      lumn":"11","top":"190px","cursor ro-
     A                                      w":"5","parent tab panel":"N0582F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCASE","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      ASE","designValue":"[SCCASE]","refF-
     A                                      ield":"CASE","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"358px","cursor co-
     A                                      lumn":"13","top":"190px","cursor ro-
     A                                      w":"5","width":"49px","text align":-
     A                                      "right","css class 2":"HI","parent -
     A                                      tab panel":"N0582F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt7","field type":"output field","v-
     A                                      alue":"Claimant:","css class":"cons-
     A                                      tant","left":"414px","cursor column-
     A                                      ":"21","top":"190px","cursor row":"-
     A                                      5","parent tab panel":"N0582F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCSS#","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCSS#","-
     A                                      designValue":"[SCSS#]","refField":"-
     A                                      SS#","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"484px","cursor column":-
     A                                      "31","top":"190px","cursor row":"5"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"N0582F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCCNAM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCNAM","designValue":"[S-
     A                                      CCNAM]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"55-
     A                                      4px","cursor column":"41","top":"19-
     A                                      0px","cursor row":"5","css class 2"-
     A                                      :"HI","description":"CLAIMANT NAME"-
     A                                      ,"parent tab panel":"N0582F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"N0582F_SCR01_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px","response":{"-
     A                                      fieldName":"btnMessag')
     A                                  1  2HTML('e","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant8","field t-
     A                                      ype":"output field","value":"Provid-
     A                                      er:","css class":"constant","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      210px","cursor row":"6","parent tab-
     A                                       panel":"N0582F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCFEIN","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFEIN","designValue"-
     A                                      :"[SCFEIN]","refField":"FEIN","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"false","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00"},-
     A                                      "css class":"output-field","left":"-
     A                                      358px","cursor column":"13","top":"-
     A                                      210px","cursor row":"6","width":"63-
     A                                      px","text align":"right","css class-
     A                                       2":"HI","description":"PROVIDER ID-
     A                                       NUMBER","parent tab panel":"N0582F-
     A                                      _SCR01_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCMOD","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      MOD","designValue":"[SCMOD]","refFi-
     A                                      eld":"MOD","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"428px","cursor colu-
     A                                      mn":"23","top":"210px","cursor row"-
     A                                      :"6","width":"21px","text align":"r-
     A                                      ight","css class 2":"HI","descripti-
     A                                      on":"MODIFIER","parent tab panel":"-
     A                                      N0582F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant21","field-
     A                                       type":"output field","value":"Deta-
     A                                      il Seq. #:","css class":"constant",-
     A                                      "left":"687px","cursor column":"60"-
     A                                      ,"top":"210px","cursor row":"6","pa-
     A                                      rent tab panel":"N0582F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CSEQ#","field type":"output field",-
     A                                      "value":{"fieldName":"SCSEQ#","desi-
     A                                      gnValue":"[SCSEQ#]","refField":"SEQ-
     A                                      #","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"true","-
     A                                      curSym":"","units":"","negNum":"-99-
     A                                      9.00","edtWrd":"''    0''"},"css cl-
     A                                      ass":"output-field","left":"799px",-
     A                                      "cursor column":"76","top":"210px",-
     A                                      "cursor row":"6","width":"35px","te-
     A                                      xt align":"right","css class 2":"HI-
     A                                      ","parent tab panel":"N0582F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"N0582F_SCR01_Bt-
     A                                      nHiddenWorkSubmitJob","value":"btnW-
     A                                      rksbmjob","top":"225px","response":-
     A                                      {"fieldName":"btnWrkJob","dataType"-
     A                                      :"indicator","formatt')
     A                                  1  2HTML('ing":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant9","field -
     A                                      type":"output field","value":"Name:-
     A                                      ","css class":"constant","left":"30-
     A                                      2px","cursor column":"5","top":"230-
     A                                      px","cursor row":"7","parent tab pa-
     A                                      nel":"N0582F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCPNAM","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCPNAM","designValue":"[-
     A                                      SCPNAM]","refField":"NAME","dataTyp-
     A                                      e":"reference","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"false","textTransform":"none"},"-
     A                                      css class":"output-field","left":"3-
     A                                      72px","cursor column":"15","top":"2-
     A                                      30px","cursor row":"7","css class 2-
     A                                      ":"HI","description":"PAYEE NAME (O-
     A                                      VERRIDE)","parent tab panel":"N0582-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"constant10","field type-
     A                                      ":"output field","value":"Address:"-
     A                                      ,"css class":"constant","left":"302-
     A                                      px","cursor column":"5","top":"250p-
     A                                      x","cursor row":"8","parent tab pan-
     A                                      el":"N0582F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCADR1","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCADR1","designValue":"[S-
     A                                      CADR1]","refField":"ADR1","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"37-
     A                                      2px","cursor column":"15","top":"25-
     A                                      0px","cursor row":"8","css class 2"-
     A                                      :"HI","description":"ADDRESS LINE 1-
     A                                      ","parent tab panel":"N0582F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"N0582F_SCR01_Bt-
     A                                      nHiddenWorkPrinterOutput","value":"-
     A                                      btnWrkprtout","top":"250px","respon-
     A                                      se":{"fieldName":"btnWrkPrnt","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCADR2","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCADR2","d-
     A                                      esignValue":"[SCADR2]","refField":"-
     A                                      ADR2","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"false","textTransf-
     A                                      orm":"none"},"css class":"output-fi-
     A                                      eld","left":"372px","cursor column"-
     A                                      :"15","top":"270px","cursor row":"9-
     A                                      ","css class 2":"HI","description":-
     A                                      "ADDRESS LINE 2","parent tab panel"-
     A                                      :"N0582F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      N0582F_SCR01_BtnHidde')
     A                                  1  2HTML('nImageQueue","value":"btnImgQ-
     A                                      ue","top":"275px","response":{"fiel-
     A                                      dName":"btnImgQue","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant1-
     A                                      2","field type":"output field","val-
     A                                      ue":"City:","css class":"constant",-
     A                                      "left":"302px","cursor column":"5",-
     A                                      "top":"290px","cursor row":"10","pa-
     A                                      rent tab panel":"N0582F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCTY","field type":"output field","-
     A                                      value":{"fieldName":"SCCTY","design-
     A                                      Value":"[SCCTY]","refField":"CTY","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"372px","cursor column":"15","-
     A                                      top":"290px","cursor row":"10","css-
     A                                       class 2":"HI","description":"CITY"-
     A                                      ,"parent tab panel":"N0582F_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant13","field type":"output-
     A                                       field","value":"State:","css class-
     A                                      ":"constant","left":"575px","cursor-
     A                                       column":"44","top":"290px","cursor-
     A                                       row":"10","parent tab panel":"N058-
     A                                      2F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCST","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CST","designValue":"[SCST]","refFie-
     A                                      ld":"ST","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"638px","cursor colu-
     A                                      mn":"53","top":"290px","cursor row"-
     A                                      :"10","css class 2":"HI","descripti-
     A                                      on":"State","parent tab panel":"N05-
     A                                      82F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant14","field ty-
     A                                      pe":"output field","value":"Zip:","-
     A                                      css class":"constant","left":"673px-
     A                                      ","cursor column":"58","top":"290px-
     A                                      ","cursor row":"10","parent tab pan-
     A                                      el":"N0582F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCZP1","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCZP1","designValue":"[SCZ-
     A                                      P1]","refField":"ZIP1","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00"},"css cl-
     A                                      ass":"output-field","left":"715px",-
     A                                      "cursor column":"64","top":"290px",-
     A                                      "cursor row":"10","width":"35px","t-
     A                                      ext align":"right","css class 2":"H-
     A                                      I","description":"ZIP 1","parent ta-
     A                                      b panel":"N0582F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visib')
     A                                  1  2HTML('ility":"hidden","id":"N0582F_-
     A                                      SCR01_BtnHiddenHelp","value":"btnHe-
     A                                      lp","top":"300px","response":{"fiel-
     A                                      dName":"btnHelp","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant18"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Contr. Eff. Date:","css class":"-
     A                                      constant","left":"288px","cursor co-
     A                                      lumn":"3","top":"330px","cursor row-
     A                                      ":"12","parent tab panel":"N0582F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCEDT","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      EDT","designValue":"[SCCEDT]","refF-
     A                                      ield":"DT8","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"true","curSym":"","units":"","neg-
     A                                      Num":"-999.00","edtWrd":"''  /  /  -
     A                                        ''"},"css class":"output-field","-
     A                                      left":"428px","cursor column":"23",-
     A                                      "top":"330px","cursor row":"12","wi-
     A                                      dth":"70px","text align":"right","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"N0582F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant19","fie-
     A                                      ld type":"output field","value":"Di-
     A                                      sc. Code:","css class":"constant","-
     A                                      left":"505px","cursor column":"34",-
     A                                      "top":"330px","cursor row":"12","pa-
     A                                      rent tab panel":"N0582F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCODE","field type":"output field",-
     A                                      "value":{"fieldName":"SCCODE","desi-
     A                                      gnValue":"[SCCODE]","refField":"BRC-
     A                                      D","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"596px","cursor column":"4-
     A                                      7","top":"330px","cursor row":"12",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"N0582F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant11","f-
     A                                      ield type":"output field","value":"-
     A                                      Code Eff. Date:","css class":"const-
     A                                      ant","left":"631px","cursor column"-
     A                                      :"52","top":"330px","cursor row":"1-
     A                                      2","parent tab panel":"N0582F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCCODT","field type":"output f-
     A                                      ield","value":{"fieldName":"SCCODT"-
     A                                      ,"designValue":"[SCCODT]","refField-
     A                                      ":"DT8","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","edtWrd":"''  /  /    ''-
     A                                      "},"css class":"output-field","left-
     A                                      ":"757px","cursor column":"70","top-
     A                                      ":"330px","cursor row":"12","width"-
     A                                      :"70px","text align":"right","css c-
     A                                      lass 2":"HI","parent tab panel":"N0-
     A                                      582F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"consta')
     A                                  1  2HTML('nt17","field type":"output fi-
     A                                      eld","value":"Contr. Term. Date: ",-
     A                                      "css class":"constant","left":"288p-
     A                                      x","cursor column":"3","top":"350px-
     A                                      ","cursor row":"13","parent tab pan-
     A                                      el":"N0582F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCTMDT","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCTMDT","designValue":"[S-
     A                                      CTMDT]","refField":"DT8","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","edtWrd-
     A                                      ":"''  /  /    ''"},"css class":"ou-
     A                                      tput-field","left":"428px","cursor -
     A                                      column":"23","top":"350px","cursor -
     A                                      row":"13","width":"70px","text alig-
     A                                      n":"right","css class 2":"HI","pare-
     A                                      nt tab panel":"N0582F_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant20","field type":"output field-
     A                                      ","value":"Disc. Type:","css class"-
     A                                      :"constant","left":"505px","cursor -
     A                                      column":"34","top":"350px","cursor -
     A                                      row":"13","parent tab panel":"N0582-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCTYPE","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCTYPE","designValue":"[SCTYPE]","r-
     A                                      efField":"CODE","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none"},"css class":-
     A                                      "output-field","left":"603px","curs-
     A                                      or column":"48","top":"350px","curs-
     A                                      or row":"13","css class 2":"HI","pa-
     A                                      rent tab panel":"N0582F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant16","field type":"output fie-
     A                                      ld","value":"Date of Service: ","cs-
     A                                      s class":"constant","left":"631px",-
     A                                      "cursor column":"52","top":"350px",-
     A                                      "cursor row":"13","parent tab panel-
     A                                      ":"N0582F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCFDAT","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCFDAT","designValue":"[SCF-
     A                                      DAT]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","edtWrd":-
     A                                      "''  /  /    ''"},"css class":"outp-
     A                                      ut-field","left":"757px","cursor co-
     A                                      lumn":"70","top":"350px","cursor ro-
     A                                      w":"13","width":"70px","text align"-
     A                                      :"right","css class 2":"HI","parent-
     A                                       tab panel":"N0582F_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":')
     A                                  1  2HTML('"btnCF03","field type":"butto-
     A                                      n","value":"Exit","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF06-
     A                                      ","field type":"button","value":"Pr-
     A                                      ov master inquiry","shortcut key":"-
     A                                      F6","left":"14px","top":"216px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","value":"C-
     A                                      ancel  ","shortcut key":"F12","left-
     A                                      ":"14px","top":"249px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnHELP","field-
     A                                       type":"button","shortcut key":"Alt-
     A                                      -F1","onclick":"pui.showHelp()","va-
     A                                      lue":"HELP","left":"14px","top":"28-
     A                                      2px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCADR1    R        H      REFFLD(ADR1)
     A            SCADR2    R        H      REFFLD(ADR2)
     A            SCCASE    R        H      REFFLD(CASE)
     A            SCCEDT    R        H      REFFLD(DT8)
     A            SCCNAM    R        H      REFFLD(NAME)
     A            SCCODE    R        H      REFFLD(BRCD)
     A            SCCODT    R        H      REFFLD(DT8)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCTY     R        H      REFFLD(CTY)
     A            SCFDAT    R        H      REFFLD(DT8)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFNNM    R        H      REFFLD(NAME)
     A            SCMOD     R        H      REFFLD(MOD)
     A            SCPNAM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSBNM    R        H      REFFLD(NAME)
     A            SCSEQ#    R        H      REFFLD(SEQ#)
     A            SCSS#     R        H      REFFLD(SS#)
     A            SCST      R        H      REFFLD(ST)
     A            SCSUB     R        H      REFFLD(SUB#)
     A            SCTMDT    R        H      REFFLD(DT8)
     A            SCTYPE    R        H      REFFLD(CODE)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCYR      R        H      REFFLD(YR)
     A            SCZP1     R        H      REFFLD(ZIP1)
     A          R SCR02
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR02_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR02_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR02_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR02_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR02_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR02_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR02_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR02_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR02_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR02_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR02_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR02_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR02_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR02_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR02_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR02_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      02_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR02_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR02-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR02_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR02_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR02_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant25","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCCOM1","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCC-
     A                                      OM1","designValue":"[SCCOM1]","refF-
     A                                      ield":"DS60","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"false","tex-
     A                                      tTransform":"none"},"css class":"ou-
     A                                      tput-field","left":"358px","cursor -
     A                                      column":"13","top":"390px","cursor -
     A                                      row":"15","css class 2":"HI","descr-
     A                                      iption":"COMMENT 1","parent tab pan-
     A                                      el":"N0582F_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCCOM2","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCOM2","designValue":"[S-
     A                                      CCOM2]","refField":"D')
     A                                  1  2HTML('S60","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"358px","cursor co-
     A                                      lumn":"13","top":"410px","cursor ro-
     A                                      w":"16","css class 2":"HI","descrip-
     A                                      tion":"COMMENT 2","parent tab panel-
     A                                      ":"N0582F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant22","fi-
     A                                      eld type":"output field","value":"1-
     A                                      )","css class":"constant","left":"2-
     A                                      81px","cursor column":"2","top":"45-
     A                                      0px","cursor row":"18","parent tab -
     A                                      panel":"N0582F_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant23-
     A                                      ","field type":"output field","valu-
     A                                      e":"If MRA Method: use MRA less","c-
     A                                      ss class":"constant","left":"302px"-
     A                                      ,"cursor column":"5","top":"450px",-
     A                                      "cursor row":"18","parent tab panel-
     A                                      ":"N0582F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCPC01","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCPC01","designValue":"[SCP-
     A                                      C01]","refField":"PC41 4 01","dataT-
     A                                      ype":"reference","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"49-
     A                                      8px","cursor column":"33","top":"45-
     A                                      0px","cursor row":"18","width":"35p-
     A                                      x","text align":"right","css class -
     A                                      2":"HI","description":"PERCENT","pa-
     A                                      rent tab panel":"N0582F_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant24","field type":"output fie-
     A                                      ld","value":"%","css class":"consta-
     A                                      nt","left":"540px","cursor column":-
     A                                      "39","top":"450px","cursor row":"18-
     A                                      ","parent tab panel":"N0582F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant26","field type":"outpu-
     A                                      t field","value":"2) If U&C Method:-
     A                                       use U&C percentile less","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"490px","cursor-
     A                                       row":"20","parent tab panel":"N058-
     A                                      2F_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCPC02","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCPC02","designValue":"[SCPC02]","-
     A                                      refField":"PC41 4 01","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"true",-
     A                                      "zeroFill":"false","curSym":"","uni-
     A                                      ts":"","negNum":"999.00"},"css clas-
     A                                      s":"output-field","left":"575px","c-
     A                                      ursor column":"44","top":"490px","c-
     A                                      ursor row":"20","width":"35px","tex-
     A                                      t align":"right","css class 2":"HI"-
     A                                      ,"description":"PERCENT","parent ta-
     A                                      b panel":"N0582F_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{')
     A                                  1  2HTML('"id":"constant27","field type-
     A                                      ":"output field","value":"% for In -
     A                                      Patient, or","css class":"constant"-
     A                                      ,"left":"617px","cursor column":"50-
     A                                      ","top":"490px","cursor row":"20","-
     A                                      parent tab panel":"N0582F_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCPC03","field type":"output field-
     A                                      ","value":{"fieldName":"SCPC03","de-
     A                                      signValue":"[SCPC03]","refField":"P-
     A                                      C41 4 01","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"302px","cursor column-
     A                                      ":"5","top":"510px","cursor row":"2-
     A                                      1","width":"35px","text align":"rig-
     A                                      ht","css class 2":"HI","description-
     A                                      ":"PERCENT","parent tab panel":"N05-
     A                                      82F_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant28","field ty-
     A                                      pe":"output field","value":"% for O-
     A                                      ut Patient services.","css class":"-
     A                                      constant","left":"344px","cursor co-
     A                                      lumn":"11","top":"510px","cursor ro-
     A                                      w":"21","parent tab panel":"N0582F_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"15-
     A                                      0px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF03","field type":"button","v-
     A                                      alue":"Exit","shortcut key":"F3","l-
     A                                      eft":"14px","top":"183px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF06","fi-
     A                                      eld type":"button","value":"Prov ma-
     A                                      ster inquiry","shortcut key":"F6","-
     A                                      left":"14px","top":"216px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF12","f-
     A                                      ield type":"button","value":"Cancel-
     A                                        ","shortcut key":"F12","left":"14-
     A                                      px","top":"249px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnHELP","field type-
     A                                      ":"button","shortcut key":"Alt-F1",-
     A                                      "onclick":"pui.showHelp()","value":-
     A                                      "HELP","left":"14px","top":"282px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R    4 01H      REFFLD(PC41)
     A            SCPC02    R    4 01H      REFFLD(PC41)
     A            SCPC03    R    4 01H      REFFLD(PC41)
     A          R SCR03
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR03_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR03_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR03_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR03_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR03_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR03_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR03_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR03_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR03_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR03_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR03_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR03_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR03_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR03_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR03_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR03_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      03_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR03_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR03-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR03_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR03_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR03_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant29","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR03_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR03_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR03_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant30","field type":"output field-
     A                                      ","value":"1)","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"430px","cursor row":"17",-
     A                                      "parent tab panel":"N0582F_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant31","field type":"output -
     A                                      field","value":"If MRA Method: use -
     A                                      MRA less","css class":"constant","l-
     A                                      eft":"302px","cursor column":"5","t-
     A                                      op":"430px","cursor row":"17","pare-
     A                                      nt tab panel":"N0582F_SCR03_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      03_SCPC01","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPC01","-
     A                                      designValue":"[SCPC01]","refField":-
     A                                      "PC41 4 01","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"498px","cursor colu-
     A                                      mn":"33","top":"430px","cursor row"-
     A                                      :"17","width":"35px","text align":"-
     A                                      right","css class 2":"HI","descript-
     A                                      ion":"PERCENT","parent tab panel":"-
     A                                      N0582F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant32","field-
     A                                       type":"output field","value":"%","-
     A                                      css class":"constant","left":"540px-
     A                                      ","cursor column":"39","top":"430px-
     A                                      ","cursor row":"17","parent tab pan-
     A                                      el":"N0582F_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant33","-
     A                                      field type":"output field","value":-
     A                                      "2) If U&C Method: Amount of U&C fr-
     A                                      om","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"4-
     A                                      50px","cursor row":"18","parent tab-
     A                                       panel":"N0582F_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      4","field type":"output field","val-
     A                                      ue":"0","css class":"constant","lef-
     A                                      t":"344px","cursor column":"11","to-
     A                                      p":"470px","cursor row":"19","css c-
     A                                      lass 2":"HI","parent tab panel":"N0-
     A                                      582F_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant35","field t-
     A                                      ype":"output field","value":"-","cs-
     A                                      s class":"constant","left":"379px",-
     A                                      "cursor column":"16","top":"470px",-
     A                                      "cursor row":"19","parent tab panel-
     A                                      ":"N0582F_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"S')
     A                                  1  2HTML('CAM01","field type":"output f-
     A                                      ield","value":{"fieldName":"SCAM01"-
     A                                      ,"designValue":"[SCAM01]","refField-
     A                                      ":"A92","dataType":"reference","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"false","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00"},"css class":"output-fi-
     A                                      eld","left":"393px","cursor column"-
     A                                      :"18","top":"470px","cursor row":"1-
     A                                      9","width":"70px","text align":"rig-
     A                                      ht","css class 2":"HI","description-
     A                                      ":"MRA AMOUNT","parent tab panel":"-
     A                                      N0582F_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant36","field-
     A                                       type":"output field","value":"at",-
     A                                      "css class":"constant","left":"470p-
     A                                      x","cursor column":"29","top":"470p-
     A                                      x","cursor row":"19","parent tab pa-
     A                                      nel":"N0582F_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR03_SCPC02-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPC02","designVal-
     A                                      ue":"[SCPC02]","refField":"PC41 4 0-
     A                                      1","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"491px","cursor column":"32",-
     A                                      "top":"470px","cursor row":"19","wi-
     A                                      dth":"35px","text align":"right","c-
     A                                      ss class 2":"HI","description":"PER-
     A                                      CENT","parent tab panel":"N0582F_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant37","field type":"o-
     A                                      utput field","value":"%,","css clas-
     A                                      s":"constant","left":"533px","curso-
     A                                      r column":"38","top":"470px","curso-
     A                                      r row":"19","parent tab panel":"N05-
     A                                      82F_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCAM02","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCAM02","designValue":"[SCAM02]",-
     A                                      "refField":"A92","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"false","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"568px","curso-
     A                                      r column":"43","top":"470px","curso-
     A                                      r row":"19","width":"70px","text al-
     A                                      ign":"right","css class 2":"HI","de-
     A                                      scription":"MRA AMOUNT","parent tab-
     A                                       panel":"N0582F_SCR03_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      8","field type":"output field","val-
     A                                      ue":"-","css class":"constant","lef-
     A                                      t":"645px","cursor column":"54","to-
     A                                      p":"470px","cursor row":"19","paren-
     A                                      t tab panel":"N0582F_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCAM-
     A                                      03","field type":"output field","va-
     A                                      lue":{"fieldName":"SCAM03","designV-
     A                                      alue":"[SCAM03]","refField":"A92","-
     A                                      dataType":"reference"')
     A                                  1  2HTML(',"formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"659px","cur-
     A                                      sor column":"56","top":"470px","cur-
     A                                      sor row":"19","width":"70px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      description":"MRA AMOUNT","parent t-
     A                                      ab panel":"N0582F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t39","field type":"output field","v-
     A                                      alue":"at","css class":"constant","-
     A                                      left":"736px","cursor column":"67",-
     A                                      "top":"470px","cursor row":"19","pa-
     A                                      rent tab panel":"N0582F_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR03_SCPC03","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPC03"-
     A                                      ,"designValue":"[SCPC03]","refField-
     A                                      ":"PC41 4 01","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"757px","cursor co-
     A                                      lumn":"70","top":"470px","cursor ro-
     A                                      w":"19","width":"35px","text align"-
     A                                      :"right","css class 2":"HI","descri-
     A                                      ption":"PERCENT","parent tab panel"-
     A                                      :"N0582F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant40","fie-
     A                                      ld type":"output field","value":"%,-
     A                                      ","css class":"constant","left":"79-
     A                                      9px","cursor column":"76","top":"47-
     A                                      0px","cursor row":"19","parent tab -
     A                                      panel":"N0582F_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCAM04","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCAM04","designValue":-
     A                                      "[SCAM04]","refField":"A92","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      false","zeroFill":"false","curSym":-
     A                                      "","units":"","negNum":"999.00"},"c-
     A                                      ss class":"output-field","left":"30-
     A                                      2px","cursor column":"5","top":"490-
     A                                      px","cursor row":"20","width":"70px-
     A                                      ","text align":"right","css class 2-
     A                                      ":"HI","description":"MRA AMOUNT","-
     A                                      parent tab panel":"N0582F_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "constant41","field type":"output f-
     A                                      ield","value":"-","css class":"cons-
     A                                      tant","left":"379px","cursor column-
     A                                      ":"16","top":"490px","cursor row":"-
     A                                      20","parent tab panel":"N0582F_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCAM05","field type":"output -
     A                                      field","value":{"fieldName":"SCAM05-
     A                                      ","designValue":"[SCAM05]","refFiel-
     A                                      d":"A92","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css cl')
     A                                  1  2HTML('ass":"output-field","left":"3-
     A                                      93px","cursor column":"18","top":"4-
     A                                      90px","cursor row":"20","width":"70-
     A                                      px","text align":"right","css class-
     A                                       2":"HI","description":"MRA AMOUNT"-
     A                                      ,"parent tab panel":"N0582F_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant42","field type":"output-
     A                                       field","value":"at","css class":"c-
     A                                      onstant","left":"470px","cursor col-
     A                                      umn":"29","top":"490px","cursor row-
     A                                      ":"20","parent tab panel":"N0582F_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCPC04","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCP-
     A                                      C04","designValue":"[SCPC04]","refF-
     A                                      ield":"PC41 4 01","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"491px","curso-
     A                                      r column":"32","top":"490px","curso-
     A                                      r row":"20","width":"35px","text al-
     A                                      ign":"right","css class 2":"HI","de-
     A                                      scription":"PERCENT","parent tab pa-
     A                                      nel":"N0582F_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"constant43",-
     A                                      "field type":"output field","value"-
     A                                      :"%,","css class":"constant","left"-
     A                                      :"533px","cursor column":"38","top"-
     A                                      :"490px","cursor row":"20","parent -
     A                                      tab panel":"N0582F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCAM06-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCAM06","designVal-
     A                                      ue":"[SCAM06]","refField":"A92","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"568px","cursor column":"43","top"-
     A                                      :"490px","cursor row":"20","width":-
     A                                      "70px","text align":"right","css cl-
     A                                      ass 2":"HI","description":"MRA AMOU-
     A                                      NT","parent tab panel":"N0582F_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant44","field type":"out-
     A                                      put field","value":"-","css class":-
     A                                      "constant","left":"645px","cursor c-
     A                                      olumn":"54","top":"490px","cursor r-
     A                                      ow":"20","parent tab panel":"N0582F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCAM07","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CAM07","designValue":"[SCAM07]","re-
     A                                      fField":"A92","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"false","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"659px","cursor c-
     A                                      olumn":"56","top":"490px","cursor r-
     A                                      ow":"20","width":"70px","text align-
     A                                      ":"right","css class')
     A                                  1  2HTML(' 2":"HI","description":"MRA A-
     A                                      MOUNT","parent tab panel":"N0582F_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant45","field type":"-
     A                                      output field","value":"at","css cla-
     A                                      ss":"constant","left":"736px","curs-
     A                                      or column":"67","top":"490px","curs-
     A                                      or row":"20","parent tab panel":"N0-
     A                                      582F_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCPC05","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPC05","designValue":"[SCPC05]"-
     A                                      ,"refField":"PC41 4 01","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00"},"css cl-
     A                                      ass":"output-field","left":"757px",-
     A                                      "cursor column":"70","top":"490px",-
     A                                      "cursor row":"20","width":"35px","t-
     A                                      ext align":"right","css class 2":"H-
     A                                      I","description":"PERCENT","parent -
     A                                      tab panel":"N0582F_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt46","field type":"output field","-
     A                                      value":"%,","css class":"constant",-
     A                                      "left":"799px","cursor column":"76"-
     A                                      ,"top":"490px","cursor row":"20","p-
     A                                      arent tab panel":"N0582F_SCR03_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCAM08","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCAM08","des-
     A                                      ignValue":"[SCAM08]","refField":"A9-
     A                                      2","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"false","zeroFill":"false"-
     A                                      ,"curSym":"","units":"","negNum":"9-
     A                                      99.00"},"css class":"output-field",-
     A                                      "left":"302px","cursor column":"5",-
     A                                      "top":"510px","cursor row":"21","wi-
     A                                      dth":"70px","text align":"right","c-
     A                                      ss class 2":"HI","description":"MRA-
     A                                       AMOUNT","parent tab panel":"N0582F-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant47","field type"-
     A                                      :"output field","value":"-","css cl-
     A                                      ass":"constant","left":"379px","cur-
     A                                      sor column":"16","top":"510px","cur-
     A                                      sor row":"21","parent tab panel":"N-
     A                                      0582F_SCR03_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCAM09","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCAM09","designValue":"[SCAM09]-
     A                                      ","refField":"A92","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"393px","cur-
     A                                      sor column":"18","top":"510px","cur-
     A                                      sor row":"21","width":"70px","text -
     A                                      align":"right","css class 2":"HI","-
     A                                      description":"MRA AMOUNT","parent t-
     A                                      ab panel":"N0582F_SCR03_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},')
     A                                  1  2HTML('{"id":"constant48","field typ-
     A                                      e":"output field","value":"at","css-
     A                                       class":"constant","left":"470px","-
     A                                      cursor column":"29","top":"510px","-
     A                                      cursor row":"21","parent tab panel"-
     A                                      :"N0582F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCPC06","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCPC06","designValue":"[SCPC-
     A                                      06]","refField":"PC41 4 01","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"491-
     A                                      px","cursor column":"32","top":"510-
     A                                      px","cursor row":"21","width":"35px-
     A                                      ","text align":"right","css class 2-
     A                                      ":"HI","description":"PERCENT","par-
     A                                      ent tab panel":"N0582F_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant49","field type":"output fiel-
     A                                      d","value":"%,","css class":"consta-
     A                                      nt","left":"533px","cursor column":-
     A                                      "38","top":"510px","cursor row":"21-
     A                                      ","parent tab panel":"N0582F_SCR03_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCAM10","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCAM10",-
     A                                      "designValue":"[SCAM10]","refField"-
     A                                      :"A92","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00"},"css class":"output-fie-
     A                                      ld","left":"568px","cursor column":-
     A                                      "43","top":"510px","cursor row":"21-
     A                                      ","width":"70px","text align":"righ-
     A                                      t","css class 2":"HI","description"-
     A                                      :"MRA AMOUNT","parent tab panel":"N-
     A                                      0582F_SCR03_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant50","field -
     A                                      type":"output field","value":"-","c-
     A                                      ss class":"constant","left":"645px"-
     A                                      ,"cursor column":"54","top":"510px"-
     A                                      ,"cursor row":"21","parent tab pane-
     A                                      l":"N0582F_SCR03_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCAM11","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCAM11","designValue":"[SC-
     A                                      AM11]","refField":"A92","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"999.00"},"css c-
     A                                      lass":"output-field","left":"659px"-
     A                                      ,"cursor column":"56","top":"510px"-
     A                                      ,"cursor row":"21","width":"70px","-
     A                                      text align":"right","css class 2":"-
     A                                      HI","description":"MRA AMOUNT","par-
     A                                      ent tab panel":"N0582F_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant51","field type":"output fiel-
     A                                      d","value":"at","css class":"consta-
     A                                      nt","left":"736px","cursor column":-
     A                                      "67","top":"510px","c')
     A                                  1  2HTML('ursor row":"21","parent tab p-
     A                                      anel":"N0582F_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCPC07","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCPC07","designValue":"-
     A                                      [SCPC07]","refField":"PC41 4 01","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"757px","cursor column":"70","top"-
     A                                      :"510px","cursor row":"21","width":-
     A                                      "35px","text align":"right","css cl-
     A                                      ass 2":"HI","description":"PERCENT"-
     A                                      ,"parent tab panel":"N0582F_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant52","field type":"output-
     A                                       field","value":"%,","css class":"c-
     A                                      onstant","left":"799px","cursor col-
     A                                      umn":"76","top":"510px","cursor row-
     A                                      ":"21","parent tab panel":"N0582F_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant53","field type":"-
     A                                      output field","value":"Within","css-
     A                                       class":"constant","left":"344px","-
     A                                      cursor column":"11","top":"550px","-
     A                                      cursor row":"23","parent tab panel"-
     A                                      :"N0582F_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCAM25","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCAM25","designValue":"[SCAM-
     A                                      25]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","dataLength":"7","decPos":"0"},-
     A                                      "css class":"output-field","left":"-
     A                                      400px","cursor column":"19","top":"-
     A                                      550px","cursor row":"23","width":"4-
     A                                      9px","text align":"right","css clas-
     A                                      s 2":"HI","description":"# of month-
     A                                      s from provider effective date","pa-
     A                                      rent tab panel":"N0582F_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant54","field type":"output fie-
     A                                      ld","value":"months from Providers -
     A                                      effective date.","css class":"const-
     A                                      ant","left":"456px","cursor column"-
     A                                      :"27","top":"550px","cursor row":"2-
     A                                      3","parent tab panel":"N0582F_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"btnSubmit","field type":"butto-
     A                                      n","value":"Enter","shortcut key":"-
     A                                      Enter","left":"14px","top":"150px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF03","field type":"button","value"-
     A                                      :"Exit","shortcut key":"F3","left":-
     A                                      "14px","top":"183px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF06","field t-
     A                                      ype":"button","value":"Prov master -
     A                                      inquiry","shortcut ke')
     A                                  1  2HTML('y":"F6","left":"14px","top":"-
     A                                      216px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel  ","shortcut key":"-
     A                                      F12","left":"14px","top":"249px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnHE-
     A                                      LP","field type":"button","shortcut-
     A                                       key":"Alt-F1","onclick":"pui.showH-
     A                                      elp()","value":"HELP","left":"14px"-
     A                                      ,"top":"282px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCAM25         7S 0H
     A            SCPRDS        40A  H
     A            SCAM01    R        H      REFFLD(A92)
     A            SCAM02    R        H      REFFLD(A92)
     A            SCAM03    R        H      REFFLD(A92)
     A            SCAM04    R        H      REFFLD(A92)
     A            SCAM05    R        H      REFFLD(A92)
     A            SCAM06    R        H      REFFLD(A92)
     A            SCAM07    R        H      REFFLD(A92)
     A            SCAM08    R        H      REFFLD(A92)
     A            SCAM09    R        H      REFFLD(A92)
     A            SCAM10    R        H      REFFLD(A92)
     A            SCAM11    R        H      REFFLD(A92)
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R    4 01H      REFFLD(PC41)
     A            SCPC02    R    4 01H      REFFLD(PC41)
     A            SCPC03    R    4 01H      REFFLD(PC41)
     A            SCPC04    R    4 01H      REFFLD(PC41)
     A            SCPC05    R    4 01H      REFFLD(PC41)
     A            SCPC06    R    4 01H      REFFLD(PC41)
     A            SCPC07    R    4 01H      REFFLD(PC41)
     A          R SCR04
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR04","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR04_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR04_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR04_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR04_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR04_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR04_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR04_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR04_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR04_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR04_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR04_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR04_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR04_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR04_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR04_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR04_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      04_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR04_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR04-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR04_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR04_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR04_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant56","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR04_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR04_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR04_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR04_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR04_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant58","field type":"output field-
     A                                      ","value":"1)","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"450px","cursor row":"18",-
     A                                      "parent tab panel":"N0582F_SCR04_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant59","field type":"output -
     A                                      field","value":"If MRA Method: use -
     A                                      MRA less","css class":"constant","l-
     A                                      eft":"302px","cursor column":"5","t-
     A                                      op":"450px","cursor row":"18","pare-
     A                                      nt tab panel":"N0582F_SCR04_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      04_SCPC01","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPC01","-
     A                                      designValue":"[SCPC01]","refField":-
     A                                      "PC41 4 01","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00"},"css class":"output-
     A                                      -field","left":"498px","cursor colu-
     A                                      mn":"33","top":"450px","cursor row"-
     A                                      :"18","width":"35px","text align":"-
     A                                      right","css class 2":"HI","descript-
     A                                      ion":"PERCENT","parent tab panel":"-
     A                                      N0582F_SCR04_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"constant60","field-
     A                                       type":"output field","value":"% fo-
     A                                      r In Patient, or","css class":"cons-
     A                                      tant","left":"540px","cursor column-
     A                                      ":"39","top":"450px","cursor row":"-
     A                                      18","parent tab panel":"N0582F_SCR0-
     A                                      4_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCR04_SCPC02","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPC02","designValue":"[SCPC02]","r-
     A                                      efField":"PC41 4 01","dataType":"re-
     A                                      ference","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00"},"css class-
     A                                      ":"output-field","left":"687px","cu-
     A                                      rsor column":"60","top":"450px","cu-
     A                                      rsor row":"18","width":"35px","text-
     A                                       align":"right","css class 2":"HI",-
     A                                      "description":"PERCENT","parent tab-
     A                                       panel":"N0582F_SCR04_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant5-
     A                                      5","field type":"output field","val-
     A                                      ue":"% for","css class":"constant",-
     A                                      "left":"729px","cursor column":"66"-
     A                                      ,"top":"450px","cursor row":"18","p-
     A                                      arent tab panel":"N0582F_SCR04_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-conve')
     A                                  1  2HTML('rted"},{"id":"constant57","fi-
     A                                      eld type":"output field","value":"O-
     A                                      ut Patient.","css class":"constant"-
     A                                      ,"left":"323px","cursor column":"8"-
     A                                      ,"top":"470px","cursor row":"19","p-
     A                                      arent tab panel":"N0582F_SCR04_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      constant61","field type":"output fi-
     A                                      eld","value":"2) If U&C Method: use-
     A                                       U&C percentile less","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"510px","cursor row-
     A                                      ":"21","parent tab panel":"N0582F_S-
     A                                      CR04_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR04_SCPC03","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPC03","designValue":"[SCPC03]"-
     A                                      ,"refField":"PC41 4 01","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00"},"css cl-
     A                                      ass":"output-field","left":"575px",-
     A                                      "cursor column":"44","top":"510px",-
     A                                      "cursor row":"21","width":"35px","t-
     A                                      ext align":"right","css class 2":"H-
     A                                      I","description":"PERCENT","parent -
     A                                      tab panel":"N0582F_SCR04_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt62","field type":"output field","-
     A                                      value":"% for Inpatient, or","css c-
     A                                      lass":"constant","left":"624px","cu-
     A                                      rsor column":"51","top":"510px","cu-
     A                                      rsor row":"21","parent tab panel":"-
     A                                      N0582F_SCR04_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCR04_SCPC04","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCPC04","designValue":"[-
     A                                      SCPC04]","refField":"PC41 4 01","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "764px","cursor column":"71","top":-
     A                                      "510px","cursor row":"21","width":"-
     A                                      35px","text align":"right","css cla-
     A                                      ss 2":"HI","description":"PERCENT",-
     A                                      "parent tab panel":"N0582F_SCR04_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant63","field type":"output -
     A                                      field","value":"%","css class":"con-
     A                                      stant","left":"806px","cursor colum-
     A                                      n":"77","top":"510px","cursor row":-
     A                                      "21","parent tab panel":"N0582F_SCR-
     A                                      04_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"constant64","field type":"ou-
     A                                      tput field","value":"for Out Patien-
     A                                      t.","css class":"constant","left":"-
     A                                      330px","cursor column":"9","top":"5-
     A                                      30px","cursor row":"22","parent tab-
     A                                       panel":"N0582F_SCR04_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"btnSubmit-
     A                                      ","field type":"button","value":"En-
     A                                      ter","shortcut key":"')
     A                                  1  2HTML('Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF06","f-
     A                                      ield type":"button","value":"Prov m-
     A                                      aster inquiry","shortcut key":"F6",-
     A                                      "left":"14px","top":"216px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnCF12","-
     A                                      field type":"button","value":"Cance-
     A                                      l  ","shortcut key":"F12","left":"1-
     A                                      4px","top":"249px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnHELP","field typ-
     A                                      e":"button","shortcut key":"Alt-F1"-
     A                                      ,"onclick":"pui.showHelp()","value"-
     A                                      :"HELP","left":"14px","top":"282px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R    4 01H      REFFLD(PC41)
     A            SCPC02    R    4 01H      REFFLD(PC41)
     A            SCPC03    R    4 01H      REFFLD(PC41)
     A            SCPC04    R    4 01H      REFFLD(PC41)
     A          R SCR05
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR05","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR05_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR05_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR05_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR05_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR05_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR05_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR05_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR05_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR05_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR05_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR05_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR05_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR05_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR05_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR05_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR05_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      05_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR05_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR05-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR05_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR05_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR05_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant65","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR05_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR05_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR05_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR05_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR05_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant67","field type":"output field-
     A                                      ","value":"1) For In-Patient servic-
     A                                      es Use MRA less","css class":"const-
     A                                      ant","left":"281px","cursor column"-
     A                                      :"2","top":"450px","cursor row":"18-
     A                                      ","parent tab panel":"N0582F_SCR05_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR05_SCPC01","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      PC01","designValue":"[SCPC01]","ref-
     A                                      Field":"PC41 4 01","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00"},"css class":-
     A                                      "output-field","left":"568px","curs-
     A                                      or column":"43","top":"450px","curs-
     A                                      or row":"18","width":"35px","text a-
     A                                      lign":"right","css class 2":"HI","d-
     A                                      escription":"PERCENT","parent tab p-
     A                                      anel":"N0582F_SCR05_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant68"-
     A                                      ,"field type":"output field","value-
     A                                      ":"%","css class":"constant","left"-
     A                                      :"610px","cursor column":"49","top"-
     A                                      :"450px","cursor row":"18","parent -
     A                                      tab panel":"N0582F_SCR05_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt69","field type":"output field","-
     A                                      value":"2) For Out-Patient Services-
     A                                       Use MRA less","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"490px","cursor row":"20",-
     A                                      "parent tab panel":"N0582F_SCR05_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCR05_SCPC02","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCPC-
     A                                      02","designValue":"[SCPC02]","refFi-
     A                                      eld":"PC41 4 01","dataType":"refere-
     A                                      nce","formatting":"Number","numSep"-
     A                                      :"false","zeroBalance":"true","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00"},"css class":"o-
     A                                      utput-field","left":"568px","cursor-
     A                                       column":"43","top":"490px","cursor-
     A                                       row":"20","width":"35px","text ali-
     A                                      gn":"right","css class 2":"HI","des-
     A                                      cription":"PERCENT","parent tab pan-
     A                                      el":"N0582F_SCR05_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant66","-
     A                                      field type":"output field","value":-
     A                                      "%","css class":"constant","left":"-
     A                                      610px","cursor column":"49","top":"-
     A                                      490px","cursor row":"20","parent ta-
     A                                      b panel":"N0582F_SCR05_MainTabPanel-
     A                                      ","parent tab":"0","c')
     A                                  1  2HTML('ss class 2":"profound-convert-
     A                                      ed"},{"id":"constant70","field type-
     A                                      ":"output field","value":"3) For No-
     A                                      n-Listed(non-Fee schedule) items us-
     A                                      e U&C less","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"530px","cursor row":"22","pa-
     A                                      rent tab panel":"N0582F_SCR05_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR05_SCPC03","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPC03"-
     A                                      ,"designValue":"[SCPC03]","refField-
     A                                      ":"PC41 4 01","dataType":"reference-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00"},"css class":"outp-
     A                                      ut-field","left":"666px","cursor co-
     A                                      lumn":"57","top":"530px","cursor ro-
     A                                      w":"22","width":"35px","text align"-
     A                                      :"right","css class 2":"HI","descri-
     A                                      ption":"PERCENT","parent tab panel"-
     A                                      :"N0582F_SCR05_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant71","fie-
     A                                      ld type":"output field","value":"%"-
     A                                      ,"css class":"constant","left":"708-
     A                                      px","cursor column":"63","top":"530-
     A                                      px","cursor row":"22","parent tab p-
     A                                      anel":"N0582F_SCR05_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF06","field type":"button","v-
     A                                      alue":"Prov master inquiry","shortc-
     A                                      ut key":"F6","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF12","field type":"button","-
     A                                      value":"Cancel  ","shortcut key":"F-
     A                                      12","left":"14px","top":"249px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnHEL-
     A                                      P","field type":"button","shortcut -
     A                                      key":"Alt-F1","onclick":"pui.showHe-
     A                                      lp()","value":"HELP","left":"14px",-
     A                                      "top":"282px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R    4 01H      REFFLD(PC41)
     A            SCPC02    R    4 01H      REFFLD(PC41)
     A            SCPC03    R    4 01H      REFFLD(PC41)
     A          R SCR06
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR06","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR06_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR06_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR06_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR06_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR06_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR06_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR06_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR06_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR06_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR06_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR06_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR06_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR06_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR06_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR06_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR06_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      06_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR06_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR06-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR06_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR06_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR06_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant72","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR06_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR06_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR06_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR06_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR06_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant74","field type":"output field-
     A                                      ","value":"1)","css class":"constan-
     A                                      t","left":"281px","cursor column":"-
     A                                      2","top":"450px","cursor row":"18",-
     A                                      "parent tab panel":"N0582F_SCR06_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant75","field type":"output -
     A                                      field","value":"For Hospital servic-
     A                                      es Use MRA less","css class":"const-
     A                                      ant","left":"302px","cursor column"-
     A                                      :"5","top":"450px","cursor row":"18-
     A                                      ","parent tab panel":"N0582F_SCR06_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCR06_SCPC01","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      PC01","designValue":"[SCPC01]","ref-
     A                                      Field":"PC41 4 01","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00"},"css class":-
     A                                      "output-field","left":"547px","curs-
     A                                      or column":"40","top":"450px","curs-
     A                                      or row":"18","width":"35px","text a-
     A                                      lign":"right","css class 2":"HI","d-
     A                                      escription":"PERCENT","parent tab p-
     A                                      anel":"N0582F_SCR06_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant76"-
     A                                      ,"field type":"output field","value-
     A                                      ":"%","css class":"constant","left"-
     A                                      :"589px","cursor column":"46","top"-
     A                                      :"450px","cursor row":"18","parent -
     A                                      tab panel":"N0582F_SCR06_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt77","field type":"output field","-
     A                                      value":"2) For Non-Hospital Service-
     A                                      s Use MRA less","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"490px","cursor row":"20"-
     A                                      ,"parent tab panel":"N0582F_SCR06_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCR06_SCPC02","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCP-
     A                                      C02","designValue":"[SCPC02]","refF-
     A                                      ield":"PC41 4 01","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"false","curSym":"","units":-
     A                                      "","negNum":"999.00"},"css class":"-
     A                                      output-field","left":"575px","curso-
     A                                      r column":"44","top":"490px","curso-
     A                                      r row":"20","width":"35px","text al-
     A                                      ign":"right","css class 2":"HI","de-
     A                                      scription":"PERCENT","parent tab pa-
     A                                      nel":"N0582F_SCR06_MainTabPanel","p-
     A                                      arent tab":"0","css c')
     A                                  1  2HTML('lass 3":"profound-converted"}-
     A                                      ,{"id":"constant73","field type":"o-
     A                                      utput field","value":"%","css class-
     A                                      ":"constant","left":"617px","cursor-
     A                                       column":"50","top":"490px","cursor-
     A                                       row":"20","parent tab panel":"N058-
     A                                      2F_SCR06_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"constant78","field typ-
     A                                      e":"output field","value":"3) For N-
     A                                      on-Listed(non-Fee schedule) items u-
     A                                      se U&C less","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"530px","cursor row":"22","p-
     A                                      arent tab panel":"N0582F_SCR06_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCR06_SCPC03","field type":"output -
     A                                      field","value":{"fieldName":"SCPC03-
     A                                      ","designValue":"[SCPC03]","refFiel-
     A                                      d":"PC41 4 01","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"666px","cursor c-
     A                                      olumn":"57","top":"530px","cursor r-
     A                                      ow":"22","width":"35px","text align-
     A                                      ":"right","css class 2":"HI","descr-
     A                                      iption":"PERCENT","parent tab panel-
     A                                      ":"N0582F_SCR06_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant79","fi-
     A                                      eld type":"output field","value":"%-
     A                                      ","css class":"constant","left":"71-
     A                                      5px","cursor column":"64","top":"53-
     A                                      0px","cursor row":"22","parent tab -
     A                                      panel":"N0582F_SCR06_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"constant81-
     A                                      ","field type":"output field","valu-
     A                                      e":"Except Code 70540 which will be-
     A                                       at U&C less","css class":"constant-
     A                                      ","left":"330px","cursor column":"9-
     A                                      ","top":"550px","cursor row":"23","-
     A                                      parent tab panel":"N0582F_SCR06_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "FLD001","field type":"output field-
     A                                      ","value":{"fieldName":"FLD001","de-
     A                                      signValue":"[FLD001]","refField":"P-
     A                                      C41 4 01","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"true","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"999.00"},"css class":"output-f-
     A                                      ield","left":"638px","cursor column-
     A                                      ":"53","top":"550px","cursor row":"-
     A                                      23","width":"35px","text align":"ri-
     A                                      ght","css class 2":"HI","descriptio-
     A                                      n":"PERCENT","parent tab panel":"N0-
     A                                      582F_SCR06_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant80","field t-
     A                                      ype":"output field","value":"%","cs-
     A                                      s class":"constant","left":"680px",-
     A                                      "cursor column":"59","top":"550px",-
     A                                      "cursor row":"23","parent tab panel-
     A                                      ":"N0582F_SCR06_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"btnSubmit","fie-
     A                                      ld type":"button","va')
     A                                  1  2HTML('lue":"Enter","shortcut key":"-
     A                                      Enter","left":"14px","top":"150px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      CF03","field type":"button","value"-
     A                                      :"Exit","shortcut key":"F3","left":-
     A                                      "14px","top":"183px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF06","field t-
     A                                      ype":"button","value":"Prov master -
     A                                      inquiry","shortcut key":"F6","left"-
     A                                      :"14px","top":"216px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF12","field -
     A                                      type":"button","value":"Cancel  ","-
     A                                      shortcut key":"F12","left":"14px","-
     A                                      top":"249px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnHELP","field type":"bu-
     A                                      tton","shortcut key":"Alt-F1","oncl-
     A                                      ick":"pui.showHelp()","value":"HELP-
     A                                      ","left":"14px","top":"282px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            FLD001    R    4 01H      REFFLD(PC41)
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R    4 01H      REFFLD(PC41)
     A            SCPC02    R    4 01H      REFFLD(PC41)
     A            SCPC03    R    4 01H      REFFLD(PC41)
     A          R SCRERR
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    18C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCRERR","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","valid command ke-
     A                                      y":{"fieldName":"*IN11","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"overlay ran-
     A                                      ge":"18-24"},"items":[{"id":"N0582F-
     A                                      _SCRERR_avKeys","field type":"outpu-
     A                                      t field","value":{"fieldName":"AV_K-
     A                                      EYS","dataLength":"1134","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[AV_KEYS]"},"left":"0px"-
     A                                      ,"top":"0px","visibility":"hidden"}-
     A                                      ,{"id":"N0582F_SCRERR_action","fiel-
     A                                      d type":"html container","white spa-
     A                                      ce":"normal","left":"0px","top":"10-
     A                                      px","width":"230px","css class":"ac-
     A                                      tion-panel-converted","height":"700-
     A                                      px","html":"<div class=\"top\"></di-
     A                                      v><div class=\"imagetop\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_t-
     A                                      op.png\" /></div><div class=\"menul-
     A                                      inks\"></div><div class=\"imagebott-
     A                                      om\"><img src=\"/profoundui/userdat-
     A                                      a/images/bar_bottom.png\" /></div><-
     A                                      div class=\"bottom\"></div>"},{"fie-
     A                                      ld type":"icon menu button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"32px","z index-
     A                                      ":"20","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1170px","id":"N0582F_SCR-
     A                                      ERR_BtnIconMenuSystemTools","tool t-
     A                                      ip":"System Tools","icon source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      systools.png","data function":"Syst-
     A                                      emToolbarSystools","show down arrow-
     A                                      ":"Yes"},{"field type":"panel","pan-
     A                                      el style":"TransformButtonBar","id"-
     A                                      :"N0582F_SCRERR_ButtonBar","top":"3-
     A                                      5px","left":"1036px","width":"187px-
     A                                      ","height":"28px","css class":"stat-
     A                                      ionary","visibility":"hidden","lock-
     A                                      ed in place":"true"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1040px","id":"N0582F_SCRERR-
     A                                      _BtnSave","tool tip":"Save","onclic-
     A                                      k":"SystemToolbarSave","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/save.png'')"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","')
     A                                  1  2HTML('border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1066px","id":"N0582F_SCRERR_BtnRef-
     A                                      resh","tool tip":"Refresh","onclick-
     A                                      ":"SystemToolbarRefresh","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/refresh.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1092px","id":"-
     A                                      N0582F_SCRERR_BtnSearch","tool tip"-
     A                                      :"Search","onclick":"SystemToolbarS-
     A                                      earch","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      earch.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1118px","id":"N0582F_SCRERR_BtnDi-
     A                                      aryItems","tool tip":"Diary/Work It-
     A                                      ems - IDARTS","onclick":"SystemTool-
     A                                      barDiary","background image":{"fiel-
     A                                      dName":"DryIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      44px","id":"N0582F_SCRERR_BtnSystem-
     A                                      Messages","tool tip":"System Messag-
     A                                      es","onclick":"SystemToolbarMessage-
     A                                      s","background image":{"fieldName":-
     A                                      "MsgIcnURL","dataLength":"128","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      "}},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1196px","-
     A                                      id":"N0582F_SCRERR_BtnHelp","tool t-
     A                                      ip":"Help","onclick":')
     A                                  1  2HTML('"SystemToolbarHelp","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/help.png'')"},{"i-
     A                                      d":"N0582F_SCRERR_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"N0582F_SCRERR_MainTabPanel","fi-
     A                                      eld type":"tab panel","tab panel st-
     A                                      yle":"Transform","tab names":{"fiel-
     A                                      dName":"SCPRDS","dataLength":"40","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one","designValue":"Tab 1"},"active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"N0582F_SCRERR_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"N0582F_SCRERR_fkeyMenu","fie-
     A                                      ld type":"menu","left":"10px","top"-
     A                                      :"120px","height":"350px","width":"-
     A                                      230px","hover background color":"#9-
     A                                      AAA61","hover text color":"#FFFFFF"-
     A                                      ,"border color":"#4C6106","menu opt-
     A                                      ion indent":"10px","background colo-
     A                                      r":"#758B27","css class":"action-me-
     A                                      nu","css class 2":"stationary","z i-
     A                                      ndex":"101"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCRERR_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCRER-
     A                                      R_BtnHiddenSearch","value":"btnSear-
     A                                      ch","top":"150px","response":{"fiel-
     A                                      dName":"btnSearch","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCRERR_BtnHiddenDiary-
     A                                      Items","value":"btnDiary","top":"17-
     A                                      5px","response":{"fieldName":"btnDi-
     A                                      ary","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"b')
     A                                  1  2HTML('utton","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"N0582F_SCRERR_BtnHidde-
     A                                      nSystemMessages","value":"btnMessag-
     A                                      e","top":"200px","response":{"field-
     A                                      Name":"btnMessage","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCRERR_BtnHiddenWorkS-
     A                                      ubmitJob","value":"btnWrksbmjob","t-
     A                                      op":"225px","response":{"fieldName"-
     A                                      :"btnWrkJob","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCRERR_BtnHiddenWorkPrinter-
     A                                      Output","value":"btnWrkprtout","top-
     A                                      ":"250px","response":{"fieldName":"-
     A                                      btnWrkPrnt","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      N0582F_SCRERR_BtnHiddenImageQueue",-
     A                                      "value":"btnImgQue","top":"275px","-
     A                                      response":{"fieldName":"btnImgQue",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCRER-
     A                                      R_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant83","fi-
     A                                      eld type":"output field","value":"*-
     A                                      ** Valid Discount Code Not Found Fo-
     A                                      r This Date of Service:","css class-
     A                                      ":"constant","left":"288px","cursor-
     A                                       column":"3","top":"450px","cursor -
     A                                      row":"18","parent tab panel":"N0582-
     A                                      F_SCRERR_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCRERR_SCFDAT","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCFDAT","designValue":"[SCF-
     A                                      DAT]","refField":"DT8","dataType":"-
     A                                      reference","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","edtWrd":-
     A                                      "''  /  /    ''"},"css class":"outp-
     A                                      ut-field","left":"708px","cursor co-
     A                                      lumn":"63","top":"450px","cursor ro-
     A                                      w":"18","width":"70px","text align"-
     A                                      :"right","css class 2":"HI","parent-
     A                                       tab panel":"N0582F_SCRERR_MainTabP-
     A                                      anel","parent tab":"0')
     A                                  1  2HTML('","css class 3":"profound-con-
     A                                      verted"},{"id":"constant82","field -
     A                                      type":"output field","value":"***",-
     A                                      "css class":"constant","left":"785p-
     A                                      x","cursor column":"74","top":"450p-
     A                                      x","cursor row":"18","parent tab pa-
     A                                      nel":"N0582F_SCRERR_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF06","field type":"button","v-
     A                                      alue":"Prov master inquiry","shortc-
     A                                      ut key":"F6","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF12","field type":"button","-
     A                                      value":"Cancel  ","shortcut key":"F-
     A                                      12","left":"14px","top":"249px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnHEL-
     A                                      P","field type":"button","shortcut -
     A                                      key":"Alt-F1","onclick":"pui.showHe-
     A                                      lp()","value":"HELP","left":"14px",-
     A                                      "top":"282px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCFDAT    R        H      REFFLD(DT8)
     A          R SCR99
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC3    ROVERLAY   0     -
     A                                      RROWS      2    C1    3C1    3 FSCE-
     A                                      RR     INPUTONLY 0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"3-3"},"items":[{"id":"N0582F_SC-
     A                                      R99_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"N0582F_SCR99_action","field typ-
     A                                      e":"html container","white space":"-
     A                                      normal","left":"0px","top":"10px","-
     A                                      width":"230px","css class":"action--
     A                                      panel-converted","height":"700px","-
     A                                      html":"<div class=\"top\"></div><di-
     A                                      v class=\"imagetop\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_top.pn-
     A                                      g\" /></div><div class=\"menulinks\-
     A                                      "></div><div class=\"imagebottom\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_bottom.png\" /></div><div c-
     A                                      lass=\"bottom\"></div>"},{"field ty-
     A                                      pe":"icon menu button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"32px","z index":"20-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1170px","id":"N0582F_SCR99_Bt-
     A                                      nIconMenuSystemTools","tool tip":"S-
     A                                      ystem Tools","icon source":"/profou-
     A                                      ndui/userdata/images/systool/systoo-
     A                                      ls.png","data function":"SystemTool-
     A                                      barSystools","show down arrow":"Yes-
     A                                      "},{"field type":"panel","panel sty-
     A                                      le":"TransformButtonBar","id":"N058-
     A                                      2F_SCR99_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"N0582F_SCR99_BtnSave-
     A                                      ","tool tip":"Save","onclick":"Syst-
     A                                      emToolbarSave","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/save.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border l')
     A                                  1  2HTML('eft style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"N0582F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"N0582F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"N0582F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "N0582F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1196px","id":"N0582F_-
     A                                      SCR99_BtnHelp","tool tip":"Help","o-
     A                                      nclick":"SystemToolba')
     A                                  1  2HTML('rHelp","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/help.png'')"},{"id":"N0582F_SC-
     A                                      R99_ImgSysToolBottom","field type":-
     A                                      "image","image source":"/profoundui-
     A                                      /userdata/images/systool/butbarbot.-
     A                                      png","left":"1036px","top":"64px","-
     A                                      width":"187px","locked in place":"t-
     A                                      rue","css class":"stationary","visi-
     A                                      bility":"hidden"},{"id":"N0582F_SCR-
     A                                      99_MainTabPanel","field type":"tab -
     A                                      panel","tab panel style":"Transform-
     A                                      ","tab names":{"fieldName":"SCPRDS"-
     A                                      ,"dataLength":"40","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none","designVal-
     A                                      ue":"Tab 1"},"active tab":"0","left-
     A                                      ":"250px","top":"70px","width":"970-
     A                                      px","height":"657px","z index":"8",-
     A                                      "locked in place":"true","css class-
     A                                      ":"tab-panel","css class 2":"statio-
     A                                      nary"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR99_BtnHiddenSave","value":"btn-
     A                                      Save","top":"100px","response":{"fi-
     A                                      eldName":"btnSave","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"N0582F_SC-
     A                                      R99_fkeyMenu","field type":"menu","-
     A                                      left":"10px","top":"120px","height"-
     A                                      :"350px","width":"230px","hover bac-
     A                                      kground color":"#9AAA61","hover tex-
     A                                      t color":"#FFFFFF","border color":"-
     A                                      #4C6106","menu option indent":"10px-
     A                                      ","background color":"#758B27","css-
     A                                       class":"action-menu","css class 2"-
     A                                      :"stationary","z index":"101"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"N0582F_SCR99_Btn-
     A                                      HiddenRefresh","value":"btnRefresh"-
     A                                      ,"top":"125px","response":{"fieldNa-
     A                                      me":"btnRefresh","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"SCERR","fie-
     A                                      ld type":"password field","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "input only":"true","value":{"field-
     A                                      Name":"SCERR","designValue":"[SCERR-
     A                                      ]","refField":"FLAG","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"2-
     A                                      88px","cursor column":"3","top":"15-
     A                                      0px","cursor row":"3","width":"8px"-
     A                                      ,"read only":"true","css class 3":"-
     A                                      PR-UL","parent tab panel":"N0582F_S-
     A                                      CR99_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 4":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","i')
     A                                  1  2HTML('d":"N0582F_SCR99_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"N0582F_-
     A                                      SCR99_BtnHiddenDiaryItems","value":-
     A                                      "btnDiary","top":"175px","response"-
     A                                      :{"fieldName":"btnDiary","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"N0582F_SCR99_BtnHidden-
     A                                      SystemMessages","value":"btnMessage-
     A                                      ","top":"200px","response":{"fieldN-
     A                                      ame":"btnMessage","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"N0582F_SCR99_BtnHiddenWorkSub-
     A                                      mitJob","value":"btnWrksbmjob","top-
     A                                      ":"225px","response":{"fieldName":"-
     A                                      btnWrkJob","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"N-
     A                                      0582F_SCR99_BtnHiddenWorkPrinterOut-
     A                                      put","value":"btnWrkprtout","top":"-
     A                                      250px","response":{"fieldName":"btn-
     A                                      WrkPrnt","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR99_BtnHiddenImageQueue","val-
     A                                      ue":"btnImgQue","top":"275px","resp-
     A                                      onse":{"fieldName":"btnImgQue","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"N0582F_SCR99_Btn-
     A                                      HiddenHelp","value":"btnHelp","top"-
     A                                      :"300px","response":{"fieldName":"b-
     A                                      tnHelp","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"btnSubmit","field ty-
     A                                      pe":"button","value":"Enter","short-
     A                                      cut key":"Enter","left":"14px","top-
     A                                      ":"150px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF03","field type":"butto-
     A                                      n","value":"Exit","shortcut key":"F-
     A                                      3","left":"14px","top')
     A                                  1  2HTML('":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnHELP","field type":-
     A                                      "button","shortcut key":"Alt-F1","o-
     A                                      nclick":"pui.showHelp()","value":"H-
     A                                      ELP","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCERR     R        H      REFFLD(FLAG)
     A          R SCR07
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR07","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR07_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR07_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR07_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR07_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR07_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR07_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR07_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR07_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR07_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR07_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR07_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR07_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR07_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR07_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR07_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR07_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      07_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR07_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR07-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR07_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR07_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR07_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant84","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR07_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR07_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR07_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR07_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR07_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"btn-
     A                                      Submit","field type":"button","valu-
     A                                      e":"Enter","shortcut key":"Enter","-
     A                                      left":"14px","top":"150px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF03","f-
     A                                      ield type":"button","value":"Exit",-
     A                                      "shortcut key":"F3","left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF05","field type":"bu-
     A                                      tton","value":"Detail inquiry","sho-
     A                                      rtcut key":"F5","left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF06","field type":"button-
     A                                      ","value":"Prov master inquiry","sh-
     A                                      ortcut key":"F6","left":"14px","top-
     A                                      ":"249px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF12","field type":"butto-
     A                                      n","value":"Cancel  ","shortcut key-
     A                                      ":"F12","left":"14px","top":"282px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nHELP","field type":"button","short-
     A                                      cut key":"Alt-F1","onclick":"pui.sh-
     A                                      owHelp()","value":"HELP","left":"14-
     A                                      px","top":"315px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A          R SCR08
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR08","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR08_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR08_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR08_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR08_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR08_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR08_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR08_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR08_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR08_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR08_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR08_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR08_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR08_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR08_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR08_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR08_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      08_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR08_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR08-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR08_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR08_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR08_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant85","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR08_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR08_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR08_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR08_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR08_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant87","field type":"output field-
     A                                      ","value":"Plus:","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"450px","cursor row":"1-
     A                                      8","parent tab panel":"N0582F_SCR08-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR08_SCPC01","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CPC01","designValue":"[SCPC01]","re-
     A                                      fField":"PC41 4 01","dataType":"ref-
     A                                      erence","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00"},"css class"-
     A                                      :"output-field","left":"330px","cur-
     A                                      sor column":"9","top":"450px","curs-
     A                                      or row":"18","width":"35px","text a-
     A                                      lign":"right","css class 2":"HI","d-
     A                                      escription":"PLUS PERCENT","parent -
     A                                      tab panel":"N0582F_SCR08_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt86","field type":"output field","-
     A                                      value":"%","css class":"constant","-
     A                                      left":"372px","cursor column":"15",-
     A                                      "top":"450px","cursor row":"18","pa-
     A                                      rent tab panel":"N0582F_SCR08_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant89","field type":"output fie-
     A                                      ld","value":"Minus:","css class":"c-
     A                                      onstant","left":"400px","cursor col-
     A                                      umn":"19","top":"450px","cursor row-
     A                                      ":"18","parent tab panel":"N0582F_S-
     A                                      CR08_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR08_SCPC02","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPC02","designValue":"[SCPC02]"-
     A                                      ,"refField":"PC41 4 01","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00"},"css cl-
     A                                      ass":"output-field","left":"456px",-
     A                                      "cursor column":"27","top":"450px",-
     A                                      "cursor row":"18","width":"35px","t-
     A                                      ext align":"right","css class 2":"H-
     A                                      I","description":"MINUS PERCENT","p-
     A                                      arent tab panel":"N0582F_SCR08_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 3":"profound-converted"},{"id":"-
     A                                      constant88","field type":"output fi-
     A                                      eld","value":"%","css class":"const-
     A                                      ant","left":"498px","cursor column"-
     A                                      :"33","top":"450px","cursor row":"1-
     A                                      8","parent tab panel":"N0582F_SCR08-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"constant90","fie')
     A                                  1  2HTML('ld type":"output field","valu-
     A                                      e":"Source:","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"490px","cursor row":"20","p-
     A                                      arent tab panel":"N0582F_SCR08_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCSRCE","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCSRCE","des-
     A                                      ignValue":"[SCSRCE]","refField":"FL-
     A                                      AG","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"344px","cursor column":"-
     A                                      11","top":"490px","cursor row":"20"-
     A                                      ,"css class 2":"HI","description":"-
     A                                      SOURCE","parent tab panel":"N0582F_-
     A                                      SCR08_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant91","field type":-
     A                                      "output field","value":"Lesser of B-
     A                                      illed Charges or PMD/FS:","css clas-
     A                                      s":"constant","left":"400px","curso-
     A                                      r column":"19","top":"490px","curso-
     A                                      r row":"20","parent tab panel":"N05-
     A                                      82F_SCR08_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCLESS","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCLESS","designValue":"[SCLESS]",-
     A                                      "refField":"FLAG","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"659px","cu-
     A                                      rsor column":"56","top":"490px","cu-
     A                                      rsor row":"20","css class 2":"HI","-
     A                                      description":"SOURCE","parent tab p-
     A                                      anel":"N0582F_SCR08_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"id":"btnSubmit",-
     A                                      "field type":"button","value":"Ente-
     A                                      r","shortcut key":"Enter","left":"1-
     A                                      4px","top":"150px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF03","field typ-
     A                                      e":"button","value":"Exit","shortcu-
     A                                      t key":"F3","left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF06","field type":"button","v-
     A                                      alue":"Prov master inquiry","shortc-
     A                                      ut key":"F6","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF12","field type":"button","-
     A                                      value":"Cancel  ","shortcut key":"F-
     A                                      12","left":"14px","top":"249px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnHEL-
     A                                      P","field type":"button","shortcut -
     A                                      key":"Alt-F1","onclick":"pui.showHe-
     A                                      lp()","value":"HELP","left":"14px",-
     A                                      "top":"282px","width":"100px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCLESS    R        H      REFFLD(FLAG)
     A            SCPC01    R    4 01H      REFFLD(PC41)
     A            SCPC02    R    4 01H      REFFLD(PC41)
     A            SCSRCE    R        H      REFFLD(FLAG)
     A          R SCR09
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR09","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR09_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR09_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR09_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR09_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR09_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR09_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR09_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR09_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR09_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR09_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR09_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR09_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR09_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR09_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR09_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR09_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      09_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR09_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR09-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR09_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR09_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR09_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant92","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR09_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR09_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR09_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR09_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR09_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant93","field type":"output field-
     A                                      ","value":"In-patient % off State F-
     A                                      ee Schedule Reimbursement Amount :"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"450p-
     A                                      x","cursor row":"18","parent tab pa-
     A                                      nel":"N0582F_SCR09_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCR09_SCPC01-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPC01","designVal-
     A                                      ue":"[SCPC01]","refField":"PC41","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"true","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"694px","cursor column":"61","top"-
     A                                      :"450px","cursor row":"18","width":-
     A                                      "35px","text align":"right","css cl-
     A                                      ass 2":"HI","description":"PERCENT"-
     A                                      ,"parent tab panel":"N0582F_SCR09_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant94","field type":"output-
     A                                       field","value":"%","css class":"co-
     A                                      nstant","left":"729px","cursor colu-
     A                                      mn":"66","top":"450px","cursor row"-
     A                                      :"18","parent tab panel":"N0582F_SC-
     A                                      R09_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant95","field type":"o-
     A                                      utput field","value":"Out-patient %-
     A                                       off State Fee Schedule Reimburseme-
     A                                      nt Amount:","css class":"constant",-
     A                                      "left":"281px","cursor column":"2",-
     A                                      "top":"470px","cursor row":"19","pa-
     A                                      rent tab panel":"N0582F_SCR09_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR09_SCPC02","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPC02"-
     A                                      ,"designValue":"[SCPC02]","refField-
     A                                      ":"PC41","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00"},"css class":"output-fi-
     A                                      eld","left":"694px","cursor column"-
     A                                      :"61","top":"470px","cursor row":"1-
     A                                      9","width":"35px","text align":"rig-
     A                                      ht","css class 2":"HI","description-
     A                                      ":"PERCENT","parent tab panel":"N05-
     A                                      82F_SCR09_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant96","field ty-
     A                                      pe":"output field","value":"%","css-
     A                                       class":"constant","left":"729px","-
     A                                      cursor column":"66","top":"470px","-
     A                                      cursor row":"19","parent tab panel"-
     A                                      :"N0582F_SCR09_MainTa')
     A                                  1  2HTML('bPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"constant97","field type":"outpu-
     A                                      t field","value":"Non-listed % off -
     A                                      State Fee Schedule Reimbursement Am-
     A                                      ount :","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"490px","cursor row":"20","parent-
     A                                       tab panel":"N0582F_SCR09_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCR09-
     A                                      _SCPC03","field type":"output field-
     A                                      ","value":{"fieldName":"SCPC03","de-
     A                                      signValue":"[SCPC03]","refField":"P-
     A                                      C41","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"694px","cursor column":"61-
     A                                      ","top":"490px","cursor row":"20","-
     A                                      width":"35px","text align":"right",-
     A                                      "css class 2":"HI","description":"P-
     A                                      ERCENT","parent tab panel":"N0582F_-
     A                                      SCR09_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"constant98","field type":-
     A                                      "output field","value":"%","css cla-
     A                                      ss":"constant","left":"729px","curs-
     A                                      or column":"66","top":"490px","curs-
     A                                      or row":"20","parent tab panel":"N0-
     A                                      582F_SCR09_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"btnSubmit","field ty-
     A                                      pe":"button","value":"Enter","short-
     A                                      cut key":"Enter","left":"14px","top-
     A                                      ":"150px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"},-
     A                                      {"id":"btnCF03","field type":"butto-
     A                                      n","value":"Exit","shortcut key":"F-
     A                                      3","left":"14px","top":"183px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF06-
     A                                      ","field type":"button","value":"Pr-
     A                                      ov Master Inquiry","shortcut key":"-
     A                                      F6","left":"14px","top":"216px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF1-
     A                                      2","field type":"button","value":"P-
     A                                      revious","shortcut key":"F12","left-
     A                                      ":"14px","top":"249px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnHELP","field-
     A                                       type":"button","shortcut key":"Alt-
     A                                      -F1","onclick":"pui.showHelp()","va-
     A                                      lue":"HELP","left":"14px","top":"28-
     A                                      2px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R        H      REFFLD(PC41)
     A            SCPC02    R        H      REFFLD(PC41)
     A            SCPC03    R        H      REFFLD(PC41)
     A          R SCR10
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR10","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR10_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR10_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR10_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR10_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR10_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR10_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR10_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR10_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR10_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR10_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR10_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR10_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR10_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR10_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR10_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR10_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      10_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR10_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR10-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR10_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR10_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR10_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant99","field type":"output field-
     A                                      ","value":"Comments:","css class":"-
     A                                      constant","left":"281px","cursor co-
     A                                      lumn":"2","top":"390px","cursor row-
     A                                      ":"15","parent tab panel":"N0582F_S-
     A                                      CR10_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR10_SCCOM1","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCOM1","designValue":"[SCCOM1]"-
     A                                      ,"refField":"DS60","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"358px","c-
     A                                      ursor column":"13","top":"390px","c-
     A                                      ursor row":"15","css class 2":"HI",-
     A                                      "description":"COMMENT 1","parent t-
     A                                      ab panel":"N0582F_SCR10_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SCR10_S-
     A                                      CCOM2","field type":"output field",-
     A                                      "value":{"fieldName":"SCCOM2","desi-
     A                                      gnValue":"[SCCOM2]","')
     A                                  1  2HTML('refField":"DS60","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"358px-
     A                                      ","cursor column":"13","top":"410px-
     A                                      ","cursor row":"16","css class 2":"-
     A                                      HI","description":"COMMENT 2","pare-
     A                                      nt tab panel":"N0582F_SCR10_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"con-
     A                                      stant100","field type":"output fiel-
     A                                      d","value":"Conversion Factor:","cs-
     A                                      s class":"constant","left":"281px",-
     A                                      "cursor column":"2","top":"450px","-
     A                                      cursor row":"18","parent tab panel"-
     A                                      :"N0582F_SCR10_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCR10_SCAM01","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCAM01","designValue":-
     A                                      "[SCAM01]","refField":"A92","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"414-
     A                                      px","cursor column":"21","top":"450-
     A                                      px","cursor row":"18","width":"70px-
     A                                      ","text align":"right","css class 2-
     A                                      ":"HI","parent tab panel":"N0582F_S-
     A                                      CR10_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"constant101","field type":-
     A                                      "output field","value":"Time Unit F-
     A                                      actor:","css class":"constant","lef-
     A                                      t":"491px","cursor column":"32","to-
     A                                      p":"450px","cursor row":"18","paren-
     A                                      t tab panel":"N0582F_SCR10_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR1-
     A                                      0_SCAM02","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCAM02","d-
     A                                      esignValue":"[SCAM02]","refField":"-
     A                                      A92","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00"},"css class":"output-field"-
     A                                      ,"left":"617px","cursor column":"50-
     A                                      ","top":"450px","cursor row":"18","-
     A                                      width":"70px","text align":"right",-
     A                                      "css class 2":"HI","parent tab pane-
     A                                      l":"N0582F_SCR10_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant102","-
     A                                      field type":"output field","value":-
     A                                      "Carve out (Y/N):","css class":"con-
     A                                      stant","left":"694px","cursor colum-
     A                                      n":"61","top":"450px","cursor row":-
     A                                      "18","parent tab panel":"N0582F_SCR-
     A                                      10_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCFL03","field type":"output-
     A                                       field","value":{"fieldName":"SCFL0-
     A                                      3","designValue":"[SCFL03]","refFie-
     A                                      ld":"FLAG","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"813px","cursor co-
     A                                      lumn":"78","top":"450')
     A                                  1  2HTML('px","cursor row":"18","css cl-
     A                                      ass 2":"HI","parent tab panel":"N05-
     A                                      82F_SCR10_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant103","field t-
     A                                      ype":"output field","value":"% off -
     A                                      MRA:","css class":"constant","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "470px","cursor row":"19","parent t-
     A                                      ab panel":"N0582F_SCR10_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCR10_S-
     A                                      CPC01","field type":"output field",-
     A                                      "value":{"fieldName":"SCPC01","desi-
     A                                      gnValue":"[SCPC01]","refField":"PC4-
     A                                      1","dataType":"reference","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00"},"css class":"output-field","-
     A                                      left":"358px","cursor column":"13",-
     A                                      "top":"470px","cursor row":"19","wi-
     A                                      dth":"35px","text align":"right","c-
     A                                      ss class 2":"HI","parent tab panel"-
     A                                      :"N0582F_SCR10_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant104","fi-
     A                                      eld type":"output field","value":"%-
     A                                       off U&C:","css class":"constant","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"470px","cursor row":"19","pa-
     A                                      rent tab panel":"N0582F_SCR10_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CR10_SCPC02","field type":"output f-
     A                                      ield","value":{"fieldName":"SCPC02"-
     A                                      ,"designValue":"[SCPC02]","refField-
     A                                      ":"PC41","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"f-
     A                                      alse","curSym":"","units":"","negNu-
     A                                      m":"999.00"},"css class":"output-fi-
     A                                      eld","left":"491px","cursor column"-
     A                                      :"32","top":"470px","cursor row":"1-
     A                                      9","width":"35px","text align":"rig-
     A                                      ht","css class 2":"HI","parent tab -
     A                                      panel":"N0582F_SCR10_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"constant10-
     A                                      5","field type":"output field","val-
     A                                      ue":"% off Billed Inpatient Charges-
     A                                       :","css class":"constant","left":"-
     A                                      547px","cursor column":"40","top":"-
     A                                      470px","cursor row":"19","parent ta-
     A                                      b panel":"N0582F_SCR10_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCR10_SC-
     A                                      PC04","field type":"output field","-
     A                                      value":{"fieldName":"SCPC04","desig-
     A                                      nValue":"[SCPC04]","refField":"PC41-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00"},"css class":"output-field","l-
     A                                      eft":"778px","cursor column":"73","-
     A                                      top":"470px","cursor row":"19","wid-
     A                                      th":"35px","text align":"right","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "N0582F_SCR10_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"con')
     A                                  1  2HTML('stant106","field type":"outpu-
     A                                      t field","value":"% off Billed Outp-
     A                                      atient Charges:","css class":"const-
     A                                      ant","left":"547px","cursor column"-
     A                                      :"40","top":"490px","cursor row":"2-
     A                                      0","parent tab panel":"N0582F_SCR10-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCR10_SCPC05","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CPC05","designValue":"[SCPC05]","re-
     A                                      fField":"PC41","dataType":"referenc-
     A                                      e","formatting":"Number","numSep":"-
     A                                      false","zeroBalance":"true","zeroFi-
     A                                      ll":"false","curSym":"","units":"",-
     A                                      "negNum":"999.00"},"css class":"out-
     A                                      put-field","left":"778px","cursor c-
     A                                      olumn":"73","top":"490px","cursor r-
     A                                      ow":"20","width":"35px","text align-
     A                                      ":"right","css class 2":"HI","paren-
     A                                      t tab panel":"N0582F_SCR10_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"btnS-
     A                                      ubmit","field type":"button","value-
     A                                      ":"Enter","shortcut key":"Enter","l-
     A                                      eft":"14px","top":"150px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF03","fi-
     A                                      eld type":"button","value":"Exit","-
     A                                      shortcut key":"F3","left":"14px","t-
     A                                      op":"183px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF06","field type":"but-
     A                                      ton","value":"Prov Master Inquiry",-
     A                                      "shortcut key":"F6","left":"14px","-
     A                                      top":"216px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","value":"Previous","shortcut -
     A                                      key":"F12","left":"14px","top":"249-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnHELP","field type":"button","sh-
     A                                      ortcut key":"Alt-F1","onclick":"pui-
     A                                      .showHelp()","value":"HELP","left":-
     A                                      "14px","top":"282px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCAM01    R        H      REFFLD(A92)
     A            SCAM02    R        H      REFFLD(A92)
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCFL03    R        H      REFFLD(FLAG)
     A            SCPC01    R        H      REFFLD(PC41)
     A            SCPC02    R        H      REFFLD(PC41)
     A            SCPC04    R        H      REFFLD(PC41)
     A            SCPC05    R        H      REFFLD(PC41)
     A          R SCR11
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR11","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR11_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR11_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR11_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR11_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR11_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR11_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR11_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR11_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR11_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR11_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR11_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR11_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR11_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR11_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR11_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR11_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      11_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR11_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR11-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR11_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR11_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR11_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant107","field type":"output fiel-
     A                                      d","value":"Comments:","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"390px","cursor ro-
     A                                      w":"15","parent tab panel":"N0582F_-
     A                                      SCR11_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR11_SCCOM1","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCOM1","designValue":"[SCCOM1]-
     A                                      ","refField":"DS60","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"358px","-
     A                                      cursor column":"13","top":"390px","-
     A                                      cursor row":"15","css class 2":"HI"-
     A                                      ,"description":"COMMENT 1","parent -
     A                                      tab panel":"N0582F_SCR11_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCR11_-
     A                                      SCCOM2","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCCOM2","des-
     A                                      ignValue":"[SCCOM2]",')
     A                                  1  2HTML('"refField":"DS60","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"358p-
     A                                      x","cursor column":"13","top":"410p-
     A                                      x","cursor row":"16","css class 2":-
     A                                      "HI","description":"COMMENT 2","par-
     A                                      ent tab panel":"N0582F_SCR11_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant108","field type":"output fie-
     A                                      ld","value":"Discount % off fee sch-
     A                                      ed . :","css class":"constant","lef-
     A                                      t":"358px","cursor column":"13","to-
     A                                      p":"450px","cursor row":"18","paren-
     A                                      t tab panel":"N0582F_SCR11_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCR1-
     A                                      1_SCPC01","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCPC01","d-
     A                                      esignValue":"[SCPC01]","refField":"-
     A                                      PC41","dataType":"reference","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00"},"css class":"output-field-
     A                                      ","left":"561px","cursor column":"4-
     A                                      2","top":"450px","cursor row":"18",-
     A                                      "width":"35px","text align":"right"-
     A                                      ,"css class 2":"HI","parent tab pan-
     A                                      el":"N0582F_SCR11_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"constant109",-
     A                                      "field type":"output field","value"-
     A                                      :"Billed amount discount % . :","cs-
     A                                      s class":"constant","left":"358px",-
     A                                      "cursor column":"13","top":"470px",-
     A                                      "cursor row":"19","parent tab panel-
     A                                      ":"N0582F_SCR11_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCR11_SCPC02","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCPC02","designValue"-
     A                                      :"[SCPC02]","refField":"PC41","data-
     A                                      Type":"reference","formatting":"Num-
     A                                      ber","numSep":"false","zeroBalance"-
     A                                      :"true","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00"},"-
     A                                      css class":"output-field","left":"5-
     A                                      61px","cursor column":"42","top":"4-
     A                                      70px","cursor row":"19","width":"35-
     A                                      px","text align":"right","css class-
     A                                       2":"HI","parent tab panel":"N0582F-
     A                                      _SCR11_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"constant110","field type-
     A                                      ":"output field","value":"Inpatient-
     A                                       discount %       :","css class":"c-
     A                                      onstant","left":"358px","cursor col-
     A                                      umn":"13","top":"490px","cursor row-
     A                                      ":"20","parent tab panel":"N0582F_S-
     A                                      CR11_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR11_SCPC03","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPC03","designValue":"[SCPC03]"-
     A                                      ,"refField":"PC41","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"true","ze-
     A                                      roFill":"false","curSym":"","units"-
     A                                      :"","negNum":"999.00"')
     A                                  1  2HTML('},"css class":"output-field",-
     A                                      "left":"561px","cursor column":"42"-
     A                                      ,"top":"490px","cursor row":"20","w-
     A                                      idth":"35px","text align":"right","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"N0582F_SCR11_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"constant111","f-
     A                                      ield type":"output field","value":"-
     A                                      Inpatient bill amt discnt %:","css -
     A                                      class":"constant","left":"358px","c-
     A                                      ursor column":"13","top":"510px","c-
     A                                      ursor row":"21","parent tab panel":-
     A                                      "N0582F_SCR11_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR11_SCPC04","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCPC04","designValue":"-
     A                                      [SCPC04]","refField":"PC41","dataTy-
     A                                      pe":"reference","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"561-
     A                                      px","cursor column":"42","top":"510-
     A                                      px","cursor row":"21","width":"35px-
     A                                      ","text align":"right","css class 2-
     A                                      ":"HI","parent tab panel":"N0582F_S-
     A                                      CR11_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"btnSubmit","field type":"b-
     A                                      utton","value":"Enter","shortcut ke-
     A                                      y":"Enter","left":"14px","top":"150-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF03","field type":"button","va-
     A                                      lue":"Exit","shortcut key":"F3","le-
     A                                      ft":"14px","top":"183px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF06","fie-
     A                                      ld type":"button","value":"Prov Mas-
     A                                      ter Inquiry","shortcut key":"F6","l-
     A                                      eft":"14px","top":"216px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF12","fi-
     A                                      eld type":"button","value":"Previou-
     A                                      s","shortcut key":"F12","left":"14p-
     A                                      x","top":"249px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnHELP","field type"-
     A                                      :"button","shortcut key":"Alt-F1","-
     A                                      onclick":"pui.showHelp()","value":"-
     A                                      HELP","left":"14px","top":"282px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R        H      REFFLD(PC41)
     A            SCPC02    R        H      REFFLD(PC41)
     A            SCPC03    R        H      REFFLD(PC41)
     A            SCPC04    R        H      REFFLD(PC41)
     A          R SCR12
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR12","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR12_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR12_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR12_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR12_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR12_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR12_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR12_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR12_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR12_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR12_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR12_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR12_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR12_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR12_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR12_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR12_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      12_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR12_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR12-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR12_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR12_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR12_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant112","field type":"output fiel-
     A                                      d","value":"Comments:","css class":-
     A                                      "constant","left":"281px","cursor c-
     A                                      olumn":"2","top":"390px","cursor ro-
     A                                      w":"15","parent tab panel":"N0582F_-
     A                                      SCR12_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR12_SCCOM1","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCOM1","designValue":"[SCCOM1]-
     A                                      ","refField":"DS60","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"358px","-
     A                                      cursor column":"13","top":"390px","-
     A                                      cursor row":"15","css class 2":"HI"-
     A                                      ,"description":"COMMENT 1","parent -
     A                                      tab panel":"N0582F_SCR12_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCR12_-
     A                                      SCCOM2","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCCOM2","des-
     A                                      ignValue":"[SCCOM2]",')
     A                                  1  2HTML('"refField":"DS60","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"358p-
     A                                      x","cursor column":"13","top":"410p-
     A                                      x","cursor row":"16","css class 2":-
     A                                      "HI","description":"COMMENT 2","par-
     A                                      ent tab panel":"N0582F_SCR12_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant113","field type":"output fie-
     A                                      ld","value":"Contract Rate","css cl-
     A                                      ass":"constant","left":"407px","cur-
     A                                      sor column":"20","top":"450px","cur-
     A                                      sor row":"18","parent tab panel":"N-
     A                                      0582F_SCR12_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"constant114","field-
     A                                       type":"output field","value":"Fee -
     A                                      Schedule Rate","css class":"constan-
     A                                      t","left":"533px","cursor column":"-
     A                                      38","top":"450px","cursor row":"18"-
     A                                      ,"parent tab panel":"N0582F_SCR12_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant115","field type":"outpu-
     A                                      t field","value":"Professional :","-
     A                                      css class":"constant","left":"302px-
     A                                      ","cursor column":"5","top":"470px"-
     A                                      ,"cursor row":"19","parent tab pane-
     A                                      l":"N0582F_SCR12_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCPROF","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCPROF","designValue":"[SC-
     A                                      PROF]","dataType":"zoned","formatti-
     A                                      ng":"Number","numSep":"false","zero-
     A                                      Balance":"true","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"99-
     A                                      9.00","dataLength":"9","decPos":"2"-
     A                                      },"css class":"output-field","left"-
     A                                      :"421px","cursor column":"22","top"-
     A                                      :"470px","cursor row":"19","width":-
     A                                      "70px","text align":"right","css cl-
     A                                      ass 2":"HI","parent tab panel":"N05-
     A                                      82F_SCR12_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"SCFSPC","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"SCFSPC","designValue":"[SCFSPC]",-
     A                                      "dataType":"zoned","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"true","zeroFill":"false","curSym-
     A                                      ":"","units":"","negNum":"999.00","-
     A                                      dataLength":"9","decPos":"2"},"css -
     A                                      class":"output-field","left":"547px-
     A                                      ","cursor column":"40","top":"470px-
     A                                      ","cursor row":"19","width":"70px",-
     A                                      "text align":"right","css class 2":-
     A                                      "HI","parent tab panel":"N0582F_SCR-
     A                                      12_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"constant116","field type":"o-
     A                                      utput field","value":"Technical    -
     A                                      :","css class":"constant","left":"3-
     A                                      02px","cursor column":"5","top":"49-
     A                                      0px","cursor row":"20","parent tab -
     A                                      panel":"N0582F_SCR12_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCTECH","f-
     A                                      ield type":"output fi')
     A                                  1  2HTML('eld","value":{"fieldName":"SC-
     A                                      TECH","designValue":"[SCTECH]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"9","decPos":"2"},"css clas-
     A                                      s":"output-field","left":"421px","c-
     A                                      ursor column":"22","top":"490px","c-
     A                                      ursor row":"20","width":"70px","tex-
     A                                      t align":"right","css class 2":"HI"-
     A                                      ,"parent tab panel":"N0582F_SCR12_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"SCFSTC","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCFSTC","-
     A                                      designValue":"[SCFSTC]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00","dataLength"-
     A                                      :"9","decPos":"2"},"css class":"out-
     A                                      put-field","left":"547px","cursor c-
     A                                      olumn":"40","top":"490px","cursor r-
     A                                      ow":"20","width":"70px","text align-
     A                                      ":"right","css class 2":"HI","paren-
     A                                      t tab panel":"N0582F_SCR12_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant117","field type":"output field-
     A                                      ","value":"Total        :","css cla-
     A                                      ss":"constant","left":"302px","curs-
     A                                      or column":"5","top":"510px","curso-
     A                                      r row":"21","parent tab panel":"N05-
     A                                      82F_SCR12_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCMRA","field type":"-
     A                                      output field","value":{"fieldName":-
     A                                      "SCMRA","designValue":"[SCMRA]","da-
     A                                      taType":"zoned","formatting":"Numbe-
     A                                      r","numSep":"false","zeroBalance":"-
     A                                      true","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00","dat-
     A                                      aLength":"9","decPos":"2"},"css cla-
     A                                      ss":"output-field","left":"421px","-
     A                                      cursor column":"22","top":"510px","-
     A                                      cursor row":"21","width":"70px","te-
     A                                      xt align":"right","css class 2":"HI-
     A                                      ","parent tab panel":"N0582F_SCR12_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCFSTO","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCFSTO",-
     A                                      "designValue":"[SCFSTO]","dataType"-
     A                                      :"zoned","formatting":"Number","num-
     A                                      Sep":"false","zeroBalance":"true","-
     A                                      zeroFill":"false","curSym":"","unit-
     A                                      s":"","negNum":"999.00","dataLength-
     A                                      ":"9","decPos":"2"},"css class":"ou-
     A                                      tput-field","left":"547px","cursor -
     A                                      column":"40","top":"510px","cursor -
     A                                      row":"21","width":"70px","text alig-
     A                                      n":"right","css class 2":"HI","pare-
     A                                      nt tab panel":"N0582F_SCR12_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      3":"profound-converted"},{"id":"btn-
     A                                      Submit","field type":"button","valu-
     A                                      e":"Enter","shortcut key":"Enter","-
     A                                      left":"14px","top":"150px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id')
     A                                  1  2HTML('":"btnCF03","field type":"but-
     A                                      ton","value":"Exit","shortcut key":-
     A                                      "F3","left":"14px","top":"183px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      06","field type":"button","value":"-
     A                                      Prov master inquiry","shortcut key"-
     A                                      :"F6","left":"14px","top":"216px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F12","field type":"button","value":-
     A                                      "Cancel  ","shortcut key":"F12","le-
     A                                      ft":"14px","top":"249px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnHELP","fie-
     A                                      ld type":"button","shortcut key":"A-
     A                                      lt-F1","onclick":"pui.showHelp()","-
     A                                      value":"HELP","left":"14px","top":"-
     A                                      282px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFSPC         9S 2H
     A            SCFSTC         9S 2H
     A            SCFSTO         9S 2H
     A            SCMRA          9S 2H
     A            SCPRDS        40A  H
     A            SCPROF         9S 2H
     A            SCTECH         9S 2H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A          R SCR13
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR13","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR13_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR13_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR13_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR13_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR13_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR13_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR13_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR13_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR13_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR13_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR13_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR13_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR13_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR13_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR13_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR13_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      13_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR13_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR13-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR13_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR13_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR13_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant118","field type":"output fiel-
     A                                      d","value":"Comments:","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"390px","cursor ro-
     A                                      w":"15","parent tab panel":"N0582F_-
     A                                      SCR13_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR13_SCCOM1","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCOM1","designValue":"[SCCOM1]-
     A                                      ","refField":"DS60","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"372px","-
     A                                      cursor column":"15","top":"390px","-
     A                                      cursor row":"15","css class 2":"HI"-
     A                                      ,"description":"COMMENT 1","parent -
     A                                      tab panel":"N0582F_SCR13_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCR13_-
     A                                      SCCOM2","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCCOM2","des-
     A                                      ignValue":"[SCCOM2]",')
     A                                  1  2HTML('"refField":"DS60","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"372p-
     A                                      x","cursor column":"15","top":"410p-
     A                                      x","cursor row":"16","css class 2":-
     A                                      "HI","description":"COMMENT 2","par-
     A                                      ent tab panel":"N0582F_SCR13_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant119","field type":"output fie-
     A                                      ld","value":"Percent of Medicare:",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"450px-
     A                                      ","cursor row":"18","parent tab pan-
     A                                      el":"N0582F_SCR13_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCR13_SCPC01"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPC01","designValu-
     A                                      e":"[SCPC01]","refField":"PC41","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "449px","cursor column":"26","top":-
     A                                      "450px","cursor row":"18","width":"-
     A                                      35px","text align":"right","css cla-
     A                                      ss 2":"HI","description":"PERCENT",-
     A                                      "parent tab panel":"N0582F_SCR13_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant120","field type":"output-
     A                                       field","value":"%","css class":"co-
     A                                      nstant","left":"491px","cursor colu-
     A                                      mn":"32","top":"450px","cursor row"-
     A                                      :"18","parent tab panel":"N0582F_SC-
     A                                      R13_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"btnSubmit","field type":"bu-
     A                                      tton","value":"Enter","shortcut key-
     A                                      ":"Enter","left":"14px","top":"150p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF03","field type":"button","val-
     A                                      ue":"Exit","shortcut key":"F3","lef-
     A                                      t":"14px","top":"183px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"},{"id":"btnCF06","fiel-
     A                                      d type":"button","value":"Prov mast-
     A                                      er inquiry","shortcut key":"F6","le-
     A                                      ft":"14px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF12","fie-
     A                                      ld type":"button","value":"Cancel  -
     A                                      ","shortcut key":"F12","left":"14px-
     A                                      ","top":"249px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnHELP","field type":-
     A                                      "button","shortcut key":"Alt-F1","o-
     A                                      nclick":"pui.showHelp()","value":"H-
     A                                      ELP","left":"14px","top":"282px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R        H      REFFLD(PC41)
     A          R SCR14
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    15C2    24 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR14","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"15-24"},"items":[{"id":"N0582F_-
     A                                      SCR14_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N0582F_SCR14_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N0582F_SCR14_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"N0-
     A                                      582F_SCR14_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"N0582F_SCR14_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border')
     A                                  1  2HTML(' left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"N0582F_SCR14_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"N0582F_-
     A                                      SCR14_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"N0582F_SCR14_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"N0582F_SCR14_BtnSystemMessages",-
     A                                      "tool tip":"System Messages","oncli-
     A                                      ck":"SystemToolbarMessages","backgr-
     A                                      ound image":{"fieldName":"MsgIcnURL-
     A                                      ","dataLength":"128","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"}},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1196px","id":"N0582-
     A                                      F_SCR14_BtnHelp","tool tip":"Help",-
     A                                      "onclick":"SystemTool')
     A                                  1  2HTML('barHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"N0582F_-
     A                                      SCR14_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"N0582F_S-
     A                                      CR14_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":{"fieldName":"SCPRD-
     A                                      S","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"Tab 1"},"active tab":"0","le-
     A                                      ft":"250px","top":"70px","width":"9-
     A                                      70px","height":"657px","z index":"8-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"tab-panel","css class 2":"stat-
     A                                      ionary"},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N05-
     A                                      82F_SCR14_BtnHiddenSave","value":"b-
     A                                      tnSave","top":"100px","response":{"-
     A                                      fieldName":"btnSave","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"N0582F_-
     A                                      SCR14_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N0582F_SCR14_B-
     A                                      tnHiddenRefresh","value":"btnRefres-
     A                                      h","top":"125px","response":{"field-
     A                                      Name":"btnRefresh","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N0582F_SCR14_BtnHiddenSearch-
     A                                      ","value":"btnSearch","top":"150px"-
     A                                      ,"response":{"fieldName":"btnSearch-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"N0582F_SCR-
     A                                      14_BtnHiddenDiaryItems","value":"bt-
     A                                      nDiary","top":"175px","response":{"-
     A                                      fieldName":"btnDiary","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"114')
     A                                  1  2HTML('0px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N0582-
     A                                      F_SCR14_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N0582F_SCR14-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N0582F_SCR14_BtnHid-
     A                                      denWorkPrinterOutput","value":"btnW-
     A                                      rkprtout","top":"250px","response":-
     A                                      {"fieldName":"btnWrkPrnt","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N0582F_SCR14_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N0582F_SCR14_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant121","field type":"output fiel-
     A                                      d","value":"Comments:","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"390px","cursor ro-
     A                                      w":"15","parent tab panel":"N0582F_-
     A                                      SCR14_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR14_SCCOM1","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCCOM1","designValue":"[SCCOM1]-
     A                                      ","refField":"DS60","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"372px","-
     A                                      cursor column":"15","top":"390px","-
     A                                      cursor row":"15","css class 2":"HI"-
     A                                      ,"description":"COMMENT 1","parent -
     A                                      tab panel":"N0582F_SCR14_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCR14_-
     A                                      SCCOM2","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCCOM2","des-
     A                                      ignValue":"[SCCOM2]",')
     A                                  1  2HTML('"refField":"DS60","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"372p-
     A                                      x","cursor column":"15","top":"410p-
     A                                      x","cursor row":"16","css class 2":-
     A                                      "HI","description":"COMMENT 2","par-
     A                                      ent tab panel":"N0582F_SCR14_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant122","field type":"output fie-
     A                                      ld","value":"1) Inpatient Percent o-
     A                                      f Medicare :","css class":"constant-
     A                                      ","left":"295px","cursor column":"4-
     A                                      ","top":"450px","cursor row":"18","-
     A                                      parent tab panel":"N0582F_SCR14_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR14_SCPC01","field type":"output-
     A                                       field","value":{"fieldName":"SCPC0-
     A                                      1","designValue":"[SCPC01]","refFie-
     A                                      ld":"PC41","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"true","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"999.00"},"css class":"output--
     A                                      field","left":"547px","cursor colum-
     A                                      n":"40","top":"450px","cursor row":-
     A                                      "18","width":"35px","text align":"r-
     A                                      ight","css class 2":"HI","descripti-
     A                                      on":"PERCENT","parent tab panel":"N-
     A                                      0582F_SCR14_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant123","field-
     A                                       type":"output field","value":"%","-
     A                                      css class":"constant","left":"589px-
     A                                      ","cursor column":"46","top":"450px-
     A                                      ","cursor row":"18","parent tab pan-
     A                                      el":"N0582F_SCR14_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"constant124",-
     A                                      "field type":"output field","value"-
     A                                      :"2) Outpatient Percent of Medicare-
     A                                      :","css class":"constant","left":"2-
     A                                      95px","cursor column":"4","top":"49-
     A                                      0px","cursor row":"20","parent tab -
     A                                      panel":"N0582F_SCR14_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCR14_SCPC-
     A                                      02","field type":"output field","va-
     A                                      lue":{"fieldName":"SCPC02","designV-
     A                                      alue":"[SCPC02]","refField":"PC41",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"true","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"999.0-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"547px","cursor column":"40","to-
     A                                      p":"490px","cursor row":"20","width-
     A                                      ":"35px","text align":"right","css -
     A                                      class 2":"HI","description":"PERCEN-
     A                                      T","parent tab panel":"N0582F_SCR14-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      id":"constant125","field type":"out-
     A                                      put field","value":"%","css class":-
     A                                      "constant","left":"589px","cursor c-
     A                                      olumn":"46","top":"490px","cursor r-
     A                                      ow":"20","parent tab panel":"N0582F-
     A                                      _SCR14_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"pro')
     A                                  1  2HTML('found-converted"},{"id":"btnS-
     A                                      ubmit","field type":"button","value-
     A                                      ":"Enter","shortcut key":"Enter","l-
     A                                      eft":"14px","top":"150px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF03","fi-
     A                                      eld type":"button","value":"Exit","-
     A                                      shortcut key":"F3","left":"14px","t-
     A                                      op":"183px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF06","field type":"but-
     A                                      ton","value":"Prov master inquiry",-
     A                                      "shortcut key":"F6","left":"14px","-
     A                                      top":"216px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF12","field type":"bu-
     A                                      tton","value":"Cancel  ","shortcut -
     A                                      key":"F12","left":"14px","top":"249-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnHELP","field type":"button","sh-
     A                                      ortcut key":"Alt-F1","onclick":"pui-
     A                                      .showHelp()","value":"HELP","left":-
     A                                      "14px","top":"282px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCCOM1    R        H      REFFLD(DS60)
     A            SCCOM2    R        H      REFFLD(DS60)
     A            SCPC01    R        H      REFFLD(PC41)
     A            SCPC02    R        H      REFFLD(PC41)
