     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 23
     A  24 25 26                            CA01(10 'Response Indicator *IN10')
     A  27 28                               CA02(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                  1  2HTML('QPUIREC9    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCSUB#C7    MCR0301C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCSUB#C7    MC40004-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     26RERRMSGID  5    C6    SCFLA-
     A                                      GC7    MCR0555C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     21RERRMSGID  5 -
     A                                         C6    SCFRDTC7    MCR0500C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     2-
     A                                      2RERRMSGID  5    C6    SCFRDTC7    -
     A                                      MCR0529C6    FSMESGC5    *LIBLC0   -
     A                                       E1    3     24RERRMSGID  5    C6  -
     A                                        SCTODTC7    MCR0500C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     23RERRMS-
     A                                      GID  5    C6    SCTODTC7    MCR0529-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     24RERRMSGID  5    C6    SCRTY-
     A                                      PC7    MCR0304C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     25')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"return cursor record":{"fiel-
     A                                      dName":"HREC","dataLength":"10","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"none"},"r-
     A                                      eturn cursor field":{"fieldName":"H-
     A                                      FLD","dataLength":"10","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"none"},"valid comm-
     A                                      and key":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-23"},"items":[{"id":"H-
     A                                      FLD","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"HFLD","designValue":"[HFLD]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"10"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"HREC","field type-
     A                                      ":"output field","visibility":"hidd-
     A                                      en","value":{"fieldName":"HREC","de-
     A                                      signValue":"[HREC]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"N7001F_SCR01_avKeys","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"AV_KEYS","dataLength":"1134","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[AV_KEYS]"},"left-
     A                                      ":"0px","top":"0px","visibility":"h-
     A                                      idden"},{"id":"N7001F_SCR01_action"-
     A                                      ,"field type":"html container","whi-
     A                                      te space":"normal","left":"0px","to-
     A                                      p":"10px","width":"230px","css clas-
     A                                      s":"action-panel-converted","height-
     A                                      ":"700px","html":"<div class=\"top\-
     A                                      "></div><div class=\"imagetop\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_top.png\" /></div><div class=\-
     A                                      "menulinks\"></div><div class=\"ima-
     A                                      gebottom\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_bottom.png\" /><-
     A                                      /div><div class=\"bottom\"></div>"}-
     A                                      ,{"field type":"icon menu button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"32px","z-
     A                                       index":"20","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1170px","id":"N700-
     A                                      1F_SCR01_BtnIconMenuSystemTools","t-
     A                                      ool tip":"System Tools","icon align-
     A                                      ment":"middle left","icon width":"1-
     A                                      6px","icon height":"24px","icon sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/systools.png","data function-
     A                                      ":"SystemToolbarSystools","show dow-
     A                                      n arrow":"Yes"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"N7001F_SCR01_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"N7001F_-
     A                                      SCR01_BtnSave","tool tip":"Save","o-
     A                                      nclick":"SystemToolbarSave","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/save.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1066p')
     A                                  1  4HTML('x","id":"N7001F_SCR01_BtnRefr-
     A                                      esh","tool tip":"Refresh","onclick"-
     A                                      :"SystemToolbarRefresh","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/refresh.png'')"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1092px","id":"N-
     A                                      7001F_SCR01_BtnSearch","tool tip":"-
     A                                      Search","onclick":"SystemToolbarSea-
     A                                      rch","background image":"url(''/pro-
     A                                      foundui/userdata/images/systool/sea-
     A                                      rch.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1118px","id":"N7001F_SCR01_BtnDiary-
     A                                      Items","tool tip":"Diary/Work Items-
     A                                       - IDARTS","onclick":"SystemToolbar-
     A                                      Diary","background image":{"fieldNa-
     A                                      me":"DryIcnURL","dataLength":"128",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"}},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1144p-
     A                                      x","id":"N7001F_SCR01_BtnSystemMess-
     A                                      ages","tool tip":"System Messages",-
     A                                      "onclick":"SystemToolbarMessages","-
     A                                      background image":{"fieldName":"Msg-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1196px","id":-
     A                                      "N7001F_SCR01_BtnHelp","tool tip":"-
     A                                      Help","onclick":"SystemToolbarHelp"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/help.pn-
     A                                      g'')"},{"id":"N7001F_SCR01_ImgSysTo-
     A                                      olBottom","field type":"image","ima-
     A                                      ge source":"/profoundui/userdata/im-
     A                                      ages/systool/butbarbot.png","left":-
     A                                      "1036px","top":"64px","width":"187p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den"},{"id":"N7001F_SCR01_MainTabPa-
     A                                      nel","field type":"tab panel","tab -
     A                                      panel style":"Transform","tab names-
     A                                      ":{"fieldName":"SCPRDS","designValu-
     A                                      e":"[SCPRDS]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"active tab":"0","left":"250px"-
     A                                      ,"top":"70px","width":"970px","heig-
     A                                      ht":"657px","z index":"8","locked i-
     A                                      n place":"true","css class":"tab-pa-
     A                                      nel","css class 2":"stationary"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"N7001F_SCR01_B-
     A                                      tnHiddenSave","value":"btnSave","to-
     A                                      p":"100px","response":{"fieldName":-
     A                                      "btnSave","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant1","field -
     A                                      type":"output field","left":"281px"-
     A                                      ,"cursor column":"2","top":"110px",-
     A                                      "cursor row":"1","css class":"top-l-
     A                                      ine","value":"js: currentUser()","c-
     A                                      ss class 2":"output-field","parent -
     A                                      tab panel":"N7001F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCCONM-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCCONM","designVal-
     A                                      ue":"[SCCONM]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","css class 3":"H-
     A                                      I","description":"COMPANY NAME","pa-
     A                                      rent tab panel":"N7001F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 4":"profound-converted"},{"id":"c-
     A                                      onstant2","field type":"output fiel-
     A                                      d","left":"778px","cursor column":"-
     A                                      73","top":"110px","cursor row":"1",-
     A                                      "css class":"top-line","value":"js:-
     A                                       currentDate()","css class 2":"outp-
     A                                      ut-field","parent tab pane')
     A                                  1  5HTML('l":"N7001F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"N7001F_S-
     A                                      CR01_fkeyMenu","field type":"menu",-
     A                                      "left":"10px","top":"120px","height-
     A                                      ":"350px","width":"230px","hover ba-
     A                                      ckground color":"#9AAA61","hover te-
     A                                      xt color":"#FFFFFF","border color":-
     A                                      "#4C6106","menu option indent":"10p-
     A                                      x","background color":"#758B27","cs-
     A                                      s class":"action-menu","css class 2-
     A                                      ":"stationary","z index":"101"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"N7001F_SCR01_Bt-
     A                                      nHiddenRefresh","value":"btnRefresh-
     A                                      ","top":"125px","response":{"fieldN-
     A                                      ame":"btnRefresh","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"Q1PGM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"Q1PGM","designValue":"[-
     A                                      Q1PGM]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none","dataLength":"10"},"css cl-
     A                                      ass":"output-field","left":"281px",-
     A                                      "cursor column":"2","top":"130px","-
     A                                      cursor row":"2","parent tab panel":-
     A                                      "N7001F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPRDS","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPRDS","designValue":"[SCPRD-
     A                                      S]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"130px"-
     A                                      ,"cursor row":"2","css class 2":"HI-
     A                                      ","description":"PROGRAM NAME","par-
     A                                      ent tab panel":"N7001F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","visibilit-
     A                                      y":"hidden","css class 3":"profound-
     A                                      -converted"},{"id":"constant3","fie-
     A                                      ld type":"output field","value":"SC-
     A                                      R01","css class":"constant","left":-
     A                                      "799px","cursor column":"76","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"N7001F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"N7001F_SCR01_BtnHiddenSearc-
     A                                      h","value":"btnSearch","top":"150px-
     A                                      ","response":{"fieldName":"btnSearc-
     A                                      h","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"N7001F_SC-
     A                                      R01_BtnHiddenDiaryItems","value":"b-
     A                                      tnDiary","top":"175px","response":{-
     A                                      "fieldName":"btnDiary","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant4","field type":"output field","-
     A                                      value":"Type choices, press Enter."-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"190p-
     A                                      x","cursor row":"5","css class 2":"-
     A                                      BLU","parent tab panel":"N7001F_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N7001F_SCR01-
     A                                      _BtnHiddenSystemMessages","value":"-
     A                                      btnMessage","top":"200px","response-
     A                                      ":{"fieldName":"btnMessage","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"N7001F_SCR01_BtnHid-
     A                                      denWorkSubmitJob","value":"btnWrksb-
     A                                      mjob","top":"225px","response":{"fi-
     A                                      eldName":"btnWrkJob","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"constan-
     A                                      t5","field type":"output field","va-
     A                                      lue":"Subscriber number  :","css cl-
     A                                      ass":"constant","left":"295px","cur-
     A                                      sor column":"4","top":"230px","curs-
     A                                      or row":"7","parent tab panel":"N70-
     A                                      01F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCSUB#","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCSUB#","designValue":"[SCSUB-
     A                                      #]","refField":"SUB#","dataType":"r-
     A                                      eference","formatting":"Number","nu-
     A                                      mSep":"false","zeroBalance":"false"-
     A                                      ,"zeroFill":"false","curSym":"","un-
     A                                      its":"","negNum":"999.00","numBlank-
     A                                      Fill":"true"},"left":"442px","curso-
     A                                      r column":"25","top":"230px","curso-
     A                                      r row":"7","width":"36px","text ali-
     A                                      gn":"right","css class 3":"UL","set-
     A                                       focus":{"fieldName":"28","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"MCR0301","error m-
     A                                      essage file":"FSMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"20","dataT')
     A                                  1  6HTML('ype":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"MC40004","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"26","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"descripti-
     A                                      on":"Subscriber Number","parent tab-
     A                                       panel":"N7001F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 4":"pr-
     A                                      ofound-converted"},{"id":"constant6-
     A                                      ","field type":"output field","valu-
     A                                      e":"(Blank for all)","css class":"c-
     A                                      onstant","left":"631px","cursor col-
     A                                      umn":"52","top":"230px","cursor row-
     A                                      ":"7","parent tab panel":"N7001F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"N7001F_SCR0-
     A                                      1_BtnHiddenWorkPrinterOutput","valu-
     A                                      e":"btnWrkprtout","top":"250px","re-
     A                                      sponse":{"fieldName":"btnWrkPrnt","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant7","field type":"outp-
     A                                      ut field","value":"Held/Released (H-
     A                                      /R):","css class":"constant","left"-
     A                                      :"295px","cursor column":"4","top":-
     A                                      "270px","cursor row":"9","parent ta-
     A                                      b panel":"N7001F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCFLAG",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCFLAG","designV-
     A                                      alue":"[SCFLAG]","refField":"FLAG",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"u-
     A                                      ppercase"},"text transform":"upperc-
     A                                      ase","left":"442px","cursor column"-
     A                                      :"25","top":"270px","cursor row":"9-
     A                                      ","width":"8px","css class 3":"UL",-
     A                                      "set focus":{"fieldName":"27","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error message id":"MCR0555","err-
     A                                      or message file":"FSMESG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"21","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"1 message","description":"PR-
     A                                      INT HELD/RELEASED","parent tab pane-
     A                                      l":"N7001F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 4":"profoun-
     A                                      d-converted"},{"id":"constant8","fi-
     A                                      eld type":"output field","value":"(-
     A                                      H=Held, R=Released,","css class":"c-
     A                                      onstant","left":"631px","cursor col-
     A                                      umn":"52","top":"270px","cursor row-
     A                                      ":"9","parent tab panel":"N7001F_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"N7001F_SCR0-
     A                                      1_BtnHiddenImageQueue","value":"btn-
     A                                      ImgQue","top":"275px","response":{"-
     A                                      fieldName":"btnImgQue","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant9","field type":"output field","-
     A                                      value":"Blank for all)","css class"-
     A                                      :"constant","left":"638px","cursor -
     A                                      column":"53","top":"290px","cursor -
     A                                      row":"10","parent tab panel":"N7001-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"N7001F_-
     A                                      SCR01_BtnHiddenHelp","value":"btnHe-
     A                                      lp","top":"300px","response":{"fiel-
     A                                      dName":"btnHelp","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant10"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Date range         :","css class-
     A                                      ":"constant","left":"295px","cursor-
     A                                       column":"4","top":"330px","cursor -
     A                                      row":"12","parent tab panel":"N7001-
     A                                      F_SCR01_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCFRDT","field type":"d-
     A                                      ate field","css class":"input","css-
     A                                       class 2":"date-field","value":{"fi-
     A                                      eldName":"SCFRDT","designValue":"[S-
     A                                      CFRDT]","refField":"DT8","dataType"-
     A                                      :"reference","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"fal-
     A                                      se","zeroFill":"false","curSym":"",-
     A                                      "units":"","negNum":"-999.00","numB-
     A                                      lankFill":"true","edtWrd":"''  /  /-
     A                                          ''","dateFormat":"m/d/Y"},"left-
     A                                      ":"442px","cursor column":"25","top-
     A                                      ":"330px","cursor row":"12","width"-
     A                                      :"71px","text align":"right","css c-
     A                                      lass 3":"UL","error message id":"MC-
     A                                      R0500","error message file":"FSMESG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"22",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"2 messages","erro-
     A                                      r message id 2":"MCR0529","error me-
     A                                      ssage file 2":"FSMESG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"24","')
     A                                  1  7HTML('dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"description":"DATE","parent t-
     A                                      ab panel":"N7001F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t11","field type":"output field","v-
     A                                      alue":"to","css class":"constant","-
     A                                      left":"519px","cursor column":"36",-
     A                                      "top":"330px","cursor row":"12","pa-
     A                                      rent tab panel":"N7001F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CTODT","field type":"date field","c-
     A                                      ss class":"input","css class 2":"da-
     A                                      te-field","value":{"fieldName":"SCT-
     A                                      ODT","designValue":"[SCTODT]","refF-
     A                                      ield":"DT8","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00","numBlankFill":"tr-
     A                                      ue","edtWrd":"''  /  /    ''","date-
     A                                      Format":"m/d/Y"},"left":"562px","cu-
     A                                      rsor column":"39","top":"330px","cu-
     A                                      rsor row":"12","width":"71px","text-
     A                                       align":"right","css class 3":"UL",-
     A                                      "error message id":"MCR0500","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"23","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0529","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"24","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab panel":"N70-
     A                                      01F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant12","field ty-
     A                                      pe":"output field","value":"(Blank -
     A                                      for all)","css class":"constant","l-
     A                                      eft":"631px","cursor column":"52","-
     A                                      top":"330px","cursor row":"12","par-
     A                                      ent tab panel":"N7001F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"co-
     A                                      nstant13","field type":"output fiel-
     A                                      d","value":"Report type (S/D/B):","-
     A                                      css class":"constant","left":"295px-
     A                                      ","cursor column":"4","top":"370px"-
     A                                      ,"cursor row":"14","parent tab pane-
     A                                      l":"N7001F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCRTYP","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCRTYP","designValue":-
     A                                      "[SCRTYP]","refField":"FLAG","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"442px","cursor column":"25",-
     A                                      "top":"370px","cursor row":"14","wi-
     A                                      dth":"8px","css class 3":"UL","css -
     A                                      class 4":"HI","error message id":"M-
     A                                      CR0304","error message file":"FSMES-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"25"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"1 message","desc-
     A                                      ription":"REPORT TYPE","parent tab -
     A                                      panel":"N7001F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 5":"pro-
     A                                      found-converted"},{"id":"constant14-
     A                                      ","field type":"output field","valu-
     A                                      e":"(S=Summary, D=Detail, B=Both)",-
     A                                      "css class":"constant","left":"631p-
     A                                      x","cursor column":"52","top":"370p-
     A                                      x","cursor row":"14","parent tab pa-
     A                                      nel":"N7001F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF03","field type-
     A                                      ":"button","value":"Exit","shortcut-
     A                                       key":"F3","left":"14px","top":"183-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF10","field type":"button","va-
     A                                      lue":"Search","shortcut key":"F10",-
     A                                      "left":"14px","top":"216px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"btnHELP","-
     A                                      field type":"button","shortcut key"-
     A                                      :"Alt-F1","bypass validation":"true-
     A                                      ","value":"HELP","response":{"field-
     A                                      Name":"*IN10","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"left":"14px","top":"2-
     A                                      49px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFLAG    R        H      REFFLD(FLAG)
     A            SCFRDT    R        H      REFFLD(DT8)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCRTYP    R        H      REFFLD(FLAG)
     A            SCSUB#    R        H      REFFLD(SUB#)
     A            SCTODT    R        H      REFFLD(DT8)
