     A                                      REF(*LIBL/FSREFP)
     A*PUI                                  SFLDEFINE(10)
     A          R SCR01
     A  10 11 20
     A  21 22 31
     A  32 09                               CA01(10 'Response Indicator *IN10')
     A                                      SETOF(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                  1  2HTML('QPUIREC4    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCSUB#C7    MCR0503C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCSUB#C7    MCR0301-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     21RERRMSGID  5    C6    SCINV-
     A                                      TC7    MC40326C6    FSMESGC5    *LI-
     A                                      BLC0    E1    3     22')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN31","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN32","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"valid command ke-
     A                                      y":{"fieldName":"*IN11","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"overlay ran-
     A                                      ge":"1-23"},"items":[{"id":"N7127F_-
     A                                      SCR01_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N7127F_SCR01_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N7127F_SCR01_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      N7127F_SCR01_ButtonBar","top":"35px-
     A                                      ","left":"1036px","width":"187px","-
     A                                      height":"28px","css class":"station-
     A                                      ary","visibility":"hidden","locked -
     A                                      in place":"true"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1040px","id":"N7127F_SCR01_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"N7127F_SC-
     A                                      R01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"N7127F_SCR01_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"N7127F_SCR-
     A                                      01_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field')
     A                                  1  4HTML(' type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1144px","id":"-
     A                                      N7127F_SCR01_BtnSystemMessages","to-
     A                                      ol tip":"System Messages","onclick"-
     A                                      :"SystemToolbarMessages","backgroun-
     A                                      d image":{"fieldName":"MsgIcnURL","-
     A                                      dataLength":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1196px","id":"N7127F_S-
     A                                      CR01_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"N7127F_SCR01_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"N7127F_SCR01_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":{"field-
     A                                      Name":"SCPRDS","designValue":"[SCPR-
     A                                      DS]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"acti-
     A                                      ve tab":"0","left":"250px","top":"7-
     A                                      0px","width":"970px","height":"657p-
     A                                      x","z index":"8","locked in place":-
     A                                      "true","css class":"tab-panel","css-
     A                                       class 2":"stationary"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"N7127F_SCR01_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SCUSER","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCUS-
     A                                      ER","designValue":"[SCUSER]","refFi-
     A                                      eld":"USER","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"281px","cursor c-
     A                                      olumn":"2","top":"110px","cursor ro-
     A                                      w":"1","css class 2":"top-line","pa-
     A                                      rent tab panel":"N7127F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      CCONM","field type":"output field",-
     A                                      "value":{"fieldName":"SCCONM","desi-
     A                                      gnValue":"[SCCONM]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"false","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      40"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","css class 3":"H-
     A                                      I","parent tab panel":"N7127F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 4":"profound-converted"},{"-
     A                                      id":"constant1","field type":"outpu-
     A                                      t field","left":"778px","cursor col-
     A                                      umn":"73","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentDate()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "N7127F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"N7127F_SCR01_fkey-
     A                                      Menu","field type":"menu","left":"1-
     A                                      0px","top":"120px","height":"350px"-
     A                                      ,"width":"230px","hover background -
     A                                      color":"#9AAA61","hover text color"-
     A                                      :"#FFFFFF","border color":"#4C6106"-
     A                                      ,"menu option indent":"10px","backg-
     A                                      round color":"#758B27","css class":-
     A                                      "action-menu","css class 2":"statio-
     A                                      nary","z index":"101"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"N7127F_SCR01_BtnHiddenRe-
     A                                      fresh","value":"btnRefresh","top":"-
     A                                      125px","response":{"fieldName":"btn-
     A                                      Refresh","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"Q1PGM","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"Q1PGM","designValue":"[Q1PGM]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none",-
     A                                      "dataLength":"10"},"css class":"out-
     A                                      put-field","left":"281px","cursor c-
     A                                      olumn":"2","top":"130px","cursor ro-
     A                                      w":"2","parent tab panel":"N7127F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCPRDS","field type":"outp-
     A                                      ut field","value":{"fieldN')
     A                                  1  5HTML('ame":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      130px","cursor row":"2","css class -
     A                                      2":"HI","description":"PROGRAM NAME-
     A                                      ","parent tab panel":"N7127F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","vis-
     A                                      ibility":"hidden","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant2-
     A                                      ","field type":"output field","valu-
     A                                      e":"SCR01","css class":"constant","-
     A                                      left":"799px","cursor column":"76",-
     A                                      "top":"130px","cursor row":"2","par-
     A                                      ent tab panel":"N7127F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N7127F_SCR01_BtnHidde-
     A                                      nSearch","value":"btnSearch","top":-
     A                                      "150px","response":{"fieldName":"bt-
     A                                      nSearch","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"N71-
     A                                      27F_SCR01_BtnHiddenDiaryItems","val-
     A                                      ue":"btnDiary","top":"175px","respo-
     A                                      nse":{"fieldName":"btnDiary","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"id":-
     A                                      "constant3","field type":"output fi-
     A                                      eld","value":"Press Enter to submit-
     A                                       billing.","css class":"constant","-
     A                                      left":"281px","cursor column":"2","-
     A                                      top":"190px","cursor row":"5","css -
     A                                      class 2":"BLU","parent tab panel":"-
     A                                      N7127F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"N7-
     A                                      127F_SCR01_BtnHiddenSystemMessages"-
     A                                      ,"value":"btnMessage","top":"200px"-
     A                                      ,"response":{"fieldName":"btnMessag-
     A                                      e","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"N7127F_SC-
     A                                      R01_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"Subscriber number  -
     A                                       :","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"2-
     A                                      30px","cursor row":"7","parent tab -
     A                                      panel":"N7127F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCSUB#","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCSUB#","designVal-
     A                                      ue":"[SCSUB#]","refField":"SUB#","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      ","numBlankFill":"true"},"left":"44-
     A                                      9px","cursor column":"26","top":"23-
     A                                      0px","cursor row":"7","width":"36px-
     A                                      ","text align":"right","css class 3-
     A                                      ":"HI","css class 4":"UL","set focu-
     A                                      s":{"fieldName":"31","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"error -
     A                                      message id":"MCR0503","error messag-
     A                                      e file":"FSMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"20","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"2 -
     A                                      messages","error message id 2":"MCR-
     A                                      0301","error message file 2":"FSMES-
     A                                      G","error message library 2":"*LIBL-
     A                                      ","error condition 2":{"fieldName":-
     A                                      "21","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"description":"Subscriber Numb-
     A                                      er","parent tab panel":"N7127F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 5":"profound-converted"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"N7127F_SCR01_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant5","field type":"output-
     A                                       field","value":"Invoice type (B/N/-
     A                                       ):","css class":"constant","left":-
     A                                      "295px","cursor column":"4","top":"-
     A                                      270px","cursor row":"9","parent tab-
     A                                       panel":"N7127F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCINVT","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCINVT","designVa-
     A                                      lue":"[SCINVT]","dataType"')
     A                                  1  6HTML(':"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      ,"dataLength":"1"},"text transform"-
     A                                      :"uppercase","left":"449px","cursor-
     A                                       column":"26","top":"270px","cursor-
     A                                       row":"9","width":"8px","css class -
     A                                      3":"HI","css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"set focus":{"fieldNa-
     A                                      me":"32","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"error messa-
     A                                      ge id":"MC40326","error message fil-
     A                                      e":"FSMESG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"22","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","parent tab panel":"N7127F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant6","field type":"outp-
     A                                      ut field","value":"B=BRS","css clas-
     A                                      s":"constant","left":"505px","curso-
     A                                      r column":"34","top":"270px","curso-
     A                                      r row":"9","css class 2":"BLU","par-
     A                                      ent tab panel":"N7127F_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"N7127F_SCR01_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant7","fie-
     A                                      ld type":"output field","value":"N=-
     A                                      Network","css class":"constant","le-
     A                                      ft":"505px","cursor column":"34","t-
     A                                      op":"290px","cursor row":"10","css -
     A                                      class 2":"BLU","parent tab panel":"-
     A                                      N7127F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"N7-
     A                                      127F_SCR01_BtnHiddenHelp","value":"-
     A                                      btnHelp","top":"300px","response":{-
     A                                      "fieldName":"btnHelp","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"consta-
     A                                      nt8","field type":"output field","v-
     A                                      alue":"Blank=Both","css class":"con-
     A                                      stant","left":"505px","cursor colum-
     A                                      n":"34","top":"310px","cursor row":-
     A                                      "11","css class 2":"BLU","parent ta-
     A                                      b panel":"N7127F_SCR01_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"btnSubmi-
     A                                      t","field type":"button","value":"E-
     A                                      nter","shortcut key":"Enter","left"-
     A                                      :"14px","top":"150px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF03","field -
     A                                      type":"button","value":"Exit","shor-
     A                                      tcut key":"F3","left":"14px","top":-
     A                                      "183px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF10","field type":"button"-
     A                                      ,"value":"Search","shortcut key":"F-
     A                                      10","left":"14px","top":"216px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnHEL-
     A                                      P","field type":"button","shortcut -
     A                                      key":"Alt-F1","bypass validation":"-
     A                                      true","value":"HELP","response":{"f-
     A                                      ieldName":"*IN10","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"left":"14px","top-
     A                                      ":"249px","width":"100px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","cursor":"default"}]-
     A                                      }')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCCONM        40A  H
     A            SCINVT         1A  H
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSUB#    R        H      REFFLD(SUB#)
     A            SCUSER    R        H      REFFLD(USER)
