     A*%%TS  SD  19920824  092054  KRUTHVEN    REL-V2R1M0  5738-PW1
     A*  (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1997
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FSREFP)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A                                      CF03
     A*%%TS  SD  19920824  092054  KRUTHVEN    REL-V2R1M0  5738-PW1
     A          R SCR01
     A                                      CHGINPDFT
     A                                      SETOF(20)
     A                                      SETOF(21)
     A                                      SETOF(22)
     A                                      SETOF(23)
     A                                      SETOF(24)
     A                                      CF13
     A            SCUSER    R        O  1  2REFFLD(USER)
     A            SCCONM    R        O  1 21REFFLD(NAME)
     A                                      TEXT('COMPANY NAME')
     A                                  1 73DATE
     A                                      EDTWRD('  /  /  ')
     A                                  2  2'N9001F'
     A            SCPRDS    R        O  2 21REFFLD(NAME)
     A                                      TEXT('PROGRAM NAME')
     A                                  2 76'SCR01'
     A                                  8 30'System ID:'
     A            SCSYS     R        B  8 44REFFLD(FLAG)
     A  09                                  DSPATR(HI)
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(PR)
     A  21                                  ERRMSGID(MCR0306 *LIBL/FSMESG)
     A                                      TEXT('System ID')
     A                                 10 30'From Date:'
     A            SCFRDT    R        B 10 44REFFLD(DT8)
     A N09                                  DSPATR(UL)
     A                                      CHECK(RB)
     A  22                                  ERRMSGID(MCR0500 *LIBL/FSMESG)
     A  24                                  ERRMSGID(MCR0529 *LIBL/FSMESG)
     A                                      TEXT('DATE')
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      EDTWRD('  /  /    ')
     A                                 12 32'To Date:'
     A            SCTODT    R        B 12 44REFFLD(DT8)
     A N09                                  DSPATR(UL)
     A                                      CHECK(RB)
     A  23                                  ERRMSGID(MCR0500 *LIBL/FSMESG)
     A  24                                  ERRMSGID(MCR0529 *LIBL/FSMESG)
     A                                      TEXT('DATE')
     A  09                                  DSPATR(HI)
     A  09                                  DSPATR(PR)
     A                                      EDTWRD('  /  /    ')
     A                                 17 28'Press'
     A                                 17 34'<ENTER>'
     A                                      DSPATR(HI)
     A                                 17 42'to Submit Job'
     A                                 23 11'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 49'F13=Chg user parms'
     A                                      COLOR(BLU)
     A                                  6 30'Company #:'
     A            SCCO#     R        B  6 44REFFLD(CO#)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      TEXT('Company #')
     A  09                                  DSPATR(HI)
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(PC)
     A  20                                  ERRMSGID(MCR0507 *LIBL/FSMESG)
     A          R SCR99
     A*            09:53:51    MGELDERT    REL-R08M00  5714-UT1
     A            SCERR     R        I  3  3REFFLD(FLAG)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
