     A                                      REF(*LIBL/FSREFP)
     A          R WDW01S                    SFL
     A  09 25 31
     A  71 73 32
     A  72 33 74  QPUI000001     1A  O  2  2
     A  75 34 35
     A  76        QPUI000002     1A  O  2  2
     A            SC10A3         5A  H
     A            SC10A4         5A  H
     A            HDFEE     R        H      REFFLD(PREF01/A92 *LIBL/FSREFP)
     A            SC10A1    R        H      REFFLD(DS3)
     A            SC10A2    R        H      REFFLD(DS3)
     A            SCDEL     R        H      REFFLD(PREF01/DS10 *LIBL/FSREFP)
     A            SCFEE     R        H      REFFLD(PREF01/A92 *LIBL/FSREFP)
     A            SCSEL     R        H      REFFLD(FLAG)
     A          R QSFLCTL001                SFLCTL(WDW01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLWDW01C')
     A          R WDW01C
     A  11 18 31
     A  32 33 34
     A  35 36 37                            CA01(11 'Response Indicator *IN11')
     A  71 72 73
     A  74 75 76
     A  78 79 80                            CA02(18 'Response Indicator *IN18')
     A  81 82 01
     A  04 05 09
     A  19 77                               CA03(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                      SETOF(74 'Response Indicator *IN74')
     A                                      SETOF(75 'Response Indicator *IN75')
     A                                      SETOF(76 'Response Indicator *IN76')
     A                                      SETOF(78 'Response Indicator *IN78')
     A                                      SETOF(79 'Response Indicator *IN79')
     A                                      SETOF(80 'Response Indicator *IN80')
     A                                      SETOF(81 'Response Indicator *IN81')
     A                                      SETOF(82 'Response Indicator *IN82')
     A                                  1  2HTML('QPUICTL1    WDW01S    5    RS-
     A                                      FLDSP    0    E1    3     01RSFLDSP-
     A                                      CTL 0    E1    3     01RSFLCLR    0-
     A                                          E1    3     04RSFLPAG    1    C-
     A                                      1    7 RSFLSIZ    1    C3    999 0 -
     A                                         14   ROVERLAY   0     RROWS     -
     A                                       2    C1    1C2    20 RSFLMSG    1 -
     A                                         C50   If one is entered, then th-
     A                                      e other must be entered.E1    3    -
     A                                       74RSFLMSGID  4    C7    MCR0355C6 -
     A                                         FSMESGC5    *LIBLC0    E1    3  -
     A                                         71RSFLMSGID  4    C7    MCR0355C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           72RSFLMSGID  4    C7    MCR070-
     A                                      2C6    FSMESGC5    *LIBLC0    E1   -
     A                                       3     73RSFLMSGID  4    C7    MCR0-
     A                                      702C6    FSMESGC5    *LIBLC0    E1 -
     A                                         3     75RSFLMSGID  4    C7    MC-
     A                                      R0556C6    FSMESGC5    *LIBLC0    E-
     A                                      1    3     76RSFLMSGID  4    C7    -
     A                                      CPF5203C7    QCPFMSGC5    *LIBLC0  -
     A                                        E1    6     37 18RSFLMSGID  4    -
     A                                      C7    CPF5203C7    QCPFMSGC5    *LI-
     A                                      BLC0    E1    6     37 19RERRMSGID -
     A                                       5    C6    SCCOM1C7    MCR0355C6  -
     A                                        FSMESGC5    *LIBLC0    E1    3   -
     A                                        77RERRMSGID  5    C6    SCCOM2C7 -
     A                                         MCR0355C6    FSMESGC5    *LIBLC0-
     A                                          E1    3     77FSCPST1    INPUTO-
     A                                      NLY 0     FSCPST2    INPUTONLY 0   -
     A                                        ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"description":"Subfile Control for-
     A                                       N91D7R WDW01","set off":{"fieldNam-
     A                                      e":"*IN31","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"set off 2":{"fieldName":-
     A                                      "*IN32","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 3":{"fieldName":"*I-
     A                                      N33","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 4":{"fieldName":"*IN34-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"set off 5":{"fieldName":"*IN35","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 6":{"fieldName":"*IN36","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 7":{"fieldName":"*IN37","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       8":{"fieldName":"*IN71","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 9"-
     A                                      :{"fieldName":"*IN72","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 10":{-
     A                                      "fieldName":"*IN73","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"set off 11":{"f-
     A                                      ieldName":"*IN74","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"set off 12":{"fie-
     A                                      ldName":"*IN75","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 13":{"field-
     A                                      Name":"*IN76","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"set off 14":{"fieldNa-
     A                                      me":"*IN78","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"set off 15":{"fieldName-
     A                                      ":"*IN79","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 16":{"fieldName":-
     A                                      "*IN80","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"set off 17":{"fieldName":"*-
     A                                      IN81","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 18":{"fieldName":"*IN-
     A                                      82","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"return cursor record":{"fieldNa-
     A                                      me":"HREC","dataLength":"10","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none"},"retu-
     A                                      rn cursor field":{"fieldName":"HFLD-
     A                                      ","dataLength":"10","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"overlay":"tru-
     A                                      e","error message":"If one is enter-
     A                                      ed, then the other must be entered.-
     A                                      ","error condition":{"fieldName":"7-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"8 messages","e-
     A                                      rror message id 2":"MCR0355","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"71","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 3":"MCR0355","error mess-
     A                                      age file 3":"FSMESG","error message-
     A                                       library 3":"*LIBL","error conditio-
     A                                      n 3":{"fieldName":"72","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 4":"MCR0702","error message f-
     A                                      ile 4":"FSMESG","error message libr-
     A                                      ary 4":"*LIBL","error condition 4":-
     A                                      {"fieldName":"73","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       5":"MCR0702","error message file 5-
     A                                      ":"FSMESG","error message library 5-
     A                                      ":"*LIBL","error condition 5":{"fie-
     A                                      ldName":"75","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error message id 6":"-
     A                                      MCR0556","error message file 6":"FS-
     A                                      MESG","error message library 6":"*L-
     A                                      IBL","error condition 6":{"fieldNam-
     A                                      e":"76","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 7":"CPF52-
     A                                      03","error message file 7":"QCPFMSG-
     A                                      ","error message library 7":"*LIBL"-
     A                                      ,"error condition 7":{"fieldName":"-
     A                                      37 and 18","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error message id 8":"CP-
     A                                      F5203","error message file 8":"QCPF-
     A                                      MSG","error message library 8":"*LI-
     A                                      BL","error condition 8":{"fieldName-
     A                                      ":"37 and 19","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"valid command key":{-
     A                                      "fieldName":"*IN11","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"overlay range":-
     A                                      "1-20"},"items":[{"id":"HFLD","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"HFL-
     A                                      D","designValue":"[HFLD]","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"10"},"left":"0px","to')
     A                                  1  4HTML('p":"-30px","css class":"profo-
     A                                      und-converted"},{"id":"HREC","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"HREC-
     A                                      ","designValue":"[HREC]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"left":"0px","top":"-30px"-
     A                                      ,"css class":"profound-converted"},-
     A                                      {"id":"#@$2","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"#@$2","designValue":-
     A                                      "[#@$2]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"3","decPos":"-
     A                                      0"},"left":"0px","top":"-30px","wid-
     A                                      th":"21px","text align":"right","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"SFRRN","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SFRRN","designValue":"[-
     A                                      SFRRN]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","dataLength":"5","decPos":"0-
     A                                      "},"left":"0px","top":"-30px","widt-
     A                                      h":"35px","text align":"right","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"N91DKF_WDW01C_avKeys","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"AV_KEYS","dataLength":"1134","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[AV_KEYS]"},"lef-
     A                                      t":"0px","top":"0px","visibility":"-
     A                                      hidden"},{"id":"N91DKF_WDW01C_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"32px",-
     A                                      "z index":"20","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1170px","id":"N9-
     A                                      1DKF_WDW01C_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon al-
     A                                      ignment":"middle left","icon width"-
     A                                      :"16px","icon height":"24px","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"N91DKF_WDW01C_ButtonBar-
     A                                      ","top":"35px","left":"1036px","wid-
     A                                      th":"187px","height":"28px","css cl-
     A                                      ass":"stationary","visibility":"hid-
     A                                      den","locked in place":"true"},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1040px","id":"N91-
     A                                      DKF_WDW01C_BtnSave","tool tip":"Sav-
     A                                      e","onclick":"SystemToolbarSave","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/save.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1066px","-
     A                                      id":"N91DKF_WDW01C_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"N91DKF_WDW-
     A                                      01C_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"N91DKF_WDW01C_BtnDiaryItems",-
     A                                      "tool tip":"Diary/Work Ite')
     A                                  1  5HTML('ms - IDARTS","onclick":"Syste-
     A                                      mToolbarDiary","background image":{-
     A                                      "fieldName":"DryIcnURL","dataLength-
     A                                      ":"128","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1144px","id":"N91DKF_WDW01C_BtnS-
     A                                      ystemMessages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"}},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1196-
     A                                      px","id":"N91DKF_WDW01C_BtnHelp","t-
     A                                      ool tip":"Help","onclick":"SystemTo-
     A                                      olbarHelp","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/help.png'')"},{"id":"N91DKF_WDW0-
     A                                      1C_ImgSysToolBottom","field type":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/systool/butbarbot.p-
     A                                      ng","left":"1036px","top":"64px","w-
     A                                      idth":"187px","locked in place":"tr-
     A                                      ue","css class":"stationary","visib-
     A                                      ility":"hidden"},{"id":"N91DKF_WDW0-
     A                                      1C_MainTabPanel","field type":"tab -
     A                                      panel","tab panel style":"Transform-
     A                                      ","tab names":{"fieldName":"SCPRDS"-
     A                                      ,"designValue":"[SCPRDS]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"active tab":"0","l-
     A                                      eft":"250px","top":"70px","width":"-
     A                                      970px","height":"657px","z index":"-
     A                                      8","locked in place":"true","css cl-
     A                                      ass":"tab-panel","css class 2":"sta-
     A                                      tionary"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"N9-
     A                                      1DKF_WDW01C_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCUSE-
     A                                      R","field type":"output field","val-
     A                                      ue":{"fieldName":"SCUSER","designVa-
     A                                      lue":"[SCUSER]","refField":"USER","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","parent tab pane-
     A                                      l":"N91DKF_WDW01C_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCCONM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCCONM","designValue":"[S-
     A                                      CCONM]","refField":"NAME","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"41-
     A                                      4px","cursor column":"21","top":"11-
     A                                      0px","cursor row":"1","css class 2"-
     A                                      :"top-line","css class 3":"HI","des-
     A                                      cription":"COMPANY NAME","parent ta-
     A                                      b panel":"N91DKF_WDW01C_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"constan-
     A                                      t1","field type":"output field","le-
     A                                      ft":"778px","cursor column":"73","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass":"top-line","value":"js: curre-
     A                                      ntDate()","css class 2":"output-fie-
     A                                      ld","parent tab panel":"N91DKF_WDW0-
     A                                      1C_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"id":"N91DKF_WDW01C_fkeyMenu","fie-
     A                                      ld type":"menu","left":"10px","top"-
     A                                      :"120px","height":"350px","width":"-
     A                                      230px","hover background color":"#9-
     A                                      AAA61","hover text color":"#FFFFFF"-
     A                                      ,"border color":"#4C6106","menu opt-
     A                                      ion indent":"10px","background colo-
     A                                      r":"#758B27","css class":"action-me-
     A                                      nu","css class 2":"stationary","z i-
     A                                      ndex":"101"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "N91DKF_WDW01C_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant2","field type":"out-
     A                                      put field","value":"N91DGF","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab pa')
     A                                  1  6HTML('nel":"N91DKF_WDW01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCPRD-
     A                                      S","field type":"output field","val-
     A                                      ue":{"fieldName":"SCPRDS","designVa-
     A                                      lue":"[SCPRDS]","refField":"NAME","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"414px","cursor column":"21","-
     A                                      top":"130px","cursor row":"2","css -
     A                                      class 2":"HI","description":"PROGRA-
     A                                      M NAME","parent tab panel":"N91DKF_-
     A                                      WDW01C_MainTabPanel","parent tab":"-
     A                                      0","visibility":"hidden","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant3","field type":"output field-
     A                                      ","value":"WDW01","css class":"cons-
     A                                      tant","visibility":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"799px","curso-
     A                                      r column":"76","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"N91D-
     A                                      KF_WDW01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"constant4","field typ-
     A                                      e":"output field","value":"Type","c-
     A                                      ss class":"constant","left":"281px"-
     A                                      ,"cursor column":"2","top":"150px",-
     A                                      "cursor row":"3","parent tab panel"-
     A                                      :"N91DKF_WDW01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCMODE","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCMODE","designValue":"[SCM-
     A                                      ODE]","refField":"NM10","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"764p-
     A                                      x","cursor column":"71","top":"150p-
     A                                      x","cursor row":"3","css class 2":"-
     A                                      HI","description":"ADD/UPDATE MODE"-
     A                                      ,"parent tab panel":"N91DKF_WDW01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"N91DKF_WDW01C_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"SCTYPE","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCTYPE","designValue":"[-
     A                                      SCTYPE]","refField":"PREF01/CODE *L-
     A                                      IBL/FSREFP","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"288px","cursor c-
     A                                      olumn":"3","top":"170px","cursor ro-
     A                                      w":"4","css class 2":"HI","parent t-
     A                                      ab panel":"N91DKF_WDW01C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt5","field type":"output field","v-
     A                                      alue":"-","css class":"constant","l-
     A                                      eft":"309px","cursor column":"6","t-
     A                                      op":"170px","cursor row":"4","paren-
     A                                      t tab panel":"N91DKF_WDW01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCT-
     A                                      DSC","field type":"output field","v-
     A                                      alue":{"fieldName":"SCTDSC","design-
     A                                      Value":"[SCTDSC]","refField":"PREF0-
     A                                      1/DS70 *LIBL/FSREFP","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"323px",-
     A                                      "cursor column":"8","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "N91DKF_WDW01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      N91DKF_WDW01C_BtnHiddenDiaryItems",-
     A                                      "value":"btnDiary","top":"175px","r-
     A                                      esponse":{"fieldName":"btnDiary","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"constant6","field type":"outpu-
     A                                      t field","value":"Discount Code:","-
     A                                      css class":"constant","left":"281px-
     A                                      ","cursor column":"2","top":"190px"-
     A                                      ,"cursor row":"5","parent tab panel-
     A                                      ":"N91DKF_WDW01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"SCCODE","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCCODE","designValue":"[SC-
     A                                      CODE]","refField":"BRCD","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "false","textTransform":"none"},"cs-
     A                                      s class":"output-field","left":"386-
     A                                      px","cursor column":"17","top":"190-
     A                                      px","cursor row":"5","css class 2":-
     A                                      "HI","parent tab panel":"N91DKF_WDW-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 3":"profound-converted"}-
     A                                      ,{"id":"constant7","field type":"ou-
     A                                      tput field","value":"Effective Date-
     A                                      :","css class":"constant","left":"4-
     A                                      56px","cursor column":"27","top":"1-
     A                                      90px","cursor row":"5","parent tab -
     A                                      panel":"N91DKF_WDW01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCEFDT","-
     A                                      field type":"output field"')
     A                                  1  7HTML(',"value":{"fieldName":"SCEFDT-
     A                                      ","designValue":"[SCEFDT]","refFiel-
     A                                      d":"DT8","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"true","zeroFill":"t-
     A                                      rue","curSym":"","units":"","negNum-
     A                                      ":"-999.00","edtWrd":"''  /  /    '-
     A                                      '"},"css class":"output-field","lef-
     A                                      t":"568px","cursor column":"43","to-
     A                                      p":"190px","cursor row":"5","width"-
     A                                      :"70px","text align":"right","css c-
     A                                      lass 2":"HI","parent tab panel":"N9-
     A                                      1DKF_WDW01C_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant8","field t-
     A                                      ype":"output field","value":"Status-
     A                                      :","css class":"constant","left":"7-
     A                                      15px","cursor column":"64","top":"1-
     A                                      90px","cursor row":"5","parent tab -
     A                                      panel":"N91DKF_WDW01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCSTAT","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCSTAT","designValue"-
     A                                      :"[SCSTAT]","refField":"STAT","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"771px","cursor column":"72","top"-
     A                                      :"190px","cursor row":"5","css clas-
     A                                      s 2":"HI","parent tab panel":"N91DK-
     A                                      F_WDW01C_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"N91DKF-
     A                                      _WDW01C_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant9","field type":"out-
     A                                      put field","value":"Comments:","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"210px","c-
     A                                      ursor row":"6","parent tab panel":"-
     A                                      N91DKF_WDW01C_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCCOM1","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCCOM1","designValue":"[S-
     A                                      CCOM1]","refField":"PREF01/DS60 *LI-
     A                                      BL/FSREFP","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"365px","cur-
     A                                      sor column":"14","top":"210px","cur-
     A                                      sor row":"6","width":"421px","css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"error message id":"MCR-
     A                                      0355","error message file":"FSMESG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"77","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error messages":"1 message","parent-
     A                                       tab panel":"N91DKF_WDW01C_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"N91DKF_WDW01C_BtnHidden-
     A                                      WorkSubmitJob","value":"btnWrksbmjo-
     A                                      b","top":"225px","response":{"field-
     A                                      Name":"btnWrkJob","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"SCCOM2","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCCOM2","designVal-
     A                                      ue":"[SCCOM2]","refField":"PREF01/D-
     A                                      S60 *LIBL/FSREFP","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"365p-
     A                                      x","cursor column":"14","top":"230p-
     A                                      x","cursor row":"7","width":"421px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"error message i-
     A                                      d":"MCR0355","error message file":"-
     A                                      FSMESG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"77","dataType":"expressi')
     A                                  1  8HTML('on","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      N91DKF_WDW01C_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"N-
     A                                      91DKF_WDW01C_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"constant10","field-
     A                                       type":"output field","value":"Posi-
     A                                      tion to . . . From Rev Code:","css -
     A                                      class":"constant","left":"281px","c-
     A                                      ursor column":"2","top":"270px","cu-
     A                                      rsor row":"9","parent tab panel":"N-
     A                                      91DKF_WDW01C_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCPST1","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","input only":-
     A                                      "true","value":{"fieldName":"SCPST1-
     A                                      ","designValue":"[SCPST1]","refFiel-
     A                                      d":"DS3","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"512px","curso-
     A                                      r column":"35","top":"270px","curso-
     A                                      r row":"9","width":"22px","set focu-
     A                                      s":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"parent-
     A                                       tab panel":"N91DKF_WDW01C_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant11","field type":"output field"-
     A                                      ,"value":"From Cpt Code:","css clas-
     A                                      s":"constant","left":"547px","curso-
     A                                      r column":"40","top":"270px","curso-
     A                                      r row":"9","parent tab panel":"N91D-
     A                                      KF_WDW01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCPST2","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","input only":"tr-
     A                                      ue","value":{"fieldName":"SCPST2","-
     A                                      designValue":"[SCPST2]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase","dataL-
     A                                      ength":"5"},"text transform":"upper-
     A                                      case","left":"652px","cursor column-
     A                                      ":"55","top":"270px","cursor row":"-
     A                                      9","width":"36px","parent tab panel-
     A                                      ":"N91DKF_WDW01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"N91DKF_WDW01C_BtnHiddenImageQueue-
     A                                      ","value":"btnImgQue","top":"275px"-
     A                                      ,"response":{"fieldName":"btnImgQue-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant12","field type":"-
     A                                      output field","value":"Type options-
     A                                      , press Enter.","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"290px","cursor row":"10"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"N91DKF_WDW01C_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"N91DKF_WDW01C_BtnHiddenHelp","-
     A                                      value":"btnHelp","top":"300px","res-
     A                                      ponse":{"fieldName":"btnHelp","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"constant13","field type":"output -
     A                                      field","value":"4=Delete","css clas-
     A                                      s":"constant","left":"295px","curso-
     A                                      r column":"4","top":"310px","cursor-
     A                                       row":"11","css class 2":"BLU","par-
     A                                      ent tab panel":"N91DKF_WDW01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant14","field type":"output fie-
     A                                      ld","value":"From       To         -
     A                                      From       To       Madigan","css c-
     A                                      lass":"constant","left":"330px","cu-
     A                                      rsor column":"9","top":"330px","cur-
     A                                      sor row":"12","css class 2":"HI","p-
     A                                      arent tab panel":"N91DKF_WDW01C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted","css cl-
     A                                      ass 4":"subfile-heading"},{"id":"co-
     A                                      nstant15","field type":"output fiel-
     A                                      d","value":"Opt  Rev Code   Rev Cod-
     A                                      e   Cpt Code   Cpt Code   Percent",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"350px-
     A                                      ","cursor row":"13","css class 2":"-
     A                                      HI","parent tab panel":"N91DKF_WDW0-
     A                                      1C_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted","-
     A                                      css class 4":"subfile-heading"},{"i-
     A                                      d":"WDW01S","field type":"grid","nu-
     A                                      mber of columns":"7","record format-
     A                                       name":"WDW01S","display subfile":{-
     A                                      "fieldName":"01","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"display co-
     A                                      ntrol record":{"fieldName":"01","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"clear subfile":{"fieldName":"0-
     A                                      4","dataType":"expression"')
     A                                  1  9HTML(',"formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"subfile s-
     A                                      ize":"999","place cursor":"true","h-
     A                                      eader height":"40","row height":"20-
     A                                      ","css class":"subfilegrid","css cl-
     A                                      ass 2":"profound-converted","parent-
     A                                       tab panel":"N91DKF_WDW01C_MainTabP-
     A                                      anel","parent tab":"0","subfile end-
     A                                      ":{"fieldName":"05","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"page do-
     A                                      wn response":{"fieldName":"*IN18","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      how paging controls":"true","show p-
     A                                      age number":"true","scrollbar":"non-
     A                                      e","number of rows":"8","top":"330p-
     A                                      x","left":"281px","column widths":"-
     A                                      44,77,77,70,70,105,110","cursor rec-
     A                                      ord number":{"fieldName":"SFRRN","d-
     A                                      ataLength":"5","decPos":"0","numSep-
     A                                      ":"false","zeroBalance":"false","ze-
     A                                      roFill":"false","curSym":"","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      units":"","negNum":"-999.00"},"subf-
     A                                      ile record number":{"fieldName":"#@-
     A                                      $2","designValue":"[#@$2]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"3","decPos":"0"}},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF03","fie-
     A                                      ld type":"button","value":"Exit","s-
     A                                      hortcut key":"F3","left":"14px","to-
     A                                      p":"183px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF05","field type":"butt-
     A                                      on","value":"F5","shortcut key":"F5-
     A                                      ","left":"14px","top":"216px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF12"-
     A                                      ,"field type":"button","value":"Can-
     A                                      cel","shortcut key":"F12","left":"1-
     A                                      4px","top":"249px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnHELP","field typ-
     A                                      e":"button","shortcut key":"Alt-F1"-
     A                                      ,"onclick":"pui.showHelp()","value"-
     A                                      :"HELP","left":"14px","top":"282px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"HD-
     A                                      FEE","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"HDFEE","designValue":"[HDFEE-
     A                                      ]","refField":"PREF01/A92 *LIBL/FSR-
     A                                      EFP","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00"},"left":"-65px","top":"-399-
     A                                      px","width":"70px","text align":"ri-
     A                                      ght","css class":"profound-converte-
     A                                      d","grid":"WDW01S","column":"0"},{"-
     A                                      id":"SCSEL","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCSE-
     A                                      L","designValue":"[SCSEL]","refFiel-
     A                                      d":"FLAG","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"7px","cursor-
     A                                       column":"3","top":"1px","cursor ro-
     A                                      w":"14","width":"8px","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"set focus":{"fieldName":"25",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 6":{"fieldName":"-
     A                                      25","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"RI","custo-
     A                                      mFalse":""},"css class 7":"profound-
     A                                      -converted","grid":"WDW01S","column-
     A                                      ":"0"},{"id":"SC10A1","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SC10A1","designValue":"[SC10A-
     A                                      1]","refField":"DS3","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      px","cursor column":"9","top":"1px"-
     A                                      ,"cursor row":"14","width":"22px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expressio')
     A                                  1 10HTML('n","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"31 or 71 or -
     A                                      73","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 6":{"fieldNam-
     A                                      e":"71 or 73","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      RI","customFalse":""},"css class 7"-
     A                                      :"profound-converted","grid":"WDW01-
     A                                      S","column":"1"},{"id":"SC10A2","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SC10A2","designValu-
     A                                      e":"[SC10A2]","refField":"DS3","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"5px","cursor column":"20",-
     A                                      "top":"1px","cursor row":"14","widt-
     A                                      h":"22px","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"32 or 72 or 73",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 6":{"fieldName":"-
     A                                      72 or 73","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"RI",-
     A                                      "customFalse":""},"css class 7":"pr-
     A                                      ofound-converted","grid":"WDW01S","-
     A                                      column":"2"},{"id":"SC10A3","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SC10A3","designValue":"-
     A                                      [SC10A3]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase","dataLength":"5"},"t-
     A                                      ext transform":"uppercase","left":"-
     A                                      5px","cursor column":"31","top":"1p-
     A                                      x","cursor row":"14","width":"36px"-
     A                                      ,"css class 3":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"css class 4":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"UL","custo-
     A                                      mFalse":""},"set focus":{"fieldName-
     A                                      ":"33 or 74 or 75","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 5":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"c-
     A                                      ss class 6":{"fieldName":"74 or 75"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"RI","customFa-
     A                                      lse":""},"css class 7":"profound-co-
     A                                      nverted","grid":"WDW01S","column":"-
     A                                      3"},{"id":"SC10A4","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SC10A4","designValue":"[SC10A4]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case","dataLength":"5"},"text trans-
     A                                      form":"uppercase","left":"5px","cur-
     A                                      sor column":"41","top":"1px","curso-
     A                                      r row":"14","width":"36px","css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"HI","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"set focus":{"fieldName":"34 or -
     A                                      74 or 75","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"css class -
     A                                      6":{"fieldName":"74 or 75","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"RI","customFalse":""},-
     A                                      "css class 7":"profound-converted",-
     A                                      "grid":"WDW01S","column":"4"},{"id"-
     A                                      :"SCFEE","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCFEE",-
     A                                      "designValue":"[SCFEE]","refField":-
     A                                      "PREF01/A92 *LIBL/FSREFP","dataType-
     A                                      ":"reference","formatting"')
     A                                  1 11HTML(':"Number","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","units":"","negNum"-
     A                                      :"999.00","numBlankFill":"true"},"l-
     A                                      eft":"5px","cursor column":"51","to-
     A                                      p":"1px","cursor row":"14","width":-
     A                                      "71px","text align":"right","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"set focus":{"fieldName"-
     A                                      :"35 or 76","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 6":{"-
     A                                      fieldName":"76","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"RI","customFalse":""},"css class -
     A                                      7":"profound-converted","grid":"WDW-
     A                                      01S","column":"5"},{"id":"SCDEL","f-
     A                                      ield type":"output field","value":{-
     A                                      "fieldName":"SCDEL","designValue":"-
     A                                      [SCDEL]","refField":"PREF01/DS10 *L-
     A                                      IBL/FSREFP","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"5px","cursor col-
     A                                      umn":"66","top":"1px","cursor row":-
     A                                      "14","css class 2":"profound-conver-
     A                                      ted","grid":"WDW01S","column":"6"}]-
     A                                      }')
     A            #@$2           3S 0H
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCPST2         5A  H
     A            SFRRN          5S 0H
     A            SCCODE    R        H      REFFLD(BRCD)
     A            SCCOM1    R        H      REFFLD(PREF01/DS60 *LIBL/FSREFP)
     A            SCCOM2    R        H      REFFLD(PREF01/DS60 *LIBL/FSREFP)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCEFDT    R        H      REFFLD(DT8)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPST1    R        H      REFFLD(DS3)
     A            SCSTAT    R        H      REFFLD(STAT)
     A            SCTDSC    R        H      REFFLD(PREF01/DS70 *LIBL/FSREFP)
     A            SCTYPE    R        H      REFFLD(PREF01/CODE *LIBL/FSREFP)
     A            SCUSER    R        H      REFFLD(USER)
     A          R WDW01
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"WDW01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"23-23"},"items":[{"id":"N91DKF_-
     A                                      WDW01_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"N91DKF_WDW01_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"N91DKF_WDW01_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      N91DKF_WDW01_ButtonBar","top":"35px-
     A                                      ","left":"1036px","width":"187px","-
     A                                      height":"28px","css class":"station-
     A                                      ary","visibility":"hidden","locked -
     A                                      in place":"true"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1040px","id":"N91DKF_WDW01_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"N91DKF_WD-
     A                                      W01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"N91DKF_WDW01_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"N91DKF_WDW-
     A                                      01_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1144px","id":"N91DKF_WDW01_Bt-
     A                                      nSystemMessages","tool tip":"System-
     A                                       Messages","onclick":"SystemToolbar-
     A                                      Messages","background image":{"fiel-
     A                                      dName":"MsgIcnURL","dataLe')
     A                                  1  4HTML('ngth":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1196px","id":"N91DKF_W-
     A                                      DW01_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"N91DKF_WDW01_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"N91DKF_WDW01_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":"Tab 1"-
     A                                      ,"active tab":"0","left":"250px","t-
     A                                      op":"70px","width":"970px","height"-
     A                                      :"657px","z index":"8","locked in p-
     A                                      lace":"true","css class":"tab-panel-
     A                                      ","css class 2":"stationary"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"N91DKF_WDW01_BtnH-
     A                                      iddenSave","value":"btnSave","top":-
     A                                      "100px","response":{"fieldName":"bt-
     A                                      nSave","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"N91DKF_WDW01_fkeyMenu-
     A                                      ","field type":"menu","left":"10px"-
     A                                      ,"top":"120px","height":"350px","wi-
     A                                      dth":"230px","hover background colo-
     A                                      r":"#9AAA61","hover text color":"#F-
     A                                      FFFFF","border color":"#4C6106","me-
     A                                      nu option indent":"10px","backgroun-
     A                                      d color":"#758B27","css class":"act-
     A                                      ion-menu","css class 2":"stationary-
     A                                      ","z index":"101"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"N91DKF_WDW01_BtnHiddenRefres-
     A                                      h","value":"btnRefresh","top":"125p-
     A                                      x","response":{"fieldName":"btnRefr-
     A                                      esh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"N91DKF_-
     A                                      WDW01_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"N91DKF_WDW01_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"N91D-
     A                                      KF_WDW01_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"N91DKF_WDW0-
     A                                      1_BtnHiddenWorkSubmitJob","value":"-
     A                                      btnWrksbmjob","top":"225px","respon-
     A                                      se":{"fieldName":"btnWrkJob","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"N91DKF_WDW01_BtnHi-
     A                                      ddenWorkPrinterOutput","value":"btn-
     A                                      Wrkprtout","top":"250px","response"-
     A                                      :{"fieldName":"btnWrkPrnt","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"N91DKF_WDW01_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"N91DKF_WDW01_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting"')
     A                                  1  5HTML(':"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF03","field type":"button"-
     A                                      ,"value":"Exit","shortcut key":"F3"-
     A                                      ,"left":"14px","top":"183px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnHELP",-
     A                                      "field type":"button","shortcut key-
     A                                      ":"Alt-F1","onclick":"pui.showHelp(-
     A                                      )","value":"HELP","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR99
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      1    1C1    1 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"1-1"},"items"-
     A                                      :[{"id":"N91DKF_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"N91DKF_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"N91DKF_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"N91DKF_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      N91DKF_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"N91DKF_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"N91DKF_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"N91DKF_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "N91DKF_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"N91DKF_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"N91DKF_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"N91DKF_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"N-
     A                                      91DKF_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCFL0-
     A                                      1","field type":"output field","val-
     A                                      ue":{"fieldName":"SCFL01","designVa-
     A                                      lue":"[SCFL01]","refField":"FLAG","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"281px","cursor column":"2","t-
     A                                      op":"110px","cursor row":"1","css c-
     A                                      lass 2":"top-line","visibility":"hi-
     A                                      dden","description":"DUMMY FIELD","-
     A                                      parent tab panel":"N91DKF_SCR99_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"id":-
     A                                      "N91DKF_SCR99_fkeyMenu","field type-
     A                                      ":"menu","left":"10px","top":"120px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"N91DKF-
     A                                      _SCR99_BtnHiddenRefresh","value":"b-
     A                                      tnRefresh","top":"125px","response"-
     A                                      :{"fieldName":"btnRefresh","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"N91DKF_SCR99_BtnHidd-
     A                                      enSearch","value":"btnSearch","top"-
     A                                      :"150px","response":{"fieldName":"b-
     A                                      tnSearch","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"N9-
     A                                      1DKF_SCR99_BtnHiddenDiaryItems","va-
     A                                      lue":"btnDiary","top":"175px","resp-
     A                                      onse":{"fieldName":"btnDiary","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"N91DKF_SCR99_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"N91DKF_SCR99_BtnHiddenWo-
     A                                      rkSubmitJob","value":"btnWrksbmjob"-
     A                                      ,"top":"225px","response":{"fieldNa-
     A                                      me":"btnWrkJob","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"N91DKF_SCR99_BtnHiddenWorkPrint-
     A                                      erOutput","value":"btnWrkprtout","t-
     A                                      op":"250px","response":{"fieldName"-
     A                                      :"btnWrkPrnt","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hid')
     A                                  1  5HTML('den","id":"N91DKF_SCR99_BtnHi-
     A                                      ddenImageQueue","value":"btnImgQue"-
     A                                      ,"top":"275px","response":{"fieldNa-
     A                                      me":"btnImgQue","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"N91DKF_SCR99_BtnHiddenHelp","va-
     A                                      lue":"btnHelp","top":"300px","respo-
     A                                      nse":{"fieldName":"btnHelp","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      btnSubmit","field type":"button","v-
     A                                      alue":"Enter","shortcut key":"Enter-
     A                                      ","left":"14px","top":"150px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF03"-
     A                                      ,"field type":"button","value":"Exi-
     A                                      t","shortcut key":"F3","left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnHELP","field type":-
     A                                      "button","shortcut key":"Alt-F1","o-
     A                                      nclick":"pui.showHelp()","value":"H-
     A                                      ELP","left":"14px","top":"216px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFL01    R        H      REFFLD(FLAG)
