     A                                      REF(*LIBL/FSREFP)
     A          R SCR01
     A  11 20 21
     A  22 23 24
     A  25 26 27                            CA01(11 'Response Indicator *IN11')
     A  28 30 31
     A  32 33 34
     A  35 36 37                            CA02(20 'Response Indicator *IN20')
     A  60 90 29                            CA03(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                      SETOF(34 'Response Indicator *IN34')
     A                                      SETOF(35 'Response Indicator *IN35')
     A                                      SETOF(36 'Response Indicator *IN36')
     A                                      SETOF(37 'Response Indicator *IN37')
     A                                      SETOF(60 'Response Indicator *IN60')
     A                                      SETOF(90 'Response Indicator *IN90')
     A                                  1  2HTML('QPUIREC16   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCSUB#C7    MCR0301C6    FSMESGC5-
     A                                          *LIBLC0    E1    3     21RERRMS-
     A                                      GID  5    C6    SCSUB#C7    MCR0502-
     A                                      C6    FSMESGC5    *LIBLC0    E1    -
     A                                      3     26RERRMSGID  5    C5    SCFND-
     A                                      C7    MCR0508C6    FSMESGC5    *LIB-
     A                                      LC0    E1    3     23RERRMSGID  5  -
     A                                        C5    SCFNDC7    MCR0502C6    FSM-
     A                                      ESGC5    *LIBLC0    E1    3     27R-
     A                                      ERRMSGID  5    C5    SCSYSC7    MCR-
     A                                      0503C6    FSMESGC5    *LIBLC0    E1-
     A                                          3     29RERRMSGID  5    C5    S-
     A                                      CSYSC7    MCR0424C6    FSMESGC5    -
     A                                      *LIBLC0    E1    3     31RERRMSGID -
     A                                       5    C5    SCSYSC7    MCR0331C6   -
     A                                       FSMESGC5    *LIBLC0    E1    3    -
     A                                       32RERRMSGID  5    C6    SCFEINC7  -
     A                                        MCR0546C6    FSMESGC5    *LIBLC0 -
     A                                         E1    3     25RERRMSGID  5    C6-
     A                                          SCFEINC7    MCR0502C6    FSMESG-
     A                                      C5    *LIBLC0    E1    3     28RERR-
     A                                      MSGID  5    C6    SCFEINC7    MCR03-
     A                                      33C6    FSMESGC5    *LIBLC0    E1  -
     A                                        3     33RERRMSGID  5    C5    SCM-
     A                                      ODC7    MCR0546C6    FSMESGC5    *L-
     A                                      IBLC0    E1    3     25RERRMSGID  5-
     A                                          C5    SCMODC7    MCR0502C6    F-
     A                                      SMESGC5    *LIBLC0    E1    3     2-
     A                                      8RERRMSGID  5    C5    SCMODC7    M-
     A                                      CR0333C6    FSMESGC5    *LIBLC0    -
     A                                      E1    3     33RERRMSGID  5    C6   -
     A                                       SCNWCDC7    MCR0444C6    FSMESGC5 -
     A                                         *LIBLC0    E1    3     36RERRMSG-
     A                                      ID  5    C6    SCNWCDC7    MCR0443C-
     A                                      6    FSMESGC5    *LIBLC0    E1    3-
     A                                           35')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N30","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      1","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN32"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN33","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN34","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN35","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN36","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN37","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN60","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"set off 19"-
     A                                      :{"fieldName":"*IN90","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"return cursor-
     A                                       record":{"fieldName":"HREC","dataL-
     A                                      ength":"10","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none"},"return cursor field":-
     A                                      {"fieldName":"HFLD","dataLength":"1-
     A                                      0","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e"},"valid command ke')
     A                                  1  2HTML('y":{"fieldName":"*IN11","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"overl-
     A                                      ay range":"1-23"},"items":[{"id":"H-
     A                                      REC","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"HREC","designValue":"[HREC]"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"none"-
     A                                      ,"dataLength":"10"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"HFLD","field type-
     A                                      ":"output field","visibility":"hidd-
     A                                      en","value":{"fieldName":"HFLD","de-
     A                                      signValue":"[HFLD]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"N9909F_SCR01_avKeys","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"AV_KEYS","dataLength":"1134","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[AV_KEYS]"},"left-
     A                                      ":"0px","top":"0px","visibility":"h-
     A                                      idden"},{"id":"N9909F_SCR01_action"-
     A                                      ,"field type":"html container","whi-
     A                                      te space":"normal","left":"0px","to-
     A                                      p":"10px","width":"230px","css clas-
     A                                      s":"action-panel-converted","height-
     A                                      ":"700px","html":"<div class=\"top\-
     A                                      "></div><div class=\"imagetop\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_top.png\" /></div><div class=\-
     A                                      "menulinks\"></div><div class=\"ima-
     A                                      gebottom\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_bottom.png\" /><-
     A                                      /div><div class=\"bottom\"></div>"}-
     A                                      ,{"field type":"icon menu button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"32px","z-
     A                                       index":"20","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1170px","id":"N990-
     A                                      9F_SCR01_BtnIconMenuSystemTools","t-
     A                                      ool tip":"System Tools","icon sourc-
     A                                      e":"/profoundui/userdata/images/sys-
     A                                      tool/systools.png","data function":-
     A                                      "SystemToolbarSystools","show down -
     A                                      arrow":"Yes"},{"field type":"panel"-
     A                                      ,"panel style":"TransformButtonBar"-
     A                                      ,"id":"N9909F_SCR01_ButtonBar","top-
     A                                      ":"35px","left":"1036px","width":"1-
     A                                      87px","height":"28px","css class":"-
     A                                      stationary","visibility":"hidden","-
     A                                      locked in place":"true"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1040px","id":"N9909F_SC-
     A                                      R01_BtnSave","tool ti')
     A                                  1  2HTML('p":"Save","onclick":"SystemTo-
     A                                      olbarSave","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/save.png'')"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1066px","id":"N9909F_SCR01_BtnR-
     A                                      efresh","tool tip":"Refresh","oncli-
     A                                      ck":"SystemToolbarRefresh","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/refresh.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1092px","id"-
     A                                      :"N9909F_SCR01_BtnSearch","tool tip-
     A                                      ":"Search","onclick":"SystemToolbar-
     A                                      Search","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      search.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1118px","id":"N9909F_SCR01_BtnDi-
     A                                      aryItems","tool tip":"Diary/Work It-
     A                                      ems - IDARTS","onclick":"SystemTool-
     A                                      barDiary","background image":{"fiel-
     A                                      dName":"DryIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      44px","id":"N9909F_SCR01_BtnSystemM-
     A                                      essages","tool tip":"System Message-
     A                                      s","onclick":"SystemToolbarMessages-
     A                                      ","background image":{"fieldName":"-
     A                                      MsgIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","widt')
     A                                  1  2HTML('h":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1196px","id":"N9909F_SCR0-
     A                                      1_BtnHelp","tool tip":"Help","oncli-
     A                                      ck":"SystemToolbarHelp","background-
     A                                       image":"url(''/profoundui/userdata-
     A                                      /images/systool/help.png'')"},{"id"-
     A                                      :"N9909F_SCR01_ImgSysToolBottom","f-
     A                                      ield type":"image","image source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /butbarbot.png","left":"1036px","to-
     A                                      p":"64px","width":"187px","locked i-
     A                                      n place":"true","css class":"statio-
     A                                      nary","visibility":"hidden"},{"id":-
     A                                      "N9909F_SCR01_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"N9909F_SCR01_BtnHiddenSave-
     A                                      ","value":"btnSave","top":"100px","-
     A                                      response":{"fieldName":"btnSave","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"SCUSER","field type":"output f-
     A                                      ield","value":{"fieldName":"SCUSER"-
     A                                      ,"designValue":"[SCUSER]","refField-
     A                                      ":"USER","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"css class":"output-
     A                                      -field","left":"281px","cursor colu-
     A                                      mn":"2","top":"110px","cursor row":-
     A                                      "1","css class 2":"top-line","paren-
     A                                      t tab panel":"N9909F_SCR01_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"id":"SCCO-
     A                                      NM","field type":"output field","va-
     A                                      lue":{"fieldName":"SCCONM","designV-
     A                                      alue":"[SCCONM]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"414px","cursor column":"21",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class 2":"top-line","css class 3":-
     A                                      "HI","description":"COMPANY NAME","-
     A                                      parent tab panel":"N9909F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"id":-
     A                                      "constant1","field type":"output fi-
     A                                      eld","left":"778px","cursor column"-
     A                                      :"73","top":"110px","')
     A                                  1  2HTML('cursor row":"1","css class":"-
     A                                      top-line","value":"js: currentDate(-
     A                                      )","css class 2":"output-field","pa-
     A                                      rent tab panel":"N9909F_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"N-
     A                                      9909F_SCR01_fkeyMenu","field type":-
     A                                      "menu","left":"10px","top":"120px",-
     A                                      "height":"350px","width":"230px","h-
     A                                      over background color":"#9AAA61","h-
     A                                      over text color":"#FFFFFF","border -
     A                                      color":"#4C6106","menu option inden-
     A                                      t":"10px","background color":"#758B-
     A                                      27","css class":"action-menu","css -
     A                                      class 2":"stationary","z index":"10-
     A                                      1"},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"N9909F_S-
     A                                      CR01_BtnHiddenRefresh","value":"btn-
     A                                      Refresh","top":"125px","response":{-
     A                                      "fieldName":"btnRefresh","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant2","field type":"output field"-
     A                                      ,"value":"N9909R","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"N9909F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCPRDS","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCPRDS",-
     A                                      "designValue":"[SCPRDS]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"130px","cursor row":-
     A                                      "2","css class 2":"HI","description-
     A                                      ":"PROGRAM NAME","parent tab panel"-
     A                                      :"N9909F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","visibility":"hidden","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"constant3","field type":"outp-
     A                                      ut field","value":"SCR01","css clas-
     A                                      s":"constant","left":"799px","curso-
     A                                      r column":"76","top":"130px","curso-
     A                                      r row":"2","parent tab panel":"N990-
     A                                      9F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"N9909F-
     A                                      _SCR01_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"N9909F_SCR01_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator"')
     A                                  1  2HTML(',"indFormat":"1 / 0"}},{"id":-
     A                                      "constant10","field type":"output f-
     A                                      ield","value":"Type choices, press -
     A                                      Enter.","css class":"constant","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"190px","cursor row":"5","css cla-
     A                                      ss 2":"BLU","parent tab panel":"N99-
     A                                      09F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"N9909-
     A                                      F_SCR01_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"N9909F_SCR01-
     A                                      _BtnHiddenWorkSubmitJob","value":"b-
     A                                      tnWrksbmjob","top":"225px","respons-
     A                                      e":{"fieldName":"btnWrkJob","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant4","field type":"output fie-
     A                                      ld","value":"Subscriber       :","c-
     A                                      ss class":"constant","left":"295px"-
     A                                      ,"cursor column":"4","top":"230px",-
     A                                      "cursor row":"7","parent tab panel"-
     A                                      :"N9909F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCSUB#","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCSUB#","designValue":"[-
     A                                      SCSUB#]","refField":"PREF01/SUB# *L-
     A                                      IBL/FSREFP","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00","numBlankFill":"tru-
     A                                      e"},"left":"428px","cursor column":-
     A                                      "23","top":"230px","cursor row":"7"-
     A                                      ,"width":"36px","text align":"right-
     A                                      ","css class 3":"UL","set focus":{"-
     A                                      fieldName":"20","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":"HI","error message id":"MCR0301"-
     A                                      ,"error message file":"FSMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"21","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"2 messages","error mess-
     A                                      age id 2":"MCR0502","error message -
     A                                      file 2":"FSMESG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"26","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"N9909F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 5":"profoun-
     A                                      d-converted"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"butt')
     A                                  1  2HTML('on","cursor":"default","visib-
     A                                      ility":"hidden","id":"N9909F_SCR01_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant5","field type":"output-
     A                                       field","value":"Group            :-
     A                                      ","css class":"constant","left":"29-
     A                                      5px","cursor column":"4","top":"270-
     A                                      px","cursor row":"9","parent tab pa-
     A                                      nel":"N9909F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCFND","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCFND","designValue":-
     A                                      "[SCFND]","refField":"FND *LIBL/FSR-
     A                                      EFP","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00","numBlankFill":"true"},"le-
     A                                      ft":"428px","cursor column":"23","t-
     A                                      op":"270px","cursor row":"9","width-
     A                                      ":"300px","text align":"left","css -
     A                                      class 3":"UL","set focus":{"fieldNa-
     A                                      me":"22","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 4":"HI",-
     A                                      "error message id":"MCR0508","error-
     A                                       message file":"FSMESG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"23","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0502","error message file 2"-
     A                                      :"FSMESG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"27","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"description":"Fund","p-
     A                                      arent tab panel":"N9909F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 5":"profound-converted","allow b-
     A                                      lanks":"true","contains match":"tru-
     A                                      e","choices database file":"FMFNP",-
     A                                      "choice options field":"FNFND|| ''--
     A                                      '' ||TRIM(FNNAME)","choice values f-
     A                                      ield":"FNFND","choices selection cr-
     A                                      iteria":"FNSTAT <> ''I''"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"N9909F_SCR01_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"N9909F_SCR01_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 /')
     A                                  1  2HTML(' 0"}},{"id":"constant6","fiel-
     A                                      d type":"output field","value":"Sys-
     A                                      tem type      :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"310px","cursor row":"11-
     A                                      ","parent tab panel":"N9909F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCSYS","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCSYS-
     A                                      ","designValue":"[SCSYS]","refField-
     A                                      ":"PREF01/FLAG *LIBL/FSREFP","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      left":"428px","cursor column":"23",-
     A                                      "top":"310px","cursor row":"11","wi-
     A                                      dth":"8px","set focus":{"fieldName"-
     A                                      :"30","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 3":"HI","er-
     A                                      ror message id":"MCR0503","error me-
     A                                      ssage file":"FSMESG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"29","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"3 messages","error message id 2":-
     A                                      "MCR0424","error message file 2":"F-
     A                                      SMESG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"31","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error message id 3":"MCR0-
     A                                      331","error message file 3":"FSMESG-
     A                                      ","error message library 3":"*LIBL"-
     A                                      ,"error condition 3":{"fieldName":"-
     A                                      32","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"parent tab panel":"N9909F_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 4":"profound-converted"},{-
     A                                      "id":"constant7","field type":"outp-
     A                                      ut field","value":"Provider        -
     A                                       :","css class":"constant","left":"-
     A                                      295px","cursor column":"4","top":"3-
     A                                      50px","cursor row":"13","parent tab-
     A                                       panel":"N9909F_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCFEIN","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCFEIN","designVa-
     A                                      lue":"[SCFEIN]","refField":"PREF01/-
     A                                      FEIN *LIBL/FSREFP","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"999.00","numBlankFil-
     A                                      l":"true"},"left":"428px","cursor c-
     A                                      olumn":"23","top":"350px","cursor r-
     A                                      ow":"13","width":"64px","text align-
     A                                      ":"right","set focus":{"fieldName":-
     A                                      "24","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 3":"HI","err-
     A                                      or message id":"MCR0546","error mes-
     A                                      sage file":"FSMESG","error message -
     A                                      library":"*LIBL","error condition":-
     A                                      {"fieldName":"25","da')
     A                                  1  2HTML('taType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"3 messages","e-
     A                                      rror message id 2":"MCR0502","error-
     A                                       message file 2":"FSMESG","error me-
     A                                      ssage library 2":"*LIBL","error con-
     A                                      dition 2":{"fieldName":"28","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 3":"MCR0333","error mess-
     A                                      age file 3":"FSMESG","error message-
     A                                       library 3":"*LIBL","error conditio-
     A                                      n 3":{"fieldName":"33","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"N9909F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 4":"pro-
     A                                      found-converted"},{"id":"constant8"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Provider modifier:","css class":-
     A                                      "constant","left":"295px","cursor c-
     A                                      olumn":"4","top":"390px","cursor ro-
     A                                      w":"15","parent tab panel":"N9909F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCMOD","field type":"text-
     A                                      box","css class":"input","css class-
     A                                       2":"textbox","value":{"fieldName":-
     A                                      "SCMOD","designValue":"[SCMOD]","re-
     A                                      fField":"PREF01/MOD *LIBL/FSREFP","-
     A                                      dataType":"reference","formatting":-
     A                                      "Number","numSep":"false","zeroBala-
     A                                      nce":"false","zeroFill":"false","cu-
     A                                      rSym":"","units":"","negNum":"999.0-
     A                                      0","numBlankFill":"true"},"left":"4-
     A                                      28px","cursor column":"23","top":"3-
     A                                      90px","cursor row":"15","width":"22-
     A                                      px","text align":"right","set focus-
     A                                      ":{"fieldName":"37","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 3":"HI","error message id":"MCR0-
     A                                      546","error message file":"FSMESG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"25","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"3 messages","error -
     A                                      message id 2":"MCR0502","error mess-
     A                                      age file 2":"FSMESG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"28","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ge id 3":"MCR0333","error message f-
     A                                      ile 3":"FSMESG","error message libr-
     A                                      ary 3":"*LIBL","error condition 3":-
     A                                      {"fieldName":"33","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"parent tab panel-
     A                                      ":"N9909F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 4":"profound-
     A                                      -converted"},{"id":"constant9","fie-
     A                                      ld type":"output field","value":"Ne-
     A                                      twork code     :","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"430px","cursor row":"1-
     A                                      7","parent tab panel":"N9909F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCNWCD","field type":"textbox"-
     A                                      ,"css class":"input",')
     A                                  1  2HTML('"css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCNWCD","designVal-
     A                                      ue":"[SCNWCD]","refField":"PREF01/N-
     A                                      WCD *LIBL/FSREFP","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"428p-
     A                                      x","cursor column":"23","top":"430p-
     A                                      x","cursor row":"17","width":"36px"-
     A                                      ,"set focus":{"fieldName":"34","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 3":"HI","error messag-
     A                                      e id":"MCR0444","error message file-
     A                                      ":"FSMESG","error message library":-
     A                                      "*LIBL","error condition":{"fieldNa-
     A                                      me":"36","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error messages":"2 messag-
     A                                      es","error message id 2":"MCR0443",-
     A                                      "error message file 2":"FSMESG","er-
     A                                      ror message library 2":"*LIBL","err-
     A                                      or condition 2":{"fieldName":"35","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"N9909F_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"id":-
     A                                      "btnSubmit","field type":"button","-
     A                                      value":"Enter","shortcut key":"Ente-
     A                                      r","left":"14px","top":"150px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF03-
     A                                      ","field type":"button","value":"Ex-
     A                                      it","shortcut key":"F3","left":"14p-
     A                                      x","top":"183px","width":"100px","h-
     A                                      eight":"23px","css class":"button",-
     A                                      "auto arrange":"true","cursor":"def-
     A                                      ault"},{"id":"btnCF10","field type"-
     A                                      :"button","value":"Search","shortcu-
     A                                      t key":"F10","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnHELP","field type":"button","-
     A                                      shortcut key":"Alt-F1","onclick":"p-
     A                                      ui.showHelp()","value":"HELP","left-
     A                                      ":"14px","top":"249px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCFEIN    R        H      REFFLD(PREF01/FEIN *LIBL/FSREFP)
     A            SCFND     R        H      REFFLD(FND *LIBL/FSREFP)
     A            SCMOD     R        H      REFFLD(PREF01/MOD *LIBL/FSREFP)
     A            SCNWCD    R        H      REFFLD(PREF01/NWCD *LIBL/FSREFP)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSUB#    R        H      REFFLD(PREF01/SUB# *LIBL/FSREFP)
     A            SCSYS     R        H      REFFLD(PREF01/FLAG *LIBL/FSREFP)
     A            SCUSER    R        H      REFFLD(USER)
     A          R SCR99
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"N9909F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"N9909F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"N9909F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n source":"/profoundui/userdata/ima-
     A                                      ges/systool/systools.png","data fun-
     A                                      ction":"SystemToolbarSystools","sho-
     A                                      w down arrow":"Yes"},{"field type":-
     A                                      "panel","panel style":"TransformBut-
     A                                      tonBar","id":"N9909F_SCR99_ButtonBa-
     A                                      r","top":"35px","left":"1036px","wi-
     A                                      dth":"187px","height":"28px","css c-
     A                                      lass":"stationary","visibility":"hi-
     A                                      dden","locked in place":"true"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1040px","id":"N9-
     A                                      909F_SCR99_BtnSave","tool tip":"Sav-
     A                                      e","onclick":"SystemToolbarSave","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/save.png''-
     A                                      )"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none"')
     A                                  1  2HTML(',"cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1066px","id":"N9909F_SCR-
     A                                      99_BtnRefresh","tool tip":"Refresh"-
     A                                      ,"onclick":"SystemToolbarRefresh","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/refresh.p-
     A                                      ng'')"},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1092p-
     A                                      x","id":"N9909F_SCR99_BtnSearch","t-
     A                                      ool tip":"Search","onclick":"System-
     A                                      ToolbarSearch","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/search.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1118px","id":"N9909F_SCR9-
     A                                      9_BtnDiaryItems","tool tip":"Diary/-
     A                                      Work Items - IDARTS","onclick":"Sys-
     A                                      temToolbarDiary","background image"-
     A                                      :{"fieldName":"DryIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"}},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1144px","id":"N9909F_SCR99_Btn-
     A                                      SystemMessages","tool tip":"System -
     A                                      Messages","onclick":"SystemToolbarM-
     A                                      essages","background image":{"field-
     A                                      Name":"MsgIcnURL","dataLength":"128-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"}},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"119-
     A                                      6px","id":"N9909F_SCR99_BtnHelp","t-
     A                                      ool tip":"Help","onclick":"SystemTo-
     A                                      olbarHelp","backgroun')
     A                                  1  2HTML('d image":"url(''/profoundui/u-
     A                                      serdata/images/systool/help.png'')"-
     A                                      },{"id":"N9909F_SCR99_ImgSysToolBot-
     A                                      tom","field type":"image","image so-
     A                                      urce":"/profoundui/userdata/images/-
     A                                      systool/butbarbot.png","left":"1036-
     A                                      px","top":"64px","width":"187px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "stationary","visibility":"hidden"}-
     A                                      ,{"id":"N9909F_SCR99_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":"Ta-
     A                                      b 1","active tab":"0","left":"250px-
     A                                      ","top":"70px","width":"970px","hei-
     A                                      ght":"657px","z index":"8","locked -
     A                                      in place":"true","css class":"tab-p-
     A                                      anel","css class 2":"stationary"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"N9909F_SCR99_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"N9909F_SCR99_fkey-
     A                                      Menu","field type":"menu","left":"1-
     A                                      0px","top":"120px","height":"350px"-
     A                                      ,"width":"230px","hover background -
     A                                      color":"#9AAA61","hover text color"-
     A                                      :"#FFFFFF","border color":"#4C6106"-
     A                                      ,"menu option indent":"10px","backg-
     A                                      round color":"#758B27","css class":-
     A                                      "action-menu","css class 2":"statio-
     A                                      nary","z index":"101"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"N9909F_SCR99_BtnHiddenRe-
     A                                      fresh","value":"btnRefresh","top":"-
     A                                      125px","response":{"fieldName":"btn-
     A                                      Refresh","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"SCERR","field type"-
     A                                      :"password field","css class":"inpu-
     A                                      t","css class 2":"textbox","input o-
     A                                      nly":"true","value":{"fieldName":"S-
     A                                      CERR","designValue":"[SCERR]","refF-
     A                                      ield":"FLAG","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"288px","c-
     A                                      ursor column":"3","top":"150px","cu-
     A                                      rsor row":"3","width":"8px","read o-
     A                                      nly":"true","css class 3":"PR-UL","-
     A                                      parent tab panel":"N9909F_SCR99_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 4":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"N9909F_SCR99_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","heig')
     A                                  1  2HTML('ht":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"N9909F_SCR99_Bt-
     A                                      nHiddenDiaryItems","value":"btnDiar-
     A                                      y","top":"175px","response":{"field-
     A                                      Name":"btnDiary","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"N9909F_SCR99_BtnHiddenSystemMe-
     A                                      ssages","value":"btnMessage","top":-
     A                                      "200px","response":{"fieldName":"bt-
     A                                      nMessage","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"N9-
     A                                      909F_SCR99_BtnHiddenWorkSubmitJob",-
     A                                      "value":"btnWrksbmjob","top":"225px-
     A                                      ","response":{"fieldName":"btnWrkJo-
     A                                      b","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"N9909F_SC-
     A                                      R99_BtnHiddenWorkPrinterOutput","va-
     A                                      lue":"btnWrkprtout","top":"250px","-
     A                                      response":{"fieldName":"btnWrkPrnt"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"N9909F_SCR9-
     A                                      9_BtnHiddenImageQueue","value":"btn-
     A                                      ImgQue","top":"275px","response":{"-
     A                                      fieldName":"btnImgQue","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"N9909F_SCR99_BtnHiddenHe-
     A                                      lp","value":"btnHelp","top":"300px"-
     A                                      ,"response":{"fieldName":"btnHelp",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF03","field type":"button","valu-
     A                                      e":"Exit","shortcut key":"F3","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnHELP","field-
     A                                       type":"button","shortcut key":"Alt-
     A                                      -F1","onclick":"pui.showHelp()","va-
     A                                      lue":"HELP","left":"1')
     A                                  1  2HTML('4px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
