     A*****************************************************************
     A* (C) Copyright Progressive Data Solutions, Inc., 2003
     A*****************************************************************
     A* SHN Provider/Contract Exception Logical file                  *
     A*                                                               *
     A*****************************************************************
     A* Created on 04/28/2003 by c:62 for Project 10MBX               *
     A*****************************************************************
     A* Revisions:                                                    *
     A*                                                               *
     A* 07/06/04 c:62 Project 10MDT                                   *
     A*               Omit if stat = 'D'                              *
     A*                                                               *
     A*****************************************************************
     A          R PSE01                     PFILE(NASEP)
     A          K SEFEIN
     A          K SEID#
     A          O SESTAT                    COMP(EQ 'D')
