     A*=========================================================================
     A* (c)Copyright - Progressive Data Solutions, Inc., 2000
     A*=========================================================================
     A* NDPPOL12 - Logical over Ascent Document Cross Reference File
     A*=========================================================================
     A* Created   : 08/17/00
     A* Programmer: C:113
     A* Project   : DR113
     A*
     A*=========================================================================
     A* Revisions:
     A*
     A* MG 8/27/00 - ADDED UNIQUE KEYWORD FOR ODBC WRITE CAPABILITY
     A*
     A* (NOTE: Please add comments to the top of revisions.)
     A*=========================================================================
     A                                      UNIQUE
     A          R POL2                      PFILE(NDPPOL2)

     A          K ASDCID
