      *****************************************************************
      *  (C) Copyright Fiserv Insurance Solutions Inc., 2007
      *****************************************************************
      ** FEE SCHEDULE SYSTEM - A/R MASTER FILE - Back Up
      *
      *  Created by: C:47    Project: MC309    Date: 11/20/2007
      *****************************************************************
     A          R PAR01                     FORMAT(NMARP)
