     A* (C) Copyright FISERV Insurance Solutions, Inc., 2008
     A*
     A*****************************************************************
     A* NXBDL - Network Billing Tracking File
     A****************************************************************
     A*  PROGRAMMER: C:197                                           *
     A*  CREATED:    08/18/08                                        *
     A*  PROJECT#:   114MPX                                          *
     A*                                                              *
     A****************************************************************
     A* REVISIONS:
     A*
     A*****************************************************************
     A*
     A          R PBD01                     PFILE(NXBDP)
     A          K BDDT
     A          K BDTIME
     A          K BDCODE
     A          K BDTYPE
