     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1993
     A**
     A** WCMC - EOB PURGE AUXILIARY FILE
     A****************************************************************
     A**  IMPORTANT NOTE:
     A**   CHANGES TO THIS FILE MAY REQUIRE CHANGES TO THE FOLLOWING:
     A**
     A**          FAE1P
     A**          FDE1P
     A****************************************************************
     A                                      REF(FSREFP)
     A          R PE101                     TEXT('EOB AUXILIARY FILE')
     A            E1CO#     R               REFFLD(CO#)
     A            E1SUB#    R               REFFLD(SUB#)
     A            E1FND     R               REFFLD(FND)
     A            E1FYR     R               REFFLD(FYR)
     A            E1CASE    R               REFFLD(CASE)
     A            E1EOB#    R               REFFLD(EOB#)
     A            E1ACCT    R               REFFLD(DS15)
     A                                      COLHDG('PATIENT' 'ACCOUNT#' )
     A            E1ENDT    R               REFFLD(DT)
     A                                      COLHDG('ENTRY' 'DATE')
     A            E1BLDT    R               REFFLD(DT)
     A                                      COLHDG('BILL' 'DATE')
     A            E1ORDT    R               REFFLD(DT)
     A                                      COLHDG('OUR COMPANY' 'RECEIPT DATE')
     A            E1CRDT    R               REFFLD(DT)
     A                                      COLHDG('CARRIER' 'RECEIPT DATE')
     A            E1TRPH    R               REFFLD(FEIN)
     A                                      COLHDG('TREATING' 'PHYSICIAN')
     A            E1TRPM    R               REFFLD(MOD)
     A                                      COLHDG('TREATING' 'PHYSICIAN' 'MOD')
     A*** THE FOLLOWING FIELDS ARE NOT USED YET
     A            E1FLG1    R               REFFLD(FLAG) COLHDG('FLAG 1')
     A            E1FLG2    R               REFFLD(FLAG) COLHDG('FLAG 2')
     A            E1FLG3    R               REFFLD(FLAG) COLHDG('FLAG 3')
     A            E1FLG4    R               REFFLD(FLAG) COLHDG('FLAG 4')
     A            E1FLG5    R               REFFLD(FLAG) COLHDG('FLAG 5')
     A            E1DT1     R               REFFLD(DT) COLHDG('DATE 1')
     A            E1DT2     R               REFFLD(DT) COLHDG('DATE 2')
     A            E1DT3     R               REFFLD(DT) COLHDG('DATE 3')
     A            E1DT4     R               REFFLD(DT) COLHDG('DATE 4')
     A            E1DT5     R               REFFLD(DT) COLHDG('DATE 5')
     A            E1AMT1    R               REFFLD(A92) COLHDG('AMOUNT 1')
     A            E1AMT2    R               REFFLD(A92) COLHDG('AMOUNT 2')
     A            E1AMT3    R               REFFLD(A92) COLHDG('AMOUNT 3')
     A            E1AMT4    R               REFFLD(A92) COLHDG('AMOUNT 4')
     A            E1AMT5    R               REFFLD(A92) COLHDG('AMOUNT 5')
     A            E110A1    R               REFFLD(DS10) COLHDG('1 DESC 10')
     A            E110A2    R               REFFLD(DS10) COLHDG('2 DESC 10')
     A            E110A3    R               REFFLD(DS10) COLHDG('3 DESC 10')
     A            E120A1    R               REFFLD(DS20) COLHDG('1 DESC 20')
     A            E120A2    R               REFFLD(DS20) COLHDG('2 DESC 20')
     A            E140A1    R               REFFLD(DS40)
     A*** END UNUSED FIELDS
     A            E1USER    R               REFFLD(USER)
     A            E1PGM     R               REFFLD(PGM)
     A            E1TIME    R               REFFLD(TIME)
     A            E1DT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            E1IUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            E1IDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
