     A* (c) 2011 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A*  QUERY POLICY PAGE 3C WORKFILE
     A*=====================================================
      * REVISIONS:
      *
      * CREATED BY C:136 FOR WC1918
     A*=====================================================
     A                                      REF(WREFP)
     A          R PP301                     TEXT('POLICY PAGE 3C QRY')
     A            P3ENV          5A         COLHDG('ENV')
     A            P3CO#     R               REFFLD(CO#)
     A            P3FND     R               REFFLD(FND)
     A            P3EMP#    R               REFFLD(EMP#)
     A            P3DIV     R               REFFLD(DIV)
     A            P3FYR     R               REFFLD(FYR)
     A            P3FFLA    R               REFFLD(FLAG)
     A            P3PTDT    R               REFFLD(DT8)
     A                                      COLHDG('POL EXP DATE')
     A            P3CXDT    R               REFFLD(DT8)
     A                                      COLHDG('CX DATE')
     A            P3SHST    R               REFFLD(STAT)
     A                                      COLHDG('SUBMITTED TO' 'NCCI Y/N')
     A            P3GRP1    R               REFFLD(DS60)
     A                                      COLHDG('GRP PAGE 3C INFO 1')
     A            P3GRP2    R               REFFLD(DS60)
     A                                      COLHDG('GRP PAGE 3C INFO 2')
     A            P3POL1    R               REFFLD(DS60)
     A                                      COLHDG('POL PAGE 3C INFO 1')
     A            P3POL2    R               REFFLD(DS60)
     A                                      COLHDG('POL PAGE 3C INFO 2')
     A            P3USER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            P3PGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            P3DT      R               REFFLD(DT)
     A                                      COLHDG('DATE')
     A            P3TIME    R               REFFLD(TIME)
     A                                      COLHDG('TIME')
     A          K P3ENV
     A          K P3CO#
     A          K P3FND
     A          K P3EMP#
     A          K P3DIV
     A          K P3FYR
