     A          R INCRCD                    TEXT('INCLUDE FILE')
     A            INCFLD        78A         TEXT('INCLUDE STMT')
     A            INCORD         1A         TEXT('ORDER OF INC')
     A          K INCORD
