     A                                      REF(*LIBL/SREFP)
     A          R SCR01
     A  34 35 09
     A  39 40 50
     A  71 72 73                            CA01(34 'Response Indicator *IN34')
     A  74 75 76
     A  77 78 79
     A  88 89                               CA02(35 'Response Indicator *IN35')
     A                                  1  2HTML('QPUIREC17   RASSUME    0     -
     A                                      RROWS      2    C1    1C2    23 RER-
     A                                      RMSGID  5    C5    SCCO#C7    MC300-
     A                                      06C6    MMESGGC5    *LIBLC0    E1  -
     A                                        3     89RERRMSGID  5    C5    SCC-
     A                                      O#C7    MCR0503C6    MMESGGC5    *L-
     A                                      IBLC0    E1    3     71RERRMSGID  5-
     A                                          C6    SCNAMEC7    MCR0503C6    -
     A                                      MMESGGC5    *LIBLC0    E1    3     -
     A                                      72RERRMSGID  5    C6    SCANAMC7   -
     A                                       MCR0500C6    MMESGGC5    *LIBLC0  -
     A                                        E1    3     88RERRMSGID  5    C6 -
     A                                         SCADR1C7    MCR0503C6    MMESGGC-
     A                                      5    *LIBLC0    E1    3     73RERRM-
     A                                      SGID  5    C5    SCCTYC7    MCR0503-
     A                                      C6    MMESGGC5    *LIBLC0    E1    -
     A                                      3     74RERRMSGID  5    C4    SCSTC-
     A                                      7    MCR0503C6    MMESGGC5    *LIBL-
     A                                      C0    E1    3     75RERRMSGID  5   -
     A                                       C4    SCSTC7    MCR0504C6    MMESG-
     A                                      GC5    *LIBLC0    E1    3     78RER-
     A                                      RMSGID  5    C6    SCZIP1C7    MCR0-
     A                                      503C6    MMESGGC5    *LIBLC0    E1 -
     A                                         3     76RERRMSGID  5    C6    SC-
     A                                      1099C7    MCR0513C6    MMESGGC5    -
     A                                      *LIBLC0    E1    3     77RERRMSG   -
     A                                       2    C6    SCBFLGC31   Valid value-
     A                                      s are "Y" and blank.E1    3     79R-
     A                                      ERRMSG    2    C6    SCPFLGC31   Va-
     A                                      lid values are "Y" and blank.E1    -
     A                                      3     34RERRMSG    2    C6    SCPFL-
     A                                      GC29   Separate JOBQ does not exist-
     A                                      .E1    3     35REMSG      2    C13 -
     A                                        TxbOutputLogoFMSSLOGO   FERSLOGO -
     A                                        REMSG      2    C17   TxaOutputLo-
     A                                      goPathFMSSLOGOPTHFERSLOGOPTH')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN34","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN35","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"assume"-
     A                                      :"true","overlay range":"1-23"},"it-
     A                                      ems":[{"id":"S0001F02_SCR01_avKeys"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"AV_KEYS","dataLengt-
     A                                      h":"1134","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none","designValue":"[AV_-
     A                                      KEYS]"},"left":"0px","top":"0px","v-
     A                                      isibility":"hidden"},{"id":"S0001F0-
     A                                      2_SCR01_action","field type":"html -
     A                                      container","white space":"normal","-
     A                                      left":"0px","top":"10px","width":"2-
     A                                      30px","css class":"action-panel-con-
     A                                      verted","height":"700px","html":"<d-
     A                                      iv class=\"top\"></div><div class=\-
     A                                      "imagetop\"><img src=\"/profoundui/-
     A                                      userdata/images/bar_top.png\" /></d-
     A                                      iv><div class=\"menulinks\"></div><-
     A                                      div class=\"imagebottom\"><img src=-
     A                                      \"/profoundui/userdata/images/bar_b-
     A                                      ottom.png\" /></div><div class=\"bo-
     A                                      ttom\"></div>"},{"field type":"pane-
     A                                      l","panel style":"TransformButtonBa-
     A                                      r","id":"S0001F02_SCR01_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"S0001-
     A                                      F02_SCR01_BtnSave","tool tip":"Save-
     A                                      ","onclick":"SystemToolbarSave","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/save.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1066px","i-
     A                                      d":"S0001F02_SCR01_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css clas')
     A                                  1  2HTML('s":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"S0001F02_SCR01_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"S0001F02-
     A                                      _SCR01_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1144px","id":"S0001F02_SC-
     A                                      R01_BtnSystemMessages","tool tip":"-
     A                                      System Messages","onclick":"SystemT-
     A                                      oolbarMessages","background image":-
     A                                      {"fieldName":"MsgIcnURL","dataLengt-
     A                                      h":"128","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none"}},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1196px","id":"S0001F02_SCR01_Bt-
     A                                      nHelp","tool tip":"Help","onclick":-
     A                                      "SystemToolbarHelp","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/help.png'')"},{"id":"S0-
     A                                      001F02_SCR01_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css cl')
     A                                  1  2HTML('ass":"stationary","visibility-
     A                                      ":"hidden"},{"id":"S0001F02_SCR01_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"S0001F-
     A                                      02_SCR01_BtnHiddenSave","value":"bt-
     A                                      nSave","top":"100px","response":{"f-
     A                                      ieldName":"btnSave","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"constant-
     A                                      1","field type":"output field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"110px","cursor row":"1","css cla-
     A                                      ss":"top-line","value":"js: current-
     A                                      User()","css class 2":"output-field-
     A                                      ","parent tab panel":"S0001F02_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 3":"profound-converted"},{-
     A                                      "id":"SCCONM","field type":"output -
     A                                      field","value":{"fieldName":"SCCONM-
     A                                      ","designValue":"[SCCONM]","refFiel-
     A                                      d":"NAME","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"414px","cursor col-
     A                                      umn":"21","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","css-
     A                                       class 3":"HI","parent tab panel":"-
     A                                      S0001F02_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 4":"profound--
     A                                      converted"},{"id":"constant2","fiel-
     A                                      d type":"output field","left":"778p-
     A                                      x","cursor column":"73","top":"110p-
     A                                      x","cursor row":"1","css class":"to-
     A                                      p-line","value":"js: currentDate()"-
     A                                      ,"css class 2":"output-field","pare-
     A                                      nt tab panel":"S0001F02_SCR01_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 3":"profound-converted"},{"id":"S-
     A                                      0001F02_SCR01_fkeyMenu","field type-
     A                                      ":"menu","left":"10px","top":"120px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"S0001F-
     A                                      02_SCR01_BtnHiddenRefresh","value":-
     A                                      "btnRefresh","top":"125px","respons-
     A                                      e":{"fieldName":"btnRefresh","dataT-
     A                                      ype":"indicator","for')
     A                                  1  2HTML('matting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValue":"[Q1PG-
     A                                      M]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"S00-
     A                                      01F02_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPRDS","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"414px","-
     A                                      cursor column":"21","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "parent tab panel":"S0001F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","vis-
     A                                      ibility":"hidden","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      ","field type":"output field","valu-
     A                                      e":"SCR01","css class":"constant","-
     A                                      left":"799px","cursor column":"76",-
     A                                      "top":"130px","cursor row":"2","par-
     A                                      ent tab panel":"S0001F02_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCMODE","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCMODE","des-
     A                                      ignValue":"[SCMODE]","refField":"PG-
     A                                      M","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"764px","cursor column":"7-
     A                                      1","top":"150px","cursor row":"3","-
     A                                      css class 2":"HI","parent tab panel-
     A                                      ":"S0001F02_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"S0001F02_SCR01_BtnHiddenSearch",-
     A                                      "value":"btnSearch","top":"150px","-
     A                                      response":{"fieldName":"btnSearch",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant4","field type":"out-
     A                                      put field","value":"Company #:","cs-
     A                                      s class":"constant","left":"295px",-
     A                                      "cursor column":"4","top":"170px","-
     A                                      cursor row":"4","parent tab panel":-
     A                                      "S0001F02_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"SCCO#","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCCO#","designValue":"[S-
     A                                      CCO#]","refField":"CO#","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false","curSym":"","-
     A                                      units":"","negNum":"9')
     A                                  1  2HTML('99.00","numBlankFill":"true"}-
     A                                      ,"left":"372px","cursor column":"15-
     A                                      ","top":"170px","cursor row":"4","w-
     A                                      idth":"22px","text align":"right","-
     A                                      css class 3":{"fieldName":"40","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"css class 4":"HI","read only":-
     A                                      {"fieldName":"N40","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"N40","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"er-
     A                                      ror message id":"MC30006","error me-
     A                                      ssage file":"MMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"89","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "MCR0503","error message file 2":"M-
     A                                      MESGG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"71","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"parent tab panel":"S0001F-
     A                                      02_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"S0001F-
     A                                      02_SCR01_BtnHiddenDiaryItems","valu-
     A                                      e":"btnDiary","top":"175px","respon-
     A                                      se":{"fieldName":"btnDiary","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"S0001F02_SCR01_BtnH-
     A                                      iddenSystemMessages","value":"btnMe-
     A                                      ssage","top":"200px","response":{"f-
     A                                      ieldName":"btnMessage","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant5","field type":"output field","-
     A                                      value":"Company name    :","css cla-
     A                                      ss":"constant","left":"295px","curs-
     A                                      or column":"4","top":"210px","curso-
     A                                      r row":"6","parent tab panel":"S000-
     A                                      1F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCNAME","field type"-
     A                                      :"textbox","css class":"input","css-
     A                                       class 2":"textbox","value":{"field-
     A                                      Name":"SCNAME","designValue":"[SCNA-
     A                                      ME]","refField":"NAME","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppercase","left":-
     A                                      "421px","cursor column":"22","top":-
     A                                      "210px","cursor row":"6","width":"2-
     A                                      81px","css class 3":{"fieldName":"N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","in')
     A                                  1  2HTML('dFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"cs-
     A                                      s class 4":"HI","read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"error messa-
     A                                      ge id":"MCR0503","error message fil-
     A                                      e":"MMESGG","error message library"-
     A                                      :"*LIBL","error condition":{"fieldN-
     A                                      ame":"72","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error messages":"1 messa-
     A                                      ge","description":"COMPANY NAME","p-
     A                                      arent tab panel":"S0001F02_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"S0001F02_SCR01_Bt-
     A                                      nHiddenWorkSubmitJob","value":"btnW-
     A                                      rksbmjob","top":"225px","response":-
     A                                      {"fieldName":"btnWrkJob","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant6","field type":"output field"-
     A                                      ,"value":"Short name      :","css c-
     A                                      lass":"constant","left":"295px","cu-
     A                                      rsor column":"4","top":"230px","cur-
     A                                      sor row":"7","parent tab panel":"S0-
     A                                      001F02_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCSHNM","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCSHNM","designValue":"[SC-
     A                                      SHNM]","refField":"NM30","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"421px","cursor column":"22","top-
     A                                      ":"230px","cursor row":"7","width":-
     A                                      "211px","css class 3":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"HI","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 4":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"css class 5":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"UL","customFalse":""},"parent t-
     A                                      ab panel":"S0001F02_SCR01_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant7","field type":"output field","-
     A                                      value":"EFT Batch Name  :","css cla-
     A                                      ss":"constant","visibility":{"field-
     A                                      Name":"39","dataType":"expression",-
     A                                      "formatting":"Indicat')
     A                                  1  2HTML('or","indFormat":"visible / hi-
     A                                      dden"},"left":"295px","cursor colum-
     A                                      n":"4","top":"250px","cursor row":"-
     A                                      8","parent tab panel":"S0001F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCANAM","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CANAM","designValue":"[SCANAM]","re-
     A                                      fField":"NAME","dataType":"referenc-
     A                                      e","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase"},"text tra-
     A                                      nsform":"uppercase","visibility":{"-
     A                                      fieldName":"39","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      421px","cursor column":"22","top":"-
     A                                      250px","cursor row":"8","width":"28-
     A                                      1px","css class 3":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"css class 4":"HI","read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"error message id":"MCR0500","err-
     A                                      or message file":"MMESGG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"88","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      ages":"1 message","parent tab panel-
     A                                      ":"S0001F02_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"S0001F02_SCR01_BtnHiddenWorkPrin-
     A                                      terOutput","value":"btnWrkprtout","-
     A                                      top":"250px","response":{"fieldName-
     A                                      ":"btnWrkPrnt","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant8","f-
     A                                      ield type":"output field","value":"-
     A                                      Physical address: ","css class":"co-
     A                                      nstant","left":"295px","cursor colu-
     A                                      mn":"4","top":"270px","cursor row":-
     A                                      "9","parent tab panel":"S0001F02_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"S0001F02_SC-
     A                                      R01_BtnHiddenImageQueue","value":"b-
     A                                      tnImgQue","top":"275px","response":-
     A                                      {"fieldName":"btnImgQue","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"SCA-
     A                                      DR1","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName')
     A                                  1  2HTML('":"SCADR1","designValue":"[SC-
     A                                      ADR1]","refField":"ADR1","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"421px","cursor column":"22","top-
     A                                      ":"290px","cursor row":"10","width"-
     A                                      :"281px","css class 3":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"css class 4":"HI","-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"error message id":"MCR0503",-
     A                                      "error message file":"MMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"73","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","parent tab p-
     A                                      anel":"S0001F02_SCR01_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"S0001F02_SCR01_BtnHiddenHelp-
     A                                      ","value":"btnHelp","top":"300px","-
     A                                      response":{"fieldName":"btnHelp","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"SCADR2","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCA-
     A                                      DR2","designValue":"[SCADR2]","refF-
     A                                      ield":"ADR2","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"421px","c-
     A                                      ursor column":"22","top":"310px","c-
     A                                      ursor row":"11","width":"281px","cs-
     A                                      s class 3":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"parent tab panel":"-
     A                                      S0001F02_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"SCCTY","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCCTY","des')
     A                                  1  2HTML('ignValue":"[SCCTY]","refField-
     A                                      ":"CTY","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"421px","cursor-
     A                                       column":"22","top":"330px","cursor-
     A                                       row":"12","width":"176px","css cla-
     A                                      ss 3":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"c-
     A                                      ss class 4":"HI","read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"error mess-
     A                                      age id":"MCR0503","error message fi-
     A                                      le":"MMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"74","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"1 mess-
     A                                      age","parent tab panel":"S0001F02_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"SCST","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CST","designValue":"[SCST]","refFie-
     A                                      ld":"ST","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase"},"text transform-
     A                                      ":"uppercase","left":"610px","curso-
     A                                      r column":"49","top":"330px","curso-
     A                                      r row":"12","width":"15px","css cla-
     A                                      ss 3":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"c-
     A                                      ss class 4":"HI","read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"error mess-
     A                                      age id":"MCR0503","error message fi-
     A                                      le":"MMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"75","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"MCR0504-
     A                                      ","error message file 2":"MMESGG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"78"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"S0001F02_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      id":"SCZIP1","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCZ-
     A                                      IP1","designValue":"[SCZIP1]","refF-
     A                                      ield":"ZIP1","dataTyp')
     A                                  1  2HTML('e":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      "},"left":"638px","cursor column":"-
     A                                      53","top":"330px","cursor row":"12"-
     A                                      ,"width":"36px","css class 3":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"css class 4"-
     A                                      :"HI","read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 5":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"error message id":"MC-
     A                                      R0503","error message file":"MMESGG-
     A                                      ","error message library":"*LIBL","-
     A                                      error condition":{"fieldName":"76",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"1 message","paren-
     A                                      t tab panel":"S0001F02_SCR01_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       6":"profound-converted"},{"id":"co-
     A                                      nstant9","field type":"output field-
     A                                      ","value":"-","css class":"constant-
     A                                      ","left":"680px","cursor column":"5-
     A                                      9","top":"330px","cursor row":"12",-
     A                                      "parent tab panel":"S0001F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCZIP2","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCZI-
     A                                      P2","designValue":"[SCZIP2]","refFi-
     A                                      eld":"ZIP2","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"999.00"},"left":"694px","cu-
     A                                      rsor column":"61","top":"330px","cu-
     A                                      rsor row":"12","width":"29px","css -
     A                                      class 3":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 5":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"parent tab panel":"S0-
     A                                      001F02_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"constant10","field-
     A                                       type":"output field","value":"Mail-
     A                                      ing address :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"350px","cursor row":"13",-
     A                                      "parent tab panel":"S0001F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-c')
     A                                  1  2HTML('onverted"},{"id":"SCMAD1","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCMAD1","designValu-
     A                                      e":"[SCMAD1]","refField":"ADR1","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"421px","cursor column":"2-
     A                                      2","top":"370px","cursor row":"14",-
     A                                      "width":"281px","css class 3":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      parent tab panel":"S0001F02_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"SCMAD2","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCMAD-
     A                                      2","designValue":"[SCMAD2]","refFie-
     A                                      ld":"ADR2","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase"},"text transfo-
     A                                      rm":"uppercase","left":"421px","cur-
     A                                      sor column":"22","top":"390px","cur-
     A                                      sor row":"15","width":"281px","css -
     A                                      class 3":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 5":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"PR","cust-
     A                                      omFalse":""},"parent tab panel":"S0-
     A                                      001F02_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"SCMCTY","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCMCTY","designValue":"[SC-
     A                                      MCTY]","refField":"CTY","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"421px","cursor column":"22","top"-
     A                                      :"410px","cursor row":"16","width":-
     A                                      "176px","css class 3":{"fieldName":-
     A                                      "N09","dataType":"exp')
     A                                  1  2HTML('ression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      css class 4":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"parent tab panel":"S000-
     A                                      1F02_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"id":"SCMST","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCMST","designValue":"[SCMST]-
     A                                      ","refField":"ST","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase"},"text -
     A                                      transform":"uppercase","left":"610p-
     A                                      x","cursor column":"49","top":"410p-
     A                                      x","cursor row":"16","width":"15px"-
     A                                      ,"css class 3":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"read only":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"css class 5":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"PR"-
     A                                      ,"customFalse":""},"parent tab pane-
     A                                      l":"S0001F02_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 6":"profo-
     A                                      und-converted"},{"id":"SCMZP1","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCMZP1","designValue-
     A                                      ":"[SCMZP1]","refField":"ZIP1","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"left":"638px","cursor column":"53-
     A                                      ","top":"410px","cursor row":"16","-
     A                                      width":"36px","css class 3":{"field-
     A                                      Name":"N09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"UL-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custo')
     A                                  1  2HTML('m Values","customTrue":"PR","-
     A                                      customFalse":""},"parent tab panel"-
     A                                      :"S0001F02_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 6":"profoun-
     A                                      d-converted"},{"id":"constant11","f-
     A                                      ield type":"output field","value":"-
     A                                      -","css class":"constant","left":"6-
     A                                      80px","cursor column":"59","top":"4-
     A                                      10px","cursor row":"16","parent tab-
     A                                       panel":"S0001F02_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCMZP2"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCMZP2","design-
     A                                      Value":"[SCMZP2]","refField":"ZIP2"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"false","zeroFill":"false","-
     A                                      curSym":"","units":"","negNum":"999-
     A                                      .00"},"left":"694px","cursor column-
     A                                      ":"61","top":"410px","cursor row":"-
     A                                      16","width":"29px","css class 3":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"css class-
     A                                       4":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"parent tab panel":"S0001F02_SCR0-
     A                                      1_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant12","field type":"out-
     A                                      put field","value":"Phone Number   -
     A                                                   :","css class":"consta-
     A                                      nt","left":"295px","cursor column":-
     A                                      "4","top":"450px","cursor row":"18"-
     A                                      ,"parent tab panel":"S0001F02_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCAREA","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCA-
     A                                      REA","designValue":"[SCAREA]","refF-
     A                                      ield":"AREA","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"999.00","numBlankFill":"tr-
     A                                      ue"},"left":"505px","cursor column"-
     A                                      :"34","top":"450px","cursor row":"1-
     A                                      8","width":"22px","text align":"rig-
     A                                      ht","css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 4":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","custo')
     A                                  1  2HTML('mTrue":"PR","customFalse":""}-
     A                                      ,"css class 5":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"description":"AREA CODE","p-
     A                                      arent tab panel":"S0001F02_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"SCPHN#","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCPHN#-
     A                                      ","designValue":"[SCPHN#]","refFiel-
     A                                      d":"PHN#","dataType":"reference","f-
     A                                      ormatting":"Number","numSep":"false-
     A                                      ","zeroBalance":"false","zeroFill":-
     A                                      "false","curSym":"","units":"","neg-
     A                                      Num":"-999.00","numBlankFill":"true-
     A                                      ","edtWrd":"''   -    ''"},"left":"-
     A                                      540px","cursor column":"39","top":"-
     A                                      450px","cursor row":"18","width":"5-
     A                                      7px","text align":"right","css clas-
     A                                      s 3":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 4":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"css class 5":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"parent tab panel":"S0001F-
     A                                      02_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"id":"constant13","field typ-
     A                                      e":"output field","value":"FAX Numb-
     A                                      er  :","css class":"constant","left-
     A                                      ":"645px","cursor column":"54","top-
     A                                      ":"450px","cursor row":"18","parent-
     A                                       tab panel":"S0001F02_SCR01_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCF-
     A                                      ARA","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCFARA","de-
     A                                      signValue":"[SCFARA]","refField":"A-
     A                                      REA","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"false","zeroFill":"fals-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "999.00","numBlankFill":"true"},"le-
     A                                      ft":"743px","cursor column":"68","t-
     A                                      op":"450px","cursor row":"18","widt-
     A                                      h":"22px","text align":"right","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"read only":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"css class 4":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 5"')
     A                                  1  2HTML(':{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      description":"AREA CODE","parent ta-
     A                                      b panel":"S0001F02_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"SCFPHN-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCFPHN","desig-
     A                                      nValue":"[SCFPHN]","refField":"PHN#-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"false","zeroFill":"false",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00","numBlankFill":"true","edtWr-
     A                                      d":"''   -    ''"},"left":"778px","-
     A                                      cursor column":"73","top":"450px","-
     A                                      cursor row":"18","width":"57px","te-
     A                                      xt align":"right","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"read only":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"css class-
     A                                       4":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"css -
     A                                      class 5":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"parent tab panel":"S0001F02_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      id":"constant14","field type":"outp-
     A                                      ut field","value":"Federal tax ID  -
     A                                                  :","css class":"constan-
     A                                      t","left":"295px","cursor column":"-
     A                                      4","top":"470px","cursor row":"19",-
     A                                      "parent tab panel":"S0001F02_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCFEIN","field type":"textbox",-
     A                                      "css class":"input","css class 2":"-
     A                                      textbox","value":{"fieldName":"SCFE-
     A                                      IN","designValue":"[SCFEIN]","refFi-
     A                                      eld":"FEIN","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"false","zeroFill-
     A                                      ":"false","curSym":"","units":"","n-
     A                                      egNum":"-999.00","numBlankFill":"tr-
     A                                      ue","edtWrd":"''  -       ''"},"lef-
     A                                      t":"505px","cursor column":"34","to-
     A                                      p":"470px","cursor row":"19","width-
     A                                      ":"71px","text align":"right","css -
     A                                      class 3":{"fieldName":"N09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"UL","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"HI","customFalse-
     A                                      ":""},"read only":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"css class 5"')
     A                                  1  2HTML(':{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"p-
     A                                      arent tab panel":"S0001F02_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 6":"profound-converted"},{"id"-
     A                                      :"constant15","field type":"output -
     A                                      field","value":"1099 Min Amt:","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"50","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"left":"6-
     A                                      45px","cursor column":"54","top":"4-
     A                                      70px","cursor row":"19","parent tab-
     A                                       panel":"S0001F02_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SC1099"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SC1099","design-
     A                                      Value":"[SC1099]","refField":"A72",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Number","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"999.-
     A                                      00","numBlankFill":"true"},"visibil-
     A                                      ity":{"fieldName":"50","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"743px","cursor column":"68",-
     A                                      "top":"470px","cursor row":"19","wi-
     A                                      dth":"57px","text align":"right","c-
     A                                      ss class 3":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"HI","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"error message id":-
     A                                      "MCR0513","error message file":"MME-
     A                                      SGG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"7-
     A                                      7","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error messages":"1 message","pa-
     A                                      rent tab panel":"S0001F02_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 6":"profound-converted"},{"id":-
     A                                      "constant16","field type":"output f-
     A                                      ield","value":"IRS transmittal cont-
     A                                      rol code:","css class":"constant","-
     A                                      visibility":{"fieldName":"50","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"295px","cursor column-
     A                                      ":"4","top":"490px","cursor row":"2-
     A                                      0","parent tab panel":"S0001F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCTCC","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"')
     A                                  1  2HTML('fieldName":"SCTCC","designVal-
     A                                      ue":"[SCTCC]","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"uppercase","dataLength":"5"-
     A                                      },"text transform":"uppercase","vis-
     A                                      ibility":{"fieldName":"50","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"505px","cursor column":"-
     A                                      34","top":"490px","cursor row":"20"-
     A                                      ,"width":"36px","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 4-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"css cl-
     A                                      ass 5":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      parent tab panel":"S0001F02_SCR01_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant17","field type":"output-
     A                                       field","value":"Submit WCMS billin-
     A                                      gs to separate job queue           -
     A                                               :","css class":"constant",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"510px","cursor row":"21","pa-
     A                                      rent tab panel":"S0001F02_SCR01_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCBFLG","field type":"checkbox","c-
     A                                      ss class":"input","css class 2":"ch-
     A                                      eckbox","value":{"fieldName":"SCBFL-
     A                                      G","designValue":"[SCBFLG]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"1"},"text transform":"u-
     A                                      ppercase","left":"743px","top":"510-
     A                                      px","width":"8px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"error message":"Valid values are -
     A                                      \"Y\" and blank.","error condition"-
     A                                      :{"fieldName":"79","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"S0-
     A                                      001F02_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 6')
     A                                  1  2HTML('":"profound-converted","check-
     A                                      ed value":"Y","unchecked value":" "-
     A                                      },{"id":"constant18","field type":"-
     A                                      output field","value":"Submit mass -
     A                                      policy pages to separate job queue -
     A                                                     :","css class":"cons-
     A                                      tant","left":"295px","cursor column-
     A                                      ":"4","top":"530px","cursor row":"2-
     A                                      2","parent tab panel":"S0001F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SCPFLG","field type":"checkb-
     A                                      ox","css class":"input","css class -
     A                                      2":"checkbox","value":{"fieldName":-
     A                                      "SCPFLG","designValue":"[SCPFLG]","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se","dataLength":"1"},"text transfo-
     A                                      rm":"uppercase","left":"743px","top-
     A                                      ":"530px","width":"8px","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"error message":"Valid value-
     A                                      s are \"Y\" and blank.","error cond-
     A                                      ition":{"fieldName":"34","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"2 messages","error message -
     A                                      2":"Separate JOBQ does not exist.",-
     A                                      "error condition 2":{"fieldName":"3-
     A                                      5","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"parent tab panel":"S0001F02_SCR-
     A                                      01_MainTabPanel","parent tab":"0","-
     A                                      css class 6":"profound-converted","-
     A                                      checked value":"Y","unchecked value-
     A                                      ":" "},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF03","field type":"button-
     A                                      ","value":"Exit","shortcut key":"F3-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnCF12"-
     A                                      ,"field type":"button","value":"Can-
     A                                      cel","shortcut key":"F12","left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"lblNetworkID","fiel-
     A                                      d type":"output field","css class":-
     A                                      "constant","value":"Network ID     -
     A                                             :","cursor row":"19","cursor-
     A                                       column":"4","left":"')
     A                                  1  2HTML('295px","top":"550px","css cla-
     A                                      ss 2":"profound-converted","parent -
     A                                      tab panel":"S0001F02_SCR01_MainTabP-
     A                                      anel","parent tab":"0","visibility"-
     A                                      :{"fieldName":"isRelayMod","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "width":"140px"},{"id":"txbNetworkI-
     A                                      D","field type":"textbox","css clas-
     A                                      s":"input","value":{"fieldName":"sc-
     A                                      NetID","dataLength":"255","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[scNetID]"},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"left":"4-
     A                                      60px","top":"550px","width":"415px"-
     A                                      ,"css class 2":"textbox","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"HI","customFalse":""},"css -
     A                                      class 4":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 5":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"css class 6":"profound-conve-
     A                                      rted","visibility":{"fieldName":"is-
     A                                      RelayMod","customTrue":"","customFa-
     A                                      lse":"","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"parent tab panel-
     A                                      ":"S0001F02_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0"},{"id":"LblOutputLogo-
     A                                      ","field type":"output field","css -
     A                                      class":"constant","value":"Output l-
     A                                      ogo file name :","cursor row":"19",-
     A                                      "cursor column":"4","left":"295px",-
     A                                      "top":"575px","width":"140px","css -
     A                                      class 2":"profound-converted","visi-
     A                                      bility":{"fieldName":"isScript","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"}},{"id":"TxbOutputLogo","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"value":{"fieldName":"scSLogo","da-
     A                                      taLength":"100","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[scSLogo]"},"read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"460px","top-
     A                                      ":"575px","width":"415px","css clas-
     A                                      s 2":"textbox","css class 3":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"HI-
     A                                      ","customFalse":""},"css class 4":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"I')
     A                                  1  2HTML('ndicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"css class 6":"prof-
     A                                      ound-converted","visibility":{"fiel-
     A                                      dName":"isScript","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"},"error me-
     A                                      ssage":{"fieldName":"msSLogo","data-
     A                                      Length":"200","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"},"error conditi-
     A                                      on":{"fieldName":"erSLogo","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error enha-
     A                                      nced mode":"1","error messages":"1 -
     A                                      message","tool tip":{"fieldName":"t-
     A                                      ipSLogo","dataLength":"200","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[tipSLogo]"}},{"id":"-
     A                                      LblOutputLogoPath","field type":"ou-
     A                                      tput field","css class":"constant",-
     A                                      "value":"Output logo path :","curso-
     A                                      r row":"19","cursor column":"4","le-
     A                                      ft":"295px","top":"600px","width":"-
     A                                      140px","css class 2":"profound-conv-
     A                                      erted","visibility":{"fieldName":"i-
     A                                      sScript","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"parent tab panel"-
     A                                      :"S0001F02_SCR01_MainTabPanel","par-
     A                                      ent tab":"0"},{"id":"TxaOutputLogoP-
     A                                      ath","field type":"text area","css -
     A                                      class":"textarea","description":"ou-
     A                                      tput logo path text area","value":{-
     A                                      "fieldName":"scSLogoPth","dataLengt-
     A                                      h":"250","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[scSL-
     A                                      ogoPth]"},"read only":{"fieldName":-
     A                                      "09","customTrue":"","customFalse":-
     A                                      "","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"error messages":"1 messa-
     A                                      ge","error message":{"fieldName":"m-
     A                                      sSLogoPth","dataLength":"200","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      },"error condition":{"fieldName":"e-
     A                                      rSLogoPth","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error enhanced mode":"1","-
     A                                      left":"460px","top":"600px","width"-
     A                                      :"415px","tool tip":{"fieldName":"t-
     A                                      ipSLogoPt","dataLength":"200","trim-
     A                                      Leading":"false","tri')
     A                                  1  2HTML('mTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[tipSLogoPt]"},"visibility":{"fiel-
     A                                      dName":"isScript","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"visible / hidden"}}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            ERSLOGO        1A  H
     A            ERSLOGOPTH     1A  H
     A            ISRELAYMOD     1A  H
     A            ISSCRIPT       1A  H
     A            MSGICNURL    128A  H
     A            MSSLOGO      200A  H
     A            MSSLOGOPTH   200A  H
     A            Q1PGM         10A  H
     A            SCBFLG         1A  H
     A            SCNETID      255A  H
     A            SCPFLG         1A  H
     A            SCSLOGO      100A  H
     A            SCSLOGOPTH   250A  H
     A            SCTCC          5A  H
     A            TIPSLOGO     200A  H
     A            TIPSLOGOPT   200A  H
     A            SC1099    R        H      REFFLD(A72)
     A            SCADR1    R        H      REFFLD(ADR1)
     A            SCADR2    R        H      REFFLD(ADR2)
     A            SCANAM    R        H      REFFLD(NAME)
     A            SCAREA    R        H      REFFLD(AREA)
     A            SCCO#     R        H      REFFLD(CO#)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCTY     R        H      REFFLD(CTY)
     A            SCFARA    R        H      REFFLD(AREA)
     A            SCFEIN    R        H      REFFLD(FEIN)
     A            SCFPHN    R        H      REFFLD(PHN#)
     A            SCMAD1    R        H      REFFLD(ADR1)
     A            SCMAD2    R        H      REFFLD(ADR2)
     A            SCMCTY    R        H      REFFLD(CTY)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCMST     R        H      REFFLD(ST)
     A            SCMZP1    R        H      REFFLD(ZIP1)
     A            SCMZP2    R        H      REFFLD(ZIP2)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPHN#    R        H      REFFLD(PHN#)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCSHNM    R        H      REFFLD(NM30)
     A            SCST      R        H      REFFLD(ST)
     A            SCZIP1    R        H      REFFLD(ZIP1)
     A            SCZIP2    R        H      REFFLD(ZIP2)
     A          R SCR02
     A  26 28 41
     A  42 43 44
     A  45 46 47                            CA01(26 'Response Indicator *IN26')
     A  48 49 52
     A  53 62 70
     A  71 72 73                            CA02(28 'Response Indicator *IN28')
     A  09 25 27
     A  81 82 83
     A  50 55 51                            CA03(41 'Response Indicator *IN41')
     A  74 75 76
     A  80 84 85                            CA04(42 'Response Indicator *IN42')
     A                                      SETOF(43 'Response Indicator *IN43')
     A                                      SETOF(44 'Response Indicator *IN44')
     A                                      SETOF(45 'Response Indicator *IN45')
     A                                      SETOF(46 'Response Indicator *IN46')
     A                                      SETOF(47 'Response Indicator *IN47')
     A                                      SETOF(48 'Response Indicator *IN48')
     A                                      SETOF(49 'Response Indicator *IN49')
     A                                      SETOF(52 'Response Indicator *IN52')
     A                                      SETOF(53 'Response Indicator *IN53')
     A                                      SETOF(62 'Response Indicator *IN62')
     A                                      SETOF(70 'Response Indicator *IN70')
     A                                      SETOF(71 'Response Indicator *IN71')
     A                                      SETOF(72 'Response Indicator *IN72')
     A                                      SETOF(73 'Response Indicator *IN73')
     A                                  1  2HTML('QPUIREC25   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCCHK1C7    MCR0700C6    MMESGGC5-
     A                                          *LIBLC0    E1    3     71RERRMS-
     A                                      GID  5    C6    SCCHK2C7    MCR0700-
     A                                      C6    MMESGGC5    *LIBLC0    E1    -
     A                                      3     71RERRMSGID  5    C6    SCCAS-
     A                                      EC7    MCR0513C6    MMESGGC5    *LI-
     A                                      BLC0    E1    3     72RERRMSGID  5 -
     A                                         C5    SCISOC7    MCR0701C6    MM-
     A                                      ESGGC5    *LIBLC0    E1    3     74-
     A                                      RERRMSGID  5    C5    SCCOIC7    MC-
     A                                      R0500C6    MMESGGC5    *LIBLC0    E-
     A                                      1    3     73RERRMSGID  5    C6    -
     A                                      SCCARTC7    WC30376C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     80RERRMSGI-
     A                                      D  5    C6    SCPBCDC7    WC31354C6-
     A                                          WMESGGC5    *LIBLC0    E1    6 -
     A                                          47 82RERRMSGID  5    C6    SCPB-
     A                                      CDC7    WCR1130C6    WMESGGC5    *L-
     A                                      IBLC0    E1    6     47 83RERRMSG  -
     A                                        2    C6    SCPSS#C31   Valid valu-
     A                                      es are "Y" and blank.E1    3     26-
     A                                      RERRMSGID  5    C6    SCDBCDC7    W-
     A                                      C31384C6    WMESGGC5    *LIBLC0    -
     A                                      E1    6     48 82RERRMSGID  5    C6-
     A                                          SCDBCDC7    WCR1130C6    WMESGG-
     A                                      C5    *LIBLC0    E1    6     48 83R-
     A                                      ERRMSGID  5    C6    SCNMADC7    WC-
     A                                      R0505C6    WMESGGC5    *LIBLC0    E-
     A                                      1    3     75RERRMSGID  5    C6    -
     A                                      SCNMADC7    WCR2347C6    WMESGGC5  -
     A                                        *LIBLC0    E1    3     76RERRMSGI-
     A                                      D  5    C6    SCFBCDC7    WC31385C6-
     A                                          WMESGGC5    *LIBLC0    E1    6 -
     A                                          49 82RERRMSGID  5    C6    SCFB-
     A                                      CDC7    WCR1130C6    WMESGGC5    *L-
     A                                      IBLC0    E1    6     49 83RERRMSGID-
     A                                        5    C6    SCTHRLC7    WCR1083C6 -
     A                                         WMESGGC5    *LIBLC0    E1    3  -
     A                                         84RERRMSGID  5    C6    SCTHRLC7-
     A                                          WCR0750C6    WMESGGC5    *LIBLC-
     A                                      0    E1    3     85RERRMSGID  5    -
     A                                      C6    SCTHRHC7    WCR1083C6    WMES-
     A                                      GGC5    *LIBLC0    E1    3     84RE-
     A                                      RRMSGID  5    C6    SCTHRHC7    WCR-
     A                                      0750C6    WMESGGC5    *LIBLC0    E1-
     A                                          3     85RERRMSG    2    C6    S-
     A                                      CARSQC30   Valid values are C,E or -
     A                                      blank.E1    3     28RERRMSGID  5   -
     A                                       C13   TxbClmActDartC7    WCR2347C6-
     A                                          WMESGGC5    *LIBLC0    FINDACTE-
     A                                      RR RERRMSGID  5    C13   TxbClmActD-
     A                                      artC7    WCR0505C6    WMESGGC5    *-
     A                                      LIBLC0    FINDACTERRNRERRMSG    2  -
     A                                        C10   CbxMaintDtC31   Valid value-
     A                                      s are "Y" and blank.E1    3     26R-
     A                                      ERRMSG    2    C11   CbxMaintNewC31-
     A                                         Valid values are "Y" and blank.E-
     A                                      1    3     26')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN26","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN28","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN41","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN42","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN43","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN44","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN45","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN46","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN47","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N48","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN4-
     A                                      9","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN52"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN53","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN62","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN70","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"set o-
     A                                      ff 16":{"fieldName":"*IN71","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       17":{"fieldName":"*IN72","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"set off 1-
     A                                      8":{"fieldName":"*IN73","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"return curs-
     A                                      or record":{"fieldName":"HREC","dat-
     A                                      aLength":"10","dataType":"char","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none"},"return cursor field-
     A                                      ":{"fieldName":"HFLD","dataLength":-
     A                                      "10","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"true","textTransform":"n-
     A                                      one"},"overlay range":"1-23","set o-
     A                                      ff 19":{"fieldName":"IndClmAct","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat"')
     A                                  1  2HTML(':"1 / 0"}},"items":[{"id":"HR-
     A                                      EC","field type":"output field","vi-
     A                                      sibility":"hidden","value":{"fieldN-
     A                                      ame":"HREC","designValue":"[HREC]",-
     A                                      "dataType":"char","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"none",-
     A                                      "dataLength":"10"},"left":"0px","to-
     A                                      p":"-30px","css class":"profound-co-
     A                                      nverted"},{"id":"HFLD","field type"-
     A                                      :"output field","visibility":"hidde-
     A                                      n","value":{"fieldName":"HFLD","des-
     A                                      ignValue":"[HFLD]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"10-
     A                                      "},"left":"0px","top":"-30px","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "S0001F02_SCR02_avKeys","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"AV_KEYS","dataLength":"1134","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[AV_KEYS]"},"lef-
     A                                      t":"0px","top":"0px","visibility":"-
     A                                      hidden"},{"id":"S0001F02_SCR02_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"panel","panel st-
     A                                      yle":"TransformButtonBar","id":"S00-
     A                                      01F02_SCR02_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"S0001F02_SCR02_Bt-
     A                                      nSave","tool tip":"Save","onclick":-
     A                                      "SystemToolbarSave","background ima-
     A                                      ge":"url(''/profoundui/userdata/ima-
     A                                      ges/systool/save.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1066px","id":"S0001F02-
     A                                      _SCR02_BtnRefresh","t')
     A                                  1  2HTML('ool tip":"Refresh","onclick":-
     A                                      "SystemToolbarRefresh","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/refresh.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1092px","id":"S0-
     A                                      001F02_SCR02_BtnSearch","tool tip":-
     A                                      "Search","onclick":"SystemToolbarSe-
     A                                      arch","background image":"url(''/pr-
     A                                      ofoundui/userdata/images/systool/se-
     A                                      arch.png'')"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1118px","id":"S0001F02_SCR02_BtnDi-
     A                                      aryItems","tool tip":"Diary/Work It-
     A                                      ems - IDARTS","onclick":"SystemTool-
     A                                      barDiary","background image":{"fiel-
     A                                      dName":"DryIcnURL","dataLength":"12-
     A                                      8","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"}},{"field type":"button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"40px","b-
     A                                      ackground color":"#FFFFFF","backgro-
     A                                      und repeat":"no-repeat","border top-
     A                                       style":"none","border right style"-
     A                                      :"none","border bottom style":"none-
     A                                      ","border left style":"none","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "locked in place":"true","left":"11-
     A                                      44px","id":"S0001F02_SCR02_BtnSyste-
     A                                      mMessages","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"S0001F02_SCR02_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"S0001F02_SCR02-
     A                                      _ImgSysToolBottom","f')
     A                                  1  2HTML('ield type":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/butbarbot.png","left":"1036p-
     A                                      x","top":"64px","width":"187px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      stationary","visibility":"hidden"},-
     A                                      {"id":"S0001F02_SCR02_MainTabPanel"-
     A                                      ,"field type":"tab panel","tab pane-
     A                                      l style":"Transform","tab names":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "active tab":"0","left":"250px","to-
     A                                      p":"70px","width":"970px","height":-
     A                                      "657px","z index":"8","locked in pl-
     A                                      ace":"true","css class":"tab-panel"-
     A                                      ,"css class 2":"stationary"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"S0001F02_SCR02_Btn-
     A                                      HiddenSave","value":"btnSave","top"-
     A                                      :"100px","response":{"fieldName":"b-
     A                                      tnSave","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"id":"constant19","field t-
     A                                      ype":"output field","left":"281px",-
     A                                      "cursor column":"2","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentUser()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"S0001F02_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"SCR02-
     A                                      _SCCONM","field type":"output field-
     A                                      ","value":{"fieldName":"SCCONM","de-
     A                                      signValue":"[SCCONM]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"414px","cursor column":-
     A                                      "21","top":"110px","cursor row":"1"-
     A                                      ,"css class 2":"top-line","css clas-
     A                                      s 3":"HI","parent tab panel":"S0001-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 4":"profound-conve-
     A                                      rted"},{"id":"constant20","field ty-
     A                                      pe":"output field","left":"778px","-
     A                                      cursor column":"73","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentDate()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"S0001F02_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 3"-
     A                                      :"profound-converted"},{"id":"S0001-
     A                                      F02_SCR02_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor"')
     A                                  1  2HTML(':"default","visibility":"hidd-
     A                                      en","id":"S0001F02_SCR02_BtnHiddenR-
     A                                      efresh","value":"btnRefresh","top":-
     A                                      "125px","response":{"fieldName":"bt-
     A                                      nRefresh","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"id":"SCR02_Q1PGM","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"Q1PGM","designValue":"[Q1-
     A                                      PGM]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none","dataLength":"10"},"css clas-
     A                                      s":"output-field","left":"281px","c-
     A                                      ursor column":"2","top":"130px","cu-
     A                                      rsor row":"2","parent tab panel":"S-
     A                                      0001F02_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCR02_SCPRDS","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field","left":"-
     A                                      414px","cursor column":"21","top":"-
     A                                      130px","cursor row":"2","css class -
     A                                      2":"HI","parent tab panel":"S0001F0-
     A                                      2_SCR02_MainTabPanel","parent tab":-
     A                                      "0","visibility":"hidden","css clas-
     A                                      s 3":"profound-converted"},{"id":"c-
     A                                      onstant21","field type":"output fie-
     A                                      ld","value":"SCR02","css class":"co-
     A                                      nstant","left":"799px","cursor colu-
     A                                      mn":"76","top":"130px","cursor row"-
     A                                      :"2","parent tab panel":"S0001F02_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCR02_SCMODE","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCMODE","designValue":"[SCMODE]"-
     A                                      ,"refField":"PGM","dataType":"refer-
     A                                      ence","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"764px","cu-
     A                                      rsor column":"71","top":"150px","cu-
     A                                      rsor row":"3","css class 2":"HI","p-
     A                                      arent tab panel":"S0001F02_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"S0001F02_SCR02_Bt-
     A                                      nHiddenSearch","value":"btnSearch",-
     A                                      "top":"150px","response":{"fieldNam-
     A                                      e":"btnSearch","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant22","-
     A                                      field type":"output field","value":-
     A                                      "COMPANY #:","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"170px","cursor row":"4","pa-
     A                                      rent tab panel":"S0001F02_SCR02_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR02_SCCO#","field type":"output -
     A                                      field","value":{"fieldName":"SCCO#"-
     A                                      ,"designValue":"[SCCO')
     A                                  1  2HTML('#]","refField":"CO#","dataTyp-
     A                                      e":"reference","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00"},"cs-
     A                                      s class":"output-field","left":"358-
     A                                      px","cursor column":"13","top":"170-
     A                                      px","cursor row":"4","width":"21px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :"HI","parent tab panel":"S0001F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 3":"profound-converted-
     A                                      "},{"id":"SCR02_SCNAME","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCNAME","designValue":"[SCNAME]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"400px","-
     A                                      cursor column":"19","top":"170px","-
     A                                      cursor row":"4","css class 2":"HI",-
     A                                      "parent tab panel":"S0001F02_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"S0001F02_SCR02_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"S0001F02_SCR02_BtnHiddenSyst-
     A                                      emMessages","value":"btnMessage","t-
     A                                      op":"200px","response":{"fieldName"-
     A                                      :"btnMessage","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"S0001F02_SCR02_BtnHiddenWorkSubmi-
     A                                      tJob","value":"btnWrksbmjob","top":-
     A                                      "225px","response":{"fieldName":"bt-
     A                                      nWrkJob","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant23","field -
     A                                      type":"output field","value":"Incom-
     A                                      ing Wats:","css class":"constant","-
     A                                      left":"288px","cursor column":"3","-
     A                                      top":"230px","cursor row":"7","pare-
     A                                      nt tab panel":"S0001F02_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPH1A","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCPH1A","-
     A                                      designValue":"[SCPH1A]","refField":-
     A                                      "AREA","dataType":"reference","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"false","zeroFill":"fa-
     A                                      lse","curSym":"","units":"","negNum-
     A                                      ":"999.00","numBlankFill":"true"},"-
     A                                      left":"414px","cursor')
     A                                  1  2HTML(' column":"21","top":"230px","-
     A                                      cursor row":"7","width":"22px","tex-
     A                                      t align":"right","css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      HI","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 5":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "parent tab panel":"S0001F02_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"i-
     A                                      d":"SCPH1","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCPH1-
     A                                      ","designValue":"[SCPH1]","refField-
     A                                      ":"PHN#","dataType":"reference","fo-
     A                                      rmatting":"Number","numSep":"false"-
     A                                      ,"zeroBalance":"false","zeroFill":"-
     A                                      false","curSym":"","units":"","negN-
     A                                      um":"-999.00","numBlankFill":"true"-
     A                                      ,"edtWrd":"''   -    ''"},"left":"4-
     A                                      49px","cursor column":"26","top":"2-
     A                                      30px","cursor row":"7","width":"57p-
     A                                      x","text align":"right","css class -
     A                                      3":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"HI","customFalse":""},"css c-
     A                                      lass 4":{"fieldName":"N09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"UL","customFalse":""},-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"css class 5":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"PR","customFals-
     A                                      e":""},"set focus":{"fieldName":"46-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"parent tab panel":"S0001F-
     A                                      02_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 6":"profound-conver-
     A                                      ted"},{"id":"constant24","field typ-
     A                                      e":"output field","value":"Incoming-
     A                                       Local:","css class":"constant","le-
     A                                      ft":"288px","cursor column":"3","to-
     A                                      p":"250px","cursor row":"8","parent-
     A                                       tab panel":"S0001F02_SCR02_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCR-
     A                                      02_SCAREA","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SCARE-
     A                                      A","designValue":"[SCAREA]","refFie-
     A                                      ld":"AREA","dataType":"reference","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","numBl')
     A                                  1  2HTML('ankFill":"true"},"left":"414p-
     A                                      x","cursor column":"21","top":"250p-
     A                                      x","cursor row":"8","width":"22px",-
     A                                      "text align":"right","css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"parent tab panel":"S0001F02_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"SCPH2","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      CPH2","designValue":"[SCPH2]","refF-
     A                                      ield":"PHN#","dataType":"reference"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","numBlankFill":"t-
     A                                      rue","edtWrd":"''   -    ''"},"left-
     A                                      ":"449px","cursor column":"26","top-
     A                                      ":"250px","cursor row":"8","width":-
     A                                      "57px","text align":"right","css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 5":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"parent tab panel":"S000-
     A                                      1F02_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 6":"profound-conv-
     A                                      erted"},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"S000-
     A                                      1F02_SCR02_BtnHiddenWorkPrinterOutp-
     A                                      ut","value":"btnWrkprtout","top":"2-
     A                                      50px","response":{"fieldName":"btnW-
     A                                      rkPrnt","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"S000-
     A                                      1F02_SCR02_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","')
     A                                  1  2HTML('formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant25"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Manual Check Numbers   From #:",-
     A                                      "css class":"constant","visibility"-
     A                                      :{"fieldName":"51","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"290px","cursor row":"10","parent -
     A                                      tab panel":"S0001F02_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCCH-
     A                                      K1","field type":"textbox","css cla-
     A                                      ss":"input","css class 2":"textbox"-
     A                                      ,"value":{"fieldName":"SCCHK1","des-
     A                                      ignValue":"[SCCHK1]","refField":"CH-
     A                                      K#","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      999.00","numBlankFill":"true"},"vis-
     A                                      ibility":{"fieldName":"51","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"505px","cursor column":"-
     A                                      34","top":"290px","cursor row":"10"-
     A                                      ,"width":"50px","text align":"right-
     A                                      ","css class 3":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"HI","customFals-
     A                                      e":""},"css class 4":{"fieldName":"-
     A                                      N09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"Cus-
     A                                      tom Values","customTrue":"UL","cust-
     A                                      omFalse":""},"read only":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"css class 5":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"Custom Values","customTrue":"PR-
     A                                      ","customFalse":""},"error message -
     A                                      id":"MCR0700","error message file":-
     A                                      "MMESGG","error message library":"*-
     A                                      LIBL","error condition":{"fieldName-
     A                                      ":"71","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"error messages":"1 message"-
     A                                      ,"description":"CHECK NUMBER","pare-
     A                                      nt tab panel":"S0001F02_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 6":"profound-converted"},{"id":"c-
     A                                      onstant26","field type":"output fie-
     A                                      ld","value":"To#:","css class":"con-
     A                                      stant","visibility":{"fieldName":"5-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"582px","curso-
     A                                      r column":"45","top":"290px","curso-
     A                                      r row":"10","parent tab panel":"S00-
     A                                      01F02_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCCHK2","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCCHK2","designValue":"[SCC-
     A                                      HK2]","refField":"CHK#","dataType":-
     A                                      "reference","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","zeroFill":"false"')
     A                                  1  2HTML(',"curSym":"","units":"","negN-
     A                                      um":"999.00","numBlankFill":"true"}-
     A                                      ,"visibility":{"fieldName":"51","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"617px","cursor colu-
     A                                      mn":"50","top":"290px","cursor row"-
     A                                      :"10","width":"50px","text align":"-
     A                                      right","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"error mes-
     A                                      sage id":"MCR0700","error message f-
     A                                      ile":"MMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"71","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","description":"CHECK NUMBER",-
     A                                      "parent tab panel":"S0001F02_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 6":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"S0001F02_SCR02_-
     A                                      BtnHiddenHelp","value":"btnHelp","t-
     A                                      op":"300px","response":{"fieldName"-
     A                                      :"btnHelp","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant27","fiel-
     A                                      d type":"output field","value":"Nex-
     A                                      t Available Claim Number  :","css c-
     A                                      lass":"constant","visibility":{"fie-
     A                                      ldName":"51","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"288-
     A                                      px","cursor column":"3","top":"310p-
     A                                      x","cursor row":"11","parent tab pa-
     A                                      nel":"S0001F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCCASE","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCCASE","designVal-
     A                                      ue":"[SCCASE]","refField":"CASE","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Number","numSep":"false","zeroBalan-
     A                                      ce":"false","zeroFill":"false","cur-
     A                                      Sym":"","units":"","negNum":"999.00-
     A                                      ","numBlankFill":"true"},"visibilit-
     A                                      y":{"fieldName":"51","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"505px","cursor column":"34","t-
     A                                      op":"310px","cursor row":"11","widt-
     A                                      h":"50px","text align":"right","css-
     A                                       class 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","for')
     A                                  1  2HTML('matting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      error message id":"MCR0513","error -
     A                                      message file":"MMESGG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"72","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      S0001F02_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"constant29","fie-
     A                                      ld type":"output field","value":"IS-
     A                                      O transaction type       :","css cl-
     A                                      ass":"constant","visibility":{"fiel-
     A                                      dName":"51","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"},"left":"582p-
     A                                      x","cursor column":"45","top":"310p-
     A                                      x","cursor row":"11","parent tab pa-
     A                                      nel":"S0001F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCISO","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCISO","designValue-
     A                                      ":"[SCISO]","refField":"ISO","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"upperca-
     A                                      se"},"text transform":"uppercase","-
     A                                      visibility":{"fieldName":"51","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"792px","cursor column-
     A                                      ":"75","top":"310px","cursor row":"-
     A                                      11","width":"8px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"error message id":"MCR0701","erro-
     A                                      r message file":"MMESGG","error mes-
     A                                      sage library":"*LIBL","error condit-
     A                                      ion":{"fieldName":"74","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error messa-
     A                                      ges":"1 message","parent tab panel"-
     A                                      :"S0001F02_SCR02_Main')
     A                                  1  2HTML('TabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant28","field type":"out-
     A                                      put field","value":"ISO assigned co-
     A                                      mpany/group   :","css class":"const-
     A                                      ant","visibility":{"fieldName":"51"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"288px","cursor -
     A                                      column":"3","top":"330px","cursor r-
     A                                      ow":"12","parent tab panel":"S0001F-
     A                                      02_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCCOI","field type":"t-
     A                                      extbox","css class":"input","css cl-
     A                                      ass 2":"textbox","value":{"fieldNam-
     A                                      e":"SCCOI","designValue":"[SCCOI]",-
     A                                      "refField":"COI","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"uppercase"},"text t-
     A                                      ransform":"uppercase","visibility":-
     A                                      {"fieldName":"51","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"512px","cursor column":"35","top"-
     A                                      :"330px","cursor row":"12","width":-
     A                                      "29px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"error mes-
     A                                      sage id":"MCR0500","error message f-
     A                                      ile":"MMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"73","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"1 mes-
     A                                      sage","parent tab panel":"S0001F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant31","field type":-
     A                                      "output field","value":"Section Cod-
     A                                      e, Policy Fee   :","css class":"con-
     A                                      stant","visibility":{"fieldName":"5-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"582px","curso-
     A                                      r column":"45","top":"330px","curso-
     A                                      r row":"12","parent tab panel":"S00-
     A                                      01F02_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPFSC","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCPFSC","designValue":"[SCP-
     A                                      FSC]","refField":"CDE","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase"},"-
     A                                      text transform":"uppe')
     A                                  1  2HTML('rcase","visibility":{"fieldNa-
     A                                      me":"51","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"792px",-
     A                                      "cursor column":"75","top":"330px",-
     A                                      "cursor row":"12","width":"15px","c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"HI","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"read only":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"set focus":{"field-
     A                                      Name":"42","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"parent tab panel-
     A                                      ":"S0001F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 6":"profou-
     A                                      nd-converted"},{"id":"constant30","-
     A                                      field type":"output field","value":-
     A                                      "A/R Trans Code, Policy Fee   :","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"51","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "288px","cursor column":"3","top":"-
     A                                      350px","cursor row":"13","parent ta-
     A                                      b panel":"S0001F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPFAR-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCPFAR","desig-
     A                                      nValue":"[SCPFAR]","refField":"CDE"-
     A                                      ,"dataType":"reference","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      uppercase"},"text transform":"upper-
     A                                      case","visibility":{"fieldName":"51-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"512px","cursor-
     A                                       column":"35","top":"350px","cursor-
     A                                       row":"13","width":"15px","css clas-
     A                                      s 3":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"HI","customFalse":""},"css-
     A                                       class 4":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"read only":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 5":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"PR","customFa-
     A                                      lse":""},"set focus":{"fieldName":"-
     A                                      41","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"parent ta')
     A                                  1  2HTML('b panel":"S0001F02_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 6":"profound-converted"},{"id":"-
     A                                      constant33","field type":"output fi-
     A                                      eld","value":"Policy Trans Code, De-
     A                                      letion:","css class":"constant","vi-
     A                                      sibility":{"fieldName":"51","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"582px","cursor column":-
     A                                      "45","top":"350px","cursor row":"13-
     A                                      ","parent tab panel":"S0001F02_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCTRDL","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      TRDL","designValue":"[SCTRDL]","ref-
     A                                      Field":"CDE","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","visibility":{"fi-
     A                                      eldName":"51","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"79-
     A                                      2px","cursor column":"75","top":"35-
     A                                      0px","cursor row":"13","width":"15p-
     A                                      x","css class 3":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"HI","customFal-
     A                                      se":""},"css class 4":{"fieldName":-
     A                                      "N09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"UL","cus-
     A                                      tomFalse":""},"set focus":{"fieldNa-
     A                                      me":"44","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"parent tab -
     A                                      panel":"S0001F02_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      32","field type":"output field","va-
     A                                      lue":"A/R Trans Code, Cancellation -
     A                                      :","css class":"constant","visibili-
     A                                      ty":{"fieldName":"51","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"288px","cursor column":"3","t-
     A                                      op":"370px","cursor row":"14","pare-
     A                                      nt tab panel":"S0001F02_SCR02_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CCNAR","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCCNAR","-
     A                                      designValue":"[SCCNAR]","refField":-
     A                                      "CDE","dataType":"reference","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"uppercase"},"text transform":"-
     A                                      uppercase","visibility":{"fieldName-
     A                                      ":"51","dataType":"expression","for-
     A                                      matting":"Indicator",')
     A                                  1  2HTML('"indFormat":"visible / hidden-
     A                                      "},"left":"512px","cursor column":"-
     A                                      35","top":"370px","cursor row":"14"-
     A                                      ,"width":"15px","css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"H-
     A                                      I","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"read on-
     A                                      ly":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      set focus":{"fieldName":"43","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"description":"Code","parent tab p-
     A                                      anel":"S0001F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 6":"pr-
     A                                      ofound-converted"},{"id":"constant3-
     A                                      5","field type":"output field","val-
     A                                      ue":"SR Upload Batch Security   :",-
     A                                      "css class":"constant","left":"582p-
     A                                      x","cursor column":"45","top":"370p-
     A                                      x","cursor row":"14","parent tab pa-
     A                                      nel":"S0001F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"SCSRPL","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCSRPL","designVal-
     A                                      ue":"[SCSRPL]","dataType":"zoned","-
     A                                      formatting":"Number","numSep":"fals-
     A                                      e","zeroBalance":"false","zeroFill"-
     A                                      :"false","curSym":"","units":"","ne-
     A                                      gNum":"999.00","dataLength":"3","de-
     A                                      cPos":"0","numBlankFill":"true"},"l-
     A                                      eft":"792px","cursor column":"75","-
     A                                      top":"370px","cursor row":"14","wid-
     A                                      th":"22px","text align":"right","cs-
     A                                      s class 3":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"HI","customFalse":""-
     A                                      },"css class 4":{"fieldName":"N09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"UL","customFal-
     A                                      se":""},"read only":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"parent tab panel":"-
     A                                      S0001F02_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"SCSRPT","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCSRPT","designValue":"[-
     A                                      SCSRPT]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"uppercase","dataLe')
     A                                  1  2HTML('ngth":"1"},"text transform":"-
     A                                      uppercase","left":"820px","cursor c-
     A                                      olumn":"79","top":"370px","cursor r-
     A                                      ow":"14","width":"8px","css class 3-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"HI","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"N09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"UL","customFalse":""},"-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"css class 5":{"fieldName":"09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"PR","customFalse-
     A                                      ":""},"parent tab panel":"S0001F02_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 6":"profound-converted-
     A                                      "},{"id":"constant34","field type":-
     A                                      "output field","value":"A/R Trans C-
     A                                      ode, Reinstatement:","css class":"c-
     A                                      onstant","visibility":{"fieldName":-
     A                                      "51","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"288px","cur-
     A                                      sor column":"3","top":"390px","curs-
     A                                      or row":"15","parent tab panel":"S0-
     A                                      001F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCARRE","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCARRE","designValue":"[SC-
     A                                      ARRE]","refField":"CDE","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","visib-
     A                                      ility":{"fieldName":"51","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"512px","cursor column":"35-
     A                                      ","top":"390px","cursor row":"15","-
     A                                      width":"15px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"45","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      parent tab panel":"S0001F02_SCR02_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant37","field type":"output-
     A                                       field","value":"CA pure rate code -
     A                                               :","css clas')
     A                                  1  2HTML('s":"constant","left":"582px",-
     A                                      "cursor column":"45","top":"390px",-
     A                                      "cursor row":"15","parent tab panel-
     A                                      ":"S0001F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCCART","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","css class 2":"textbox","value":-
     A                                      {"fieldName":"SCCART","designValue"-
     A                                      :"[SCCART]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"3"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"792px","cursor column":"75","top"-
     A                                      :"390px","cursor row":"15","width":-
     A                                      "22px","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"UL",-
     A                                      "customFalse":""},"read only":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"css class 5":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"PR","customFalse":""},"set focus-
     A                                      ":{"fieldName":"52","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"WC30376","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"80","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"S0001F0-
     A                                      2_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 6":"profound-convert-
     A                                      ed"},{"id":"constant36","field type-
     A                                      ":"output field","value":"A/R premi-
     A                                      um adjustment code  :","css class":-
     A                                      "constant","visibility":{"fieldName-
     A                                      ":"50 and 55","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      8px","cursor column":"3","top":"410-
     A                                      px","cursor row":"16","parent tab p-
     A                                      anel":"S0001F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCPBCD","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","val-
     A                                      ue":{"fieldName":"SCPBCD","designVa-
     A                                      lue":"[SCPBCD]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      2"},"text transform":"uppercase","v-
     A                                      isibility":{"fieldName":"50 and 55"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"512px","cursor -
     A                                      column":"35","top":"410px","cursor -
     A                                      row":"16","width":"15px","css class-
     A                                       3":{"fieldName":"09","dataType":"e-
     A                                      xpression","formattin')
     A                                  1  2HTML('g":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"47 and 81","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"error message id":"WC31354","err-
     A                                      or message file":"WMESGG","error me-
     A                                      ssage library":"*LIBL","error condi-
     A                                      tion":{"fieldName":"47 and 82","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"2 messages","error me-
     A                                      ssage id 2":"WCR1130","error messag-
     A                                      e file 2":"WMESGG","error message l-
     A                                      ibrary 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"47 and 83","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"descri-
     A                                      ption":"Adjustment code","parent ta-
     A                                      b panel":"S0001F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt42","field type":"output field","-
     A                                      value":"Print SS# on claim checks  -
     A                                      :","css class":"constant","left":"5-
     A                                      82px","cursor column":"45","top":"4-
     A                                      10px","cursor row":"16","parent tab-
     A                                       panel":"S0001F02_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCPSS#"-
     A                                      ,"field type":"checkbox","css class-
     A                                      ":"input","css class 2":"checkbox",-
     A                                      "value":{"fieldName":"SCPSS#","desi-
     A                                      gnValue":"[SCPSS#]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase","dataLengt-
     A                                      h":"1"},"text transform":"uppercase-
     A                                      ","left":"795px","top":"410px","wid-
     A                                      th":"8px","css class 3":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"HI","cu-
     A                                      stomFalse":""},"css class 4":{"fiel-
     A                                      dName":"N09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"U-
     A                                      L","customFalse":""},"read only":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"css class 5-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"PR","customFalse":""},"set fo-
     A                                      cus":{"fieldName":"25","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"erro-
     A                                      r message":"Valid values are \"Y\" -
     A                                      and blank.","error co')
     A                                  1  2HTML('ndition":{"fieldName":"26","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"1 message","parent -
     A                                      tab panel":"S0001F02_SCR02_MainTabP-
     A                                      anel","parent tab":"0","css class 6-
     A                                      ":"profound-converted","checked val-
     A                                      ue":"Y","unchecked value":" "},{"id-
     A                                      ":"constant38","field type":"output-
     A                                       field","value":"A/R deposit adjust-
     A                                      ment code  :","css class":"constant-
     A                                      ","visibility":{"fieldName":"50 and-
     A                                       55","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"288px","cur-
     A                                      sor column":"3","top":"430px","curs-
     A                                      or row":"17","parent tab panel":"S0-
     A                                      001F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"profound-co-
     A                                      nverted"},{"id":"SCDBCD","field typ-
     A                                      e":"textbox","css class":"input","c-
     A                                      ss class 2":"textbox","value":{"fie-
     A                                      ldName":"SCDBCD","designValue":"[SC-
     A                                      DBCD]","refField":"CDE","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase"},-
     A                                      "text transform":"uppercase","visib-
     A                                      ility":{"fieldName":"50 and 55","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"visible / h-
     A                                      idden"},"left":"512px","cursor colu-
     A                                      mn":"35","top":"430px","cursor row"-
     A                                      :"17","width":"15px","css class 3":-
     A                                      {"fieldName":"09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"Custom Values","customTru-
     A                                      e":"HI","customFalse":""},"css clas-
     A                                      s 4":{"fieldName":"N09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"UL","customFalse":""},"re-
     A                                      ad only":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      css class 5":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"PR","customFalse":-
     A                                      ""},"set focus":{"fieldName":"53 or-
     A                                       48 and 81","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"error message i-
     A                                      d":"WC31384","error message file":"-
     A                                      WMESGG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"48 and 82","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"error messages":"2 me-
     A                                      ssages","error message id 2":"WCR11-
     A                                      30","error message file 2":"WMESGG"-
     A                                      ,"error message library 2":"*LIBL",-
     A                                      "error condition 2":{"fieldName":"4-
     A                                      8 and 83","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"S0001-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant49","field ty-
     A                                      pe":"output field","value":"Provide-
     A                                      r name/addr chg rmk :","css class":-
     A                                      "constant","left":"58')
     A                                  1  2HTML('2px","cursor column":"45","to-
     A                                      p":"430px","cursor row":"17","paren-
     A                                      t tab panel":"S0001F02_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      NMAD","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCNMAD","d-
     A                                      esignValue":"[SCNMAD]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"5"},"text transform":"upperc-
     A                                      ase","left":"792px","cursor column"-
     A                                      :"75","top":"430px","cursor row":"1-
     A                                      7","width":"36px","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"read -
     A                                      only":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"css-
     A                                       class 5":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"PR","customFalse":""}-
     A                                      ,"set focus":{"fieldName":"70","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"error message id":"WCR0505","er-
     A                                      ror message file":"WMESGG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"75","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"2 messages","error message -
     A                                      id 2":"WCR2347","error message file-
     A                                       2":"WMESGG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"76","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"parent tab panel":"-
     A                                      S0001F02_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"constant39","fie-
     A                                      ld type":"output field","value":"A/-
     A                                      R fee adjustment code      :","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"50 and 55","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"le-
     A                                      ft":"288px","cursor column":"3","to-
     A                                      p":"450px","cursor row":"18","paren-
     A                                      t tab panel":"S0001F02_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      FBCD","field type":"textbox","css c-
     A                                      lass":"input","css class 2":"textbo-
     A                                      x","value":{"fieldName":"SCFBCD","d-
     A                                      esignValue":"[SCFBCD]","refField":"-
     A                                      CDE","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase"},"text transform":"u-
     A                                      ppercase","visibility":{"fieldName"-
     A                                      :"50 and 55","dataType":"expression-
     A                                      ","formatting":"Indic')
     A                                  1  2HTML('ator","indFormat":"visible / -
     A                                      hidden"},"left":"512px","cursor col-
     A                                      umn":"35","top":"450px","cursor row-
     A                                      ":"18","width":"15px","css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"HI","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"set focus":{"fieldName":"49 a-
     A                                      nd 81","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"error message id":"W-
     A                                      C31385","error message file":"WMESG-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"49 -
     A                                      and 82","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error messages":"2 message-
     A                                      s","error message id 2":"WCR1130","-
     A                                      error message file 2":"WMESGG","err-
     A                                      or message library 2":"*LIBL","erro-
     A                                      r condition 2":{"fieldName":"49 and-
     A                                       83","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"S0001F02_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant50","field type":"-
     A                                      output field","value":"Print check -
     A                                      order          :","css class":"cons-
     A                                      tant","left":"582px","cursor column-
     A                                      ":"45","top":"450px","cursor row":"-
     A                                      18","parent tab panel":"S0001F02_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCCKFE","field type":"selec-
     A                                      t box","css class":"input","css cla-
     A                                      ss 2":"dropdown","value":{"fieldNam-
     A                                      e":"SCCKFE","dataLength":"1","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"upperc-
     A                                      ase","designValue":"[SCCKFE]"},"tex-
     A                                      t transform":"uppercase","left":"79-
     A                                      5px","top":"450px","width":"140px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"css class 5":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"PR","c-
     A                                      ustomFalse":""},"parent tab panel":-
     A                                      "S0001F02_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css clas')
     A                                  1  2HTML('s 6":"profound-converted","ch-
     A                                      oices":"Check #,Federal #,Number of-
     A                                       Pages","choice values":",Y,P"},{"i-
     A                                      d":"constant40","field type":"outpu-
     A                                      t field","value":"A/R adjustment th-
     A                                      reshold     :","css class":"constan-
     A                                      t","visibility":{"fieldName":"50 an-
     A                                      d 55","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"},"left":"288px","cu-
     A                                      rsor column":"3","top":"470px","cur-
     A                                      sor row":"19","parent tab panel":"S-
     A                                      0001F02_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCTHRL","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCTHRL","designValue":"[S-
     A                                      CTHRL]","dataType":"zoned","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"false","zeroFill":"false-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"5","decPos":-
     A                                      "2","numBlankFill":"true"},"visibil-
     A                                      ity":{"fieldName":"50 and 55","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"},"left":"512px","cursor column-
     A                                      ":"35","top":"470px","cursor row":"-
     A                                      19","width":"50px","text align":"ri-
     A                                      ght","css class 3":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"HI","customF-
     A                                      alse":""},"css class 4":{"fieldName-
     A                                      ":"N09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"UL","c-
     A                                      ustomFalse":""},"read only":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"true / false"},"css class 5":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "PR","customFalse":""},"set focus":-
     A                                      {"fieldName":"81","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"error mes-
     A                                      sage id":"WCR1083","error message f-
     A                                      ile":"WMESGG","error message librar-
     A                                      y":"*LIBL","error condition":{"fiel-
     A                                      dName":"84","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"error messages":"2 mes-
     A                                      sages","error message id 2":"WCR075-
     A                                      0","error message file 2":"WMESGG",-
     A                                      "error message library 2":"*LIBL","-
     A                                      error condition 2":{"fieldName":"85-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"description":"Threshold adjustme-
     A                                      nt lower limit","parent tab panel":-
     A                                      "S0001F02_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 6":"profound-
     A                                      -converted"},{"id":"constant41","fi-
     A                                      eld type":"output field","value":"t-
     A                                      o","css class":"constant","visibili-
     A                                      ty":{"fieldName":"50 and 55","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"568px","')
     A                                  1  2HTML('cursor column":"43","top":"47-
     A                                      0px","cursor row":"19","parent tab -
     A                                      panel":"S0001F02_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCTHRH",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCTHRH","designV-
     A                                      alue":"[SCTHRH]","dataType":"zoned"-
     A                                      ,"formatting":"Number","numSep":"fa-
     A                                      lse","zeroBalance":"false","zeroFil-
     A                                      l":"false","curSym":"","units":"","-
     A                                      negNum":"-999.00","dataLength":"5",-
     A                                      "decPos":"2","numBlankFill":"true"}-
     A                                      ,"visibility":{"fieldName":"50 and -
     A                                      55","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"left":"589px","curs-
     A                                      or column":"46","top":"470px","curs-
     A                                      or row":"19","width":"50px","text a-
     A                                      lign":"right","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"er-
     A                                      ror message id":"WCR1083","error me-
     A                                      ssage file":"WMESGG","error message-
     A                                       library":"*LIBL","error condition"-
     A                                      :{"fieldName":"84","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"2 messages","error message id 2":-
     A                                      "WCR0750","error message file 2":"W-
     A                                      MESGG","error message library 2":"*-
     A                                      LIBL","error condition 2":{"fieldNa-
     A                                      me":"85","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"description":"Threshold a-
     A                                      djustment upper limit","parent tab -
     A                                      panel":"S0001F02_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 6":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      43","field type":"output field","va-
     A                                      lue":"A/R Batch Rpts Sort   (C/E/ )-
     A                                      :","css class":"constant","left":"2-
     A                                      88px","cursor column":"3","top":"49-
     A                                      0px","cursor row":"20","parent tab -
     A                                      panel":"S0001F02_SCR02_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCARSQ",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCARSQ","designV-
     A                                      alue":"[SCARSQ]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase","dataLength":-
     A                                      "1"},"text transform":"uppercase","-
     A                                      left":"512px","cursor column":"35",-
     A                                      "top":"490px","cursor row":"20","wi-
     A                                      dth":"8px","css class')
     A                                  1  2HTML(' 3":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"Custom Values",-
     A                                      "customTrue":"HI","customFalse":""}-
     A                                      ,"css class 4":{"fieldName":"N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"UL","customFals-
     A                                      e":""},"read only":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"css class 5":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"Cu-
     A                                      stom Values","customTrue":"PR","cus-
     A                                      tomFalse":""},"set focus":{"fieldNa-
     A                                      me":"27","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"error message":"Va-
     A                                      lid values are C,E or blank.","erro-
     A                                      r condition":{"fieldName":"28","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","parent ta-
     A                                      b panel":"S0001F02_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 6":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt46","field type":"output field","-
     A                                      value":"C=Check # order","css class-
     A                                      ":"constant","left":"554px","cursor-
     A                                       column":"41","top":"490px","cursor-
     A                                       row":"20","parent tab panel":"S000-
     A                                      1F02_SCR02_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"constant47","field t-
     A                                      ype":"output field","value":"E=Empl-
     A                                      oyer/div # order","css class":"cons-
     A                                      tant","left":"554px","cursor column-
     A                                      ":"41","top":"510px","cursor row":"-
     A                                      21","parent tab panel":"S0001F02_SC-
     A                                      R02_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"constant48","field type":"o-
     A                                      utput field","value":"Blank=Order e-
     A                                      ntered","css class":"constant","lef-
     A                                      t":"554px","cursor column":"41","to-
     A                                      p":"530px","cursor row":"22","paren-
     A                                      t tab panel":"S0001F02_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"id":"Ou-
     A                                      tClmActDart","field type":"output f-
     A                                      ield","css class":"constant","value-
     A                                      ":"Claim Action Plan DARTS Remark C-
     A                                      ode:","cursor row":"20","cursor col-
     A                                      umn":"3","left":"290px","top":"555p-
     A                                      x","parent tab panel":"S0001F02_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted","-
     A                                      width":"260px"},{"id":"TxbClmActDar-
     A                                      t","field type":"textbox","css clas-
     A                                      s":"input","value":{"fieldName":"sc-
     A                                      ActDart","dataLength":"5","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"uppercase-
     A                                      ","designValue":"[scActDart]"},"tex-
     A                                      t transform":"uppercase","read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"set foc-
     A                                      us":{"fieldName":"Ind')
     A                                  1  2HTML('ClmAct","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"true / false"},"cursor row":"1-
     A                                      7","cursor column":"75","left":"565-
     A                                      px","top":"555px","width":"40px","p-
     A                                      arent tab panel":"S0001F02_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"textbox","css class 3":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"Custom Values","customTrue":-
     A                                      "HI","customFalse":""},"css class 4-
     A                                      ":{"fieldName":"N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"UL","customFalse":""},"css c-
     A                                      lass 5":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"PR","customFalse":""},"-
     A                                      css class 6":"profound-converted","-
     A                                      error messages":"2 messages","error-
     A                                       message id":"WCR2347","error messa-
     A                                      ge file":"WMESGG","error message li-
     A                                      brary":"*LIBL","error condition":{"-
     A                                      fieldName":"indacterr","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error enhanc-
     A                                      ed mode":"0","error message id 2":"-
     A                                      WCR0505","error message file 2":"WM-
     A                                      ESGG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"indacterrn","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error enhanced mode-
     A                                       2":"0"},{"id":"constant44","field -
     A                                      type":"output field","value":" ","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "275px","cursor column":"2","top":"-
     A                                      535px","cursor row":"23","css class-
     A                                       2":"BLU","parent tab panel":"S0001-
     A                                      F02_SCR02_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant45","field ty-
     A                                      pe":"output field","value":" ","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      275px","cursor column":"2","top":"5-
     A                                      35px","cursor row":"23","css class -
     A                                      2":"BLU","parent tab panel":"S0001F-
     A                                      02_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF03","field type":"button"-
     A                                      ,"visibility":{"fieldName":"09 or N-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"visi-
     A                                      ble / hidden"},"value":"Exit","shor-
     A                                      tcut key":"F3","left":"14px","top":-
     A                                      "183px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor"')
     A                                  1  2HTML(':"default"},{"id":"btnCF10","-
     A                                      field type":"button","visibility":{-
     A                                      "fieldName":"N09","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"value-
     A                                      ":"Search","shortcut key":"F10","le-
     A                                      ft":"14px","top":"216px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnCF12","fie-
     A                                      ld type":"button","visibility":{"fi-
     A                                      eldName":"09 or N09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"visible / hidden"},"va-
     A                                      lue":"Cancel","shortcut key":"F12",-
     A                                      "left":"14px","top":"249px","width"-
     A                                      :"100px","height":"23px","css class-
     A                                      ":"button","auto arrange":"true","c-
     A                                      ursor":"default"},{"id":"OutEmpCpyC-
     A                                      tl","field type":"output field","cs-
     A                                      s class":"constant","value":"Employ-
     A                                      er Copy Controls :","cursor row":"1-
     A                                      6","cursor column":"45","left":"290-
     A                                      px","top":"585px","parent tab panel-
     A                                      ":"S0001F02_SCR02_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"OutMaintIDt",-
     A                                      "field type":"output field","css cl-
     A                                      ass":"constant","value":"Maintain I-
     A                                      nception Date Default ","cursor row-
     A                                      ":"16","cursor column":"45","left":-
     A                                      "315px","top":"600px","parent tab p-
     A                                      anel":"S0001F02_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"OutMaintN-
     A                                      ew","field type":"output field","cs-
     A                                      s class":"constant","value":"Mainta-
     A                                      in New/Renewal Designation Regardle-
     A                                      ss of Carrier Default","cursor row"-
     A                                      :"16","cursor column":"45","left":"-
     A                                      315px","top":"615px","parent tab pa-
     A                                      nel":"S0001F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"id":"CbxMaintDt-
     A                                      ","field type":"checkbox","css clas-
     A                                      s":"input","value":{"fieldName":"SC-
     A                                      MAINTIDT","dataLength":"1","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"uppercas-
     A                                      e","designValue":"[SCMAINTIDT]"},"t-
     A                                      ext transform":"uppercase","checked-
     A                                       value":"Y","unchecked value":" ","-
     A                                      read only":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"error messages":"1 message","erro-
     A                                      r message":"Valid values are \"Y\" -
     A                                      and blank.","error condition":{"fie-
     A                                      ldName":"26","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"},"left":"795px","top":"-
     A                                      600px","width":"8px","parent tab pa-
     A                                      nel":"S0001F02_SCR02_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"che-
     A                                      ckbox","css class 3":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"HI","custo-
     A                                      mFalse":""},"css class 4":{"fieldNa-
     A                                      me":"N09","dataType":')
     A                                  1  2HTML('"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"css class 5":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"Custom V-
     A                                      alues","customTrue":"PR","customFal-
     A                                      se":""},"css class 6":"profound-con-
     A                                      verted"},{"id":"CbxMaintNew","field-
     A                                       type":"checkbox","css class":"inpu-
     A                                      t","value":{"fieldName":"SCMAINTNEW-
     A                                      ","dataLength":"1","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"uppercase","desi-
     A                                      gnValue":"[SCMAINTNEW]"},"text tran-
     A                                      sform":"uppercase","checked value":-
     A                                      "Y","unchecked value":" ","read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"error -
     A                                      messages":"1 message","error messag-
     A                                      e":"Valid values are \"Y\" and blan-
     A                                      k.","error condition":{"fieldName":-
     A                                      "26","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"left":"795px","top":"615px","-
     A                                      width":"8px","parent tab panel":"S0-
     A                                      001F02_SCR02_MainTabPanel","parent -
     A                                      tab":"0","css class 2":"checkbox","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"css class 5":{"fieldName-
     A                                      ":"09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"PR","cu-
     A                                      stomFalse":""},"css class 6":"profo-
     A                                      und-converted"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            INDACTERR      1A  H
     A            INDACTERRN     1A  H
     A            INDCLMACT      1A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCACTDART      5A  H
     A            SCARSQ         1A  H
     A            SCCART         3A  H
     A            SCCKFE         1A  H
     A            SCMAINTIDT     1A  H
     A            SCMAINTNEW     1A  H
     A            SCNMAD         5A  H
     A            SCPBCD         2A  H
     A            SCPSS#         1A  H
     A            SCSRPL         3S 0H
     A            SCSRPT         1A  H
     A            SCTHRH         5S 2H
     A            SCTHRL         5S 2H
     A            SCAREA    R        H      REFFLD(AREA)
     A            SCARRE    R        H      REFFLD(CDE)
     A            SCCASE    R        H      REFFLD(CASE)
     A            SCCHK1    R        H      REFFLD(CHK#)
     A            SCCHK2    R        H      REFFLD(CHK#)
     A            SCCNAR    R        H      REFFLD(CDE)
     A            SCCO#     R        H      REFFLD(CO#)
     A            SCCOI     R        H      REFFLD(COI)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCDBCD    R        H      REFFLD(CDE)
     A            SCFBCD    R        H      REFFLD(CDE)
     A            SCISO     R        H      REFFLD(ISO)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCNAME    R        H      REFFLD(NAME)
     A            SCPFAR    R        H      REFFLD(CDE)
     A            SCPFSC    R        H      REFFLD(CDE)
     A            SCPH1     R        H      REFFLD(PHN#)
     A            SCPH1A    R        H      REFFLD(AREA)
     A            SCPH2     R        H      REFFLD(PHN#)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCTRDL    R        H      REFFLD(CDE)
     A          R SCR03
     A  20 21 22
     A  23 24 25
     A  26 27 28                            CA01(20 'Response Indicator *IN20')
     A  29 30 31
     A  32 50 51
     A  09 33 36                            CA02(21 'Response Indicator *IN21')
     A  71 76 77
     A  78 79 80
     A  83                                  CA03(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(50 'Response Indicator *IN50')
     A                                      SETOF(51 'Response Indicator *IN51')
     A                                  1  2HTML('QPUIREC46   RROWS      2    C-
     A                                      1    1C2    23 RERRMSG    2    C7  -
     A                                        SCORFBSC30   Valid values are N,E-
     A                                       or blank.E1    3     71RERRMSGID  -
     A                                      5    C6    SCSYCDC7    WC30270C6   -
     A                                       WMESGGC5    *LIBLC0    E1    3    -
     A                                       79RERRMSGID  5    C6    SCSYCDC7  -
     A                                        WCR0503C6    WMESGGC5    *LIBLC0 -
     A                                         E1    3     80RERRMSGID  5    C6-
     A                                          SCARCDC7    WC30259C6    WMESGG-
     A                                      C5    *LIBLC0    E1    6     76 20R-
     A                                      ERRMSGID  5    C6    SCARCDC7    WC-
     A                                      R2213C6    WMESGGC5    *LIBLC0    E-
     A                                      1    6     77 20RERRMSGID  5    C6 -
     A                                         SCARCDC7    WCR0503C6    WMESGGC-
     A                                      5    *LIBLC0    E1    6     78 20RE-
     A                                      RRMSGID  5    C6    SC1AARC7    WC3-
     A                                      0329C6    WMESGGC5    *LIBLC0    E1-
     A                                          6     76 21RERRMSGID  5    C6  -
     A                                        SC1AARC7    WCR2213C6    WMESGGC5-
     A                                          *LIBLC0    E1    6     77 21RER-
     A                                      RMSGID  5    C6    SC1AARC7    WCR0-
     A                                      503C6    WMESGGC5    *LIBLC0    E1 -
     A                                         6     78 21RERRMSGID  5    C6   -
     A                                       SCECARC7    WC30334C6    WMESGGC5 -
     A                                         *LIBLC0    E1    6     76 22RERR-
     A                                      MSGID  5    C6    SCECARC7    WCR22-
     A                                      13C6    WMESGGC5    *LIBLC0    E1  -
     A                                        6     77 22RERRMSGID  5    C6    -
     A                                      SCECARC7    WCR0503C6    WMESGGC5  -
     A                                        *LIBLC0    E1    6     78 22RERRM-
     A                                      SGID  5    C6    SC2AARC7    WC3033-
     A                                      0C6    WMESGGC5    *LIBLC0    E1   -
     A                                       6     76 23RERRMSGID  5    C6    S-
     A                                      C2AARC7    WCR2213C6    WMESGGC5   -
     A                                       *LIBLC0    E1    6     77 23RERRMS-
     A                                      GID  5    C6    SC2AARC7    WCR0503-
     A                                      C6    WMESGGC5    *LIBLC0    E1    -
     A                                      6     78 23RERRMSGID  5    C6    SC-
     A                                      IFARC7    WC30325C6    WMESGGC5    -
     A                                      *LIBLC0    E1    6     76 24RERRMSG-
     A                                      ID  5    C6    SCIFARC7    WCR2213C-
     A                                      6    WMESGGC5    *LIBLC0    E1    6-
     A                                           77 24RERRMSGID  5    C6    SCI-
     A                                      FARC7    WCR0503C6    WMESGGC5    *-
     A                                      LIBLC0    E1    6     78 24RERRMSGI-
     A                                      D  5    C6    SC3AARC7    WC30331C6-
     A                                          WMESGGC5    *LIBLC0    E1    6 -
     A                                          76 25RERRMSGID  5    C6    SC3A-
     A                                      ARC7    WCR2213C6    WMESGGC5    *L-
     A                                      IBLC0    E1    6     77 25RERRMSGID-
     A                                        5    C6    SC3AARC7    WCR0503C6 -
     A                                         WMESGGC5    *LIBLC0    E1    6  -
     A                                         78 25RERRMSGID  5    C6    SCSFA-
     A                                      RC7    WC30326C6    WMESGGC5    *LI-
     A                                      BLC0    E1    6     76 26RERRMSGID -
     A                                       5    C6    SCSFARC7    WCR2213C6  -
     A                                        WMESGGC5    *LIBLC0    E1    6   -
     A                                        77 26RERRMSGID  5    C6    SCSFAR-
     A                                      C7    WCR0503C6    WMESGGC5    *LIB-
     A                                      LC0    E1    6     78 26RERRMSGID  -
     A                                      5    C6    SC4AARC7    WC30332C6   -
     A                                       WMESGGC5    *LIBLC0    E1    6    -
     A                                       76 27RERRMSGID  5    C6    SC4AARC-
     A                                      7    WCR2213C6    WMESGGC5    *LIBL-
     A                                      C0    E1    6     77 27RERRMSGID  5-
     A                                          C6    SC4AARC7    WCR0503C6    -
     A                                      WMESGGC5    *LIBLC0    E1    6     -
     A                                      78 27RERRMSGID  5    C6    SCMFARC7-
     A                                          WC30327C6    WMESGGC5    *LIBLC-
     A                                      0    E1    6     76 28RERRMSGID  5 -
     A                                         C6    SCMFARC7    WCR2')
     A                                  1  2HTML('QPUI213C6    WMESGGC5    *LIB-
     A                                      LC0    E1    6     77 28RERRMSGID  -
     A                                      5    C6    SCMFARC7    WCR0503C6   -
     A                                       WMESGGC5    *LIBLC0    E1    6    -
     A                                       78 28RERRMSGID  5    C6    SC5AARC-
     A                                      7    WC30333C6    WMESGGC5    *LIBL-
     A                                      C0    E1    6     76 29RERRMSGID  5-
     A                                          C6    SC5AARC7    WCR2213C6    -
     A                                      WMESGGC5    *LIBLC0    E1    6     -
     A                                      77 29RERRMSGID  5    C6    SC5AARC7-
     A                                          WCR0503C6    WMESGGC5    *LIBLC-
     A                                      0    E1    6     78 29RERRMSGID  5 -
     A                                         C6    SCTXARC7    WC30328C6    W-
     A                                      MESGGC5    *LIBLC0    E1    6     7-
     A                                      6 30RERRMSGID  5    C6    SCTXARC7 -
     A                                         WCR2213C6    WMESGGC5    *LIBLC0-
     A                                          E1    6     77 30RERRMSGID  5  -
     A                                        C6    SCTXARC7    WCR0503C6    WM-
     A                                      ESGGC5    *LIBLC0    E1    6     78-
     A                                       30RERRMSG    2    C6    SC6AARC36 -
     A                                        Category must be a ''6'' and type-
     A                                       ''Q''.E1    6     76 31RERRMSGID  -
     A                                      5    C6    SC6AARC7    WCR2213C6   -
     A                                       WMESGGC5    *LIBLC0    E1    6    -
     A                                       77 31RERRMSGID  5    C6    SC6AARC-
     A                                      7    WCR0503C6    WMESGGC5    *LIBL-
     A                                      C0    E1    6     78 31RERRMSG    2-
     A                                          C6    SC7AARC36   Category must-
     A                                       be a ''7'' and type ''Q''.E1    6 -
     A                                          76 32RERRMSGID  5    C6    SC7A-
     A                                      ARC7    WCR2213C6    WMESGGC5    *L-
     A                                      IBLC0    E1    6     77 32RERRMSGID-
     A                                        5    C6    SC7AARC7    WCR0503C6 -
     A                                         WMESGGC5    *LIBLC0    E1    6  -
     A                                         78 32RERRMSG    2    C6    SCFYS-
     A                                      MC38   Value must be 1 thru 12, if -
     A                                      populated.E1    3     83RERRMSGID  -
     A                                      5    C13   txtPlanLetterFMSPLNLETER-
     A                                      C6    WMESGGC5    *LIBLC0    FERPLN-
     A                                      LETTERERRMSGID  5    C15   txtPrmTh-
     A                                      resholdFMSPRMTHRSHC6    WMESGGC5   -
     A                                       *LIBLC0    FERPRMTHRSH')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N29","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN31"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN32","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN50","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"set-
     A                                       off 15":{"fieldName":"*IN51","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"retur-
     A                                      n cursor record":{"fieldName":"HREC-
     A                                      ","dataLength":"10","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"none"},"return cursor-
     A                                       field":{"fieldName":"HFLD","dataLe-
     A                                      ngth":"10","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none"},"overlay range":"1-23",-
     A                                      "set off 16":{"fieldName":"erPlnLet-
     A                                      er","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"set off 17":{"fieldName":"erPrm-
     A                                      Thrs","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"set off 18":{"fieldName":"Pln-
     A                                      LtFoucs","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"set off 19":{"fieldName":"-
     A                                      PrmThFoucs","dataType":"indicator",-
     A                                      "formatting":"Indicat')
     A                                  1  2HTML('or","indFormat":"1 / 0"}},"it-
     A                                      ems":[{"id":"SCR03_HFLD","field typ-
     A                                      e":"output field","visibility":"hid-
     A                                      den","value":{"fieldName":"HFLD","d-
     A                                      esignValue":"[HFLD]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      10"},"left":"0px","top":"-30px","cs-
     A                                      s class":"profound-converted"},{"id-
     A                                      ":"SCR03_HREC","field type":"output-
     A                                       field","visibility":"hidden","valu-
     A                                      e":{"fieldName":"HREC","designValue-
     A                                      ":"[HREC]","dataType":"char","forma-
     A                                      tting":"Text","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","textTransfo-
     A                                      rm":"none","dataLength":"10"},"left-
     A                                      ":"0px","top":"-30px","css class":"-
     A                                      profound-converted"},{"id":"S0001F0-
     A                                      2_SCR03_avKeys","field type":"outpu-
     A                                      t field","value":{"fieldName":"AV_K-
     A                                      EYS","dataLength":"1134","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none","des-
     A                                      ignValue":"[AV_KEYS]"},"left":"0px"-
     A                                      ,"top":"0px","visibility":"hidden"}-
     A                                      ,{"id":"S0001F02_SCR03_action","fie-
     A                                      ld type":"html container","white sp-
     A                                      ace":"normal","left":"0px","top":"1-
     A                                      0px","width":"230px","css class":"a-
     A                                      ction-panel-converted","height":"70-
     A                                      0px","html":"<div class=\"top\"></d-
     A                                      iv><div class=\"imagetop\"><img src-
     A                                      =\"/profoundui/userdata/images/bar_-
     A                                      top.png\" /></div><div class=\"menu-
     A                                      links\"></div><div class=\"imagebot-
     A                                      tom\"><img src=\"/profoundui/userda-
     A                                      ta/images/bar_bottom.png\" /></div>-
     A                                      <div class=\"bottom\"></div>"},{"fi-
     A                                      eld type":"panel","panel style":"Tr-
     A                                      ansformButtonBar","id":"S0001F02_SC-
     A                                      R03_ButtonBar","top":"35px","left":-
     A                                      "1036px","width":"187px","height":"-
     A                                      28px","css class":"stationary","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1040-
     A                                      px","id":"S0001F02_SCR03_BtnSave","-
     A                                      tool tip":"Save","onclick":"SystemT-
     A                                      oolbarSave","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/save.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1066px","id":"S0')
     A                                  1  2HTML('001F02_SCR03_BtnRefresh","too-
     A                                      l tip":"Refresh","onclick":"SystemT-
     A                                      oolbarRefresh","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/refresh.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1092px","id":"S0001F02_S-
     A                                      CR03_BtnSearch","tool tip":"Search"-
     A                                      ,"onclick":"SystemToolbarSearch","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/search.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1118px"-
     A                                      ,"id":"S0001F02_SCR03_BtnDiaryItems-
     A                                      ","tool tip":"Diary/Work Items - ID-
     A                                      ARTS","onclick":"SystemToolbarDiary-
     A                                      ","background image":{"fieldName":"-
     A                                      DryIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1144px","i-
     A                                      d":"S0001F02_SCR03_BtnSystemMessage-
     A                                      s","tool tip":"System Messages","on-
     A                                      click":"SystemToolbarMessages","bac-
     A                                      kground image":{"fieldName":"MsgIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1196px","id":"S0-
     A                                      001F02_SCR03_BtnHelp","tool tip":"H-
     A                                      elp","onclick":"SystemToolbarHelp",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/help.png-
     A                                      '')"},{"id":"S0001F02')
     A                                  1  2HTML('_SCR03_ImgSysToolBottom","fie-
     A                                      ld type":"image","image source":"/p-
     A                                      rofoundui/userdata/images/systool/b-
     A                                      utbarbot.png","left":"1036px","top"-
     A                                      :"64px","width":"187px","locked in -
     A                                      place":"true","css class":"stationa-
     A                                      ry","visibility":"hidden"},{"id":"S-
     A                                      0001F02_SCR03_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"active -
     A                                      tab":"0","left":"250px","top":"70px-
     A                                      ","width":"970px","height":"657px",-
     A                                      "z index":"8","locked in place":"tr-
     A                                      ue","css class":"tab-panel","css cl-
     A                                      ass 2":"stationary"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"S0001F02_SCR03_BtnHiddenSa-
     A                                      ve","value":"btnSave","top":"100px"-
     A                                      ,"response":{"fieldName":"btnSave",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant51","field type":"ou-
     A                                      tput field","left":"281px","cursor -
     A                                      column":"2","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentUser()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"S0001F02_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"SCR03_SCCONM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCONM","designValu-
     A                                      e":"[SCCONM]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","css class 3":"HI-
     A                                      ","parent tab panel":"S0001F02_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 4":"profound-converted"},{-
     A                                      "id":"constant52","field type":"out-
     A                                      put field","left":"778px","cursor c-
     A                                      olumn":"73","top":"110px","cursor r-
     A                                      ow":"1","css class":"top-line","val-
     A                                      ue":"js: currentDate()","css class -
     A                                      2":"output-field","parent tab panel-
     A                                      ":"S0001F02_SCR03_MainTabPanel","pa-
     A                                      rent tab":"0","css class 3":"profou-
     A                                      nd-converted"},{"id":"S0001F02_SCR0-
     A                                      3_fkeyMenu","field type":"menu","le-
     A                                      ft":"10px","top":"120px","height":"-
     A                                      350px","width":"230px","hover backg-
     A                                      round color":"#9AAA61","hover text -
     A                                      color":"#FFFFFF","border color":"#4-
     A                                      C6106","menu option indent":"10px",-
     A                                      "background color":"#758B27","css c-
     A                                      lass":"action-menu","css class 2":"-
     A                                      stationary","z index":"101"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","c')
     A                                  1  2HTML('ss class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"S0001F02_SCR03_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCR03_Q1PGM","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"Q1PGM","designValue":"[Q1PGM]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none","-
     A                                      dataLength":"10"},"css class":"outp-
     A                                      ut-field","left":"281px","cursor co-
     A                                      lumn":"2","top":"130px","cursor row-
     A                                      ":"2","parent tab panel":"S0001F02_-
     A                                      SCR03_MainTabPanel","parent tab":"0-
     A                                      ","css class 2":"profound-converted-
     A                                      "},{"id":"SCR03_SCPRDS","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPRDS","designValue":"[SCPRDS]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"414px","-
     A                                      cursor column":"21","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "parent tab panel":"S0001F02_SCR03_-
     A                                      MainTabPanel","parent tab":"0","vis-
     A                                      ibility":"hidden","css class 3":"pr-
     A                                      ofound-converted"},{"id":"constant5-
     A                                      3","field type":"output field","val-
     A                                      ue":"SCR03","css class":"constant",-
     A                                      "left":"799px","cursor column":"76"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"S0001F02_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCR03_SCMODE","field type":"output-
     A                                       field","value":{"fieldName":"SCMOD-
     A                                      E","designValue":"[SCMODE]","refFie-
     A                                      ld":"PGM","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none"},"css class":"outpu-
     A                                      t-field","left":"764px","cursor col-
     A                                      umn":"71","top":"150px","cursor row-
     A                                      ":"3","css class 2":"HI","parent ta-
     A                                      b panel":"S0001F02_SCR03_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"S0001F02_SCR03_BtnHiddenS-
     A                                      earch","value":"btnSearch","top":"1-
     A                                      50px","response":{"fieldName":"btnS-
     A                                      earch","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"S0001-
     A                                      F02_SCR03_BtnHiddenDiaryItems","val-
     A                                      ue":"btnDiary","top":"175px","respo-
     A                                      nse":{"fieldName":"btnDiary","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1')
     A                                  1  2HTML(' / 0"}},{"id":"constant54","f-
     A                                      ield type":"output field","value":"-
     A                                      Return fund batch edit sort sequenc-
     A                                      e (N/E/  ):","css class":"constant"-
     A                                      ,"left":"295px","cursor column":"4"-
     A                                      ,"top":"190px","cursor row":"5","pa-
     A                                      rent tab panel":"S0001F02_SCR03_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "SCORFBS","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCORFB-
     A                                      S","designValue":"[SCORFBS]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"uppercase","-
     A                                      dataLength":"1"},"text transform":"-
     A                                      uppercase","left":"624px","cursor c-
     A                                      olumn":"51","top":"190px","cursor r-
     A                                      ow":"5","width":"8px","css class 3"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"css cl-
     A                                      ass 4":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"HI","customFalse":""},"r-
     A                                      ead only":{"fieldName":"09","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 5":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"PR","customFalse"-
     A                                      :""},"error message":"Valid values -
     A                                      are N,E or blank.","error condition-
     A                                      ":{"fieldName":"71","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"1 message","parent tab panel":"S-
     A                                      0001F02_SCR03_MainTabPanel","parent-
     A                                       tab":"0","css class 6":"profound-c-
     A                                      onverted"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"S-
     A                                      0001F02_SCR03_BtnHiddenSystemMessag-
     A                                      es","value":"btnMessage","top":"200-
     A                                      px","response":{"fieldName":"btnMes-
     A                                      sage","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"S0001F-
     A                                      02_SCR03_BtnHiddenWorkSubmitJob","v-
     A                                      alue":"btnWrksbmjob","top":"225px",-
     A                                      "response":{"fieldName":"btnWrkJob"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant55","field type":"o-
     A                                      utput field","value":"Default A/R b-
     A                                      atch system code:","css class":"con-
     A                                      stant","visibility":{"fieldName":"3-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"295px","curso-
     A                                      r column":"4","top":"230px","cursor-
     A                                       row":"7","parent tab')
     A                                  1  2HTML(' panel":"S0001F02_SCR03_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CSYCD","field type":"textbox","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","value":{"fieldName":"SCSYCD","-
     A                                      designValue":"[SCSYCD]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase","dataL-
     A                                      ength":"2"},"text transform":"upper-
     A                                      case","visibility":{"fieldName":"36-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"left":"512px","cursor-
     A                                       column":"35","top":"230px","cursor-
     A                                       row":"7","width":"15px","css class-
     A                                       3":"HI","css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 5":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"set focus":{-
     A                                      "fieldName":"51","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"error mess-
     A                                      age id":"WC30270","error message fi-
     A                                      le":"WMESGG","error message library-
     A                                      ":"*LIBL","error condition":{"field-
     A                                      Name":"79","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error messages":"2 mess-
     A                                      ages","error message id 2":"WCR0503-
     A                                      ","error message file 2":"WMESGG","-
     A                                      error message library 2":"*LIBL","e-
     A                                      rror condition 2":{"fieldName":"80"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"parent tab panel":"S0001F02_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 6":"profound-converted"},{"-
     A                                      id":"constant56","field type":"outp-
     A                                      ut field","value":"A/R Payment Code-
     A                                      s for EFT Premium Processing","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"36","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"29-
     A                                      5px","cursor column":"4","top":"250-
     A                                      px","cursor row":"8","parent tab pa-
     A                                      nel":"S0001F02_SCR03_MainTabPanel",-
     A                                      "parent tab":"0","css class 2":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"S0001F02_SCR03_BtnHiddenWorkP-
     A                                      rinterOutput","value":"btnWrkprtout-
     A                                      ","top":"250px","response":{"fieldN-
     A                                      ame":"btnWrkPrnt","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"constant57-
     A                                      ","field type":"output field","valu-
     A                                      e":"Premium billing/adjustments:","-
     A                                      css class":"constant"')
     A                                  1  2HTML(',"visibility":{"fieldName":"3-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"310px","curso-
     A                                      r column":"6","top":"270px","cursor-
     A                                       row":"9","parent tab panel":"S0001-
     A                                      F02_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCARCD","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCARCD","designValue":"[SCARC-
     A                                      D]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"2"},"text tr-
     A                                      ansform":"uppercase","visibility":{-
     A                                      "fieldName":"36","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "512px","cursor column":"35","top":-
     A                                      "270px","cursor row":"9","width":"1-
     A                                      5px","css class 3":"HI","css class -
     A                                      4":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"50 and -
     A                                      20","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"error message id":"WC30-
     A                                      259","error message file":"WMESGG",-
     A                                      "error message library":"*LIBL","er-
     A                                      ror condition":{"fieldName":"76 and-
     A                                       20","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"error messages":"3 messages",-
     A                                      "error message id 2":"WCR2213","err-
     A                                      or message file 2":"WMESGG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"77 and 20-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error message id 3":"WCR0503","e-
     A                                      rror message file 3":"WMESGG","erro-
     A                                      r message library 3":"*LIBL","error-
     A                                       condition 3":{"fieldName":"78 and -
     A                                      20","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"parent tab panel":"S0001F02_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"constant58","field type":"o-
     A                                      utput field","value":"1st assessmen-
     A                                      t:","css class":"constant","visibil-
     A                                      ity":{"fieldName":"36","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"561px","cursor column":"42",-
     A                                      "top":"270px","cursor row":"9","par-
     A                                      ent tab panel":"S0001F02_SCR03_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SC1AAR","field type":"textbox","css-
     A                                       class":"input","css ')
     A                                  1  2HTML('class 2":"textbox","value":{"-
     A                                      fieldName":"SC1AAR","designValue":"-
     A                                      [SC1AAR]","dataType":"char","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"uppercase","dataLength":"2"},"t-
     A                                      ext transform":"uppercase","visibil-
     A                                      ity":{"fieldName":"36","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      left":"673px","cursor column":"58",-
     A                                      "top":"270px","cursor row":"9","wid-
     A                                      th":"15px","css class 3":{"fieldNam-
     A                                      e":"09","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      Custom Values","customTrue":"HI","c-
     A                                      ustomFalse":""},"css class 4":{"fie-
     A                                      ldName":"N09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      UL","customFalse":""},"read only":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"css class -
     A                                      5":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values","custom-
     A                                      True":"PR","customFalse":""},"set f-
     A                                      ocus":{"fieldName":"50 and 21","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"true / false-
     A                                      "},"error message id":"WC30329","er-
     A                                      ror message file":"WMESGG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"76 and 21","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror messages":"3 messages","error m-
     A                                      essage id 2":"WCR2213","error messa-
     A                                      ge file 2":"WMESGG","error message -
     A                                      library 2":"*LIBL","error condition-
     A                                       2":{"fieldName":"77 and 21","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       message id 3":"WCR0503","error mes-
     A                                      sage file 3":"WMESGG","error messag-
     A                                      e library 3":"*LIBL","error conditi-
     A                                      on 3":{"fieldName":"78 and 21","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"par-
     A                                      ent tab panel":"S0001F02_SCR03_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 6":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"S0001F02_SCR03_BtnH-
     A                                      iddenImageQueue","value":"btnImgQue-
     A                                      ","top":"275px","response":{"fieldN-
     A                                      ame":"btnImgQue","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"id":"constant59"-
     A                                      ,"field type":"output field","value-
     A                                      ":"Expense constant           :","c-
     A                                      ss class":"constant","visibility":{-
     A                                      "fieldName":"36","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "309px","cursor column":"6","top":"-
     A                                      290px","cursor row":"10","parent ta-
     A                                      b panel":"S0001F02_SC')
     A                                  1  2HTML('R03_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCECAR","field type":-
     A                                      "textbox","css class":"input","css -
     A                                      class 2":"textbox","value":{"fieldN-
     A                                      ame":"SCECAR","designValue":"[SCECA-
     A                                      R]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"up-
     A                                      percase","dataLength":"2"},"text tr-
     A                                      ansform":"uppercase","visibility":{-
     A                                      "fieldName":"36","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"left":-
     A                                      "512px","cursor column":"35","top":-
     A                                      "290px","cursor row":"10","width":"-
     A                                      15px","css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"HI","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"read only":{"fiel-
     A                                      dName":"09","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"css class 5":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"PR","customFalse":""},"set focus"-
     A                                      :{"fieldName":"50 and 22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"e-
     A                                      rror message id":"WC30334","error m-
     A                                      essage file":"WMESGG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"76 and 22","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"error m-
     A                                      essages":"3 messages","error messag-
     A                                      e id 2":"WCR2213","error message fi-
     A                                      le 2":"WMESGG","error message libra-
     A                                      ry 2":"*LIBL","error condition 2":{-
     A                                      "fieldName":"77 and 22","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error mess-
     A                                      age id 3":"WCR0503","error message -
     A                                      file 3":"WMESGG","error message lib-
     A                                      rary 3":"*LIBL","error condition 3"-
     A                                      :{"fieldName":"78 and 22","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"parent t-
     A                                      ab panel":"S0001F02_SCR03_MainTabPa-
     A                                      nel","parent tab":"0","css class 6"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant60","field type":"output field",-
     A                                      "value":"2nd assessment:","css clas-
     A                                      s":"constant","visibility":{"fieldN-
     A                                      ame":"36","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"561px"-
     A                                      ,"cursor column":"42","top":"290px"-
     A                                      ,"cursor row":"10","parent tab pane-
     A                                      l":"S0001F02_SCR03_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SC2AAR","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SC2AAR","designValue-
     A                                      ":"[SC2AAR]","dataTyp')
     A                                  1  2HTML('e":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"2"},"text transfor-
     A                                      m":"uppercase","visibility":{"field-
     A                                      Name":"36","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"673px-
     A                                      ","cursor column":"58","top":"290px-
     A                                      ","cursor row":"10","width":"15px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 5":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"50 and 23","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"WC30330","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"76 and 23","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"3 messages","error message id 2-
     A                                      ":"WCR2213","error message file 2":-
     A                                      "WMESGG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"77 and 23","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error message id-
     A                                       3":"WCR0503","error message file 3-
     A                                      ":"WMESGG","error message library 3-
     A                                      ":"*LIBL","error condition 3":{"fie-
     A                                      ldName":"78 and 23","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"parent tab pan-
     A                                      el":"S0001F02_SCR03_MainTabPanel","-
     A                                      parent tab":"0","css class 6":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"S0001F02_SCR03_BtnHiddenHelp",-
     A                                      "value":"btnHelp","top":"300px","re-
     A                                      sponse":{"fieldName":"btnHelp","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant61","field type":"output-
     A                                       field","value":"Installment fees  -
     A                                               :","css class":"constant",-
     A                                      "visibility":{"fieldName":"36","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"309px","cursor colum-
     A                                      n":"6","top":"310px","cursor row":"-
     A                                      11","parent tab panel":"S0001F02_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCIFAR","fiel')
     A                                  1  2HTML('d type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCIFAR","design-
     A                                      Value":"[SCIFAR]","dataType":"char"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase","dataLength"-
     A                                      :"2"},"text transform":"uppercase",-
     A                                      "visibility":{"fieldName":"36","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"512px","cursor colum-
     A                                      n":"35","top":"310px","cursor row":-
     A                                      "11","width":"15px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"set focus":{"fieldName":"50 and-
     A                                       24","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WC3-
     A                                      0325","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"76 an-
     A                                      d 24","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"3 messages"-
     A                                      ,"error message id 2":"WCR2213","er-
     A                                      ror message file 2":"WMESGG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"77 and 2-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 3":"WCR0503","-
     A                                      error message file 3":"WMESGG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"78 and-
     A                                       24","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"S0001F02_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant62","field type":"-
     A                                      output field","value":"3rd assessme-
     A                                      nt:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"36","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"561px","cursor column":"42"-
     A                                      ,"top":"310px","cursor row":"11","p-
     A                                      arent tab panel":"S0001F02_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SC3AAR","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SC3AAR-
     A                                      ","designValue":"[SC3AAR]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"')
     A                                  1  2HTML('uppercase","dataLength":"2"},-
     A                                      "text transform":"uppercase","visib-
     A                                      ility":{"fieldName":"36","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"left":"673px","cursor column":"58-
     A                                      ","top":"310px","cursor row":"11","-
     A                                      width":"15px","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"50 and 25","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"error message id":"WC30331",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"76 and 25",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"3 messages","erro-
     A                                      r message id 2":"WCR2213","error me-
     A                                      ssage file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"77 and 25","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 3":"WCR0503","error -
     A                                      message file 3":"WMESGG","error mes-
     A                                      sage library 3":"*LIBL","error cond-
     A                                      ition 3":{"fieldName":"78 and 25","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"S0001F02_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant63","field type":"output-
     A                                       field","value":"Safety fees       -
     A                                               :","css class":"constant",-
     A                                      "visibility":{"fieldName":"36","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"309px","cursor colum-
     A                                      n":"6","top":"330px","cursor row":"-
     A                                      12","parent tab panel":"S0001F02_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCSFAR","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCSFAR","designValue":"[SCSFAR]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"2"},"text transfor-
     A                                      m":"uppercase","visibility":{"field-
     A                                      Name":"36","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"510px-
     A                                      ","cursor column":"35')
     A                                  1  2HTML('","top":"330px","cursor row":-
     A                                      "12","width":"15px","css class 3":{-
     A                                      "fieldName":"09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"HI","customFalse":""},"css class-
     A                                       4":{"fieldName":"N09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"UL","customFalse":""},"rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"set focus":{"fieldName":"50 and-
     A                                       26","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WC3-
     A                                      0326","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"76 an-
     A                                      d 26","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"3 messages"-
     A                                      ,"error message id 2":"WCR2213","er-
     A                                      ror message file 2":"WMESGG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"77 and 2-
     A                                      6","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 3":"WCR0503","-
     A                                      error message file 3":"WMESGG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"78 and-
     A                                       26","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"S0001F02_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant64","field type":"-
     A                                      output field","value":"4th assessme-
     A                                      nt:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"36","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"561px","cursor column":"42"-
     A                                      ,"top":"330px","cursor row":"12","p-
     A                                      arent tab panel":"S0001F02_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SC4AAR","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SC4AAR-
     A                                      ","designValue":"[SC4AAR]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"2"},"text transform":"up-
     A                                      percase","visibility":{"fieldName":-
     A                                      "36","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"673px","cur-
     A                                      sor column":"58","top":"330px","cur-
     A                                      sor row":"12","width":"15px","css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      css class 4":{"fieldN')
     A                                  1  2HTML('ame":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 5":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"se-
     A                                      t focus":{"fieldName":"50 and 27","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"error message id":"WC30332",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"76 and 27",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"3 messages","erro-
     A                                      r message id 2":"WCR2213","error me-
     A                                      ssage file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"77 and 27","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 3":"WCR0503","error -
     A                                      message file 3":"WMESGG","error mes-
     A                                      sage library 3":"*LIBL","error cond-
     A                                      ition 3":{"fieldName":"78 and 27","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"S0001F02_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant65","field type":"output-
     A                                       field","value":"Membership fees   -
     A                                               :","css class":"constant",-
     A                                      "visibility":{"fieldName":"36","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"309px","cursor colum-
     A                                      n":"6","top":"350px","cursor row":"-
     A                                      13","parent tab panel":"S0001F02_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCMFAR","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCMFAR","designValue":"[SCMFAR]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"2"},"text transfor-
     A                                      m":"uppercase","visibility":{"field-
     A                                      Name":"36","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"512px-
     A                                      ","cursor column":"35","top":"350px-
     A                                      ","cursor row":"13","width":"15px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","')
     A                                  1  2HTML('indFormat":"true / false"},"c-
     A                                      ss class 5":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"set focus":{"fieldName":"50 and-
     A                                       28","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"error message id":"WC3-
     A                                      0327","error message file":"WMESGG"-
     A                                      ,"error message library":"*LIBL","e-
     A                                      rror condition":{"fieldName":"76 an-
     A                                      d 28","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"3 messages"-
     A                                      ,"error message id 2":"WCR2213","er-
     A                                      ror message file 2":"WMESGG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"77 and 2-
     A                                      8","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 3":"WCR0503","-
     A                                      error message file 3":"WMESGG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"78 and-
     A                                       28","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"S0001F02_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant66","field type":"-
     A                                      output field","value":"5th assessme-
     A                                      nt:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"36","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"561px","cursor column":"42"-
     A                                      ,"top":"350px","cursor row":"13","p-
     A                                      arent tab panel":"S0001F02_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SC5AAR","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SC5AAR-
     A                                      ","designValue":"[SC5AAR]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"2"},"text transform":"up-
     A                                      percase","visibility":{"fieldName":-
     A                                      "36","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"673px","cur-
     A                                      sor column":"58","top":"350px","cur-
     A                                      sor row":"13","width":"15px","css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"set focus":{"fieldName-
     A                                      ":"50 and 29","dataTy')
     A                                  1  2HTML('pe":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"error message id":"WC30333",-
     A                                      "error message file":"WMESGG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"76 and 29",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "error messages":"3 messages","erro-
     A                                      r message id 2":"WCR2213","error me-
     A                                      ssage file 2":"WMESGG","error messa-
     A                                      ge library 2":"*LIBL","error condit-
     A                                      ion 2":{"fieldName":"77 and 29","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"er-
     A                                      ror message id 3":"WCR0503","error -
     A                                      message file 3":"WMESGG","error mes-
     A                                      sage library 3":"*LIBL","error cond-
     A                                      ition 3":{"fieldName":"78 and 29","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      parent tab panel":"S0001F02_SCR03_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 6":"profound-converted"},{"id-
     A                                      ":"constant67","field type":"output-
     A                                       field","value":"State tax         -
     A                                               :","css class":"constant",-
     A                                      "visibility":{"fieldName":"36","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"309px","cursor colum-
     A                                      n":"6","top":"370px","cursor row":"-
     A                                      14","parent tab panel":"S0001F02_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCTXAR","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCTXAR","designValue":"[SCTXAR]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"2"},"text transfor-
     A                                      m":"uppercase","visibility":{"field-
     A                                      Name":"36","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"512px-
     A                                      ","cursor column":"35","top":"370px-
     A                                      ","cursor row":"14","width":"15px",-
     A                                      "css class 3":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"HI","customFalse"-
     A                                      :""},"css class 4":{"fieldName":"N0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"UL","custom-
     A                                      False":""},"read only":{"fieldName"-
     A                                      :"09","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"tr-
     A                                      ue / false"},"css class 5":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"PR",-
     A                                      "customFalse":""},"set focus":{"fie-
     A                                      ldName":"50 and 30","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"error m-
     A                                      essage id":"WC30328","error message-
     A                                       file":"WMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"76 and 30",')
     A                                  1  2HTML('"dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"3 messages"-
     A                                      ,"error message id 2":"WCR2213","er-
     A                                      ror message file 2":"WMESGG","error-
     A                                       message library 2":"*LIBL","error -
     A                                      condition 2":{"fieldName":"77 and 3-
     A                                      0","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error message id 3":"WCR0503","-
     A                                      error message file 3":"WMESGG","err-
     A                                      or message library 3":"*LIBL","erro-
     A                                      r condition 3":{"fieldName":"78 and-
     A                                       30","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"parent tab panel":"S0001F02_S-
     A                                      CR03_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 6":"profound-converted"-
     A                                      },{"id":"constant68","field type":"-
     A                                      output field","value":"6th assessme-
     A                                      nt:","css class":"constant","visibi-
     A                                      lity":{"fieldName":"36","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"visible / hidden"},-
     A                                      "left":"561px","cursor column":"42"-
     A                                      ,"top":"370px","cursor row":"14","p-
     A                                      arent tab panel":"S0001F02_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SC6AAR","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SC6AAR-
     A                                      ","designValue":"[SC6AAR]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","textTransform":"uppercase","da-
     A                                      taLength":"2"},"text transform":"up-
     A                                      percase","visibility":{"fieldName":-
     A                                      "36","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"},"left":"673px","cur-
     A                                      sor column":"58","top":"370px","cur-
     A                                      sor row":"14","width":"15px","css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"read only":{"fieldName":"09",-
     A                                      "dataType":"expression","formatting-
     A                                      ":"Indicator","indFormat":"true / f-
     A                                      alse"},"css class 5":{"fieldName":"-
     A                                      09","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"Cust-
     A                                      om Values","customTrue":"PR","custo-
     A                                      mFalse":""},"set focus":{"fieldName-
     A                                      ":"50 and 31","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"error message-
     A                                      ":"Category must be a ''''6'''' and-
     A                                       type ''''Q''''.","error condition"-
     A                                      :{"fieldName":"76 and 31","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"3 messages","error message-
     A                                       id 2":"WCR2213","error message fil-
     A                                      e 2":"WMESGG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"77 and 31')
     A                                  1  2HTML('","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"error message id 3":"WCR05-
     A                                      03","error message file 3":"WMESGG"-
     A                                      ,"error message library 3":"*LIBL",-
     A                                      "error condition 3":{"fieldName":"7-
     A                                      8 and 31","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"parent tab panel":"S0001-
     A                                      F02_SCR03_MainTabPanel","parent tab-
     A                                      ":"0","css class 6":"profound-conve-
     A                                      rted"},{"id":"constant69","field ty-
     A                                      pe":"output field","value":"7th ass-
     A                                      essment:","css class":"constant","v-
     A                                      isibility":{"fieldName":"36","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"561px","cursor column"-
     A                                      :"42","top":"390px","cursor row":"1-
     A                                      5","parent tab panel":"S0001F02_SCR-
     A                                      03_MainTabPanel","parent tab":"0","-
     A                                      css class 2":"profound-converted"},-
     A                                      {"id":"SC7AAR","field type":"textbo-
     A                                      x","css class":"input","css class 2-
     A                                      ":"textbox","value":{"fieldName":"S-
     A                                      C7AAR","designValue":"[SC7AAR]","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","textTransform":"uppercase-
     A                                      ","dataLength":"2"},"text transform-
     A                                      ":"uppercase","visibility":{"fieldN-
     A                                      ame":"36","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"},"left":"673px"-
     A                                      ,"cursor column":"58","top":"390px"-
     A                                      ,"cursor row":"15","width":"15px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"UL","customF-
     A                                      alse":""},"read only":{"fieldName":-
     A                                      "09","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"css class 5":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"PR","-
     A                                      customFalse":""},"set focus":{"fiel-
     A                                      dName":"50 and 32","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"error me-
     A                                      ssage":"Category must be a ''''7'''-
     A                                      ' and type ''''Q''''.","error condi-
     A                                      tion":{"fieldName":"76 and 32","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"3 messages","error me-
     A                                      ssage id 2":"WCR2213","error messag-
     A                                      e file 2":"WMESGG","error message l-
     A                                      ibrary 2":"*LIBL","error condition -
     A                                      2":{"fieldName":"77 and 32","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      message id 3":"WCR0503","error mess-
     A                                      age file 3":"WMESGG","error message-
     A                                       library 3":"*LIBL","error conditio-
     A                                      n 3":{"fieldName":"78 and 32","data-
     A                                      Type":"expression","f')
     A                                  1  2HTML('ormatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"parent tab panel":"-
     A                                      S0001F02_SCR03_MainTabPanel","paren-
     A                                      t tab":"0","css class 6":"profound--
     A                                      converted"},{"id":"constant70","fie-
     A                                      ld type":"output field","value":"EF-
     A                                      T batch","css class":"constant","vi-
     A                                      sibility":{"fieldName":"36","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"left":"295px","cursor column":-
     A                                      "4","top":"410px","cursor row":"16"-
     A                                      ,"parent tab panel":"S0001F02_SCR03-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"SCACHL","field type":"textbox"-
     A                                      ,"css class":"input","css class 2":-
     A                                      "textbox","value":{"fieldName":"SCA-
     A                                      CHL","designValue":"[SCACHL]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"fa-
     A                                      lse","zeroFill":"false","curSym":""-
     A                                      ,"units":"","negNum":"999.00","data-
     A                                      Length":"3","decPos":"0","numBlankF-
     A                                      ill":"true"},"visibility":{"fieldNa-
     A                                      me":"36","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"left":"512px",-
     A                                      "cursor column":"35","top":"410px",-
     A                                      "cursor row":"16","width":"22px","t-
     A                                      ext align":"right","css class 3":{"-
     A                                      fieldName":"09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"HI","customFalse":""},"css class -
     A                                      4":{"fieldName":"N09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"set focus":{"fieldName":"33","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"parent tab panel":"S0001F02_SC-
     A                                      R03_MainTabPanel","parent tab":"0",-
     A                                      "css class 6":"profound-converted"}-
     A                                      ,{"id":"SCACHT","field type":"textb-
     A                                      ox","css class":"input","css class -
     A                                      2":"textbox","value":{"fieldName":"-
     A                                      SCACHT","designValue":"[SCACHT]","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","textTransform":"uppercas-
     A                                      e","dataLength":"1"},"text transfor-
     A                                      m":"uppercase","visibility":{"field-
     A                                      Name":"36","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"left":"540px-
     A                                      ","cursor column":"39","top":"410px-
     A                                      ","cursor row":"16","width":"8px","-
     A                                      css class 3":{"fieldName":"09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"HI","customFalse":-
     A                                      ""},"css class 4":{"fieldName":"N09-
     A                                      ","dataType":"express')
     A                                  1  2HTML('ion","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"UL","customFalse":""},"read-
     A                                       only":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"true / false"},"cs-
     A                                      s class 5":{"fieldName":"09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"PR","customFalse":""-
     A                                      },"parent tab panel":"S0001F02_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 6":"profound-converted"},{-
     A                                      "id":"constant71","field type":"out-
     A                                      put field","value":"CEU fiscal year-
     A                                       start month  :","css class":"const-
     A                                      ant","left":"295px","cursor column"-
     A                                      :"4","top":"450px","cursor row":"18-
     A                                      ","parent tab panel":"S0001F02_SCR0-
     A                                      3_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCFYSM","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      FYSM","designValue":"[SCFYSM]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"f-
     A                                      alse","zeroFill":"false","curSym":"-
     A                                      ","units":"","negNum":"999.00","dat-
     A                                      aLength":"2","decPos":"0","numBlank-
     A                                      Fill":"true"},"left":"510px","curso-
     A                                      r column":"35","top":"450px","curso-
     A                                      r row":"18","width":"15px","text al-
     A                                      ign":"right","css class 3":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values","customTrue":"HI",-
     A                                      "customFalse":""},"css class 4":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values","customTrue"-
     A                                      :"UL","customFalse":""},"read only"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"css clas-
     A                                      s 5":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"Custom Values","cust-
     A                                      omTrue":"PR","customFalse":""},"err-
     A                                      or message":"Value must be 1 thru 1-
     A                                      2, if populated.","error condition"-
     A                                      :{"fieldName":"83","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"error messages"-
     A                                      :"1 message","parent tab panel":"S0-
     A                                      001F02_SCR03_MainTabPanel","parent -
     A                                      tab":"0","css class 6":"profound-co-
     A                                      nverted"},{"id":"lblDivdPlanDefault-
     A                                      RmrkCode","field type":"output fiel-
     A                                      d","css class":"constant","value":"-
     A                                      Dividend Plan Default Remark Code "-
     A                                      ,"cursor row":"18","cursor column":-
     A                                      "4","left":"295px","top":"500px","p-
     A                                      arent tab panel":"S0001F02_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted","width-
     A                                      ":"240px","visibility":{"fieldName"-
     A                                      :"visbCSIOPT","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"}},{"id":"lblPl-
     A                                      anLetter","field type')
     A                                  1  2HTML('":"output field","css class":-
     A                                      "constant","value":"Plan Letter    -
     A                                                  :","cursor row":"14","c-
     A                                      ursor column":"6","left":"310px","t-
     A                                      op":"520px","parent tab panel":"S00-
     A                                      01F02_SCR03_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted","visibility":{"fieldName":"-
     A                                      visbCSIOPT","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "visible / hidden"},"width":"195px"-
     A                                      },{"id":"txtPlanLetter","field type-
     A                                      ":"textbox","css class":"input","va-
     A                                      lue":{"fieldName":"scDivPlnLt","dat-
     A                                      aLength":"5","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scDivPlnLt]"},"text align":"right",-
     A                                      "read only":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"cursor row":"18","cursor column"-
     A                                      :"35","error messages":"1 message",-
     A                                      "left":"510px","top":"520px","width-
     A                                      ":"80px","parent tab panel":"S0001F-
     A                                      02_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"textbox","css c-
     A                                      lass 3":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"Custom Values","c-
     A                                      ustomTrue":"HI","customFalse":""},"-
     A                                      css class 4":{"fieldName":"N09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"UL","customFalse"-
     A                                      :""},"css class 5":{"fieldName":"09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"Custom-
     A                                       Values","customTrue":"PR","customF-
     A                                      alse":""},"css class 6":"profound-c-
     A                                      onverted","error message id":{"fiel-
     A                                      dName":"msPlnLeter","dataLength":"1-
     A                                      0","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"char"-
     A                                      ,"formatting":"Text","textTransform-
     A                                      ":"none"},"error message file":"WME-
     A                                      SGG","error message library":"*LIBL-
     A                                      ","error condition":{"fieldName":"e-
     A                                      rPlnLette","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"error enhanced mode":"0"-
     A                                      ,"set focus":{"fieldName":"PlnLtFou-
     A                                      cs","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"true -
     A                                      / false"},"visibility":{"fieldName"-
     A                                      :"visbCSIOPT","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"}},{"id":"OutPl-
     A                                      anLetDesc","field type":"output fie-
     A                                      ld","css class":"output-field","val-
     A                                      ue":{"fieldName":"scPlnLtDes","data-
     A                                      Length":"40","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none","designValue":"[-
     A                                      scPlnLtDes]"},"left":')
     A                                  1  2HTML('"605px","top":"520px","parent-
     A                                       tab panel":"S0001F02_SCR03_MainTab-
     A                                      Panel","parent tab":"0","width":"28-
     A                                      0px","visibility":{"fieldName":"vis-
     A                                      bCSIOPT","customTrue":"","customFal-
     A                                      se":"","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"vi-
     A                                      sible / hidden"}},{"id":"lblPremThr-
     A                                      esHoldDairy","field type":"output f-
     A                                      ield","css class":"constant","value-
     A                                      ":"Premium Threshold Dairy    :","c-
     A                                      ursor row":"14","cursor column":"6"-
     A                                      ,"left":"310px","top":"540px","widt-
     A                                      h":"195px","parent tab panel":"S000-
     A                                      1F02_SCR03_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted","visibility":{"fieldName":"v-
     A                                      isbCSIOPT","customTrue":"","customF-
     A                                      alse":"","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"}},{"id":"txtPrmTh-
     A                                      reshold","field type":"textbox","cs-
     A                                      s class":"input","value":{"fieldNam-
     A                                      e":"scDivPrmTh","dataLength":"5","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scDivPrmTh]"},"-
     A                                      text align":"right","read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"cursor row":-
     A                                      "18","cursor column":"35","error me-
     A                                      ssages":"1 message","left":"510px",-
     A                                      "top":"540px","width":"80px","paren-
     A                                      t tab panel":"S0001F02_SCR03_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"textbox","css class 3":{"field-
     A                                      Name":"09","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"Custom Values","customTrue":"HI"-
     A                                      ,"customFalse":""},"css class 4":{"-
     A                                      fieldName":"N09","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"Custom Values","customTrue-
     A                                      ":"UL","customFalse":""},"css class-
     A                                       5":{"fieldName":"09","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"Custom Values","custo-
     A                                      mTrue":"PR","customFalse":""},"css -
     A                                      class 6":"profound-converted","set -
     A                                      focus":{"fieldName":"PrmThFoucs","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"error message id":{"fieldName"-
     A                                      :"msPrmThrsh","dataLength":"10","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"},"error message file":"WMESGG","-
     A                                      error message library":"*LIBL","err-
     A                                      or condition":{"fieldName":"erPrmTh-
     A                                      rsh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error enhanced mode":"0","visi-
     A                                      bility":{"fieldName":"visbCSIOPT","-
     A                                      customTrue":"","customFalse":"","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"}},{"id":"OutPrm')
     A                                  1  2HTML('ThrsholdDesc","field type":"o-
     A                                      utput field","css class":"output-fi-
     A                                      eld","value":{"fieldName":"scPrmThD-
     A                                      es","dataLength":"40","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[scPrmThDes]"},"left":"605p-
     A                                      x","top":"540px","width":"280px","p-
     A                                      arent tab panel":"S0001F02_SCR03_Ma-
     A                                      inTabPanel","parent tab":"0","visib-
     A                                      ility":{"fieldName":"visbCSIOPT","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"visible / hid-
     A                                      den"}},{"id":"constant73","field ty-
     A                                      pe":"output field","value":" ","css-
     A                                       class":"constant","visibility":{"f-
     A                                      ieldName":"N09","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"left":"-
     A                                      280px","cursor column":"2","top":"5-
     A                                      65px","cursor row":"23","css class -
     A                                      2":"BLU","parent tab panel":"S0001F-
     A                                      02_SCR03_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"constant72","field typ-
     A                                      e":"output field","value":" ","css -
     A                                      class":"constant","visibility":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"visible / hidden"},"left":"28-
     A                                      0px","cursor column":"2","top":"565-
     A                                      px","cursor row":"23","css class 2"-
     A                                      :"BLU","parent tab panel":"S0001F02-
     A                                      _SCR03_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      visibility":{"fieldName":"09 or N09-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"visibl-
     A                                      e / hidden"},"value":"Exit","shortc-
     A                                      ut key":"F3","left":"14px","top":"1-
     A                                      83px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF10","field type":"button","-
     A                                      visibility":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"value":"Search","shortcut k-
     A                                      ey":"F10","left":"14px","top":"216p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF12","field type":"button","vis-
     A                                      ibility":{"fieldName":"09 or N09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":"Cancel","shortcu-
     A                                      t key":"F12","left":"14px","top":"2-
     A                                      49px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"OutExcldRsvCd_copy')
     A                                  1  2HTML('","field type":"output field"-
     A                                      ,"css class":"constant","value":"Ex-
     A                                      clude reserve code from duplicate p-
     A                                      ayment criteria :","cursor row":"18-
     A                                      ","cursor column":"4","left":"295px-
     A                                      ","top":"475px","parent tab panel":-
     A                                      "S0001F02_SCR03_MainTabPanel","pare-
     A                                      nt tab":"0","css class 2":"profound-
     A                                      -converted"},{"id":"CbxExcldrRsvCd_-
     A                                      copy","field type":"checkbox","css -
     A                                      class":"input","value":{"fieldName"-
     A                                      :"SCERSD","dataLength":"1","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none","d-
     A                                      esignValue":"[SCERSD]"},"checked va-
     A                                      lue":"Y","unchecked value":" ","rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"l-
     A                                      eft":"680px","top":"475px","parent -
     A                                      tab panel":"S0001F02_SCR03_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"checkbox","css class 3":{"fieldN-
     A                                      ame":"09","customTrue":"HI","custom-
     A                                      False":"","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"Custom Values"},"css class 4":{"f-
     A                                      ieldName":"N09","customTrue":"UL","-
     A                                      customFalse":"","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"Custom Values"},"css class -
     A                                      5":{"fieldName":"09","customTrue":"-
     A                                      PR","customFalse":"","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"Custom Values"}}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            ERPLNLETER     1A  H
     A            ERPLNLETTE     1A  H
     A            ERPRMTHRS      1A  H
     A            ERPRMTHRSH     1A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            MSPLNLETER    10A  H
     A            MSPRMTHRSH    10A  H
     A            PLNLTFOUCS     1A  H
     A            PRMTHFOUCS     1A  H
     A            Q1PGM         10A  H
     A            SC1AAR         2A  H
     A            SC2AAR         2A  H
     A            SC3AAR         2A  H
     A            SC4AAR         2A  H
     A            SC5AAR         2A  H
     A            SC6AAR         2A  H
     A            SC7AAR         2A  H
     A            SCACHL         3S 0H
     A            SCACHT         1A  H
     A            SCARCD         2A  H
     A            SCDIVPLNLT     5A  H
     A            SCDIVPRMTH     5A  H
     A            SCECAR         2A  H
     A            SCERSD         1A  H
     A            SCFYSM         2S 0H
     A            SCIFAR         2A  H
     A            SCMFAR         2A  H
     A            SCORFBS        1A  H
     A            SCPLNLTDES    40A  H
     A            SCPRMTHDES    40A  H
     A            SCSFAR         2A  H
     A            SCSYCD         2A  H
     A            SCTXAR         2A  H
     A            VISBCSIOPT     1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
