     A                                      REF(*LIBL/SREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDBRR         9S 0H
     A            SCMODD         5A  H
     A            SCSEL          2A  H
     A            SCIDT     R        H      REFFLD(PREF01/DT8 *LIBL/SREFP)
     A            SCITIM    R        H      REFFLD(PREF01/TIME *LIBL/SREFP)
     A            SCIUSR    R        H      REFFLD(PREF01/USER *LIBL/SREFP)
     A            SCRMK     R        H      REFFLD(PREF01/DS60 *LIBL/SREFP)
     A            SCRSYS    R        H      REFFLD(PREF01/USER *LIBL/SREFP)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 12 21
     A  22 23 24                            CA01(01 'Response Indicator *IN01')
     A  25 26 27
     A  28 29 71
     A  91 92 93                            CA02(02 'Response Indicator *IN02')
     A  94 95 06                            CA03
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    6 RSFLSIZ    1    C2    13 1  -
     A                                        RSFLNXTCHG 0    E1    3     089  -
     A                                        ROVERLAY   0     RROWS      2    -
     A                                      C1    1C2    21 RSFLMSGID  4    C7 -
     A                                         CPD6A81C7    QCPFMSGC5    *LIBLC-
     A                                      0    E1    3     92RSFLMSGID  4    -
     A                                      C7    CPD6A7CC7    QCPFMSGC5    *LI-
     A                                      BLC0    E1    3     93RERRMSGID  5 -
     A                                         C6    SCCONMC7    CPF5203C7    Q-
     A                                      CPFMSGC5    *LIBLC0    E1    3     -
     A                                      91RERRMSGID  5    C6    SCCONMC7   -
     A                                       CPF5204C7    QCPFMSGC5    *LIBLC0 -
     A                                         E1    3     94RERRMSGID  5    C6-
     A                                          SCPST1C7    SYM0500C6    SYMESG-
     A                                      C5    *LIBLC0    E1    3     71FSCP-
     A                                      ST1    INPUTONLY 0     FSCPSTA    I-
     A                                      NPUTONLY 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A81","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"92","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"CPD6A7C","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-21"},"items":[{"id"-
     A                                      :"SCPST2","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"22","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST2","designValue":"[SCPST2]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SCPST8","field type":"ou-
     A                                      tput field","visibility":{"fieldNam-
     A                                      e":"28","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"value":{"fieldN-
     A                                      ame":"SCPST8","designValue":"[SCPST-
     A                                      8]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne","dataLength":"1"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SCRRN1","field -
     A                                      type":"output field","visibility":"-
     A                                      hidden","value":{"fieldName":"SCRRN-
     A                                      1","designValue":"[SCRRN1]","dataTy-
     A                                      pe":"zoned","formatting":"Number","-
     A                                      numSep":"false","zeroBalance":"true-
     A                                      ","zeroFill":"true","curSym":"","un-
     A                                      its":"","negNum":"-999.00","dataLen-
     A                                      gth":"4","decPos":"0"},"left":"0px"-
     A                                      ,"top":"-30px","width":"28px","text-
     A                                       align":"right","css class":"profou-
     A                                      nd-converted"},{"id":"SCPST6","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :{"fieldName":"26","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"visible / hidden"},"valu-
     A                                      e":{"fieldName":"SCPST6","designVal-
     A                                      ue":"[SCPST6]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"none","dataLength":"1"},"l-
     A                                      eft":"0px","top":"-30px","css class-
     A                                      ":"profound-converted"},{"id":"SCPS-
     A                                      T7","field type":"output field","vi-
     A                                      sibility":{"fieldName":"27","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"visible / hidde-
     A                                      n"},"value":{"fieldName":"SCPST7","-
     A                                      designValue":"[SCPST7]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"1"},"left":"0px","top":"-30px","-
     A                                      css class":"profound-converted"},{"-
     A                                      id":"SCOPL2","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"SCOPL2","designValue-
     A                                      ":"[SCOPL2]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"76"},"le-
     A                                      ft":"0px","top":"-30px","css class"-
     A                                      :"profound-converted"},{"id":"SCPST-
     A                                      9","field type":"output field","vis-
     A                                      ibility":{"fieldName":"29","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"value":{"fieldName":"SCPST9","d-
     A                                      esignValue":"[SCPST9]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"1"},"left":"0px","top":"-30px","c-
     A                                      ss class":"profound-converted"},{"i-
     A                                      d":"SFLMOD","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SFLMOD","designValue"-
     A                                      :"[SFLMOD]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"1"},"left-
     A                                      ":"0px","top":"-30px","css class":"-
     A                                      profound-converted"},{"id":"SCPST5"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":{"fieldName":"25","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"value":{"fieldName":"SCPST5","des-
     A                                      ignValue":"[SCPST5]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      1"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"SCPST3","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"23","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST3","designValue":"[SCPST3]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SCPST4","field type":"ou-
     A                                      tput field","visibility":{')
     A                                  1  4HTML('"fieldName":"24","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"visible / hidden"},"-
     A                                      value":{"fieldName":"SCPST4","desig-
     A                                      nValue":"[SCPST4]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"1"-
     A                                      },"left":"0px","top":"-30px","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      S0010F_SCR01C_avKeys","field type":-
     A                                      "output field","value":{"fieldName"-
     A                                      :"AV_KEYS","dataLength":"1134","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","blankFill":"false","rjZeroFil-
     A                                      l":"false","dataType":"char","forma-
     A                                      tting":"Text","textTransform":"none-
     A                                      ","designValue":"[AV_KEYS]"},"left"-
     A                                      :"0px","top":"0px","visibility":"hi-
     A                                      dden"},{"id":"S0010F_SCR01C_action"-
     A                                      ,"field type":"html container","whi-
     A                                      te space":"normal","left":"0px","to-
     A                                      p":"10px","width":"230px","css clas-
     A                                      s":"action-panel-converted","height-
     A                                      ":"700px","html":"<div class=\"top\-
     A                                      "></div><div class=\"imagetop\"><im-
     A                                      g src=\"/profoundui/userdata/images-
     A                                      /bar_top.png\" /></div><div class=\-
     A                                      "menulinks\"></div><div class=\"ima-
     A                                      gebottom\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_bottom.png\" /><-
     A                                      /div><div class=\"bottom\"></div>"}-
     A                                      ,{"field type":"icon menu button","-
     A                                      css class":"stationary","width":"25-
     A                                      px","height":"24px","top":"32px","z-
     A                                       index":"20","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1170px","id":"S001-
     A                                      0F_SCR01C_BtnIconMenuSystemTools","-
     A                                      tool tip":"System Tools","icon sour-
     A                                      ce":"/profoundui/userdata/images/sy-
     A                                      stool/systools.png","data function"-
     A                                      :"SystemToolbarSystools","show down-
     A                                       arrow":"Yes"},{"field type":"panel-
     A                                      ","panel style":"TransformButtonBar-
     A                                      ","id":"S0010F_SCR01C_ButtonBar","t-
     A                                      op":"35px","left":"1036px","width":-
     A                                      "187px","height":"28px","css class"-
     A                                      :"stationary","visibility":"hidden"-
     A                                      ,"locked in place":"true"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1040px","id":"S0010F_-
     A                                      SCR01C_BtnSave","tool tip":"Save","-
     A                                      onclick":"SystemToolbarSave","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/save.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1066px","id":-
     A                                      "S0010F_SCR01C_BtnRefresh","tool ti-
     A                                      p":"Refresh","onclick":"SystemToolb-
     A                                      arRefresh","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/refresh.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1092px","id":"S0010F_SCR01C_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"S0010F_SCR01C_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"S0-
     A                                      010F_SCR01C_BtnSystemMessages","too-
     A                                      l tip":"System Messages","onclick":-
     A                                      "SystemToolbarMessages","background-
     A                                       image":{"fieldName":"MsgIcnURL","d-
     A                                      ataLength":"128","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"f')
     A                                  1  5HTML('alse","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1196px",-
     A                                      "id":"S0010F_SCR01C_BtnHelp","tool -
     A                                      tip":"Help","onclick":"SystemToolba-
     A                                      rHelp","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/h-
     A                                      elp.png'')"},{"id":"S0010F_SCR01C_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"S0010F_SCR01C_M-
     A                                      ainTabPanel","field type":"tab pane-
     A                                      l","tab panel style":"Transform","t-
     A                                      ab names":{"fieldName":"SCPRDS","de-
     A                                      signValue":"[SCPRDS]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"S0010F-
     A                                      _SCR01C_BtnHiddenSave","value":"btn-
     A                                      Save","top":"100px","response":{"fi-
     A                                      eldName":"btnSave","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"constant1-
     A                                      ","field type":"output field","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"110px","cursor row":"1","css clas-
     A                                      s":"top-line","value":"js: currentU-
     A                                      ser()","css class 2":"output-field"-
     A                                      ,"parent tab panel":"S0010F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted"},{"i-
     A                                      d":"SCCONM","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCCONM",-
     A                                      "designValue":"[SCCONM]","refField"-
     A                                      :"NAME","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none"},"css class":"output--
     A                                      field","left":"414px","cursor colum-
     A                                      n":"21","top":"110px","cursor row":-
     A                                      "1","css class 2":"top-line","css c-
     A                                      lass 3":"HI","error message id":"CP-
     A                                      F5203","error message file":"QCPFMS-
     A                                      G","error message library":"*LIBL",-
     A                                      "error condition":{"fieldName":"91"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"error messages":"2 messages","err-
     A                                      or message id 2":"CPF5204","error m-
     A                                      essage file 2":"QCPFMSG","error mes-
     A                                      sage library 2":"*LIBL","error cond-
     A                                      ition 2":{"fieldName":"94","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"parent -
     A                                      tab panel":"S0010F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 4"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant2","field type":"output field","-
     A                                      left":"778px","cursor column":"73",-
     A                                      "top":"110px","cursor row":"1","css-
     A                                       class":"top-line","value":"js: cur-
     A                                      rentDate()","css class 2":"output-f-
     A                                      ield","parent tab panel":"S0010F_SC-
     A                                      R01C_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"S0010F_SCR01C_fkeyMenu","f-
     A                                      ield type":"menu","left":"10px","to-
     A                                      p":"120px","height":"350px","width"-
     A                                      :"230px","hover background color":"-
     A                                      #9AAA61","hover text color":"#FFFFF-
     A                                      F","border color":"#4C6106","menu o-
     A                                      ption indent":"10px","background co-
     A                                      lor":"#758B27","css class":"action--
     A                                      menu","css class 2":"stationary","z-
     A                                       index":"101"},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"S0010F_SCR01C_BtnHiddenRefresh",-
     A                                      "value":"btnRefresh","top":"125px",-
     A                                      "response":{"fieldName":"btnRefresh-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"Q1PGM","field type":"outpu-
     A                                      t field","value":{"fieldName":"Q1PG-
     A                                      M","designValue":"[Q1PGM]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"10"},"css class":"output-fie-
     A                                      ld","left":"281px","cursor column":-
     A                                      "2","top":"130px","cursor row":"2",-
     A                                      "parent tab panel":"S0010F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SCPRDS","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCPRDS","-
     A                                      designValue":"[SCPRDS]","refField":-
     A                                      "NAME","dataType":"reference","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none"},"css class":"output-f-
     A                                      ield","left":"414px","cursor column-
     A                                      ":"21","top":"130px","cursor row":"-
     A                                      2","css class 2":"HI","par')
     A                                  1  6HTML('ent tab panel":"S0010F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","vi-
     A                                      sibility":"hidden","css class 3":"p-
     A                                      rofound-converted"},{"id":"constant-
     A                                      3","field type":"output field","val-
     A                                      ue":"SCR01","css class":"constant",-
     A                                      "left":"799px","cursor column":"76"-
     A                                      ,"top":"130px","cursor row":"2","pa-
     A                                      rent tab panel":"S0010F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"S0010F_SCR01C_BtnHi-
     A                                      ddenSearch","value":"btnSearch","to-
     A                                      p":"150px","response":{"fieldName":-
     A                                      "btnSearch","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"constant4","fiel-
     A                                      d type":"output field","value":"Pos-
     A                                      ition to . . .","css class":"consta-
     A                                      nt","left":"281px","cursor column":-
     A                                      "2","top":"170px","cursor row":"4",-
     A                                      "parent tab panel":"S0010F_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant5","field type":"output -
     A                                      field","value":"Date:","css class":-
     A                                      "constant","left":"414px","cursor c-
     A                                      olumn":"21","top":"170px","cursor r-
     A                                      ow":"4","parent tab panel":"S0010F_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPST1","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","input only":"true"-
     A                                      ,"value":{"fieldName":"SCPST1","des-
     A                                      ignValue":"[SCPST1]","dataType":"ch-
     A                                      ar","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","dataLength":"-
     A                                      8","numBlankFill":"true"},"visibili-
     A                                      ty":{"fieldName":"21","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"456px","cursor column":"27","-
     A                                      top":"170px","cursor row":"4","widt-
     A                                      h":"57px","text align":"right","set-
     A                                       focus":{"fieldName":"N06","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      error message id":"SYM0500","error -
     A                                      message file":"SYMESG","error messa-
     A                                      ge library":"*LIBL","error conditio-
     A                                      n":{"fieldName":"71","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"1 message","parent tab panel":"-
     A                                      S0010F_SCR01C_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"constant6","field-
     A                                       type":"output field","value":"Time-
     A                                      :","css class":"constant","left":"5-
     A                                      33px","cursor column":"38","top":"1-
     A                                      70px","cursor row":"4","parent tab -
     A                                      panel":"S0010F_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCPSTA","-
     A                                      field type":"textbox","css class":"-
     A                                      input","css class 2":"textbox","inp-
     A                                      ut only":"true","value":{"fieldName-
     A                                      ":"SCPSTA","designValue":"[SCPSTA]"-
     A                                      ,"refField":"TIME","dataType":"refe-
     A                                      rence","formatting":"Number","numSe-
     A                                      p":"false","zeroBalance":"false","z-
     A                                      eroFill":"false","curSym":"","units-
     A                                      ":"","negNum":"-999.00"},"left":"57-
     A                                      5px","cursor column":"44","top":"17-
     A                                      0px","cursor row":"4","width":"43px-
     A                                      ","parent tab panel":"S0010F_SCR01C-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 3":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"S0010F_SCR01C_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"S0010F_SCR01C_BtnHiddenSyste-
     A                                      mMessages","value":"btnMessage","to-
     A                                      p":"200px","response":{"fieldName":-
     A                                      "btnMessage","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"constant7","fie-
     A                                      ld type":"output field","value":"Ty-
     A                                      pe options, press Enter.","css clas-
     A                                      s":"constant","left":"281px","curso-
     A                                      r column":"2","top":"210px","cursor-
     A                                       row":"6","css class 2":"BLU","pare-
     A                                      nt tab panel":"S0010F_SCR01C_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"S0010F_SCR01C_BtnHidd-
     A                                      enWorkSubmitJob","value":"btnWrksbm-
     A                                      job","top":"225px","response":{"fie-
     A                                      ldName":"btnWrkJob","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"SCOPL1",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCOPL1","designValue-
     A                                      ":"[SCOPL1]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"false","textTran-
     A                                      sform":"none","dataLength"')
     A                                  1  7HTML(':"76"},"css class":"output-fi-
     A                                      eld","left":"295px","cursor column"-
     A                                      :"4","top":"230px","cursor row":"7"-
     A                                      ,"css class 2":"BLU","parent tab pa-
     A                                      nel":"S0010F_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 3":"prof-
     A                                      ound-converted"},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"S0010F_SCR01C_BtnHiddenWorkPri-
     A                                      nterOutput","value":"btnWrkprtout",-
     A                                      "top":"250px","response":{"fieldNam-
     A                                      e":"btnWrkPrnt","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"SCHDL1","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCHDL1","designValue":"[-
     A                                      SCHDL1]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none","dataLength":"78"},"css c-
     A                                      lass":"output-field","left":"281px"-
     A                                      ,"cursor column":"2","top":"270px",-
     A                                      "cursor row":"9","css class 2":"HI"-
     A                                      ,"parent tab panel":"S0010F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted","css-
     A                                       class 4":"subfile-heading"},{"id":-
     A                                      "SCR01S_expander","field type":"ima-
     A                                      ge","image source":"/profoundui/pro-
     A                                      ddata/images/icons/collapseall.gif"-
     A                                      ,"shortcut key":"F15","cursor":"poi-
     A                                      nter","tool tip":"Collapse All","on-
     A                                      click":"getObj(\"SCR01S\").grid.tog-
     A                                      gle(this)","z index":"25","top":"27-
     A                                      5px","left":"257px"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"S0010F_SCR01C_BtnHiddenIma-
     A                                      geQueue","value":"btnImgQue","top":-
     A                                      "275px","response":{"fieldName":"bt-
     A                                      nImgQue","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"SCR01S","field type-
     A                                      ":"grid","number of columns":"1","r-
     A                                      ecord format name":"SCR01S","subfil-
     A                                      e next changed":{"fieldName":"08","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"display subfile":{"fieldName-
     A                                      ":"04","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"display control reco-
     A                                      rd":{"fieldName":"N03","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"clea-
     A                                      r subfile":{"fieldName":"03","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"true / false"}-
     A                                      ,"subfile size":"13","expanded":{"f-
     A                                      ieldName":"N12","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"true / false"},"collapsed":-
     A                                      {"fieldName":"12","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"true / false"},"place cur-
     A                                      sor":"true","header height":"20","r-
     A                                      ow height":"40","css class":"subfil-
     A                                      egrid","css class 2":"profound-conv-
     A                                      erted","parent tab panel":"S0010F_S-
     A                                      CR01C_MainTabPanel","parent tab":"0-
     A                                      ","subfile end":{"fieldName":"95","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"page down response":{"fieldN-
     A                                      ame":"*IN01","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"page up response":{"fi-
     A                                      eldName":"*IN02","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"show paging contro-
     A                                      ls":"true","scrollbar":"none","numb-
     A                                      er of rows":"7","fold multiple":"2"-
     A                                      ,"single row zoom":"true","top":"27-
     A                                      0px","left":"256px","column widths"-
     A                                      :"598","return mode":{"fieldName":"-
     A                                      SFLMOD","dataLength":"1","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none"},"subfile -
     A                                      record number":{"fieldName":"SCRRN1-
     A                                      ","designValue":"[SCRRN1]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"4","decPos":"0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"S0010F_SCR01C_BtnHiddenH-
     A                                      elp","value":"btnHelp","top":"300px-
     A                                      ","response":{"fieldName":"btnHelp"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"btnSubmit","field type":"bu-
     A                                      tton","value":"Enter","shortcut key-
     A                                      ":"Enter","left":"14px","top":"150p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnCF03","field type":"button","val-
     A                                      ue":"F3","shortcut key":"F3","left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnCF05","field -
     A                                      type":"button","value":"F5","shortc-
     A                                      ut key":"F5","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF06","field type":"button","-
     A                                      value":"F6","shortcut key"')
     A                                  1  8HTML(':"F6","left":"14px","top":"24-
     A                                      9px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF11","field type":"button","v-
     A                                      alue":"F11","shortcut key":"F11","l-
     A                                      eft":"14px","top":"282px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF15","fi-
     A                                      eld type":"button","value":"F15","s-
     A                                      hortcut key":"F15","onclick":"getOb-
     A                                      j(\"SCR01S\").grid.toggle(this)","l-
     A                                      eft":"14px","top":"315px","width":"-
     A                                      100px","height":"23px","css class":-
     A                                      "button","auto arrange":"true","cur-
     A                                      sor":"default"},{"id":"btnCF17","fi-
     A                                      eld type":"button","value":"F17","s-
     A                                      hortcut key":"F17","left":"14px","t-
     A                                      op":"348px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      },{"id":"btnCF21","field type":"but-
     A                                      ton","value":"F21","shortcut key":"-
     A                                      F21","left":"14px","top":"381px","w-
     A                                      idth":"100px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnCF-
     A                                      23","field type":"button","value":"-
     A                                      F23","shortcut key":"F23","left":"1-
     A                                      4px","top":"414px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnCF24","field typ-
     A                                      e":"button","value":"F24","shortcut-
     A                                       key":"F24","left":"14px","top":"44-
     A                                      7px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"SCDBRR","field type":"output fiel-
     A                                      d","visibility":"hidden","value":{"-
     A                                      fieldName":"SCDBRR","designValue":"-
     A                                      [SCDBRR]","dataType":"zoned","forma-
     A                                      tting":"Number","numSep":"false","z-
     A                                      eroBalance":"true","zeroFill":"true-
     A                                      ","curSym":"","units":"","negNum":"-
     A                                      -999.00","dataLength":"9","decPos":-
     A                                      "0"},"left":"-256px","top":"-319px"-
     A                                      ,"width":"63px","text align":"right-
     A                                      ","css class":"profound-converted",-
     A                                      "grid":"SCR01S","column":"0"},{"id"-
     A                                      :"SCSEL","field type":"textbox","cs-
     A                                      s class":"input","css class 2":"tex-
     A                                      tbox","value":{"fieldName":"SCSEL",-
     A                                      "designValue":"[SCSEL]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase","dataL-
     A                                      ength":"2"},"text transform":"upper-
     A                                      case","left":"25px","cursor column"-
     A                                      :"2","top":"1px","cursor row":"10",-
     A                                      "width":"15px","set focus":{"fieldN-
     A                                      ame":"07","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 3":{"fi-
     A                                      eldName":"05","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      RI","customFalse":""},"description"-
     A                                      :"Selection Field","css class 4":"p-
     A                                      rofound-converted","grid":"SCR01S",-
     A                                      "column":"0"},{"id":"SCIDT","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCIDT","designValue":"[SCID-
     A                                      T]","refField":"PREF01/DT8 *LIBL/SR-
     A                                      EFP","dataType":"reference","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","edtWrd":"''  /  /    ''"},-
     A                                      "css class":"output-field","left":"-
     A                                      60px","cursor column":"7","top":"1p-
     A                                      x","cursor row":"10","width":"70px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :"profound-converted","grid":"SCR01-
     A                                      S","column":"0"},{"id":"SCITIM","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCITIM","designValue":"-
     A                                      [SCITIM]","refField":"PREF01/TIME *-
     A                                      LIBL/SREFP","dataType":"reference",-
     A                                      "formatting":"Number","numSep":"fal-
     A                                      se","zeroBalance":"true","zeroFill"-
     A                                      :"true","curSym":"","units":"","neg-
     A                                      Num":"-999.00","edtWrd":"''  :  :  -
     A                                      ''"},"css class":"output-field","le-
     A                                      ft":"144px","cursor column":"19","t-
     A                                      op":"1px","cursor row":"10","width"-
     A                                      :"56px","text align":"right","css c-
     A                                      lass 2":"profound-converted","grid"-
     A                                      :"SCR01S","column":"0"},{"id":"SCRS-
     A                                      YS","field type":"output field","va-
     A                                      lue":{"fieldName":"SCRSYS","designV-
     A                                      alue":"[SCRSYS]","refField":"PREF01-
     A                                      /USER *LIBL/SREFP","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"215px","c-
     A                                      ursor column":"27","top":"0px","cur-
     A                                      sor row":"10","css class 2":"profou-
     A                                      nd-converted","grid":"SCR01S","colu-
     A                                      mn":"0"},{"id":"SCMODD","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCMODD","designValue":"[SCMODD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e","dataLength":"5"},"css class":"o-
     A                                      utput-field","left":"284px","cursor-
     A                                       column":"39","top":"1px","cursor r-
     A                                      ow":"10","css class 2":"profound-co-
     A                                      nverted","grid":"SCR01S","column":"-
     A                                      0"},{"id":"SCIUSR","field type":"ou-
     A                                      tput field","value":{"fieldName":"S-
     A                                      CIUSR","designValue":"[SCIUSR]","re-
     A                                      fField":"PREF01/USER *LIBL/SREFP","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTran')
     A                                  1  9HTML('sform":"none"},"css class":"o-
     A                                      utput-field","left":"333px","cursor-
     A                                       column":"46","top":"1px","cursor r-
     A                                      ow":"10","css class 2":"profound-co-
     A                                      nverted","grid":"SCR01S","column":"-
     A                                      0"},{"id":"SCRMK","field type":"out-
     A                                      put field","value":{"fieldName":"SC-
     A                                      RMK","designValue":"[SCRMK]","refFi-
     A                                      eld":"PREF01/DS60 *LIBL/SREFP","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"false","textTransform":"none-
     A                                      "},"css class":"output-field","left-
     A                                      ":"60px","cursor column":"7","top":-
     A                                      "21px","cursor row":"11","css class-
     A                                       2":"profound-converted","grid":"SC-
     A                                      R01S","column":"0"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST1         8A  H
     A            SCPST2         1A  H
     A            SCPST3         1A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPSTA    R        H      REFFLD(TIME)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      3-23"},"items":[{"id":"SCFKL2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"S0010F_SCR01_avKeys","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"AV_KEYS","dataLength"-
     A                                      :"1134","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[AV_KE-
     A                                      YS]"},"left":"0px","top":"0px","vis-
     A                                      ibility":"hidden"},{"id":"S0010F_SC-
     A                                      R01_action","field type":"html cont-
     A                                      ainer","white space":"normal","left-
     A                                      ":"0px","top":"10px","width":"230px-
     A                                      ","css class":"action-panel-convert-
     A                                      ed","height":"700px","html":"<div c-
     A                                      lass=\"top\"></div><div class=\"ima-
     A                                      getop\"><img src=\"/profoundui/user-
     A                                      data/images/bar_top.png\" /></div><-
     A                                      div class=\"menulinks\"></div><div -
     A                                      class=\"imagebottom\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_botto-
     A                                      m.png\" /></div><div class=\"bottom-
     A                                      \"></div>"},{"field type":"icon men-
     A                                      u button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"32px","z index":"20","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1170px"-
     A                                      ,"id":"S0010F_SCR01_BtnIconMenuSyst-
     A                                      emTools","tool tip":"System Tools",-
     A                                      "icon source":"/profoundui/userdata-
     A                                      /images/systool/systools.png","data-
     A                                       function":"SystemToolbarSystools",-
     A                                      "show down arrow":"Yes"},{"field ty-
     A                                      pe":"panel","panel style":"Transfor-
     A                                      mButtonBar","id":"S0010F_SCR01_Butt-
     A                                      onBar","top":"35px","left":"1036px"-
     A                                      ,"width":"187px","height":"28px","c-
     A                                      ss class":"stationary","visibility"-
     A                                      :"hidden","locked in place":"true"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1040px","id"-
     A                                      :"S0010F_SCR01_BtnSave","tool tip":-
     A                                      "Save","onclick":"SystemToolbarSave-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/save.p-
     A                                      ng'')"},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"S0010F_SCR01_BtnRefresh","-
     A                                      tool tip":"Refresh","onclick":"Syst-
     A                                      emToolbarRefresh","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/refresh.png'')"},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1092px","id":"S0010F_-
     A                                      SCR01_BtnSearch","tool tip":"Search-
     A                                      ","onclick":"SystemToolbarSearch","-
     A                                      background image":"url(''/profoundu-
     A                                      i/userdata/images/systool/search.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1118px-
     A                                      ","id":"S0010F_SCR01_BtnDiaryItems"-
     A                                      ,"tool tip":"Diary/Work Items - IDA-
     A                                      RTS","onclick":"SystemToolbarDiary"-
     A                                      ,"background image":{"fieldName":"D-
     A                                      ryIcnURL","dataLength":"128","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","blankFill":"false","rjZeroFill"-
     A                                      :"false","dataType":"char","formatt-
     A                                      ing":"Text","textTransform":"none"}-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"S0010F_SCR01_BtnSystemM')
     A                                  1  4HTML('essages","tool tip":"System M-
     A                                      essages","onclick":"SystemToolbarMe-
     A                                      ssages","background image":{"fieldN-
     A                                      ame":"MsgIcnURL","dataLength":"128"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none"}},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1196-
     A                                      px","id":"S0010F_SCR01_BtnHelp","to-
     A                                      ol tip":"Help","onclick":"SystemToo-
     A                                      lbarHelp","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/help.png'')"},{"id":"S0010F_SCR01-
     A                                      _ImgSysToolBottom","field type":"im-
     A                                      age","image source":"/profoundui/us-
     A                                      erdata/images/systool/butbarbot.png-
     A                                      ","left":"1036px","top":"64px","wid-
     A                                      th":"187px","locked in place":"true-
     A                                      ","css class":"stationary","visibil-
     A                                      ity":"hidden"},{"id":"S0010F_SCR01_-
     A                                      MainTabPanel","field type":"tab pan-
     A                                      el","tab panel style":"Transform","-
     A                                      tab names":"Tab 1","active tab":"0"-
     A                                      ,"left":"250px","top":"70px","width-
     A                                      ":"970px","height":"657px","z index-
     A                                      ":"8","locked in place":"true","css-
     A                                       class":"tab-panel","css class 2":"-
     A                                      stationary"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "S0010F_SCR01_BtnHiddenSave","value-
     A                                      ":"btnSave","top":"100px","response-
     A                                      ":{"fieldName":"btnSave","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"S00-
     A                                      10F_SCR01_fkeyMenu","field type":"m-
     A                                      enu","left":"10px","top":"120px","h-
     A                                      eight":"350px","width":"230px","hov-
     A                                      er background color":"#9AAA61","hov-
     A                                      er text color":"#FFFFFF","border co-
     A                                      lor":"#4C6106","menu option indent"-
     A                                      :"10px","background color":"#758B27-
     A                                      ","css class":"action-menu","css cl-
     A                                      ass 2":"stationary","z index":"101"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"S0010F_SCR-
     A                                      01_BtnHiddenRefresh","value":"btnRe-
     A                                      fresh","top":"125px","response":{"f-
     A                                      ieldName":"btnRefresh","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"S0010F_SCR01_BtnHiddenSe-
     A                                      arch","value":"btnSearch","top":"15-
     A                                      0px","response":{"fieldName":"btnSe-
     A                                      arch","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"S0010F-
     A                                      _SCR01_BtnHiddenDiaryItems","value"-
     A                                      :"btnDiary","top":"175px","response-
     A                                      ":{"fieldName":"btnDiary","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"S0010F_SCR01_BtnHidde-
     A                                      nSystemMessages","value":"btnMessag-
     A                                      e","top":"200px","response":{"field-
     A                                      Name":"btnMessage","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"S0010F_SCR01_BtnHiddenWorkSu-
     A                                      bmitJob","value":"btnWrksbmjob","to-
     A                                      p":"225px","response":{"fieldName":-
     A                                      "btnWrkJob","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      S0010F_SCR01_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"S0-
     A                                      010F_SCR01_BtnHiddenImageQueue","va-
     A                                      lue":"btnImgQue","top":"275px","res-
     A                                      ponse":{"fieldName":"btnImgQue","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"S0010F')
     A                                  1  5HTML('_SCR01_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"SCFK-
     A                                      L1","field type":"output field","va-
     A                                      lue":{"fieldName":"SCFKL1","designV-
     A                                      alue":"[SCFKL1]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none","dataLength":"78"}-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"550px","cursor row":"23","c-
     A                                      ss class":"BLU","parent tab panel":-
     A                                      "S0010F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","visibility":"hidden","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      id":"btnSubmit","field type":"butto-
     A                                      n","value":"Enter","shortcut key":"-
     A                                      Enter","left":"14px","top":"150px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"btn-
     A                                      PAGEDOWN","field type":"button","va-
     A                                      lue":"Page Down","shortcut key":"Pa-
     A                                      geDown","response":{"fieldName":"*I-
     A                                      N01","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"left":"14px","top":"183px","wi-
     A                                      dth":"100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnPAG-
     A                                      EUP","field type":"button","value":-
     A                                      "Page Up","shortcut key":"PageUp","-
     A                                      response":{"fieldName":"*IN02","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"left-
     A                                      ":"14px","top":"216px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        52A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      2    14 RSFLSIZ    1    C2    15 1 -
     A                                         RSFLNXTCHG 0     2    ROVERLAY  -
     A                                       0     RROWS      2    C1    1C2   -
     A                                       21 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-21"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"S0010F_SCR-
     A                                      02C_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"S0010F_SCR02C_action","field ty-
     A                                      pe":"html container","white space":-
     A                                      "normal","left":"0px","top":"10px",-
     A                                      "width":"230px","css class":"action-
     A                                      -panel-converted","height":"700px",-
     A                                      "html":"<div class=\"top\"></div><d-
     A                                      iv class=\"imagetop\"><img src=\"/p-
     A                                      rofoundui/userdata/images/bar_top.p-
     A                                      ng\" /></div><div class=\"menulinks-
     A                                      \"></div><div class=\"imagebottom\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_bottom.png\" /></div><div -
     A                                      class=\"bottom\"></div>"},{"field t-
     A                                      ype":"icon menu button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"32px","z index":"2-
     A                                      0","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1170px","id":"S0010F_SCR02C_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"S0-
     A                                      010F_SCR02C_ButtonBar","top":"35px"-
     A                                      ,"left":"1036px","width":"187px","h-
     A                                      eight":"28px","css class":"stationa-
     A                                      ry","visibility":"hidden","locked i-
     A                                      n place":"true"},{"field type":"but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"40-
     A                                      px","background color":"#FFFFFF","b-
     A                                      ackground repeat":"no-repeat","bord-
     A                                      er top style":"none","border right -
     A                                      style":"none","border bottom style"-
     A                                      :"none","border left style":"none",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","locked in place":"true","lef-
     A                                      t":"1040px","id":"S0010F_SCR02C_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"S0010F_SC-
     A                                      R02C_BtnRefresh","tool tip":"Refres-
     A                                      h","onclick":"SystemToolbarRefresh"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/refresh-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"109-
     A                                      2px","id":"S0010F_SCR02C_BtnSearch"-
     A                                      ,"tool tip":"Search","onclick":"Sys-
     A                                      temToolbarSearch","background image-
     A                                      ":"url(''/profoundui/userdata/image-
     A                                      s/systool/search.png'')"},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1118px","id":"S0010F_S-
     A                                      CR02C_BtnDiaryItems","tool tip":"Di-
     A                                      ary/Work Items - IDARTS","onclick":-
     A                                      "SystemToolbarDiary","background im-
     A                                      age":{"fieldName":"DryIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","v')
     A                                  1  4HTML('isibility":"hidden","locked i-
     A                                      n place":"true","left":"1144px","id-
     A                                      ":"S0010F_SCR02C_BtnSystemMessages"-
     A                                      ,"tool tip":"System Messages","oncl-
     A                                      ick":"SystemToolbarMessages","backg-
     A                                      round image":{"fieldName":"MsgIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1196px","id":"S001-
     A                                      0F_SCR02C_BtnHelp","tool tip":"Help-
     A                                      ","onclick":"SystemToolbarHelp","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/help.png'')-
     A                                      "},{"id":"S0010F_SCR02C_ImgSysToolB-
     A                                      ottom","field type":"image","image -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/butbarbot.png","left":"10-
     A                                      36px","top":"64px","width":"187px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"stationary","visibility":"hidden-
     A                                      "},{"id":"S0010F_SCR02C_MainTabPane-
     A                                      l","field type":"tab panel","tab pa-
     A                                      nel style":"Transform","tab names":-
     A                                      {"fieldName":"SCPRD2","designValue"-
     A                                      :"[SCPRD2]","refField":"NAME","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"active tab":"0","left":"250px","-
     A                                      top":"70px","width":"970px","height-
     A                                      ":"657px","z index":"8","locked in -
     A                                      place":"true","css class":"tab-pane-
     A                                      l","css class 2":"stationary"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"S0010F_SCR02C_Bt-
     A                                      nHiddenSave","value":"btnSave","top-
     A                                      ":"100px","response":{"fieldName":"-
     A                                      btnSave","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"constant8","field t-
     A                                      ype":"output field","left":"281px",-
     A                                      "cursor column":"2","top":"110px","-
     A                                      cursor row":"1","css class":"top-li-
     A                                      ne","value":"js: currentUser()","cs-
     A                                      s class 2":"output-field","parent t-
     A                                      ab panel":"S0010F_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCR02C-
     A                                      _SCCONM","field type":"output field-
     A                                      ","value":{"fieldName":"SCCONM","de-
     A                                      signValue":"[SCCONM]","refField":"N-
     A                                      AME","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"false","textTransfo-
     A                                      rm":"none"},"css class":"output-fie-
     A                                      ld","left":"414px","cursor column":-
     A                                      "21","top":"110px","cursor row":"1"-
     A                                      ,"css class 2":"top-line","css clas-
     A                                      s 3":"HI","parent tab panel":"S0010-
     A                                      F_SCR02C_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"id":"constant9","field type-
     A                                      ":"output field","left":"778px","cu-
     A                                      rsor column":"73","top":"110px","cu-
     A                                      rsor row":"1","css class":"top-line-
     A                                      ","value":"js: currentDate()","css -
     A                                      class 2":"output-field","parent tab-
     A                                       panel":"S0010F_SCR02C_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"S0010F_S-
     A                                      CR02C_fkeyMenu","field type":"menu"-
     A                                      ,"left":"10px","top":"120px","heigh-
     A                                      t":"350px","width":"230px","hover b-
     A                                      ackground color":"#9AAA61","hover t-
     A                                      ext color":"#FFFFFF","border color"-
     A                                      :"#4C6106","menu option indent":"10-
     A                                      px","background color":"#758B27","c-
     A                                      ss class":"action-menu","css class -
     A                                      2":"stationary","z index":"101"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"S0010F_SCR02C_-
     A                                      BtnHiddenRefresh","value":"btnRefre-
     A                                      sh","top":"125px","response":{"fiel-
     A                                      dName":"btnRefresh","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":"SCR02C_Q-
     A                                      1PGM","field type":"output field","-
     A                                      value":{"fieldName":"Q1PGM","design-
     A                                      Value":"[Q1PGM]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none","dataLength":"10"-
     A                                      },"css class":"output-field","left"-
     A                                      :"281px","cursor column":"2","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"S0010F_SCR02C_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"id":"SCPRD2"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCPRD2","designValu-
     A                                      e":"[SCPRD2]","refField":"NAME","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"414px","cursor column":"21","to-
     A                                      p":"130px","cursor row":"2","css cl-
     A                                      ass 2":"HI","parent tab panel":"S00-
     A                                      10F_SCR02C_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted"},{"id":"constant10"')
     A                                  1  5HTML(',"field type":"output field",-
     A                                      "value":"SCR02","css class":"consta-
     A                                      nt","left":"799px","cursor column":-
     A                                      "76","top":"130px","cursor row":"2"-
     A                                      ,"parent tab panel":"S0010F_SCR02C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"S0010F_SCR02C_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"constant11",-
     A                                      "field type":"output field","value"-
     A                                      :"Press Enter to confirm your choic-
     A                                      es for 4=Delete.","css class":"cons-
     A                                      tant","left":"281px","cursor column-
     A                                      ":"2","top":"170px","cursor row":"4-
     A                                      ","css class 2":"BLU","parent tab p-
     A                                      anel":"S0010F_SCR02C_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"S0010F_SCR02C_BtnHiddenDiaryI-
     A                                      tems","value":"btnDiary","top":"175-
     A                                      px","response":{"fieldName":"btnDia-
     A                                      ry","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"constant12","field type"-
     A                                      :"output field","value":"Press F12 -
     A                                      to return to change your choices.",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"190px-
     A                                      ","cursor row":"5","css class 2":"B-
     A                                      LU","parent tab panel":"S0010F_SCR0-
     A                                      2C_MainTabPanel","parent tab":"0","-
     A                                      css class 3":"profound-converted"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"S0010F_SCR02-
     A                                      C_BtnHiddenSystemMessages","value":-
     A                                      "btnMessage","top":"200px","respons-
     A                                      e":{"fieldName":"btnMessage","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"S0010F_SCR02C_BtnH-
     A                                      iddenWorkSubmitJob","value":"btnWrk-
     A                                      sbmjob","top":"225px","response":{"-
     A                                      fieldName":"btnWrkJob","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SCR02-
     A                                      C_SCHDL1","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCHDL1","d-
     A                                      esignValue":"[SCHDL1]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"none","dataLength"-
     A                                      :"78"},"left":"281px","cursor colum-
     A                                      n":"2","top":"230px","cursor row":"-
     A                                      7","css class":"HI","parent tab pan-
     A                                      el":"S0010F_SCR02C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted","css class 3":"subfi-
     A                                      le-heading"},{"id":"SCR02S","field -
     A                                      type":"grid","number of columns":"2-
     A                                      ","record format name":"SCR02S","su-
     A                                      bfile next changed":"true","display-
     A                                       subfile":{"fieldName":"14","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "display control record":{"fieldNam-
     A                                      e":"N13","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"clear subfile":{"f-
     A                                      ieldName":"13","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"subfile size-
     A                                      ":"15","header height":"20","row he-
     A                                      ight":"20","css class":"subfilegrid-
     A                                      ","css class 2":"profound-converted-
     A                                      ","parent tab panel":"S0010F_SCR02C-
     A                                      _MainTabPanel","parent tab":"0","su-
     A                                      bfile end":{"fieldName":"N15","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"page down response":{"fieldName"-
     A                                      :"*IN01","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"page up response":{"fieldN-
     A                                      ame":"*IN02","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"show paging controls":-
     A                                      "true","scrollbar":"none","number o-
     A                                      f rows":"15","top":"230px","left":"-
     A                                      276px","column widths":"35,523","su-
     A                                      bfile record number":{"fieldName":"-
     A                                      SCRRN2","designValue":"[SCRRN2]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "true","zeroFill":"true","curSym":"-
     A                                      ","units":"","negNum":"-999.00","da-
     A                                      taLength":"4","decPos":"0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"S0010F_SCR02C_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","vi')
     A                                  1  6HTML('sibility":"hidden","id":"S001-
     A                                      0F_SCR02C_BtnHiddenImageQueue","val-
     A                                      ue":"btnImgQue","top":"302px","resp-
     A                                      onse":{"fieldName":"btnImgQue","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"S0010F_SCR02C_Bt-
     A                                      nHiddenHelp","value":"btnHelp","top-
     A                                      ":"327px","response":{"fieldName":"-
     A                                      btnHelp","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"id":"btnSubmit","field t-
     A                                      ype":"button","value":"Enter","shor-
     A                                      tcut key":"Enter","left":"14px","to-
     A                                      p":"150px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ,{"id":"btnCF12","field type":"butt-
     A                                      on","value":"Cancel","shortcut key"-
     A                                      :"F12","left":"14px","top":"183px",-
     A                                      "width":"100px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","cursor":"default"},{"id":"SCR-
     A                                      02S_SCDBRR","field type":"output fi-
     A                                      eld","visibility":"hidden","value":-
     A                                      {"fieldName":"SCDBRR","designValue"-
     A                                      :"[SCDBRR]","dataType":"zoned","for-
     A                                      matting":"Number","numSep":"false",-
     A                                      "zeroBalance":"true","zeroFill":"tr-
     A                                      ue","curSym":"","units":"","negNum"-
     A                                      :"-999.00","dataLength":"9","decPos-
     A                                      ":"0"},"left":"-58px","top":"-279px-
     A                                      ","width":"63px","text align":"righ-
     A                                      t","css class":"profound-converted"-
     A                                      ,"grid":"SCR02S","column":"0"},{"id-
     A                                      ":"SCSF1R","field type":"output fie-
     A                                      ld","visibility":"hidden","value":{-
     A                                      "fieldName":"SCSF1R","designValue":-
     A                                      "[SCSF1R]","dataType":"zoned","form-
     A                                      atting":"Number","numSep":"false","-
     A                                      zeroBalance":"true","zeroFill":"tru-
     A                                      e","curSym":"","units":"","negNum":-
     A                                      "-999.00","dataLength":"4","decPos"-
     A                                      :"0"},"left":"-23px","top":"-279px"-
     A                                      ,"width":"28px","text align":"right-
     A                                      ","css class":"profound-converted",-
     A                                      "grid":"SCR02S","column":"0"},{"id"-
     A                                      :"SCR02S_SCSEL","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCSE-
     A                                      L","designValue":"[SCSEL]","dataTyp-
     A                                      e":"char","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none","dataLe-
     A                                      ngth":"2"},"css class":"output-fiel-
     A                                      d","left":"5px","cursor column":"2"-
     A                                      ,"top":"1px","cursor row":"8","desc-
     A                                      ription":"Selection Field","css cla-
     A                                      ss 2":"profound-converted","grid":"-
     A                                      SCR02S","column":"0"},{"id":"SCDATA-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCDATA","designVal-
     A                                      ue":"[SCDATA]","dataType":"char","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"false","textTr-
     A                                      ansform":"none","dataLength":"52"},-
     A                                      "css class":"output-field","left":"-
     A                                      5px","cursor column":"7","top":"1px-
     A                                      ","cursor row":"8","css class 2":"p-
     A                                      rofound-converted","grid":"SCR02S",-
     A                                      "column":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"S0010F_SCR02_avKeys","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"AV_KEYS","dataLength":"1134"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"true","blankFill":"false","rjZe-
     A                                      roFill":"false","dataType":"char","-
     A                                      formatting":"Text","textTransform":-
     A                                      "none","designValue":"[AV_KEYS]"},"-
     A                                      left":"0px","top":"0px","visibility-
     A                                      ":"hidden"},{"id":"S0010F_SCR02_act-
     A                                      ion","field type":"html container",-
     A                                      "white space":"normal","left":"0px"-
     A                                      ,"top":"10px","width":"230px","css -
     A                                      class":"action-panel-converted","he-
     A                                      ight":"700px","html":"<div class=\"-
     A                                      top\"></div><div class=\"imagetop\"-
     A                                      ><img src=\"/profoundui/userdata/im-
     A                                      ages/bar_top.png\" /></div><div cla-
     A                                      ss=\"menulinks\"></div><div class=\-
     A                                      "imagebottom\"><img src=\"/profound-
     A                                      ui/userdata/images/bar_bottom.png\"-
     A                                       /></div><div class=\"bottom\"></di-
     A                                      v>"},{"field type":"icon menu butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"32px-
     A                                      ","z index":"20","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1170px","id":"-
     A                                      S0010F_SCR02_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon s-
     A                                      ource":"/profoundui/userdata/images-
     A                                      /systool/systools.png","data functi-
     A                                      on":"SystemToolbarSystools","show d-
     A                                      own arrow":"Yes"},{"field type":"pa-
     A                                      nel","panel style":"TransformButton-
     A                                      Bar","id":"S0010F_SCR02_ButtonBar",-
     A                                      "top":"35px","left":"1036px","width-
     A                                      ":"187px","height":"28px","css clas-
     A                                      s":"stationary","visibility":"hidde-
     A                                      n","locked in place":"true"},{"fiel-
     A                                      d type":"button","css class":"stati-
     A                                      onary","width":"25px","height":"24p-
     A                                      x","top":"40px","background color":-
     A                                      "#FFFFFF","background repeat":"no-r-
     A                                      epeat","border top style":"none","b-
     A                                      order right style":"none","border b-
     A                                      ottom style":"none","border left st-
     A                                      yle":"none","cursor":"default","vis-
     A                                      ibility":"hidden","locked in place"-
     A                                      :"true","left":"1040px","id":"S0010-
     A                                      F_SCR02_BtnSave","tool tip":"Save",-
     A                                      "onclick":"SystemToolbarSave","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/save.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1066px","id"-
     A                                      :"S0010F_SCR02_BtnRefresh","tool ti-
     A                                      p":"Refresh","onclick":"SystemToolb-
     A                                      arRefresh","background image":"url(-
     A                                      ''/profoundui/userdata/images/systo-
     A                                      ol/refresh.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1092px","id":"S0010F_SCR02_B-
     A                                      tnSearch","tool tip":"Search","oncl-
     A                                      ick":"SystemToolbarSearch","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/search.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1118px","id":-
     A                                      "S0010F_SCR02_BtnDiaryItems","tool -
     A                                      tip":"Diary/Work Items - IDARTS","o-
     A                                      nclick":"SystemToolbarDiary","backg-
     A                                      round image":{"fieldName":"DryIcnUR-
     A                                      L","dataLength":"128","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none"}},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1144px","id":"S001-
     A                                      0F_SCR02_BtnSystemMessages","tool t-
     A                                      ip":"System Messages","onclick":"Sy-
     A                                      stemToolbarMessages","background im-
     A                                      age":{"fieldName":"MsgIcnURL","data-
     A                                      Length":"128","trimLeading":"false"-
     A                                      ,"trimTrailing":"true","blankFill":-
     A                                      "false","rjZeroFill":"false","dataT-
     A                                      ype":"char","formatting":"Text","te-
     A                                      xtTransform":"none"}},{"field type"-
     A                                      :"button","css class":"sta')
     A                                  1  4HTML('tionary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1196px","id-
     A                                      ":"S0010F_SCR02_BtnHelp","tool tip"-
     A                                      :"Help","onclick":"SystemToolbarHel-
     A                                      p","background image":"url(''/profo-
     A                                      undui/userdata/images/systool/help.-
     A                                      png'')"},{"id":"S0010F_SCR02_ImgSys-
     A                                      ToolBottom","field type":"image","i-
     A                                      mage source":"/profoundui/userdata/-
     A                                      images/systool/butbarbot.png","left-
     A                                      ":"1036px","top":"64px","width":"18-
     A                                      7px","locked in place":"true","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden"},{"id":"S0010F_SCR02_MainTab-
     A                                      Panel","field type":"tab panel","ta-
     A                                      b panel style":"Transform","tab nam-
     A                                      es":"Tab 1","active tab":"0","left"-
     A                                      :"250px","top":"70px","width":"970p-
     A                                      x","height":"657px","z index":"8","-
     A                                      locked in place":"true","css class"-
     A                                      :"tab-panel","css class 2":"station-
     A                                      ary"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"S0010F-
     A                                      _SCR02_BtnHiddenSave","value":"btnS-
     A                                      ave","top":"100px","response":{"fie-
     A                                      ldName":"btnSave","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"}},{"id":"S0010F_SCR-
     A                                      02_fkeyMenu","field type":"menu","l-
     A                                      eft":"10px","top":"120px","height":-
     A                                      "350px","width":"230px","hover back-
     A                                      ground color":"#9AAA61","hover text-
     A                                       color":"#FFFFFF","border color":"#-
     A                                      4C6106","menu option indent":"10px"-
     A                                      ,"background color":"#758B27","css -
     A                                      class":"action-menu","css class 2":-
     A                                      "stationary","z index":"101"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"S0010F_SCR02_BtnH-
     A                                      iddenRefresh","value":"btnRefresh",-
     A                                      "top":"125px","response":{"fieldNam-
     A                                      e":"btnRefresh","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"S0010F_SCR02_BtnHiddenSearch","-
     A                                      value":"btnSearch","top":"150px","r-
     A                                      esponse":{"fieldName":"btnSearch","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"S0010F_SCR02_-
     A                                      BtnHiddenDiaryItems","value":"btnDi-
     A                                      ary","top":"175px","response":{"fie-
     A                                      ldName":"btnDiary","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"S0010F_SCR02_BtnHiddenSystem-
     A                                      Messages","value":"btnMessage","top-
     A                                      ":"200px","response":{"fieldName":"-
     A                                      btnMessage","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      S0010F_SCR02_BtnHiddenWorkSubmitJob-
     A                                      ","value":"btnWrksbmjob","top":"225-
     A                                      px","response":{"fieldName":"btnWrk-
     A                                      Job","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"S0010F_-
     A                                      SCR02_BtnHiddenWorkPrinterOutput","-
     A                                      value":"btnWrkprtout","top":"250px"-
     A                                      ,"response":{"fieldName":"btnWrkPrn-
     A                                      t","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"S0010F_SC-
     A                                      R02_BtnHiddenImageQueue","value":"b-
     A                                      tnImgQue","top":"275px","response":-
     A                                      {"fieldName":"btnImgQue","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"S0010F_SCR02_BtnHidden-
     A                                      Help","value":"btnHelp","top":"300p-
     A                                      x","response":{"fieldName":"btnHelp-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"btnSubmit","field type":"b-
     A                                      utton","value":"Enter","shortcut ke-
     A                                      y":"Enter","left":"14px","top":"150-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","aut')
     A                                  1  5HTML('o arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnPAGEDOWN","field-
     A                                       type":"button","value":"Page Down"-
     A                                      ,"shortcut key":"PageDown","respons-
     A                                      e":{"fieldName":"*IN01","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"left":"14px-
     A                                      ","top":"183px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnPAGEUP","field type-
     A                                      ":"button","value":"Page Up","short-
     A                                      cut key":"PageUp","response":{"fiel-
     A                                      dName":"*IN02","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"left":"14px","top":"-
     A                                      216px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02 89                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC3    RWINDOW    0     -
     A                                      RROWS      2    C1    1C2    11 RER-
     A                                      RMSGID  5    C6    SSMODEC7    SYM0-
     A                                      505C6    SYMESGC0    C0    E1    3 -
     A                                          89')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-11"},"items":[{"id":"SCR03"-
     A                                      ,"field type":"panel","panel style"-
     A                                      :"Transform Dialog","text align":"c-
     A                                      enter","left":"5px","top":"5px","he-
     A                                      ight":"370px","width":"534px","z in-
     A                                      dex":"8","locked in place":"true"},-
     A                                      {"id":"constant13","field type":"ou-
     A                                      tput field","left":"29px","cursor c-
     A                                      olumn":"2","top":"65px","cursor row-
     A                                      ":"1","value":"js: currentUser()","-
     A                                      css class":"output-field","css clas-
     A                                      s 2":"profound-converted"},{"id":"S-
     A                                      CPRD3","field type":"output field",-
     A                                      "value":{"fieldName":"SCPRD3","desi-
     A                                      gnValue":"[SCPRD3]","refField":"NAM-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"false","textTransform-
     A                                      ":"none"},"css class":"output-field-
     A                                      ","left":"127px","cursor column":"1-
     A                                      6","top":"65px","cursor row":"1","c-
     A                                      ss class 2":"HI","css class 3":"pro-
     A                                      found-converted"},{"id":"constant14-
     A                                      ","field type":"output field","valu-
     A                                      e":"SCR03","css class":"constant","-
     A                                      left":"477px","cursor column":"66",-
     A                                      "top":"65px","cursor row":"1","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"constant15","field type":"output-
     A                                       field","value":"Type choices, pres-
     A                                      s Enter.","css class":"constant","l-
     A                                      eft":"29px","cursor column":"2","to-
     A                                      p":"105px","cursor row":"3","css cl-
     A                                      ass 2":"BLU","css class 3":"profoun-
     A                                      d-converted"},{"id":"constant16","f-
     A                                      ield type":"output field","value":"-
     A                                      System . . . . . . . . . . .","css -
     A                                      class":"constant","left":"43px","cu-
     A                                      rsor column":"4","top":"125px","cur-
     A                                      sor row":"4","css class 2":"profoun-
     A                                      d-converted"},{"id":"SSRSYS","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SSRSYS","designValue":-
     A                                      "[SSRSYS]","refField":"PREF01/DS10 -
     A                                      *LIBL/SREFP","dataType":"reference"-
     A                                      ,"formatting":"Text","trimLeading":-
     A                                      "false","trimTrailing":"true","text-
     A                                      Transform":"uppercase"},"text trans-
     A                                      form":"uppercase","left":"260px","c-
     A                                      ursor column":"35","top":"125px","c-
     A                                      ursor row":"4","width":"71px","css -
     A                                      class 3":"profound-converted"},{"id-
     A                                      ":"constant17","field type":"output-
     A                                       field","value":"User ID  . . . . .-
     A                                       . . . . .","css class":"constant",-
     A                                      "left":"43px","cursor column":"4","-
     A                                      top":"165px","cursor row":"6","css -
     A                                      class 2":"profound-converted"},{"id-
     A                                      ":"SSIUSR","field type":"textbox","-
     A                                      css class":"input","css class 2":"t-
     A                                      extbox","value":{"fieldName":"SSIUS-
     A                                      R","designValue":"[SSIUSR]","refFie-
     A                                      ld":"PREF01/DS10 *LIBL/SREFP","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"true","textTransform":"upperc-
     A                                      ase"},"text transform":"uppercase",-
     A                                      "left":"260px","cursor column":"35"-
     A                                      ,"top":"165px","cursor row":"6","wi-
     A                                      dth":"71px","css class 3":"profound-
     A                                      -converted"},{"id":"constant18","fi-
     A                                      eld type":"output field","value":"M-
     A                                      ode . . . . . . . . . . . .","css c-
     A                                      lass":"constant","left":"43px","cur-
     A                                      sor column":"4","top":"205px","curs-
     A                                      or row":"8","css class 2":"profound-
     A                                      -converted"},{"id":"SSMODE","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SSMODE","designValue":"-
     A                                      [SSMODE]","refField":"PREF01/FLAG *-
     A                                      LIBL/SREFP","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase"},"text transf-
     A                                      orm":"uppercase","left":"260px","cu-
     A                                      rsor column":"35","top":"205px","cu-
     A                                      rsor row":"8","width":"8px","error -
     A                                      message id":"SYM0505","error messag-
     A                                      e file":"SYMESG","error condition":-
     A                                      {"fieldName":"89","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"error messages":-
     A                                      "1 message","css class 3":"profound-
     A                                      -converted"},{"id":"constant19","fi-
     A                                      eld type":"output field","value":"1-
     A                                      =Start","css class":"constant","lef-
     A                                      t":"288px","cursor column":"39","to-
     A                                      p":"205px","cursor row":"8","css cl-
     A                                      ass 2":"profound-converted"},{"id":-
     A                                      "constant20","field type":"output f-
     A                                      ield","value":"2=End","css class":"-
     A                                      constant","left":"288px","cursor co-
     A                                      lumn":"39","top":"225px","cursor ro-
     A                                      w":"9","css class 2":"profound-conv-
     A                                      erted"},{"id":"btnSubmit","field ty-
     A                                      pe":"button","value":"Enter","short-
     A                                      cut key":"Enter","left":"14px","top-
     A                                      ":"330px","width":"80px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF12","field type":"button-
     A                                      ","value":"Cancel","shortcut key":"-
     A                                      F12","left":"104px","top":"330px","-
     A                                      width":"80px","height":"23px","css -
     A                                      class":"button","auto arrange":"tru-
     A                                      e","cursor":"default"},{"id":"btnPA-
     A                                      GEDOWN","field type":"button","valu-
     A                                      e":"Page Down","shortcut key":"Page-
     A                                      Down","response":{"fieldNa')
     A                                  1  4HTML('me":"*IN01","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"left":"194px","to-
     A                                      p":"330px","width":"80px","height":-
     A                                      "23px","css class":"button","auto a-
     A                                      rrange":"true","visibility":"hidden-
     A                                      ","cursor":"default"},{"id":"btnPAG-
     A                                      EUP","field type":"button","value":-
     A                                      "Page Up","shortcut key":"PageUp","-
     A                                      response":{"fieldName":"*IN02","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"left-
     A                                      ":"284px","top":"330px","width":"80-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","visibi-
     A                                      lity":"hidden","cursor":"default"}]-
     A                                      }')
     A            SCPRD3    R        H      REFFLD(NAME)
     A            SSIUSR    R        H      REFFLD(PREF01/DS10 *LIBL/SREFP)
     A            SSMODE    R        H      REFFLD(PREF01/FLAG *LIBL/SREFP)
     A            SSRSYS    R        H      REFFLD(PREF01/DS10 *LIBL/SREFP)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"S0010F_MSGSFLC_avKeys","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"AV_KEYS","dataLength":"1-
     A                                      134","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none","designValue":"[AV_KEYS]-
     A                                      "},"left":"0px","top":"0px","visibi-
     A                                      lity":"hidden"},{"id":"S0010F_MSGSF-
     A                                      LC_action","field type":"html conta-
     A                                      iner","white space":"normal","left"-
     A                                      :"0px","top":"10px","width":"230px"-
     A                                      ,"css class":"action-panel-converte-
     A                                      d","height":"700px","html":"<div cl-
     A                                      ass=\"top\"></div><div class=\"imag-
     A                                      etop\"><img src=\"/profoundui/userd-
     A                                      ata/images/bar_top.png\" /></div><d-
     A                                      iv class=\"menulinks\"></div><div c-
     A                                      lass=\"imagebottom\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_bottom-
     A                                      .png\" /></div><div class=\"bottom\-
     A                                      "></div>"},{"field type":"icon menu-
     A                                       button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"32px","z index":"20","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1170px",-
     A                                      "id":"S0010F_MSGSFLC_BtnIconMenuSys-
     A                                      temTools","tool tip":"System Tools"-
     A                                      ,"icon source":"/profoundui/userdat-
     A                                      a/images/systool/systools.png","dat-
     A                                      a function":"SystemToolbarSystools"-
     A                                      ,"show down arrow":"Yes"},{"field t-
     A                                      ype":"panel","panel style":"Transfo-
     A                                      rmButtonBar","id":"S0010F_MSGSFLC_B-
     A                                      uttonBar","top":"35px","left":"1036-
     A                                      px","width":"187px","height":"28px"-
     A                                      ,"css class":"stationary","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e"},{"field type":"button","css cla-
     A                                      ss":"stationary","width":"25px","he-
     A                                      ight":"24px","top":"40px","backgrou-
     A                                      nd color":"#FFFFFF","background rep-
     A                                      eat":"no-repeat","border top style"-
     A                                      :"none","border right style":"none"-
     A                                      ,"border bottom style":"none","bord-
     A                                      er left style":"none","cursor":"def-
     A                                      ault","visibility":"hidden","locked-
     A                                       in place":"true","left":"1040px","-
     A                                      id":"S0010F_MSGSFLC_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"S0010F_MSGSFLC_BtnRef-
     A                                      resh","tool tip":"Refresh","onclick-
     A                                      ":"SystemToolbarRefresh","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/refresh.png'')"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1092px","id":"-
     A                                      S0010F_MSGSFLC_BtnSearch","tool tip-
     A                                      ":"Search","onclick":"SystemToolbar-
     A                                      Search","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      search.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1118px","id":"S0010F_MSGSFLC_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1144px","id":"S0010F_MSGSFLC_BtnSys-
     A                                      temMessages","tool tip":"System Mes-
     A                                      sages","onclick":"SystemToolbarMess-
     A                                      ages","background image":{"fieldNam-
     A                                      e":"MsgIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"butt')
     A                                  1  4HTML('on","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1196px","id":"S0010F_MSGSF-
     A                                      LC_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/help.png'')"},{"id-
     A                                      ":"S0010F_MSGSFLC_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"S0010F_MSGSFLC_MainTabPanel","f-
     A                                      ield type":"tab panel","tab panel s-
     A                                      tyle":"Transform","tab names":"Tab -
     A                                      1","active tab":"0","left":"250px",-
     A                                      "top":"70px","width":"970px","heigh-
     A                                      t":"657px","z index":"8","locked in-
     A                                       place":"true","css class":"tab-pan-
     A                                      el","css class 2":"stationary"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"S0010F_MSGSFLC_-
     A                                      BtnHiddenSave","value":"btnSave","t-
     A                                      op":"100px","response":{"fieldName"-
     A                                      :"btnSave","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"S0010F_MSGSFLC_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"S0010F_MSGSFLC_BtnHidd-
     A                                      enRefresh","value":"btnRefresh","to-
     A                                      p":"125px","response":{"fieldName":-
     A                                      "btnRefresh","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "S0010F_MSGSFLC_BtnHiddenSearch","v-
     A                                      alue":"btnSearch","top":"150px","re-
     A                                      sponse":{"fieldName":"btnSearch","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"S0010F_MSGSFLC-
     A                                      _BtnHiddenDiaryItems","value":"btnD-
     A                                      iary","top":"175px","response":{"fi-
     A                                      eldName":"btnDiary","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"S0010F_MSGSFLC_BtnHiddenSys-
     A                                      temMessages","value":"btnMessage","-
     A                                      top":"200px","response":{"fieldName-
     A                                      ":"btnMessage","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"S0010F_MSGSFLC_BtnHiddenWorkSubm-
     A                                      itJob","value":"btnWrksbmjob","top"-
     A                                      :"225px","response":{"fieldName":"b-
     A                                      tnWrkJob","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"S0-
     A                                      010F_MSGSFLC_BtnHiddenWorkPrinterOu-
     A                                      tput","value":"btnWrkprtout","top":-
     A                                      "250px","response":{"fieldName":"bt-
     A                                      nWrkPrnt","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"S0-
     A                                      010F_MSGSFLC_BtnHiddenImageQueue","-
     A                                      value":"btnImgQue","top":"275px","r-
     A                                      esponse":{"fieldName":"btnImgQue","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"S0010F_MSGSFL-
     A                                      C_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"MSGSFL","field -
     A                                      type":"grid","number of columns":"1-
     A                                      ","record format name":"MSGSFL","di-
     A                                      splay subfile":"true","dis')
     A                                  1  5HTML('play control record":"true","-
     A                                      subfile size":"5","initialize subfi-
     A                                      le":"true","row height":"20","css c-
     A                                      lass":"subfilegrid","css class 2":"-
     A                                      profound-converted","parent tab pan-
     A                                      el":"S0010F_MSGSFLC_MainTabPanel","-
     A                                      parent tab":"0","subfile end":{"fie-
     A                                      ldName":"N10","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"number of row-
     A                                      s":"1","has header":"false","subfil-
     A                                      e program message queue":{"fieldNam-
     A                                      e":"Q1PGM","dataLength":"10","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"subf-
     A                                      ile control program message queue":-
     A                                      {"fieldName":"Q1PGM","dataLength":"-
     A                                      10","trimLeading":"false","trimTrai-
     A                                      ling":"true","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"},"subfile message key":{"fieldN-
     A                                      ame":"MSGKEY","dataLength":"4","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"to-
     A                                      p":"570px","left":"269px","column w-
     A                                      idths":"595"},{"id":"btnSubmit","fi-
     A                                      eld type":"button","value":"Enter",-
     A                                      "shortcut key":"Enter","left":"14px-
     A                                      ","top":"150px","width":"100px","he-
     A                                      ight":"23px","css class":"button","-
     A                                      auto arrange":"true","cursor":"defa-
     A                                      ult"},{"id":"btnPAGEDOWN","field ty-
     A                                      pe":"button","value":"Page Down","s-
     A                                      hortcut key":"PageDown","response":-
     A                                      {"fieldName":"*IN01","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnPAGEUP","field type":"-
     A                                      button","value":"Page Up","shortcut-
     A                                       key":"PageUp","response":{"fieldNa-
     A                                      me":"*IN02","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"left":"14px","top":"216-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
