     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 2004
     A****************************************************************
     A* IDARTS OVERRIDE PER USER FILE
     *** This file allows the override of the idarts default setting
     ***  in the system control file.
     ***  IF the user is setup in this file, the setting in this file will
     ***  override the system settings.  (if Idarts not installed (flag), but
     ***  there is a user entry in this file, and the IDRT field is Not blank
     ***  for that user, then we act as if idarts is installed for this user.
     ***  (validate the other system values, and if valid, we execute idarts)
     ***
     ***  The transverse is also true.  If iDarts is installed (flag), and
     ***  there is a record in this file, and that record has a blank for
     ***  the IDRT field, then we will NOT execute iDarts, but instead
     ***  execute vdarts.
     A****************************************************************
     A*  REVISIONS:                                                  *
     A*                                                              *
     A                                      REF(SYREFP)
     A*
     A          R PID01                     TEXT('IDARTS USER OVERRIDE FILE')
     A            IDUSRP    R               REFFLD(USER)
     A                                      TEXT('iDarts - USER ID  ')
     a            IDIDRT    R               REFFLD(FLAG)
     A                                      TEXT('iDarts - Use Idarts? Y/ ')
     A            IDDS01    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS02    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS03    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS04    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS05    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS06    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS07    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS08    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS09    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDS10    R               REFFLD(DS10)
     A                                      TEXT('** FUTURE USE **')
     A            IDDT01    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT02    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT03    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT04    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT05    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT06    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT07    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT08    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT09    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            IDDT10    R               REFFLD(DT)
     A                                      TEXT('** FUTURE APPLICATION USE **')
     A            ID9201    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9202    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9203    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9204    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9205    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9206    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9207    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9208    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9209    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID9210    R               REFFLD(A92)
     A                                      TEXT('** FUTURE USE **')
     A            ID4001    R               REFFLD(DESC)
     A                                      TEXT('** FUTURE USE **')
     A            ID4002    R               REFFLD(DESC)
     A                                      TEXT('** FUTURE USE **')
     A            ID4003    R               REFFLD(DESC)
     A                                      TEXT('** FUTURE USE **')
     A            ID4004    R               REFFLD(DESC)
     A                                      TEXT('** FUTURE USE **')
     A            ID4005    R               REFFLD(DESC)
     A                                      TEXT('** FUTURE USE **')
     A            IDSTAT    R               REFFLD(STAT)
     A            IDUSER    R               REFFLD(USER)
     A            IDPGM     R               REFFLD(PGM)
     A            IDTIME    R               REFFLD(TIME)
     A            IDDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            IDIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A            IDIDT     R               REFFLD(DT)
     A                                      COLHDG('RCD CREATE' 'DATE')
     A            IDITIM    R               REFFLD(TIME)
     A                                      COLHDG('RCD CREATE' 'TIME')
