     A                                      REF(*LIBL/SCREFP)
     A          R SCR01
     A  11 20                               CA01(11 'Response Indicator *IN11')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCPATHC7    SCM0503C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"vali-
     A                                      d command key":{"fieldName":"*IN11"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "overlay range":"1-23"},"items":[{"-
     A                                      id":"SC070F_SCR01_avKeys","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"AV_KEYS","dataLength":"1134",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none","designValue":"[AV_KEYS]"},"l-
     A                                      eft":"0px","top":"0px","visibility"-
     A                                      :"hidden"},{"id":"SC070F_SCR01_acti-
     A                                      on","field type":"html container","-
     A                                      white space":"normal","left":"0px",-
     A                                      "top":"10px","width":"230px","css c-
     A                                      lass":"action-panel-converted","hei-
     A                                      ght":"700px","html":"<div class=\"t-
     A                                      op\"></div><div class=\"imagetop\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_top.png\" /></div><div clas-
     A                                      s=\"menulinks\"></div><div class=\"-
     A                                      imagebottom\"><img src=\"/profoundu-
     A                                      i/userdata/images/bar_bottom.png\" -
     A                                      /></div><div class=\"bottom\"></div-
     A                                      >"},{"field type":"icon menu button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"32px"-
     A                                      ,"z index":"20","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1170px","id":"S-
     A                                      C070F_SCR01_BtnIconMenuSystemTools"-
     A                                      ,"tool tip":"System Tools","icon al-
     A                                      ignment":"middle left","icon width"-
     A                                      :"16px","icon height":"24px","icon -
     A                                      source":"/profoundui/userdata/image-
     A                                      s/systool/systools.png","data funct-
     A                                      ion":"SystemToolbarSystools","show -
     A                                      down arrow":"Yes"},{"field type":"p-
     A                                      anel","panel style":"TransformButto-
     A                                      nBar","id":"SC070F_SCR01_ButtonBar"-
     A                                      ,"top":"35px","left":"1036px","widt-
     A                                      h":"187px","height":"28px","css cla-
     A                                      ss":"stationary","visibility":"hidd-
     A                                      en","locked in place":"true"},{"fie-
     A                                      ld type":"button","css class":"stat-
     A                                      ionary","width":"25px","height":"24-
     A                                      px","top":"40px","background color"-
     A                                      :"#FFFFFF","background repeat":"no--
     A                                      repeat","border top style":"none","-
     A                                      border right style":"none","border -
     A                                      bottom style":"none","border left s-
     A                                      tyle":"none","cursor":"default","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true","left":"1040px","id":"SC07-
     A                                      0F_SCR01_BtnSave","tool tip":"Save"-
     A                                      ,"onclick":"SystemToolbarSave","bac-
     A                                      kground image":"url(''/profoundui/u-
     A                                      serdata/images/systool/save.png'')"-
     A                                      },{"field type":"button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"40px","background-
     A                                       color":"#FFFFFF","background repea-
     A                                      t":"no-repeat","border top style":"-
     A                                      none","border right style":"none","-
     A                                      border bottom style":"none","border-
     A                                       left style":"none","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1066px","id-
     A                                      ":"SC070F_SCR01_BtnRefresh","tool t-
     A                                      ip":"Refresh","onclick":"SystemTool-
     A                                      barRefresh","background image":"url-
     A                                      (''/profoundui/userdata/images/syst-
     A                                      ool/refresh.png'')"},{"field type":-
     A                                      "button","css class":"stationary","-
     A                                      width":"25px","height":"24px","top"-
     A                                      :"40px","background color":"#FFFFFF-
     A                                      ","background repeat":"no-repeat","-
     A                                      border top style":"none","border ri-
     A                                      ght style":"none","border bottom st-
     A                                      yle":"none","border left style":"no-
     A                                      ne","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1092px","id":"SC070F_SCR01_-
     A                                      BtnSearch","tool tip":"Search","onc-
     A                                      lick":"SystemToolbarSearch","backgr-
     A                                      ound image":"url(''/profoundui/user-
     A                                      data/images/systool/search.png'')"}-
     A                                      ,{"field type":"button","css class"-
     A                                      :"stationary","width":"25px","heigh-
     A                                      t":"24px","top":"40px","background -
     A                                      color":"#FFFFFF","background repeat-
     A                                      ":"no-repeat","border top style":"n-
     A                                      one","border right style":"none","b-
     A                                      order bottom style":"none","border -
     A                                      left style":"none","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1118px","id"-
     A                                      :"SC070F_SCR01_BtnDiaryItems","tool-
     A                                       tip":"Diary/Work Items - IDARTS","-
     A                                      onclick":"SystemToolbarDiary","back-
     A                                      ground image":{"fieldName":"DryIcnU-
     A                                      RL","dataLength":"128","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"}},{"fi-
     A                                      eld type":"button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"40px","background color-
     A                                      ":"#FFFFFF","background repeat":"no-
     A                                      -repeat","border top style":"none",-
     A                                      "border right style":"none","border-
     A                                       bottom style":"none","border left -
     A                                      style":"none","cursor":"default","v-
     A                                      isibility":"hidden","locked in plac-
     A                                      e":"true","left":"1144px","id":"SC0-
     A                                      70F_SCR01_BtnSystemMessages","tool -
     A                                      tip":"System Messages","on')
     A                                  1  4HTML('click":"SystemToolbarMessages-
     A                                      ","background image":{"fieldName":"-
     A                                      MsgIcnURL","dataLength":"128","trim-
     A                                      Leading":"false","trimTrailing":"tr-
     A                                      ue","blankFill":"false","rjZeroFill-
     A                                      ":"false","dataType":"char","format-
     A                                      ting":"Text","textTransform":"none"-
     A                                      }},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1196px","i-
     A                                      d":"SC070F_SCR01_BtnHelp","tool tip-
     A                                      ":"Help","onclick":"SystemToolbarHe-
     A                                      lp","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/help-
     A                                      .png'')"},{"id":"SC070F_SCR01_ImgSy-
     A                                      sToolBottom","field type":"image","-
     A                                      image source":"/profoundui/userdata-
     A                                      /images/systool/butbarbot.png","lef-
     A                                      t":"1036px","top":"64px","width":"1-
     A                                      87px","locked in place":"true","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden"},{"id":"SC070F_SCR01_MainTa-
     A                                      bPanel","field type":"tab panel","t-
     A                                      ab panel style":"Transform","tab na-
     A                                      mes":"Tab 1","active tab":"0","left-
     A                                      ":"250px","top":"70px","width":"970-
     A                                      px","height":"657px","z index":"8",-
     A                                      "locked in place":"true","css class-
     A                                      ":"tab-panel","css class 2":"statio-
     A                                      nary"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"SC070-
     A                                      F_SCR01_BtnHiddenSave","value":"btn-
     A                                      Save","top":"100px","response":{"fi-
     A                                      eldName":"btnSave","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCFILE","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCFILE","designValue"-
     A                                      :"[SCFILE]","refField":"FLE","dataT-
     A                                      ype":"reference","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"false","textTransform":"none"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "288px","cursor column":"3","top":"-
     A                                      110px","cursor row":"1","css class -
     A                                      2":"top-line","parent tab panel":"S-
     A                                      C070F_SCR01_MainTabPanel","parent t-
     A                                      ab":"0","css class 3":"profound-con-
     A                                      verted"},{"id":"constant2","field t-
     A                                      ype":"output field","value":"Databa-
     A                                      se and Remarks Tracking System","cs-
     A                                      s class":"constant","left":"421px",-
     A                                      "cursor column":"22","top":"110px",-
     A                                      "cursor row":"1","css class 2":"top-
     A                                      -line","css class 3":"HI","parent t-
     A                                      ab panel":"SC070F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 4":"-
     A                                      profound-converted"},{"id":"SCRECF"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCRECF","designValu-
     A                                      e":"[SCRECF]","refField":"RECF","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"764px","cursor column":"71","to-
     A                                      p":"110px","cursor row":"1","css cl-
     A                                      ass 2":"top-line","parent tab panel-
     A                                      ":"SC070F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SC070F_SCR01_fk-
     A                                      eyMenu","field type":"menu","left":-
     A                                      "10px","top":"120px","height":"350p-
     A                                      x","width":"230px","hover backgroun-
     A                                      d color":"#9AAA61","hover text colo-
     A                                      r":"#FFFFFF","border color":"#4C610-
     A                                      6","menu option indent":"10px","bac-
     A                                      kground color":"#758B27","css class-
     A                                      ":"action-menu","css class 2":"stat-
     A                                      ionary","z index":"101"},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"SC070F_SCR01_BtnHidden-
     A                                      Refresh","value":"btnRefresh","top"-
     A                                      :"125px","response":{"fieldName":"b-
     A                                      tnRefresh","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant3","field-
     A                                       type":"output field","value":"Path-
     A                                       Id Maintenance","css class":"const-
     A                                      ant","left":"477px","cursor column"-
     A                                      :"30","top":"130px","cursor row":"2-
     A                                      ","parent tab panel":"SC070F_SCR01_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"SC070F_SCR01_Bt-
     A                                      nHiddenSearch","value":"btnSearch",-
     A                                      "top":"150px","response":{"fieldNam-
     A                                      e":"btnSearch","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"field type":"butto-
     A                                      n","left":"1140px","height":"18px",-
     A                                      "width":"75px","locked in place":"t-
     A                                      rue","css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"SC070F_SCR01_BtnHiddenDiaryItems-
     A                                      ","value":"btnDiary","top":"175px",-
     A                                      "response":{"fieldName":"btnDiary",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","')
     A                                  1  5HTML('css class":"button","cursor":-
     A                                      "default","visibility":"hidden","id-
     A                                      ":"SC070F_SCR01_BtnHiddenSystemMess-
     A                                      ages","value":"btnMessage","top":"2-
     A                                      00px","response":{"fieldName":"btnM-
     A                                      essage","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"SC07-
     A                                      0F_SCR01_BtnHiddenWorkSubmitJob","v-
     A                                      alue":"btnWrksbmjob","top":"225px",-
     A                                      "response":{"fieldName":"btnWrkJob"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant1","field type":"ou-
     A                                      tput field","value":"Path ID:","css-
     A                                       class":"constant","left":"484px","-
     A                                      cursor column":"31","top":"250px","-
     A                                      cursor row":"8","parent tab panel":-
     A                                      "SC070F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 2":"profound-c-
     A                                      onverted"},{"id":"SCPATH","field ty-
     A                                      pe":"textbox","css class":"input","-
     A                                      css class 2":"textbox","value":{"fi-
     A                                      eldName":"SCPATH","designValue":"[S-
     A                                      CPATH]","refField":"PATH","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"uppercase"-
     A                                      },"text transform":"uppercase","lef-
     A                                      t":"561px","cursor column":"42","to-
     A                                      p":"250px","cursor row":"8","width"-
     A                                      :"57px","css class 3":"UL","error m-
     A                                      essage id":"SCM0503","error message-
     A                                       file":"SCMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"20","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"SC070F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"SC070F_SC-
     A                                      R01_BtnHiddenWorkPrinterOutput","va-
     A                                      lue":"btnWrkprtout","top":"250px","-
     A                                      response":{"fieldName":"btnWrkPrnt"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"SC070F_SCR0-
     A                                      1_BtnHiddenImageQueue","value":"btn-
     A                                      ImgQue","top":"275px","response":{"-
     A                                      fieldName":"btnImgQue","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"SC070F_SCR01_BtnHiddenHe-
     A                                      lp","value":"btnHelp","top":"300px"-
     A                                      ,"response":{"fieldName":"btnHelp",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF03","field type":"button","valu-
     A                                      e":"Exit","shortcut key":"F3","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnCF05","field-
     A                                       type":"button","value":"Path id se-
     A                                      arch","shortcut key":"F5","left":"1-
     A                                      4px","top":"216px","width":"100px",-
     A                                      "height":"23px","css class":"button-
     A                                      ","auto arrange":"true","cursor":"d-
     A                                      efault"},{"id":"btnHELP","field typ-
     A                                      e":"button","shortcut key":"Alt-F1"-
     A                                      ,"onclick":"pui.showHelp()","value"-
     A                                      :"HELP","left":"14px","top":"249px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFILE    R        H      REFFLD(FLE)
     A            SCPATH    R        H      REFFLD(PATH)
     A            SCRECF    R        H      REFFLD(RECF)
     A          R SCR02
     A  11 20 21
     A  22 23 24
     A  25 26 27                            CA01(11 'Response Indicator *IN11')
     A  28 29 30
     A  31 32 33
     A  09 64 40                            CA02(20 'Response Indicator *IN20')
     A                                      SETOF(21 'Response Indicator *IN21')
     A                                      SETOF(22 'Response Indicator *IN22')
     A                                      SETOF(23 'Response Indicator *IN23')
     A                                      SETOF(24 'Response Indicator *IN24')
     A                                      SETOF(25 'Response Indicator *IN25')
     A                                      SETOF(26 'Response Indicator *IN26')
     A                                      SETOF(27 'Response Indicator *IN27')
     A                                      SETOF(28 'Response Indicator *IN28')
     A                                      SETOF(29 'Response Indicator *IN29')
     A                                      SETOF(30 'Response Indicator *IN30')
     A                                      SETOF(31 'Response Indicator *IN31')
     A                                      SETOF(32 'Response Indicator *IN32')
     A                                      SETOF(33 'Response Indicator *IN33')
     A                                  1  2HTML('QPUIREC15   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCCI01C7    SCM0505C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     20RERRMS-
     A                                      GID  5    C6    SCCI01C7    SCM0527-
     A                                      C6    SCMESGC5    *LIBLC0    E1    -
     A                                      3     32RERRMSGID  5    C6    SCCI0-
     A                                      2C7    SCM0505C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     21RERRMSGID  5 -
     A                                         C6    SCCI03C7    SCM0505C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     2-
     A                                      2RERRMSGID  5    C6    SCCI04C7    -
     A                                      SCM0505C6    SCMESGC5    *LIBLC0   -
     A                                       E1    3     23RERRMSGID  5    C6  -
     A                                        SCCI05C7    SCM0505C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     24RERRMS-
     A                                      GID  5    C6    SCCI06C7    SCM0505-
     A                                      C6    SCMESGC5    *LIBLC0    E1    -
     A                                      3     25RERRMSGID  5    C6    SCCI0-
     A                                      7C7    SCM0505C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     26RERRMSGID  5 -
     A                                         C6    SCCI08C7    SCM0505C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     2-
     A                                      7RERRMSGID  5    C6    SCCI09C7    -
     A                                      SCM0505C6    SCMESGC5    *LIBLC0   -
     A                                       E1    3     28RERRMSGID  5    C6  -
     A                                        SCCI10C7    SCM0505C6    SCMESGC5-
     A                                          *LIBLC0    E1    3     29RERRMS-
     A                                      GID  5    C6    SCNXPIC7    SCM0526-
     A                                      C6    SCMESGC5    *LIBLC0    E1    -
     A                                      3     30RERRMSGID  5    C6    SCNXP-
     A                                      IC7    SCM0528C6    SCMESGC5    *LI-
     A                                      BLC0    E1    3     33RERRMSGID  5 -
     A                                         C6    SCALORC7    SCM0502C6    S-
     A                                      CMESGC5    *LIBLC0    E1    3     3-
     A                                      1')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "set off":{"fieldName":"*IN20","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"set -
     A                                      off 2":{"fieldName":"*IN21","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"set off-
     A                                       3":{"fieldName":"*IN22","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"set off 4"-
     A                                      :{"fieldName":"*IN23","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"set off 5":{"-
     A                                      fieldName":"*IN24","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"set off 6":{"fie-
     A                                      ldName":"*IN25","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"set off 7":{"fieldN-
     A                                      ame":"*IN26","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"set off 8":{"fieldName-
     A                                      ":"*IN27","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"set off 9":{"fieldName":"-
     A                                      *IN28","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"set off 10":{"fieldName":"*I-
     A                                      N29","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"set off 11":{"fieldName":"*IN3-
     A                                      0","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"set off 12":{"fieldName":"*IN31"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "set off 13":{"fieldName":"*IN32","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"s-
     A                                      et off 14":{"fieldName":"*IN33","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"val-
     A                                      id command key":{"fieldName":"*IN11-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"overlay range":"1-23"},"items":[{-
     A                                      "id":"SCRF06","field type":"output -
     A                                      field","visibility":"hidden","value-
     A                                      ":{"fieldName":"SCRF06","designValu-
     A                                      e":"[SCRF06]","refField":"PIRF06 SM-
     A                                      PIP","dataType":"reference","format-
     A                                      ting":"Text","trimLeading":"false",-
     A                                      "trimTrailing":"true","textTransfor-
     A                                      m":"none"},"left":"0px","top":"-30p-
     A                                      x","css class":"profound-converted"-
     A                                      },{"id":"SCRF01","field type":"outp-
     A                                      ut field","visibility":"hidden","va-
     A                                      lue":{"fieldName":"SCRF01","designV-
     A                                      alue":"[SCRF01]","refField":"PIRF01-
     A                                       SMPIP","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none"},"left":"0px","top":"--
     A                                      30px","css class":"profound-convert-
     A                                      ed"},{"id":"SCRF02","field type":"o-
     A                                      utput field","visibility":"hidden",-
     A                                      "value":{"fieldName":"SCRF02","desi-
     A                                      gnValue":"[SCRF02]","refField":"PIR-
     A                                      F02 SMPIP","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"none"},"left":"0px","top"-
     A                                      :"-30px","css class":"profound-conv-
     A                                      erted"},{"id":"SCRF03","field type"-
     A                                      :"output field","visibility":"hidde-
     A                                      n","value":{"fieldName":"SCRF03","d-
     A                                      esignValue":"[SCRF03]","refField":"-
     A                                      PIRF03 SMPIP","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"SCRF04","field ty-
     A                                      pe":"output field","visibility":"hi-
     A                                      dden","value":{"fieldName":"SCRF04"-
     A                                      ,"designValue":"[SCRF04]","refField-
     A                                      ":"PIRF04 SMPIP","dataType":"refere-
     A                                      nce","formatting":"Text","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      textTransform":"none"},"left":"0px"-
     A                                      ,"top":"-30px","css class":"profoun-
     A                                      d-converted"},{"id":"SCRF05","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"SCRF-
     A                                      05","designValue":"[SCRF05]","refFi-
     A                                      eld":"PIRF05 SMPIP","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none"},"left":"0-
     A                                      px","top":"-30px","css class":"prof-
     A                                      ound-converted"},{"id":"SCRF10","fi-
     A                                      eld type":"output field","visibilit-
     A                                      y":"hidden","value":{"fieldName":"S-
     A                                      CRF10","designValue":"[SCRF10]","re-
     A                                      fField":"PIRF10 SMPIP","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"none"},"left"-
     A                                      :"0px","top":"-30px","css class":"p-
     A                                      rofound-converted"},{"id":"SCRF07",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"SCRF07","designValue":"[SCRF07]",-
     A                                      "refField":"PIRF07 SMPIP","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none"},"le-
     A                                      ft":"0px","top":"-30px","css class"-
     A                                      :"profound-converted"},{"id":"SCRF0-
     A                                      8","field type":"output field","vis-
     A                                      ibility":"hidden","value":{"fieldNa-
     A                                      me":"SCRF08","designValue":"[SCRF08-
     A                                      ]","refField":"PIRF08 SMPIP","dataT-
     A                                      ype":"reference","formatti')
     A                                  1  4HTML('ng":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"true","textTran-
     A                                      sform":"none"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"SCRF09","field type":"-
     A                                      output field","visibility":"hidden"-
     A                                      ,"value":{"fieldName":"SCRF09","des-
     A                                      ignValue":"[SCRF09]","refField":"PI-
     A                                      RF09 SMPIP","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"left":"0px","top-
     A                                      ":"-30px","css class":"profound-con-
     A                                      verted"},{"id":"SC070F_SCR02_avKeys-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"AV_KEYS","dataLeng-
     A                                      th":"1134","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none","designValue":"[AV-
     A                                      _KEYS]"},"left":"0px","top":"0px","-
     A                                      visibility":"hidden"},{"id":"SC070F-
     A                                      _SCR02_action","field type":"html c-
     A                                      ontainer","white space":"normal","l-
     A                                      eft":"0px","top":"10px","width":"23-
     A                                      0px","css class":"action-panel-conv-
     A                                      erted","height":"700px","html":"<di-
     A                                      v class=\"top\"></div><div class=\"-
     A                                      imagetop\"><img src=\"/profoundui/u-
     A                                      serdata/images/bar_top.png\" /></di-
     A                                      v><div class=\"menulinks\"></div><d-
     A                                      iv class=\"imagebottom\"><img src=\-
     A                                      "/profoundui/userdata/images/bar_bo-
     A                                      ttom.png\" /></div><div class=\"bot-
     A                                      tom\"></div>"},{"field type":"icon -
     A                                      menu button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"32px","z index":"20","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1170-
     A                                      px","id":"SC070F_SCR02_BtnIconMenuS-
     A                                      ystemTools","tool tip":"System Tool-
     A                                      s","icon alignment":"middle left","-
     A                                      icon width":"16px","icon height":"2-
     A                                      4px","icon source":"/profoundui/use-
     A                                      rdata/images/systool/systools.png",-
     A                                      "data function":"SystemToolbarSysto-
     A                                      ols","show down arrow":"Yes"},{"fie-
     A                                      ld type":"panel","panel style":"Tra-
     A                                      nsformButtonBar","id":"SC070F_SCR02-
     A                                      _ButtonBar","top":"35px","left":"10-
     A                                      36px","width":"187px","height":"28p-
     A                                      x","css class":"stationary","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1040px"-
     A                                      ,"id":"SC070F_SCR02_BtnSave","tool -
     A                                      tip":"Save","onclick":"SystemToolba-
     A                                      rSave","background image":"url(''/p-
     A                                      rofoundui/userdata/images/systool/s-
     A                                      ave.png'')"},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1066px","id":"SC070F_SCR02_BtnRefre-
     A                                      sh","tool tip":"Refresh","onclick":-
     A                                      "SystemToolbarRefresh","background -
     A                                      image":"url(''/profoundui/userdata/-
     A                                      images/systool/refresh.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1092px","id":"SC-
     A                                      070F_SCR02_BtnSearch","tool tip":"S-
     A                                      earch","onclick":"SystemToolbarSear-
     A                                      ch","background image":"url(''/prof-
     A                                      oundui/userdata/images/systool/sear-
     A                                      ch.png'')"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      118px","id":"SC070F_SCR02_BtnDiaryI-
     A                                      tems","tool tip":"Diary/Work Items -
     A                                      - IDARTS","onclick":"SystemToolbarD-
     A                                      iary","background image":{"fieldNam-
     A                                      e":"DryIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1144px-
     A                                      ","id":"SC070F_SCR02_BtnSystemMessa-
     A                                      ges","tool tip":"System Me')
     A                                  1  5HTML('ssages","onclick":"SystemTool-
     A                                      barMessages","background image":{"f-
     A                                      ieldName":"MsgIcnURL","dataLength":-
     A                                      "128","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none"}},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1196px","id":"SC070F_SCR02_BtnHelp-
     A                                      ","tool tip":"Help","onclick":"Syst-
     A                                      emToolbarHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"SC070F_-
     A                                      SCR02_ImgSysToolBottom","field type-
     A                                      ":"image","image source":"/profound-
     A                                      ui/userdata/images/systool/butbarbo-
     A                                      t.png","left":"1036px","top":"64px"-
     A                                      ,"width":"187px","locked in place":-
     A                                      "true","css class":"stationary","vi-
     A                                      sibility":"hidden"},{"id":"SC070F_S-
     A                                      CR02_MainTabPanel","field type":"ta-
     A                                      b panel","tab panel style":"Transfo-
     A                                      rm","tab names":"Tab 1","active tab-
     A                                      ":"0","left":"250px","top":"70px","-
     A                                      width":"970px","height":"657px","z -
     A                                      index":"8","locked in place":"true"-
     A                                      ,"css class":"tab-panel","css class-
     A                                       2":"stationary"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"SC070F_SCR02_BtnHiddenSave","-
     A                                      value":"btnSave","top":"100px","res-
     A                                      ponse":{"fieldName":"btnSave","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCR02_SCFILE","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCFI-
     A                                      LE","designValue":"[SCFILE]","refFi-
     A                                      eld":"FLE","dataType":"reference","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none"},"css class":"outp-
     A                                      ut-field","left":"288px","cursor co-
     A                                      lumn":"3","top":"110px","cursor row-
     A                                      ":"1","css class 2":"top-line","par-
     A                                      ent tab panel":"SC070F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       3":"profound-converted"},{"id":"co-
     A                                      nstant19","field type":"output fiel-
     A                                      d","value":"Database and Remarks Tr-
     A                                      acking System","css class":"constan-
     A                                      t","left":"421px","cursor column":"-
     A                                      22","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","css class-
     A                                       3":"HI","parent tab panel":"SC070F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 4":"profound-converte-
     A                                      d"},{"id":"SCR02_SCRECF","field typ-
     A                                      e":"output field","value":{"fieldNa-
     A                                      me":"SCRECF","designValue":"[SCRECF-
     A                                      ]","refField":"RECF","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"css cl-
     A                                      ass":"output-field","left":"764px",-
     A                                      "cursor column":"71","top":"110px",-
     A                                      "cursor row":"1","css class 2":"top-
     A                                      -line","parent tab panel":"SC070F_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SC070F_SCR02_fkeyMenu","fi-
     A                                      eld type":"menu","left":"10px","top-
     A                                      ":"120px","height":"350px","width":-
     A                                      "230px","hover background color":"#-
     A                                      9AAA61","hover text color":"#FFFFFF-
     A                                      ","border color":"#4C6106","menu op-
     A                                      tion indent":"10px","background col-
     A                                      or":"#758B27","css class":"action-m-
     A                                      enu","css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"SC070F_SCR02_BtnHiddenRefresh","v-
     A                                      alue":"btnRefresh","top":"125px","r-
     A                                      esponse":{"fieldName":"btnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant20","field type":"ou-
     A                                      tput field","value":"Path ID Mainte-
     A                                      nance","css class":"constant","left-
     A                                      ":"484px","cursor column":"31","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"SC070F_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCMODE-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCMODE","designVal-
     A                                      ue":"[SCMODE]","refField":"NM10","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","vi-
     A                                      sibility":{"fieldName":"N09","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"764px","cursor column"-
     A                                      :"71","top":"150px","cursor row":"3-
     A                                      ","css class 2":"HI","description":-
     A                                      "ADD/UPDATE MODE","parent tab panel-
     A                                      ":"SC070F_SCR02_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidd')
     A                                  1  6HTML('en","id":"SC070F_SCR02_BtnHid-
     A                                      denSearch","value":"btnSearch","top-
     A                                      ":"150px","response":{"fieldName":"-
     A                                      btnSearch","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"S-
     A                                      C070F_SCR02_BtnHiddenDiaryItems","v-
     A                                      alue":"btnDiary","top":"175px","res-
     A                                      ponse":{"fieldName":"btnDiary","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"id-
     A                                      ":"constant4","field type":"output -
     A                                      field","value":"Path ID:","css clas-
     A                                      s":"constant","left":"302px","curso-
     A                                      r column":"5","top":"190px","cursor-
     A                                       row":"5","parent tab panel":"SC070-
     A                                      F_SCR02_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCR02_SCPATH","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCPATH","designValue":"[SCPAT-
     A                                      H]","refField":"PATH","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"190px"-
     A                                      ,"cursor row":"5","description":"Pa-
     A                                      th ID","parent tab panel":"SC070F_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"constant18","field type":"-
     A                                      output field","value":"Status:","cs-
     A                                      s class":"constant","left":"645px",-
     A                                      "cursor column":"54","top":"190px",-
     A                                      "cursor row":"5","parent tab panel"-
     A                                      :"SC070F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCSTAT","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCSTAT","designValue":"[SCST-
     A                                      AT]","refField":"FLAG","dataType":"-
     A                                      reference","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"f-
     A                                      alse","textTransform":"none"},"css -
     A                                      class":"output-field","left":"708px-
     A                                      ","cursor column":"63","top":"190px-
     A                                      ","cursor row":"5","description":"S-
     A                                      tatus","parent tab panel":"SC070F_S-
     A                                      CR02_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"SC070F_SCR-
     A                                      02_BtnHiddenSystemMessages","value"-
     A                                      :"btnMessage","top":"200px","respon-
     A                                      se":{"fieldName":"btnMessage","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"SC070F_SCR02_BtnH-
     A                                      iddenWorkSubmitJob","value":"btnWrk-
     A                                      sbmjob","top":"225px","response":{"-
     A                                      fieldName":"btnWrkJob","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant5","field type":"output field","-
     A                                      value":"Custom IDs associated with -
     A                                      this Path:","css class":"constant",-
     A                                      "left":"302px","cursor column":"5",-
     A                                      "top":"230px","cursor row":"7","par-
     A                                      ent tab panel":"SC070F_SCR02_MainTa-
     A                                      bPanel","parent tab":"0","css class-
     A                                       2":"profound-converted"},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"SC070F_SCR02_BtnHidde-
     A                                      nWorkPrinterOutput","value":"btnWrk-
     A                                      prtout","top":"250px","response":{"-
     A                                      fieldName":"btnWrkPrnt","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant6","field type":"output field",-
     A                                      "value":"1.","css class":"constant"-
     A                                      ,"left":"379px","cursor column":"16-
     A                                      ","top":"270px","cursor row":"9","p-
     A                                      arent tab panel":"SC070F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCCI01","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCCI01",-
     A                                      "designValue":"[SCCI01]","refField"-
     A                                      :"CODE","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"414px","cursor-
     A                                       column":"21","top":"270px","cursor-
     A                                       row":"9","width":"15px","read only-
     A                                      ":{"fieldName":"09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"css cla-
     A                                      ss 3":{"fieldName":"09","dataType":-
     A                                      "expression","formatting":"Indicato-
     A                                      r","indFormat":"Custom Values","cus-
     A                                      tomTrue":"PR","customFalse":""},"cs-
     A                                      s class 4":{"fieldName":"N09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"UL","customFalse":"-
     A                                      "},"error message id":"SCM0505","er-
     A                                      ror message file":"SCMESG","error m-
     A                                      essage library":"*LIBL","error cond-
     A                                      ition":{"fieldName":"20","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"2 messages","error')
     A                                  1  7HTML(' message id 2":"SCM0527","err-
     A                                      or message file 2":"SCMESG","error -
     A                                      message library 2":"*LIBL","error c-
     A                                      ondition 2":{"fieldName":"32","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"desc-
     A                                      ription":"Custom ID 01","parent tab-
     A                                       panel":"SC070F_SCR02_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 5":"pr-
     A                                      ofound-converted"},{"id":"constant7-
     A                                      ","field type":"output field","valu-
     A                                      e":"2.","css class":"constant","lef-
     A                                      t":"491px","cursor column":"32","to-
     A                                      p":"270px","cursor row":"9","parent-
     A                                       tab panel":"SC070F_SCR02_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCCI0-
     A                                      2","field type":"textbox","css clas-
     A                                      s":"input","css class 2":"textbox",-
     A                                      "value":{"fieldName":"SCCI02","desi-
     A                                      gnValue":"[SCCI02]","refField":"COD-
     A                                      E","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase"},"text transform":"upp-
     A                                      ercase","left":"519px","cursor colu-
     A                                      mn":"36","top":"270px","cursor row"-
     A                                      :"9","width":"15px","read only":{"f-
     A                                      ieldName":"09","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"css class 3"-
     A                                      :{"fieldName":"09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"PR","customFalse":""},"css cla-
     A                                      ss 4":{"fieldName":"N09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"UL","customFalse":""},"e-
     A                                      rror message id":"SCM0505","error m-
     A                                      essage file":"SCMESG","error messag-
     A                                      e library":"*LIBL","error condition-
     A                                      ":{"fieldName":"21","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"error messages-
     A                                      ":"1 message","description":"Custom-
     A                                       ID 02","parent tab panel":"SC070F_-
     A                                      SCR02_MainTabPanel","parent tab":"0-
     A                                      ","css class 5":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"SC070F_SC-
     A                                      R02_BtnHiddenImageQueue","value":"b-
     A                                      tnImgQue","top":"275px","response":-
     A                                      {"fieldName":"btnImgQue","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"con-
     A                                      stant8","field type":"output field"-
     A                                      ,"value":"3.","css class":"constant-
     A                                      ","left":"379px","cursor column":"1-
     A                                      6","top":"290px","cursor row":"10",-
     A                                      "parent tab panel":"SC070F_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCCI03","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCCI03-
     A                                      ","designValue":"[SCCI03]","refFiel-
     A                                      d":"CODE","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"414px","curs-
     A                                      or column":"21","top":"290px","curs-
     A                                      or row":"10","width":"15px","read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"error message id":"SCM0505",-
     A                                      "error message file":"SCMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"22","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","description"-
     A                                      :"Custom Id 03","parent tab panel":-
     A                                      "SC070F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 5":"profound-c-
     A                                      onverted"},{"id":"constant9","field-
     A                                       type":"output field","value":"4.",-
     A                                      "css class":"constant","left":"491p-
     A                                      x","cursor column":"32","top":"290p-
     A                                      x","cursor row":"10","parent tab pa-
     A                                      nel":"SC070F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCCI04","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCCI04","designValue-
     A                                      ":"[SCCI04]","refField":"CODE","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"519px","cursor column":"36-
     A                                      ","top":"290px","cursor row":"10","-
     A                                      width":"15px","read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"error m-
     A                                      essage id":"SCM0505","erro')
     A                                  1  8HTML('r message file":"SCMESG","err-
     A                                      or message library":"*LIBL","error -
     A                                      condition":{"fieldName":"23","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"1 message","description-
     A                                      ":"Custom ID 04","parent tab panel"-
     A                                      :"SC070F_SCR02_MainTabPanel","paren-
     A                                      t tab":"0","css class 5":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      SC070F_SCR02_BtnHiddenHelp","value"-
     A                                      :"btnHelp","top":"300px","response"-
     A                                      :{"fieldName":"btnHelp","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant10","field type":"output field"-
     A                                      ,"value":"5.","css class":"constant-
     A                                      ","left":"379px","cursor column":"1-
     A                                      6","top":"310px","cursor row":"11",-
     A                                      "parent tab panel":"SC070F_SCR02_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"SCCI05","field type":"textbox","c-
     A                                      ss class":"input","css class 2":"te-
     A                                      xtbox","value":{"fieldName":"SCCI05-
     A                                      ","designValue":"[SCCI05]","refFiel-
     A                                      d":"CODE","dataType":"reference","f-
     A                                      ormatting":"Text","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","textTra-
     A                                      nsform":"uppercase"},"text transfor-
     A                                      m":"uppercase","left":"414px","curs-
     A                                      or column":"21","top":"310px","curs-
     A                                      or row":"11","width":"15px","read o-
     A                                      nly":{"fieldName":"09","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"true / false"},"css -
     A                                      class 3":{"fieldName":"09","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"Custom Values","-
     A                                      customTrue":"PR","customFalse":""},-
     A                                      "css class 4":{"fieldName":"N09","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"Custom Val-
     A                                      ues","customTrue":"UL","customFalse-
     A                                      ":""},"error message id":"SCM0505",-
     A                                      "error message file":"SCMESG","erro-
     A                                      r message library":"*LIBL","error c-
     A                                      ondition":{"fieldName":"24","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"1 message","description"-
     A                                      :"Custom ID 05","parent tab panel":-
     A                                      "SC070F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 5":"profound-c-
     A                                      onverted"},{"id":"constant11","fiel-
     A                                      d type":"output field","value":"6."-
     A                                      ,"css class":"constant","left":"491-
     A                                      px","cursor column":"32","top":"310-
     A                                      px","cursor row":"11","parent tab p-
     A                                      anel":"SC070F_SCR02_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCCI06","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCCI06","designValu-
     A                                      e":"[SCCI06]","refField":"CODE","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"uppe-
     A                                      rcase"},"text transform":"uppercase-
     A                                      ","left":"519px","cursor column":"3-
     A                                      6","top":"310px","cursor row":"11",-
     A                                      "width":"15px","read only":{"fieldN-
     A                                      ame":"09","dataType":"expression","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"true / false"},"css class 3":{"fi-
     A                                      eldName":"09","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"Custom Values","customTrue":"-
     A                                      PR","customFalse":""},"css class 4"-
     A                                      :{"fieldName":"N09","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"UL","customFalse":""},"error -
     A                                      message id":"SCM0505","error messag-
     A                                      e file":"SCMESG","error message lib-
     A                                      rary":"*LIBL","error condition":{"f-
     A                                      ieldName":"25","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"error messages":"1 -
     A                                      message","description":"Custom ID 0-
     A                                      6","parent tab panel":"SC070F_SCR02-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 5":"profound-converted"},{"-
     A                                      id":"constant12","field type":"outp-
     A                                      ut field","value":"7.","css class":-
     A                                      "constant","left":"379px","cursor c-
     A                                      olumn":"16","top":"330px","cursor r-
     A                                      ow":"12","parent tab panel":"SC070F-
     A                                      _SCR02_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCCI07","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","value":{"fieldName-
     A                                      ":"SCCI07","designValue":"[SCCI07]"-
     A                                      ,"refField":"CODE","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase"},"text-
     A                                       transform":"uppercase","left":"414-
     A                                      px","cursor column":"21","top":"330-
     A                                      px","cursor row":"12","width":"15px-
     A                                      ","read only":{"fieldName":"09","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"true / fals-
     A                                      e"},"css class 3":{"fieldName":"09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"PR","customFa-
     A                                      lse":""},"css class 4":{"fieldName"-
     A                                      :"N09","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"C-
     A                                      ustom Values","customTrue":"UL","cu-
     A                                      stomFalse":""},"error message id":"-
     A                                      SCM0505","error message fi')
     A                                  1  9HTML('le":"SCMESG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"26","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      1 message","description":"Custom ID-
     A                                       07","parent tab panel":"SC070F_SCR-
     A                                      02_MainTabPanel","parent tab":"0","-
     A                                      css class 5":"profound-converted"},-
     A                                      {"id":"constant13","field type":"ou-
     A                                      tput field","value":"8.","css class-
     A                                      ":"constant","left":"491px","cursor-
     A                                       column":"32","top":"330px","cursor-
     A                                       row":"12","parent tab panel":"SC07-
     A                                      0F_SCR02_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCCI08","field type":"-
     A                                      textbox","css class":"input","css c-
     A                                      lass 2":"textbox","value":{"fieldNa-
     A                                      me":"SCCI08","designValue":"[SCCI08-
     A                                      ]","refField":"CODE","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"uppercase"},"te-
     A                                      xt transform":"uppercase","left":"5-
     A                                      19px","cursor column":"36","top":"3-
     A                                      30px","cursor row":"12","width":"15-
     A                                      px","read only":{"fieldName":"09","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"true / fa-
     A                                      lse"},"css class 3":{"fieldName":"0-
     A                                      9","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"Custo-
     A                                      m Values","customTrue":"PR","custom-
     A                                      False":""},"css class 4":{"fieldNam-
     A                                      e":"N09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "Custom Values","customTrue":"UL","-
     A                                      customFalse":""},"error message id"-
     A                                      :"SCM0505","error message file":"SC-
     A                                      MESG","error message library":"*LIB-
     A                                      L","error condition":{"fieldName":"-
     A                                      27","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error messages":"1 message","d-
     A                                      escription":"Custom ID 08","parent -
     A                                      tab panel":"SC070F_SCR02_MainTabPan-
     A                                      el","parent tab":"0","css class 5":-
     A                                      "profound-converted"},{"id":"consta-
     A                                      nt14","field type":"output field","-
     A                                      value":"9.","css class":"constant",-
     A                                      "left":"379px","cursor column":"16"-
     A                                      ,"top":"350px","cursor row":"13","p-
     A                                      arent tab panel":"SC070F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCCI09","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCCI09",-
     A                                      "designValue":"[SCCI09]","refField"-
     A                                      :"CODE","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"414px","cursor-
     A                                       column":"21","top":"350px","cursor-
     A                                       row":"13","width":"15px","read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"error message id":"SCM0505","e-
     A                                      rror message file":"SCMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"28","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"1 message","description":"-
     A                                      Custom ID 09","parent tab panel":"S-
     A                                      C070F_SCR02_MainTabPanel","parent t-
     A                                      ab":"0","css class 5":"profound-con-
     A                                      verted"},{"id":"constant15","field -
     A                                      type":"output field","value":"10.",-
     A                                      "css class":"constant","left":"484p-
     A                                      x","cursor column":"31","top":"350p-
     A                                      x","cursor row":"13","parent tab pa-
     A                                      nel":"SC070F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCCI10","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","css class 2":"textbox","value"-
     A                                      :{"fieldName":"SCCI10","designValue-
     A                                      ":"[SCCI10]","refField":"CODE","dat-
     A                                      aType":"reference","formatting":"Te-
     A                                      xt","trimLeading":"false","trimTrai-
     A                                      ling":"true","textTransform":"upper-
     A                                      case"},"text transform":"uppercase"-
     A                                      ,"left":"519px","cursor column":"36-
     A                                      ","top":"350px","cursor row":"13","-
     A                                      width":"15px","read only":{"fieldNa-
     A                                      me":"09","dataType":"expression","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"css class 3":{"fie-
     A                                      ldName":"09","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"Custom Values","customTrue":"P-
     A                                      R","customFalse":""},"css class 4":-
     A                                      {"fieldName":"N09","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"Custom Values","customTr-
     A                                      ue":"UL","customFalse":""},"error m-
     A                                      essage id":"SCM0505","error message-
     A                                       file":"SCMESG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"29","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","description":"Custom ID 10-
     A                                      ","parent tab panel":"SC070F_SCR02_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 5":"profound-converted"},{"i-
     A                                      d":"constant16","field typ')
     A                                  1 10HTML('e":"output field","value":"Ne-
     A                                      xt Path ID:","css class":"constant"-
     A                                      ,"left":"302px","cursor column":"5"-
     A                                      ,"top":"430px","cursor row":"17","p-
     A                                      arent tab panel":"SC070F_SCR02_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCNXPI","field type":"textbox","css-
     A                                       class":"input","css class 2":"text-
     A                                      box","value":{"fieldName":"SCNXPI",-
     A                                      "designValue":"[SCNXPI]","refField"-
     A                                      :"PATH","dataType":"reference","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"uppercase"},"text transform"-
     A                                      :"uppercase","left":"414px","cursor-
     A                                       column":"21","top":"430px","cursor-
     A                                       row":"17","width":"57px","read onl-
     A                                      y":{"fieldName":"09","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"true / false"},"css cl-
     A                                      ass 3":{"fieldName":"09","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"PR","customFalse":""},"c-
     A                                      ss class 4":{"fieldName":"N09","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"Custom Value-
     A                                      s","customTrue":"UL","customFalse":-
     A                                      ""},"error message id":"SCM0526","e-
     A                                      rror message file":"SCMESG","error -
     A                                      message library":"*LIBL","error con-
     A                                      dition":{"fieldName":"30","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"SCM0528","error message fil-
     A                                      e 2":"SCMESG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"33","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"parent tab panel":-
     A                                      "SC070F_SCR02_MainTabPanel","parent-
     A                                       tab":"0","css class 5":"profound-c-
     A                                      onverted"},{"id":"constant17","fiel-
     A                                      d type":"output field","value":"All-
     A                                      ow outside range:","css class":"con-
     A                                      stant","left":"302px","cursor colum-
     A                                      n":"5","top":"470px","cursor row":"-
     A                                      19","parent tab panel":"SC070F_SCR0-
     A                                      2_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCALOR","field type":"textbox-
     A                                      ","css class":"input","css class 2"-
     A                                      :"textbox","value":{"fieldName":"SC-
     A                                      ALOR","designValue":"[SCALOR]","ref-
     A                                      Field":"FLAG","dataType":"reference-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"uppercase"},"text tran-
     A                                      sform":"uppercase","left":"463px","-
     A                                      cursor column":"28","top":"470px","-
     A                                      cursor row":"19","width":"8px","rea-
     A                                      d only":{"fieldName":"09","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"true / false"},"c-
     A                                      ss class 3":{"fieldName":"09","data-
     A                                      Type":"expression","formatting":"In-
     A                                      dicator","indFormat":"Custom Values-
     A                                      ","customTrue":"PR","customFalse":"-
     A                                      "},"css class 4":{"fieldName":"N09"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"Custom -
     A                                      Values","customTrue":"UL","customFa-
     A                                      lse":""},"error message id":"SCM050-
     A                                      2","error message file":"SCMESG","e-
     A                                      rror message library":"*LIBL","erro-
     A                                      r condition":{"fieldName":"31","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"},"err-
     A                                      or messages":"1 message","descripti-
     A                                      on":"Allow Outside Range","parent t-
     A                                      ab panel":"SC070F_SCR02_MainTabPane-
     A                                      l","parent tab":"0","css class 5":"-
     A                                      profound-converted"},{"id":"SCCMDD"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"SCCMDD","designValu-
     A                                      e":"[SCCMDD]","refField":"DS10","da-
     A                                      taType":"reference","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"false","textTransform":"non-
     A                                      e"},"css class":"output-field","lef-
     A                                      t":"757px","cursor column":"70","to-
     A                                      p":"550px","cursor row":"23","descr-
     A                                      iption":"F23=DELETE","parent tab pa-
     A                                      nel":"SC070F_SCR02_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"btnSubmit","-
     A                                      field type":"button","value":"Enter-
     A                                      ","shortcut key":"Enter","left":"14-
     A                                      px","top":"150px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF03","field type-
     A                                      ":"button","value":"Exit","shortcut-
     A                                       key":"F3","left":"14px","top":"183-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "btnCF10","field type":"button","va-
     A                                      lue":"Custom id srch","shortcut key-
     A                                      ":"F10","left":"14px","top":"216px"-
     A                                      ,"width":"100px","height":"23px","c-
     A                                      ss class":"button","auto arrange":"-
     A                                      true","cursor":"default"},{"id":"bt-
     A                                      nCF12","field type":"button","value-
     A                                      ":"Cancel  ","shortcut key":"F12","-
     A                                      left":"14px","top":"249px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF20","f-
     A                                      ield type":"button","visibility":{"-
     A                                      fieldName":"N09 and N40","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"value":"Chg stat","shortcut key":-
     A                                      "F20","left":"14px","top":"282px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arr')
     A                                  1 11HTML('ange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF23","field type":"b-
     A                                      utton","visibility":{"fieldName":"6-
     A                                      4","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"value":"F23","shortc-
     A                                      ut key":"F23","left":"14px","top":"-
     A                                      315px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnHELP","field type":"button",-
     A                                      "shortcut key":"Alt-F1","onclick":"-
     A                                      pui.showHelp()","value":"HELP","lef-
     A                                      t":"14px","top":"348px","width":"10-
     A                                      0px","height":"23px","css class":"b-
     A                                      utton","auto arrange":"true","curso-
     A                                      r":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCALOR    R        H      REFFLD(FLAG)
     A            SCCI01    R        H      REFFLD(CODE)
     A            SCCI02    R        H      REFFLD(CODE)
     A            SCCI03    R        H      REFFLD(CODE)
     A            SCCI04    R        H      REFFLD(CODE)
     A            SCCI05    R        H      REFFLD(CODE)
     A            SCCI06    R        H      REFFLD(CODE)
     A            SCCI07    R        H      REFFLD(CODE)
     A            SCCI08    R        H      REFFLD(CODE)
     A            SCCI09    R        H      REFFLD(CODE)
     A            SCCI10    R        H      REFFLD(CODE)
     A            SCCMDD    R        H      REFFLD(DS10)
     A            SCFILE    R        H      REFFLD(FLE)
     A            SCMODE    R        H      REFFLD(NM10)
     A            SCNXPI    R        H      REFFLD(PATH)
     A            SCPATH    R        H      REFFLD(PATH)
     A            SCRECF    R        H      REFFLD(RECF)
     A            SCRF01    R        H      REFFLD(PIRF01 SMPIP)
     A            SCRF02    R        H      REFFLD(PIRF02 SMPIP)
     A            SCRF03    R        H      REFFLD(PIRF03 SMPIP)
     A            SCRF04    R        H      REFFLD(PIRF04 SMPIP)
     A            SCRF05    R        H      REFFLD(PIRF05 SMPIP)
     A            SCRF06    R        H      REFFLD(PIRF06 SMPIP)
     A            SCRF07    R        H      REFFLD(PIRF07 SMPIP)
     A            SCRF08    R        H      REFFLD(PIRF08 SMPIP)
     A            SCRF09    R        H      REFFLD(PIRF09 SMPIP)
     A            SCRF10    R        H      REFFLD(PIRF10 SMPIP)
     A            SCSTAT    R        H      REFFLD(FLAG)
     A          R SCR99
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"SC070F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"SC070F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"SC070F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"SC070F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      SC070F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"SC070F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"SC070F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"SC070F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "SC070F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"SC070F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"SC070F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"SC070F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"S-
     A                                      C070F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SC070-
     A                                      F_SCR99_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"SC070F_SCR99-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCERR",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","input only":"true","value":{"f-
     A                                      ieldName":"SCERR","designValue":"[S-
     A                                      CERR]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      8px","read only":"true","css class -
     A                                      3":"PR-UL","parent tab panel":"SC07-
     A                                      0F_SCR99_MainTabPanel","parent tab"-
     A                                      :"0","css class 4":"profound-conver-
     A                                      ted"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"SC070F-
     A                                      _SCR99_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"SC070F_SCR99_BtnHiddenD-
     A                                      iaryItems","value":"btnDiary","top"-
     A                                      :"175px","response":{"fieldName":"b-
     A                                      tnDiary","dataType":"indicator","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"}},{"field type":"button","le-
     A                                      ft":"1140px","height":"18px","width-
     A                                      ":"75px","locked in place":"true","-
     A                                      css class":"button","cursor":"defau-
     A                                      lt","visibility":"hidden","id":"SC0-
     A                                      70F_SCR99_BtnHiddenSystemMessages",-
     A                                      "value":"btnMessage","top":"200px",-
     A                                      "response":{"fieldName":"btnMessage-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"SC070F_SCR-
     A                                      99_BtnHiddenWorkSubmitJob","value":-
     A                                      "btnWrksbmjob","top":"225px","respo-
     A                                      nse":{"fieldName":"btnWrkJob","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"SC070F_SCR99_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css cla')
     A                                  1  5HTML('ss":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"SC07-
     A                                      0F_SCR99_BtnHiddenImageQueue","valu-
     A                                      e":"btnImgQue","top":"275px","respo-
     A                                      nse":{"fieldName":"btnImgQue","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"SC070F_SCR99_BtnH-
     A                                      iddenHelp","value":"btnHelp","top":-
     A                                      "300px","response":{"fieldName":"bt-
     A                                      nHelp","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"btnSubmit","field typ-
     A                                      e":"button","value":"Enter","shortc-
     A                                      ut key":"Enter","left":"14px","top"-
     A                                      :"150px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"},{-
     A                                      "id":"btnCF03","field type":"button-
     A                                      ","value":"Exit","shortcut key":"F3-
     A                                      ","left":"14px","top":"183px","widt-
     A                                      h":"100px","height":"23px","css cla-
     A                                      ss":"button","auto arrange":"true",-
     A                                      "cursor":"default"},{"id":"btnHELP"-
     A                                      ,"field type":"button","shortcut ke-
     A                                      y":"Alt-F1","onclick":"pui.showHelp-
     A                                      ()","value":"HELP","left":"14px","t-
     A                                      op":"216px","width":"100px","height-
     A                                      ":"23px","css class":"button","auto-
     A                                       arrange":"true","cursor":"default"-
     A                                      }]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
     A          R SCR03
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC0    ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},"items":[{"id":"SC070F_SCR03_-
     A                                      avKeys","field type":"output field"-
     A                                      ,"value":{"fieldName":"AV_KEYS","da-
     A                                      taLength":"1134","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none","designValue-
     A                                      ":"[AV_KEYS]"},"left":"0px","top":"-
     A                                      0px","visibility":"hidden"},{"id":"-
     A                                      SC070F_SCR03_action","field type":"-
     A                                      html container","white space":"norm-
     A                                      al","left":"0px","top":"10px","widt-
     A                                      h":"230px","css class":"action-pane-
     A                                      l-converted","height":"700px","html-
     A                                      ":"<div class=\"top\"></div><div cl-
     A                                      ass=\"imagetop\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_top.png\" -
     A                                      /></div><div class=\"menulinks\"></-
     A                                      div><div class=\"imagebottom\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_bottom.png\" /></div><div class-
     A                                      =\"bottom\"></div>"},{"field type":-
     A                                      "icon menu button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"32px","z index":"20","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1170px","id":"SC070F_SCR03_BtnIco-
     A                                      nMenuSystemTools","tool tip":"Syste-
     A                                      m Tools","icon alignment":"middle l-
     A                                      eft","icon width":"16px","icon heig-
     A                                      ht":"24px","icon source":"/profound-
     A                                      ui/userdata/images/systool/systools-
     A                                      .png","data function":"SystemToolba-
     A                                      rSystools","show down arrow":"Yes"}-
     A                                      ,{"field type":"panel","panel style-
     A                                      ":"TransformButtonBar","id":"SC070F-
     A                                      _SCR03_ButtonBar","top":"35px","lef-
     A                                      t":"1036px","width":"187px","height-
     A                                      ":"28px","css class":"stationary","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true"},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      040px","id":"SC070F_SCR03_BtnSave",-
     A                                      "tool tip":"Save","onclick":"System-
     A                                      ToolbarSave","background image":"ur-
     A                                      l(''/profoundui/userdata/images/sys-
     A                                      tool/save.png'')"},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1066px","id":"SC070F_SCR03_Bt-
     A                                      nRefresh","tool tip":"Refresh","onc-
     A                                      lick":"SystemToolbarRefresh","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/refresh.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1092px","i-
     A                                      d":"SC070F_SCR03_BtnSearch","tool t-
     A                                      ip":"Search","onclick":"SystemToolb-
     A                                      arSearch","background image":"url('-
     A                                      '/profoundui/userdata/images/systoo-
     A                                      l/search.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1118px","id":"SC070F_SCR03_Btn-
     A                                      DiaryItems","tool tip":"Diary/Work -
     A                                      Items - IDARTS","onclick":"SystemTo-
     A                                      olbarDiary","background image":{"fi-
     A                                      eldName":"DryIcnURL","dataLength":"-
     A                                      128","trimLeading":"false","trimTra-
     A                                      iling":"true","blankFill":"false","-
     A                                      rjZeroFill":"false","dataType":"cha-
     A                                      r","formatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1144px","id":"SC070F_SCR03_BtnSyste-
     A                                      mMessages","tool tip":"System Messa-
     A                                      ges","onclick":"SystemToolbarMessag-
     A                                      es","background image":{"fieldName"-
     A                                      :"MsgIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTr')
     A                                  1  4HTML('ailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"SC070F_SCR03_B-
     A                                      tnHelp","tool tip":"Help","onclick"-
     A                                      :"SystemToolbarHelp","background im-
     A                                      age":"url(''/profoundui/userdata/im-
     A                                      ages/systool/help.png'')"},{"id":"S-
     A                                      C070F_SCR03_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"SC-
     A                                      070F_SCR03_MainTabPanel","field typ-
     A                                      e":"tab panel","tab panel style":"T-
     A                                      ransform","tab names":"Tab 1","acti-
     A                                      ve tab":"0","left":"250px","top":"7-
     A                                      0px","width":"970px","height":"657p-
     A                                      x","z index":"8","locked in place":-
     A                                      "true","css class":"tab-panel","css-
     A                                       class 2":"stationary"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"SC070F_SCR03_BtnHiddenS-
     A                                      ave","value":"btnSave","top":"100px-
     A                                      ","response":{"fieldName":"btnSave"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"SC070F_SCR03_fkeyMenu","fie-
     A                                      ld type":"menu","left":"10px","top"-
     A                                      :"120px","height":"350px","width":"-
     A                                      230px","hover background color":"#9-
     A                                      AAA61","hover text color":"#FFFFFF"-
     A                                      ,"border color":"#4C6106","menu opt-
     A                                      ion indent":"10px","background colo-
     A                                      r":"#758B27","css class":"action-me-
     A                                      nu","css class 2":"stationary","z i-
     A                                      ndex":"101"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "SC070F_SCR03_BtnHiddenRefresh","va-
     A                                      lue":"btnRefresh","top":"125px","re-
     A                                      sponse":{"fieldName":"btnRefresh","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"SC070F_SCR03_-
     A                                      BtnHiddenSearch","value":"btnSearch-
     A                                      ","top":"150px","response":{"fieldN-
     A                                      ame":"btnSearch","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"SC070F_SCR03_BtnHiddenDiaryIte-
     A                                      ms","value":"btnDiary","top":"175px-
     A                                      ","response":{"fieldName":"btnDiary-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"field type":"button","left":"11-
     A                                      40px","height":"18px","width":"75px-
     A                                      ","locked in place":"true","css cla-
     A                                      ss":"button","cursor":"default","vi-
     A                                      sibility":"hidden","id":"SC070F_SCR-
     A                                      03_BtnHiddenSystemMessages","value"-
     A                                      :"btnMessage","top":"200px","respon-
     A                                      se":{"fieldName":"btnMessage","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"SC070F_SCR03_BtnH-
     A                                      iddenWorkSubmitJob","value":"btnWrk-
     A                                      sbmjob","top":"225px","response":{"-
     A                                      fieldName":"btnWrkJob","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"SC070F_SCR03_BtnHiddenWo-
     A                                      rkPrinterOutput","value":"btnWrkprt-
     A                                      out","top":"250px","response":{"fie-
     A                                      ldName":"btnWrkPrnt","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"SC070F_SCR03_BtnHiddenImag-
     A                                      eQueue","value":"btnImgQue","top":"-
     A                                      275px","response":{"fieldName":"btn-
     A                                      ImgQue","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"SC07-
     A                                      0F_SCR03_BtnHiddenHelp","value":"bt-
     A                                      nHelp","top":"300px","response":{"f-
     A                                      ieldName":"btnHelp","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"id":')
     A                                  1  5HTML('"btnSubmit","field type":"but-
     A                                      ton","value":"Enter","shortcut key"-
     A                                      :"Enter","left":"14px","top":"150px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF03","field type":"button","valu-
     A                                      e":"Exit","shortcut key":"F3","left-
     A                                      ":"14px","top":"183px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"btnHELP","field-
     A                                       type":"button","shortcut key":"Alt-
     A                                      -F1","onclick":"pui.showHelp()","va-
     A                                      lue":"HELP","left":"14px","top":"21-
     A                                      6px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
