     A                                      REF(*LIBL/SCREFP)
     A          R SCR01S                    SFL
     A  20 06     QPUI000001     1A  O  2  2
     A            SCSEL          1A  H
     A            SCDESC    R        H      REFFLD(ODOBTX *LIBL/SAUSP)
     A            SCUSPR    R        H      REFFLD(ODOBNM *LIBL/SAUSP)
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  11 18 20
     A  01 02 03
     A  04 05 32                            CA01(11 'Response Indicator *IN11')
     A                                      SETOF(18 'Response Indicator *IN18')
     A                                      SETOF(20 'Response Indicator *IN20')
     A                                  1  2HTML('QPUICTL1    SCR01S    7    RS-
     A                                      FLDSP    0    E1    3     01RSFLDSP-
     A                                      CTL 0    E1    3     01RSFLINZ    0-
     A                                          E1    3     02RSFLDLT    0    E-
     A                                      1    3     03RSFLCLR    0    E1    -
     A                                      3     04RSFLPAG    1    C2    13 RS-
     A                                      FLSIZ    1    C3    999 0    4    R-
     A                                      OVERLAY   0     RROWS      2    C1 -
     A                                         1C2    22 RSFLMSGID  4    C7    -
     A                                      CPF5203C7    QCPFMSGC5    *LIBLC0  -
     A                                        E1    6     32 18RSFLMSGID  4    -
     A                                      C7    SCM0510C6    SCMESGC5    *LIB-
     A                                      LC0    E1    3     20')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","description":"Su-
     A                                      bfile Control for USER PROFILE MAIN-
     A                                      T.","set off":{"fieldName":"*IN20",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      error message id":"CPF5203","error -
     A                                      message file":"QCPFMSG","error mess-
     A                                      age library":"*LIBL","error conditi-
     A                                      on":{"fieldName":"32 and 18","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"2 messages","error mess-
     A                                      age id 2":"SCM0510","error message -
     A                                      file 2":"SCMESG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"20","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"valid command k-
     A                                      ey":{"fieldName":"*IN11","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"overlay ra-
     A                                      nge":"1-22"},"items":[{"id":"#@$2",-
     A                                      "field type":"output field","visibi-
     A                                      lity":"hidden","value":{"fieldName"-
     A                                      :"#@$2","designValue":"[#@$2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"3","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"21px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"SCUSER","f-
     A                                      ield type":"output field","visibili-
     A                                      ty":"hidden","value":{"fieldName":"-
     A                                      SCUSER","designValue":"[SCUSER]","r-
     A                                      efField":"USER","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SC650F_SCR01C_a-
     A                                      vKeys","field type":"output field",-
     A                                      "value":{"fieldName":"AV_KEYS","dat-
     A                                      aLength":"1134","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none","designValue"-
     A                                      :"[AV_KEYS]"},"left":"0px","top":"0-
     A                                      px","visibility":"hidden"},{"id":"S-
     A                                      C650F_SCR01C_action","field type":"-
     A                                      html container","white space":"norm-
     A                                      al","left":"0px","top":"10px","widt-
     A                                      h":"230px","css class":"action-pane-
     A                                      l-converted","height":"700px","html-
     A                                      ":"<div class=\"top\"></div><div cl-
     A                                      ass=\"imagetop\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_top.png\" -
     A                                      /></div><div class=\"menulinks\"></-
     A                                      div><div class=\"imagebottom\"><img-
     A                                       src=\"/profoundui/userdata/images/-
     A                                      bar_bottom.png\" /></div><div class-
     A                                      =\"bottom\"></div>"},{"field type":-
     A                                      "icon menu button","css class":"sta-
     A                                      tionary","width":"25px","height":"2-
     A                                      4px","top":"32px","z index":"20","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1170px","id":"SC650F_SCR01C_BtnIc-
     A                                      onMenuSystemTools","tool tip":"Syst-
     A                                      em Tools","icon alignment":"middle -
     A                                      left","icon width":"16px","icon hei-
     A                                      ght":"24px","icon source":"/profoun-
     A                                      dui/userdata/images/systool/systool-
     A                                      s.png","data function":"SystemToolb-
     A                                      arSystools","show down arrow":"Yes"-
     A                                      },{"field type":"panel","panel styl-
     A                                      e":"TransformButtonBar","id":"SC650-
     A                                      F_SCR01C_ButtonBar","top":"35px","l-
     A                                      eft":"1036px","width":"187px","heig-
     A                                      ht":"28px","css class":"stationary"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true"},{"field type":"button-
     A                                      ","css class":"stationary","width":-
     A                                      "25px","height":"24px","top":"40px"-
     A                                      ,"background color":"#FFFFFF","back-
     A                                      ground repeat":"no-repeat","border -
     A                                      top style":"none","border right sty-
     A                                      le":"none","border bottom style":"n-
     A                                      one","border left style":"none","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","locked in place":"true","left":-
     A                                      "1040px","id":"SC650F_SCR01C_BtnSav-
     A                                      e","tool tip":"Save","onclick":"Sys-
     A                                      temToolbarSave","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/save.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1066px","id":"SC650F_SCR01-
     A                                      C_BtnRefresh","tool tip":"Refresh",-
     A                                      "onclick":"SystemToolbarRefresh","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/refresh.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1092px-
     A                                      ","id":"SC650F_SCR01C_BtnS')
     A                                  1  4HTML('earch","tool tip":"Search","o-
     A                                      nclick":"SystemToolbarSearch","back-
     A                                      ground image":"url(''/profoundui/us-
     A                                      erdata/images/systool/search.png'')-
     A                                      "},{"field type":"button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"40px","backgroun-
     A                                      d color":"#FFFFFF","background repe-
     A                                      at":"no-repeat","border top style":-
     A                                      "none","border right style":"none",-
     A                                      "border bottom style":"none","borde-
     A                                      r left style":"none","cursor":"defa-
     A                                      ult","visibility":"hidden","locked -
     A                                      in place":"true","left":"1118px","i-
     A                                      d":"SC650F_SCR01C_BtnDiaryItems","t-
     A                                      ool tip":"Diary/Work Items - IDARTS-
     A                                      ","onclick":"SystemToolbarDiary","b-
     A                                      ackground image":{"fieldName":"DryI-
     A                                      cnURL","dataLength":"128","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none"}},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1144px","id":"-
     A                                      SC650F_SCR01C_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLeading":"f-
     A                                      alse","trimTrailing":"true","blankF-
     A                                      ill":"false","rjZeroFill":"false","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","textTransform":"none"}},{"field -
     A                                      type":"button","css class":"station-
     A                                      ary","width":"25px","height":"24px"-
     A                                      ,"top":"40px","background color":"#-
     A                                      FFFFFF","background repeat":"no-rep-
     A                                      eat","border top style":"none","bor-
     A                                      der right style":"none","border bot-
     A                                      tom style":"none","border left styl-
     A                                      e":"none","cursor":"default","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true","left":"1196px","id":"SC650F_-
     A                                      SCR01C_BtnHelp","tool tip":"Help","-
     A                                      onclick":"SystemToolbarHelp","backg-
     A                                      round image":"url(''/profoundui/use-
     A                                      rdata/images/systool/help.png'')"},-
     A                                      {"id":"SC650F_SCR01C_ImgSysToolBott-
     A                                      om","field type":"image","image sou-
     A                                      rce":"/profoundui/userdata/images/s-
     A                                      ystool/butbarbot.png","left":"1036p-
     A                                      x","top":"64px","width":"187px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      stationary","visibility":"hidden"},-
     A                                      {"id":"SC650F_SCR01C_MainTabPanel",-
     A                                      "field type":"tab panel","tab panel-
     A                                       style":"Transform","tab names":{"f-
     A                                      ieldName":"SCPRDS","dataLength":"40-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none"},"active tab":"0","left":"2-
     A                                      50px","top":"70px","width":"970px",-
     A                                      "height":"657px","z index":"8","loc-
     A                                      ked in place":"true","css class":"t-
     A                                      ab-panel","css class 2":"stationary-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"SC650F_SC-
     A                                      R01C_BtnHiddenSave","value":"btnSav-
     A                                      e","top":"100px","response":{"field-
     A                                      Name":"btnSave","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"id":"SCFILE","fie-
     A                                      ld type":"output field","value":{"f-
     A                                      ieldName":"SCFILE","designValue":"[-
     A                                      SCFILE]","refField":"FLE","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"28-
     A                                      1px","cursor column":"2","top":"110-
     A                                      px","cursor row":"1","css class 2":-
     A                                      "top-line","parent tab panel":"SC65-
     A                                      0F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant6","field typ-
     A                                      e":"output field","value":"Database-
     A                                       and Remarks Tracking System (DARTS-
     A                                      )","css class":"constant","left":"4-
     A                                      00px","cursor column":"19","top":"1-
     A                                      10px","cursor row":"1","css class 2-
     A                                      ":"top-line","css class 3":"HI","pa-
     A                                      rent tab panel":"SC650F_SCR01C_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 4":"profound-converted"},{"id":"-
     A                                      SCRECF","field type":"output field"-
     A                                      ,"value":{"fieldName":"SCRECF","des-
     A                                      ignValue":"[SCRECF]","refField":"RE-
     A                                      CF","dataType":"reference","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"false","textTransfor-
     A                                      m":"none"},"css class":"output-fiel-
     A                                      d","left":"757px","cursor column":"-
     A                                      70","top":"110px","cursor row":"1",-
     A                                      "css class 2":"top-line","parent ta-
     A                                      b panel":"SC650F_SCR01C_MainTabPane-
     A                                      l","parent tab":"0","css class 3":"-
     A                                      profound-converted"},{"id":"SC650F_-
     A                                      SCR01C_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","')
     A                                  1  5HTML('css class 2":"stationary","z -
     A                                      index":"101"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"SC650F_SCR01C_BtnHiddenRefresh","-
     A                                      value":"btnRefresh","top":"125px","-
     A                                      response":{"fieldName":"btnRefresh"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"id":"constant7","field type":"ou-
     A                                      tput field","value":"User Profile S-
     A                                      earch","css class":"constant","left-
     A                                      ":"470px","cursor column":"29","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"SC650F_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"SC650F_SCR01C_BtnHiddenS-
     A                                      earch","value":"btnSearch","top":"1-
     A                                      50px","response":{"fieldName":"btnS-
     A                                      earch","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant8","field typ-
     A                                      e":"output field","value":"User Pro-
     A                                      file:","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"170px","cursor row":"4","parent t-
     A                                      ab panel":"SC650F_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCUSRP-
     A                                      ","field type":"textbox","css class-
     A                                      ":"input","css class 2":"textbox","-
     A                                      value":{"fieldName":"SCUSRP","desig-
     A                                      nValue":"[SCUSRP]","refField":"ODOB-
     A                                      NM *LIBL/SAUSP","dataType":"referen-
     A                                      ce","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase"},"text tr-
     A                                      ansform":"uppercase","left":"379px"-
     A                                      ,"cursor column":"16","top":"170px"-
     A                                      ,"cursor row":"4","width":"71px","c-
     A                                      ss class 3":"UL","parent tab panel"-
     A                                      :"SC650F_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 4":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "SC650F_SCR01C_BtnHiddenDiaryItems"-
     A                                      ,"value":"btnDiary","top":"175px","-
     A                                      response":{"fieldName":"btnDiary","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"SC650F_SCR01C-
     A                                      _BtnHiddenSystemMessages","value":"-
     A                                      btnMessage","top":"200px","response-
     A                                      ":{"fieldName":"btnMessage","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"id":"-
     A                                      constant3","field type":"output fie-
     A                                      ld","value":"Type option, press Ent-
     A                                      er.","css class":"constant","left":-
     A                                      "281px","cursor column":"2","top":"-
     A                                      210px","cursor row":"6","parent tab-
     A                                       panel":"SC650F_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"SC650F_SCR01C_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant1","fi-
     A                                      eld type":"output field","value":"1-
     A                                      =Select","css class":"constant","le-
     A                                      ft":"295px","cursor column":"4","to-
     A                                      p":"230px","cursor row":"7","parent-
     A                                       tab panel":"SC650F_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"SC650F_SCR01C_BtnHidden-
     A                                      WorkPrinterOutput","value":"btnWrkp-
     A                                      rtout","top":"250px","response":{"f-
     A                                      ieldName":"btnWrkPrnt","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"const-
     A                                      ant2","field type":"output field","-
     A                                      value":"Opt","css class":"constant"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"270px","cursor row":"9","cs-
     A                                      s class 2":"HI","parent tab panel":-
     A                                      "SC650F_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted","css class 4":"subfile-h-
     A                                      eading"},{"id":"constant4","field t-
     A                                      ype":"output field","value":"User P-
     A                                      rofile","css class":"constant","lef-
     A                                      t":"323px","cursor column":"8","top-
     A                                      ":"270px","cursor row":"9","css cla-
     A                                      ss 2":"HI","parent tab panel":"SC65-
     A                                      0F_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 3":"profound-conve-
     A                                      rted","css class 4":"subfile-headin-
     A                                      g"},{"id":"constant5","field type":-
     A                                      "output field","value":"Description-
     A                                      ","css class":"constant","left":"43-
     A                                      5px","cursor column":"24","top":"27-
     A                                      0px","cursor row":"9","css class 2"-
     A                                      :"HI","parent tab panel":"SC650F_SC-
     A                                      R01C_MainTabPanel","parent')
     A                                  1  6HTML(' tab":"0","css class 3":"prof-
     A                                      ound-converted","css class 4":"subf-
     A                                      ile-heading"},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"SC650F_SCR01C_BtnHiddenImageQueue-
     A                                      ","value":"btnImgQue","top":"275px"-
     A                                      ,"response":{"fieldName":"btnImgQue-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"SCR01S","field type":"grid-
     A                                      ","number of columns":"3","record f-
     A                                      ormat name":"SCR01S","display subfi-
     A                                      le":{"fieldName":"01","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"displ-
     A                                      ay control record":{"fieldName":"01-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"clear subfile":{"fieldNam-
     A                                      e":"04","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"subfile size":"999"-
     A                                      ,"initialize subfile":{"fieldName":-
     A                                      "02","dataType":"expression","forma-
     A                                      tting":"Indicator","indFormat":"tru-
     A                                      e / false"},"delete subfile":{"fiel-
     A                                      dName":"03","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"true / false"},"place cursor":"-
     A                                      true","header height":"20","row hei-
     A                                      ght":"20","css class":"subfilegrid"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      ,"parent tab panel":"SC650F_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","sub-
     A                                      file end":{"fieldName":"05","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "page down response":{"fieldName":"-
     A                                      *IN18","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"show paging controls":"true"-
     A                                      ,"show page number":"true","scrollb-
     A                                      ar":"none","number of rows":"14","t-
     A                                      op":"270px","left":"281px","column -
     A                                      widths":"37,112,397","subfile recor-
     A                                      d number":{"fieldName":"#@$2","desi-
     A                                      gnValue":"[#@$2]","dataType":"zoned-
     A                                      ","formatting":"Number","numSep":"f-
     A                                      alse","zeroBalance":"true","zeroFil-
     A                                      l":"true","curSym":"","units":"","n-
     A                                      egNum":"-999.00","dataLength":"3","-
     A                                      decPos":"0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"SC650F_SCR01C_BtnHiddenHelp","val-
     A                                      ue":"btnHelp","top":"327px","respon-
     A                                      se":{"fieldName":"btnHelp","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"b-
     A                                      tnSubmit","field type":"button","va-
     A                                      lue":"Enter","shortcut key":"Enter"-
     A                                      ,"left":"14px","top":"150px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnCF03",-
     A                                      "field type":"button","value":"Exit-
     A                                      ","shortcut key":"F3","left":"14px"-
     A                                      ,"top":"183px","width":"100px","hei-
     A                                      ght":"23px","css class":"button","a-
     A                                      uto arrange":"true","cursor":"defau-
     A                                      lt"},{"id":"btnCF12","field type":"-
     A                                      button","value":"Cancel  ","shortcu-
     A                                      t key":"F12","left":"14px","top":"2-
     A                                      16px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnHELP","field type":"button","-
     A                                      shortcut key":"Alt-F1","onclick":"p-
     A                                      ui.showHelp()","value":"HELP","left-
     A                                      ":"14px","top":"249px","width":"100-
     A                                      px","height":"23px","css class":"bu-
     A                                      tton","auto arrange":"true","cursor-
     A                                      ":"default"},{"id":"SCSEL","field t-
     A                                      ype":"textbox","css class":"input",-
     A                                      "css class 2":"textbox","value":{"f-
     A                                      ieldName":"SCSEL","designValue":"[S-
     A                                      CSEL]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"true","textTransform":-
     A                                      "uppercase","dataLength":"1"},"text-
     A                                       transform":"uppercase","left":"7px-
     A                                      ","cursor column":"3","top":"1px","-
     A                                      cursor row":"10","width":"8px","css-
     A                                       class 3":{"fieldName":"N06","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"Custom Values"-
     A                                      ,"customTrue":"UL","customFalse":""-
     A                                      },"css class 4":{"fieldName":"20","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"RI","customFals-
     A                                      e":""},"set focus":{"fieldName":"20-
     A                                      ","dataType":"expression","formatti-
     A                                      ng":"Indicator","indFormat":"true /-
     A                                       false"},"description":"Selection F-
     A                                      ield","css class 5":"profound-conve-
     A                                      rted","grid":"SCR01S","column":"0"}-
     A                                      ,{"id":"SCUSPR","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCUS-
     A                                      PR","designValue":"[SCUSPR]","refFi-
     A                                      eld":"ODOBNM *LIBL/SAUSP","dataType-
     A                                      ":"reference","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"false","textTransform":"none"},"c-
     A                                      ss class":"output-field","left":"5p-
     A                                      x","cursor column":"8","top":"1px",-
     A                                      "cursor row":"10","css class 2":"pr-
     A                                      ofound-converted","grid":"SCR01S","-
     A                                      column":"1"},{"id":"SCDESC","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCDESC","designValue":"[SCD-
     A                                      ESC]","refField":"ODOBTX *LIBL/SAUS-
     A                                      P","dataType":"reference","formatti-
     A                                      ng":"Text","trimLeading":"')
     A                                  1  7HTML('false","trimTrailing":"false"-
     A                                      ,"textTransform":"none"},"css class-
     A                                      ":"output-field","left":"5px","curs-
     A                                      or column":"24","top":"1px","cursor-
     A                                       row":"10","css class 2":"profound--
     A                                      converted","grid":"SCR01S","column"-
     A                                      :"2"}]}')
     A            #@$2           3S 0H
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCPRDS        40A  H
     A            SCFILE    R        H      REFFLD(FLE)
     A            SCRECF    R        H      REFFLD(RECF)
     A            SCUSER    R        H      REFFLD(USER)
     A            SCUSRP    R        H      REFFLD(ODOBNM *LIBL/SAUSP)
     A          R SCR01
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","valid command key-
     A                                      ":{"fieldName":"*IN11","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"overlay rang-
     A                                      e":"24-24"},"items":[{"id":"SC650F_-
     A                                      SCR01_avKeys","field type":"output -
     A                                      field","value":{"fieldName":"AV_KEY-
     A                                      S","dataLength":"1134","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[AV_KEYS]"},"left":"0px","-
     A                                      top":"0px","visibility":"hidden"},{-
     A                                      "id":"SC650F_SCR01_action","field t-
     A                                      ype":"html container","white space"-
     A                                      :"normal","left":"0px","top":"10px"-
     A                                      ,"width":"230px","css class":"actio-
     A                                      n-panel-converted","height":"700px"-
     A                                      ,"html":"<div class=\"top\"></div><-
     A                                      div class=\"imagetop\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_top.-
     A                                      png\" /></div><div class=\"menulink-
     A                                      s\"></div><div class=\"imagebottom\-
     A                                      "><img src=\"/profoundui/userdata/i-
     A                                      mages/bar_bottom.png\" /></div><div-
     A                                       class=\"bottom\"></div>"},{"field -
     A                                      type":"icon menu button","css class-
     A                                      ":"stationary","width":"25px","heig-
     A                                      ht":"24px","top":"32px","z index":"-
     A                                      20","cursor":"default","visibility"-
     A                                      :"hidden","locked in place":"true",-
     A                                      "left":"1170px","id":"SC650F_SCR01_-
     A                                      BtnIconMenuSystemTools","tool tip":-
     A                                      "System Tools","icon alignment":"mi-
     A                                      ddle left","icon width":"16px","ico-
     A                                      n height":"24px","icon source":"/pr-
     A                                      ofoundui/userdata/images/systool/sy-
     A                                      stools.png","data function":"System-
     A                                      ToolbarSystools","show down arrow":-
     A                                      "Yes"},{"field type":"panel","panel-
     A                                       style":"TransformButtonBar","id":"-
     A                                      SC650F_SCR01_ButtonBar","top":"35px-
     A                                      ","left":"1036px","width":"187px","-
     A                                      height":"28px","css class":"station-
     A                                      ary","visibility":"hidden","locked -
     A                                      in place":"true"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1040px","id":"SC650F_SCR01_Btn-
     A                                      Save","tool tip":"Save","onclick":"-
     A                                      SystemToolbarSave","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/save.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1066px","id":"SC650F_SC-
     A                                      R01_BtnRefresh","tool tip":"Refresh-
     A                                      ","onclick":"SystemToolbarRefresh",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/refresh.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1092-
     A                                      px","id":"SC650F_SCR01_BtnSearch","-
     A                                      tool tip":"Search","onclick":"Syste-
     A                                      mToolbarSearch","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/search.png'')"},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1118px","id":"SC650F_SCR-
     A                                      01_BtnDiaryItems","tool tip":"Diary-
     A                                      /Work Items - IDARTS","onclick":"Sy-
     A                                      stemToolbarDiary","background image-
     A                                      ":{"fieldName":"DryIcnURL","dataLen-
     A                                      gth":"128","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"}},{"field type":"b-
     A                                      utton","css class":"stationary","wi-
     A                                      dth":"25px","height":"24px","top":"-
     A                                      40px","background color":"#FFFFFF",-
     A                                      "background repeat":"no-repeat","bo-
     A                                      rder top style":"none","border righ-
     A                                      t style":"none","border bottom styl-
     A                                      e":"none","border left style":"none-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1144px","id":"SC650F_SCR01_Bt-
     A                                      nSystemMessages","tool tip":"System-
     A                                       Messages","onclick":"SystemToolbar-
     A                                      Messages","background image":{"fiel-
     A                                      dName":"MsgIcnURL","dataLe')
     A                                  1  4HTML('ngth":"128","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none"}},{"field t-
     A                                      ype":"button","css class":"stationa-
     A                                      ry","width":"25px","height":"24px",-
     A                                      "top":"40px","background color":"#F-
     A                                      FFFFF","background repeat":"no-repe-
     A                                      at","border top style":"none","bord-
     A                                      er right style":"none","border bott-
     A                                      om style":"none","border left style-
     A                                      ":"none","cursor":"default","visibi-
     A                                      lity":"hidden","locked in place":"t-
     A                                      rue","left":"1196px","id":"SC650F_S-
     A                                      CR01_BtnHelp","tool tip":"Help","on-
     A                                      click":"SystemToolbarHelp","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/help.png'')"},{"-
     A                                      id":"SC650F_SCR01_ImgSysToolBottom"-
     A                                      ,"field type":"image","image source-
     A                                      ":"/profoundui/userdata/images/syst-
     A                                      ool/butbarbot.png","left":"1036px",-
     A                                      "top":"64px","width":"187px","locke-
     A                                      d in place":"true","css class":"sta-
     A                                      tionary","visibility":"hidden"},{"i-
     A                                      d":"SC650F_SCR01_MainTabPanel","fie-
     A                                      ld type":"tab panel","tab panel sty-
     A                                      le":"Transform","tab names":"Tab 1"-
     A                                      ,"active tab":"0","left":"250px","t-
     A                                      op":"70px","width":"970px","height"-
     A                                      :"657px","z index":"8","locked in p-
     A                                      lace":"true","css class":"tab-panel-
     A                                      ","css class 2":"stationary"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"SC650F_SCR01_BtnH-
     A                                      iddenSave","value":"btnSave","top":-
     A                                      "100px","response":{"fieldName":"bt-
     A                                      nSave","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"SC650F_SCR01_fkeyMenu-
     A                                      ","field type":"menu","left":"10px"-
     A                                      ,"top":"120px","height":"350px","wi-
     A                                      dth":"230px","hover background colo-
     A                                      r":"#9AAA61","hover text color":"#F-
     A                                      FFFFF","border color":"#4C6106","me-
     A                                      nu option indent":"10px","backgroun-
     A                                      d color":"#758B27","css class":"act-
     A                                      ion-menu","css class 2":"stationary-
     A                                      ","z index":"101"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"SC650F_SCR01_BtnHiddenRefres-
     A                                      h","value":"btnRefresh","top":"125p-
     A                                      x","response":{"fieldName":"btnRefr-
     A                                      esh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"SC650F_-
     A                                      SCR01_BtnHiddenSearch","value":"btn-
     A                                      Search","top":"150px","response":{"-
     A                                      fieldName":"btnSearch","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"field type-
     A                                      ":"button","left":"1140px","height"-
     A                                      :"18px","width":"75px","locked in p-
     A                                      lace":"true","css class":"button","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","id":"SC650F_SCR01_BtnHiddenDi-
     A                                      aryItems","value":"btnDiary","top":-
     A                                      "175px","response":{"fieldName":"bt-
     A                                      nDiary","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"}},{"field type":"button","lef-
     A                                      t":"1140px","height":"18px","width"-
     A                                      :"75px","locked in place":"true","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","visibility":"hidden","id":"SC65-
     A                                      0F_SCR01_BtnHiddenSystemMessages","-
     A                                      value":"btnMessage","top":"200px","-
     A                                      response":{"fieldName":"btnMessage"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"}}-
     A                                      ,{"field type":"button","left":"114-
     A                                      0px","height":"18px","width":"75px"-
     A                                      ,"locked in place":"true","css clas-
     A                                      s":"button","cursor":"default","vis-
     A                                      ibility":"hidden","id":"SC650F_SCR0-
     A                                      1_BtnHiddenWorkSubmitJob","value":"-
     A                                      btnWrksbmjob","top":"225px","respon-
     A                                      se":{"fieldName":"btnWrkJob","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"}},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"SC650F_SCR01_BtnHi-
     A                                      ddenWorkPrinterOutput","value":"btn-
     A                                      Wrkprtout","top":"250px","response"-
     A                                      :{"fieldName":"btnWrkPrnt","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"SC650F_SCR01_BtnHidd-
     A                                      enImageQueue","value":"btnImgQue","-
     A                                      top":"275px","response":{"fieldName-
     A                                      ":"btnImgQue","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"field type":"button-
     A                                      ","left":"1140px","height":"18px","-
     A                                      width":"75px","locked in place":"tr-
     A                                      ue","css class":"button","cursor":"-
     A                                      default","visibility":"hidden","id"-
     A                                      :"SC650F_SCR01_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting"')
     A                                  1  5HTML(':"Indicator","indFormat":"1 /-
     A                                       0"}},{"id":"btnSubmit","field type-
     A                                      ":"button","value":"Enter","shortcu-
     A                                      t key":"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnCF03","field type":"button"-
     A                                      ,"value":"Exit","shortcut key":"F3"-
     A                                      ,"left":"14px","top":"183px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"btnHELP",-
     A                                      "field type":"button","shortcut key-
     A                                      ":"Alt-F1","onclick":"pui.showHelp(-
     A                                      )","value":"HELP","left":"14px","to-
     A                                      p":"216px","width":"100px","height"-
     A                                      :"23px","css class":"button","auto -
     A                                      arrange":"true","cursor":"default"}-
     A                                      ]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR99
     A  11                                  CA01(11 'Response Indicator *IN11')
     A                                  1  2HTML('QPUIREC2    RROWS      2    C-
     A                                      1    3C1    3 FSCERR     INPUTONLY -
     A                                      0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR99","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "valid command key":{"fieldName":"*-
     A                                      IN11","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"overlay range":"3-3"},"items"-
     A                                      :[{"id":"SC650F_SCR99_avKeys","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"AV_KEYS","dataLength":"11-
     A                                      34","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[AV_KEYS]"-
     A                                      },"left":"0px","top":"0px","visibil-
     A                                      ity":"hidden"},{"id":"SC650F_SCR99_-
     A                                      action","field type":"html containe-
     A                                      r","white space":"normal","left":"0-
     A                                      px","top":"10px","width":"230px","c-
     A                                      ss class":"action-panel-converted",-
     A                                      "height":"700px","html":"<div class-
     A                                      =\"top\"></div><div class=\"imageto-
     A                                      p\"><img src=\"/profoundui/userdata-
     A                                      /images/bar_top.png\" /></div><div -
     A                                      class=\"menulinks\"></div><div clas-
     A                                      s=\"imagebottom\"><img src=\"/profo-
     A                                      undui/userdata/images/bar_bottom.pn-
     A                                      g\" /></div><div class=\"bottom\"><-
     A                                      /div>"},{"field type":"icon menu bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"3-
     A                                      2px","z index":"20","cursor":"defau-
     A                                      lt","visibility":"hidden","locked i-
     A                                      n place":"true","left":"1170px","id-
     A                                      ":"SC650F_SCR99_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"SC650F_SCR99_Button-
     A                                      Bar","top":"35px","left":"1036px","-
     A                                      width":"187px","height":"28px","css-
     A                                       class":"stationary","visibility":"-
     A                                      hidden","locked in place":"true"},{-
     A                                      "field type":"button","css class":"-
     A                                      stationary","width":"25px","height"-
     A                                      :"24px","top":"40px","background co-
     A                                      lor":"#FFFFFF","background repeat":-
     A                                      "no-repeat","border top style":"non-
     A                                      e","border right style":"none","bor-
     A                                      der bottom style":"none","border le-
     A                                      ft style":"none","cursor":"default"-
     A                                      ,"visibility":"hidden","locked in p-
     A                                      lace":"true","left":"1040px","id":"-
     A                                      SC650F_SCR99_BtnSave","tool tip":"S-
     A                                      ave","onclick":"SystemToolbarSave",-
     A                                      "background image":"url(''/profound-
     A                                      ui/userdata/images/systool/save.png-
     A                                      '')"},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1066px"-
     A                                      ,"id":"SC650F_SCR99_BtnRefresh","to-
     A                                      ol tip":"Refresh","onclick":"System-
     A                                      ToolbarRefresh","background image":-
     A                                      "url(''/profoundui/userdata/images/-
     A                                      systool/refresh.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1092px","id":"SC650F_SC-
     A                                      R99_BtnSearch","tool tip":"Search",-
     A                                      "onclick":"SystemToolbarSearch","ba-
     A                                      ckground image":"url(''/profoundui/-
     A                                      userdata/images/systool/search.png'-
     A                                      ')"},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1118px",-
     A                                      "id":"SC650F_SCR99_BtnDiaryItems","-
     A                                      tool tip":"Diary/Work Items - IDART-
     A                                      S","onclick":"SystemToolbarDiary","-
     A                                      background image":{"fieldName":"Dry-
     A                                      IcnURL","dataLength":"128","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"}},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1144px","id":-
     A                                      "SC650F_SCR99_BtnSystemMessages","t-
     A                                      ool tip":"System Messages","onclick-
     A                                      ":"SystemToolbarMessages","backgrou-
     A                                      nd image":{"fieldName":"MsgIcnURL",-
     A                                      "dataLength":"128","trimLe')
     A                                  1  4HTML('ading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1196px-
     A                                      ","id":"SC650F_SCR99_BtnHelp","tool-
     A                                       tip":"Help","onclick":"SystemToolb-
     A                                      arHelp","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      help.png'')"},{"id":"SC650F_SCR99_I-
     A                                      mgSysToolBottom","field type":"imag-
     A                                      e","image source":"/profoundui/user-
     A                                      data/images/systool/butbarbot.png",-
     A                                      "left":"1036px","top":"64px","width-
     A                                      ":"187px","locked in place":"true",-
     A                                      "css class":"stationary","visibilit-
     A                                      y":"hidden"},{"id":"SC650F_SCR99_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"S-
     A                                      C650F_SCR99_BtnHiddenSave","value":-
     A                                      "btnSave","top":"100px","response":-
     A                                      {"fieldName":"btnSave","dataType":"-
     A                                      indicator","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"}},{"id":"SC650-
     A                                      F_SCR99_fkeyMenu","field type":"men-
     A                                      u","left":"10px","top":"120px","hei-
     A                                      ght":"350px","width":"230px","hover-
     A                                       background color":"#9AAA61","hover-
     A                                       text color":"#FFFFFF","border colo-
     A                                      r":"#4C6106","menu option indent":"-
     A                                      10px","background color":"#758B27",-
     A                                      "css class":"action-menu","css clas-
     A                                      s 2":"stationary","z index":"101"},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"SC650F_SCR99-
     A                                      _BtnHiddenRefresh","value":"btnRefr-
     A                                      esh","top":"125px","response":{"fie-
     A                                      ldName":"btnRefresh","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"id":"SCERR",-
     A                                      "field type":"password field","css -
     A                                      class":"input","css class 2":"textb-
     A                                      ox","input only":"true","value":{"f-
     A                                      ieldName":"SCERR","designValue":"[S-
     A                                      CERR]","refField":"FLAG","dataType"-
     A                                      :"reference","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"uppercase"}-
     A                                      ,"text transform":"uppercase","left-
     A                                      ":"288px","cursor column":"3","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      8px","read only":"true","css class -
     A                                      3":"PR","parent tab panel":"SC650F_-
     A                                      SCR99_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"SC650F_SC-
     A                                      R99_BtnHiddenSearch","value":"btnSe-
     A                                      arch","top":"150px","response":{"fi-
     A                                      eldName":"btnSearch","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"}},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"SC650F_SCR99_BtnHiddenDiar-
     A                                      yItems","value":"btnDiary","top":"1-
     A                                      75px","response":{"fieldName":"btnD-
     A                                      iary","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"}},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"SC650F-
     A                                      _SCR99_BtnHiddenSystemMessages","va-
     A                                      lue":"btnMessage","top":"200px","re-
     A                                      sponse":{"fieldName":"btnMessage","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"SC650F_SCR99_-
     A                                      BtnHiddenWorkSubmitJob","value":"bt-
     A                                      nWrksbmjob","top":"225px","response-
     A                                      ":{"fieldName":"btnWrkJob","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"SC650F_SCR99_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class"')
     A                                  1  5HTML(':"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"SC650F_-
     A                                      SCR99_BtnHiddenImageQueue","value":-
     A                                      "btnImgQue","top":"275px","response-
     A                                      ":{"fieldName":"btnImgQue","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"SC650F_SCR99_BtnHidd-
     A                                      enHelp","value":"btnHelp","top":"30-
     A                                      0px","response":{"fieldName":"btnHe-
     A                                      lp","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnCF03","field type":"button","-
     A                                      value":"Exit","shortcut key":"F3","-
     A                                      left":"14px","top":"183px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnHELP","f-
     A                                      ield type":"button","shortcut key":-
     A                                      "Alt-F1","onclick":"pui.showHelp()"-
     A                                      ,"value":"HELP","left":"14px","top"-
     A                                      :"216px","width":"100px","height":"-
     A                                      23px","css class":"button","auto ar-
     A                                      range":"true","cursor":"default"}]}-
     A                                      ')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCERR     R        H      REFFLD(FLAG)
