     A*  (C) Copyright Progressive Data Solutions, Inc., 1996
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SCMESG)
     A                                      CHGINPDFT
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      HELP(10)
     A                                      VLDCMDKEY(11)
     A          R SCR01
     A                                  1 19'Database and Remarks Tracking Syst-
     A                                      em (DARTS)'
     A                                      DSPATR(HI)
     A                                  2 31'Purge to Optical Process'
     A                                  1  2'SC856F'
     A                                  1 76'SCR01'
     A                                 10 21'You will be unable to access the P-
     A                                      urge to'
     A                                 13 21'Please try again later.'
     A                                 17 21'Press'
     A                                 17 27'<ENTER>'
     A                                      DSPATR(HI)
     A                                 17 35'to return to the menu.'
     A                                 11 21'Optical Process at this time.'
     A                                  8 21'Another Purge to Optical Process i-
     A                                      s in progress.'
