     A*****************************************************************
     A* (C) Copyright Progressive Data Solutions, Inc., 2004
     A*****************************************************************
     A* DARTS Additional Information File Logical                     *
     A*****************************************************************
     A* Created on 03/24/2004 by c:62 for Project 98DAA               *
     A*****************************************************************
     A* Revisions:                                                    *
     A*                                                               *
     A*****************************************************************
     A          R PAI01                     PFILE(SDAIP)
     A          K AIKEY
     A          K AISEQ#
