      * (c) 2013 StoneRiver, Inc. All rights Reserved.
      * StoneRiver is a trademark of StoneRiver, Inc.
      *
      *  APPLICATION MASTER DETAIL FILE
      *
      *  CREATED  10/31/12
      *  C:191
      *  PROJECT: TRANSFORM
      ****************************************************************
      * REVISIONS:                                                   *
      *                                                              *
      ****************************************************************
     A                                      REF(SREFP)
     A          R PAS01                     TEXT('AREA MASTER DTL FILE')
     A            ASCO#     R               REFFLD(CO#)
     A            ASAREA        10          COLHDG('AREA ID')
     A            ASFLD         50          COLHDG('FIELD ID')
     A            ASSTAT    R               REFFLD(STAT)
     A            ASIUSR    R               REFFLD(USER)
     A            ASIPGM    R               REFFLD(PGM)
     A            ASITM     R               REFFLD(TIME)
     A            ASIDT     R               REFFLD(DT)
     A            ASUSER    R               REFFLD(USER)
     A            ASPGM     R               REFFLD(PGM)
     A            ASTIME    R               REFFLD(TIME)
     A            ASDT      R               REFFLD(DT)
