     A*  (C) Copyright Progressive Data Systems, Inc., 1990
     A**
     A** SYSTEM WIDE COMMENTS ****
     A**
     A* * * COMMENT DETAIL FILE * * *  (SORT= IDOC)
     A*
     A          R PCM01                     PFILE(SDCMP)
     A          K CMIDOC
     A          S CMSTAT                    COMP(NE 'I')
     A            CMIMGF                    COMP(EQ 'Y')
