     A*  (C) Copyright Progressive Data Systems, Inc., 2004
     A**
     A** SYSTEM WIDE COMMENTS ****
     A**
     A* * * COMMENT DETAIL FILE * * *
     A*****************************************************************
     A* CREATED 01/30/2004 BY C:62 FOR PROJECT PR029
     A*****************************************************************
     A** REVISIONS:
     A*
     A*****************************************************************
     A          R PCM01                     PFILE(SDCMP)
     A          K CMUSER
     A          K CMSEQ#                    DESCEND
     A          K CMKEY                     DESCEND
     A          S CMDIFL                    COMP(EQ 'Y')
     A            CMDCDT                    COMP(EQ 000000)
     A            CMSTAT                    COMP(NE 'I')
