      * (c) 2020 Sapiens. All Rights Reserved.                             *
     A*===============================================================*
     A* Company Master Portal Associations
     A*===============================================================*
     A* Created: 02/13/20  C:33  Project: SY406
     A*===============================================================*
     A* Revisions:
     A*
     A*===============================================================*

     A                                      REF(WREFP)
     A          R PCI01                     TEXT('Company Master - +
     A                                      Web Interface')
     A            CICO#     R               REFFLD(CO#)
     A            CISTAT    R               REFFLD(STAT)
     A            CIUSER    R               REFFLD(USER)
     A            CIPGM     R               REFFLD(PGM)
     A            CITIME    R               REFFLD(TIME)
     A            CIDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            CIIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            CIIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            CIITIM    R               REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            CIIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            CIASOF    R               REFFLD(DT)
     A                                      COLHDG('As of Date')
     A            CIDAYS         5  0
     A                                      COLHDG('Look Back Days')

     A          K CICO#
