      * (c) 2010 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A*****************************************************************
     A** DIAGNOSIS CODE LOGICAL
     A*****************************************************************
     A*  Created: 05/18/10   C:198  Project: WC1879                   *
     A*****************************************************************
     A** REVISIONS:
     A**
     A*****************************************************************
     A*
     A          R PDI01                     PFILE(SMDIP)
     A          K DIICD9
     A          O DICMS                     COMP(NE 'I')
