     A*========================================================================*
     A* (C) Copyright Progressive Data Solutions, Inc., 1988 - 2000            *
     A*========================================================================*
     A* SMKTP - KEY TYPE FILE                                                  *
     A*========================================================================*
     A* REVISIONS:                                                             *
     A*                                                                        *
     A* 03/17/2014 C:113 PROJECT: DR312                                        *
     A*            Add field KTDFTRC Default remark code for DARTMail.         *
     A*                                                                        *
     A*                                                                        *
     A* 01/24/2000 C:113 PROJECT: DR095                                        *
     A*            Add fields from IMITP to merge the two files.               *
     A*                                                                        *
     A* ---------------------------------------------------------------------- *
     A*  NOTE: PLEASE ADD COMMENTS TO THE TOP OF REVISIONS.                    *
     A* ---------------------------------------------------------------------- *
     A*========================================================================*
     A                                      REF(SCREFP)
     A          R PKT01                     TEXT('KEY TYPE RECORD')
     A            KTKTYP    R               REFFLD(CODE)
     A                                      COLHDG('KEY' 'TYPE')
     A            KTPNAM    R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM NAME')
     A            KTPDES    R               REFFLD(NAME)
     A                                      COLHDG('PROGRAM' 'DESCRIPTION')
     A** Maintenance fields
     A            KTSTAT    R               REFFLD(STAT)
     A            KTUSER    R               REFFLD(USER)
     A            KTPGM     R               REFFLD(PGM)
     A            KTTIME    R               REFFLD(TIME)
     A            KTDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            KTIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY' 'USER')
     A            KTIPGM    R               REFFLD(PGM)
     A                                      COLHDG('RECORD CREATED BY' 'PROGRM')
     A            KTIDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'CREATED')
     A*** BEGIN ADD *** 01/24/2000 *********************************************
     A            KTDESC    R               REFFLD(DS20)
     A                                      COLHDG('APPLICATION DESCRIP')
     A            KTINPG        10A         COLHDG('INDEX PGM')
     A            KTVPGM        10A         COLHDG('VERIFY PGM')
     A            KTSPLT        10A         COLHDG('SPLIT PGM')
     A            KTSRC1        10A         COLHDG('DART MAIL' 'NAME VALID')
     A            KTSRC2        10A         COLHDG('DART MAIL' 'SEARCH PGM')
     A            KTSRC3        10A         COLHDG('DART MAIL' 'KEY SEARCH')
     A            KTSRC4        10A         COLHDG('CPY/TRANS' 'KEY SEARCH')
     A            KTSRC5        10A         COLHDG('DARTS' 'GENERIC PROMPT')
     A            KTSRC6        10A         COLHDG('WEB IMG SCN DTL')
     A            KTSRC7        10A         COLHDG('SEARCH PGM 7')
     A            KTSRC8        10A         COLHDG('SEARCH PGM 8')
     A            KTSRC9        10A         COLHDG('DIRECT SCAN' 'PROMPT PGM')
     A            KTSRCA        10A         COLHDG('EXT APP' 'AUTO FOLDER PGM')
     A*** END   ADD *** 01/24/2000 *********************************************
     A*** BEGIN ADD *** 03/17/2014 *********************************************
     A            KTDFTRC        5A         COLHDG('DARTMail' 'Dft Rmk Code')
     A*** END   ADD *** 03/17/2014 *********************************************
