     A*  (C) Copyright Progressive Data Solutions, Inc., 1990, 1992
     A**
     A** SYSTEM WIDE REMARKS ****
     A**
     A* * * MULTIPLE OBJECT MWTICAL PURGE/DELETE REQUEST FILE
     A*
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A                                      REF(SCREFP)
     A          R PMW01                     TEXT('OBJECT PURGE DELE-
     A                                      TE REQUEST FILE')
     A            MWKEY     R               REFFLD(KEY)
     A            MWSEQ#    R               REFFLD(SEQ#)
     A                                      TEXT('REMARK SEQ')
     A            MWSYSN        20A         TEXT('SYSTEM NETWORK NAME')
     A            MWOFLR        60A         TEXT('OBJECT FOLDER(PATH)')
     A            MWOID         40A         TEXT('OBJECT ID')
     A            MWSYS          1A         TEXT('SYSTEM ID        ')
     A            MWHCMD         1A         TEXT('HEX CMD TO OLS             ')
     A            MWCPRY         1A         TEXT('COMMAND PRIORITY           ')
     A            MWOSYS         1A         TEXT('OPTICAL SYSTEM ID          ')
      *
      * Optical Primary Information (subdir/folder/docid)
      *
     A            MWOSBD        12A         TEXT('OPTICAL SUBDIRECTORY       ')
     A            MWOFLD         8A         TEXT('OPTICAL FOLDER NAME        ')
     A            MWOPDI        12A         TEXT('UNIQUE OPTICAL DOCUMENT ID ')
      *
      * Optical Backup Information (subdir/folder/docid)
      *
     A            MWOBSD        12A         TEXT('OPTICAL BACKUP SUBDIRECTORY')
     A            MWOBFL         8A         TEXT('OPTICAL BACKUP FOLDER      ')
     A            MWOBDI        12A         TEXT('UNIQUE BACKUP OPTICAL DOCID')
      *
      * QDLS Information (subdir/folder/docid)
      *
     A            MWSUBD        12A         TEXT('SUBDIRECTORY NAME          ')
     A            MWFOLD         8A         TEXT('FOLDER NAME                ')
     A            MWDCID        12A         TEXT('UNIQUE DOCUMENT ID         ')
      *
     A            MWDELF         1A         TEXT('DELETE FLAG                ')
     A            MWSTAT    R               REFFLD(STAT)
     A            MWUSER    R               REFFLD(USER)
     A            MWPGM     R               REFFLD(PGM)
     A            MWTIME    R               REFFLD(TIME)
     A            MWDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            MWIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A            MWIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            MWPNAM    R               REFFLD(PGM)
     A                                      TEXT('KEYED PGM')
     A            MWASTT         1A         TEXT('ALLOW SAVE TO TAPE (Y/N)   ')
     A            MWBUL#    R               REFFLD(BUL#1)
     A                                      COLHDG('BATCH LOG NO.')
     A            MWERDS        80A         TEXT('80B ERROR DESCRIPTION')
     A            MWTSFL         1A         TEXT('TAPE STATUS FLAG')
