      * (c) 2013 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**
     A** SYSTEM-WIDE PROGRAM FILE
     A*
     H*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 02/21/13 C:282 PROJECT: 140WBA                                *
     A*                Recompile Only.                                *
     H*****************************************************************
     A          R POR01                     PFILE(SMORP)
     A          K ORPNAM
     A          K ORFIL#
