     A*  (C) Copyright Progressive Data Solutions, Inc., 1990, 1992, 2003
     A**
     A** SYSTEM WIDE REMARKS ****
     A**
     A* * * OPTICAL CONTROL FILE
     A*
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A                                      REF(SCREFP)
     A          R POT01                     TEXT('OPTICAL CONTROL   -
     A                                      FILE(CURRENT VALUES)')
     A            OTOSYS         1A         TEXT('OPTICAL SYSTEM             ')
     A            OTLIBN        10A         TEXT('OPTICAL LIBRARY NAME       ')
      *
      *  Optical Primary Information (subdir/folder/docid)
      *
     A            OTOFLD         8A         TEXT('CURNT OPT FOLDER NAME      ')
     A            OTOSBD        12A         TEXT('CURNT OPT SUBDIRECTORY NAME')
     A            OTDCID        12A         TEXT('LAST OPT DOC ID FOR STORE  ')
     A            OT#STG         4S 0       TEXT('# OF STAGED OBJECTS        ')
     A            OTVOLI         6A         TEXT('CURRENT OPTICAL VOLUME ID  ')
     A            OTM#DC         5S 0       TEXT('MAX #  OF DOCS IN SUBDIRECT')
     A            OTM#SD         3S 0       TEXT('MAX #  OF SUBDIRECTS IN FLR')
     A            OTC#DC         5S 0       TEXT('CURRENT # OF DOCS IN SUBDRC')
     A            OTC#SD         3S 0       TEXT('CURRENT # OF SUBDIRC IN FLR')
      *
      *  Optical Backup Information (subdir/folder/docid)
      *
     A            OTBKID        12A         TEXT('LAST BKUP OPT DOC ID 4 STORE')
     A            OTBKCF         8A         TEXT('CURNT BKUP OPT FOLDER NAME ')
     A            OTBKSD        12A         TEXT('CURNT BKUP OPT SUBDIR NAME')
     A            OTBKVI         6A         TEXT('CURRENT BKUP OPTICAL VOL ID')
     A            OTBC#D         5S 0       TEXT('CURR # OF DOCS IN BKUP SUBD')
     A            OTBC#S         3S 0       TEXT('CURR # OF BKUP SUBDIR IN FLR')
      *
     A            OTSTAT    R               REFFLD(STAT)
     A            OTUSER    R               REFFLD(USER)
     A            OTPGM     R               REFFLD(PGM)
     A            OTTIME    R               REFFLD(TIME)
     A            OTDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            OTIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A            OTIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            OTPPFL         1A         TEXT('OPT PURGE IN PROGRESS - Y/N ')
      *
      *  Optical Process information
      *
     A            OTLCPY         7  0       TEXT('LAST COPY PCS DATE')
     A            OTCPYF         1A         TEXT('COPY PCS DONE FLAG')
     A            OTLDEL         7  0       TEXT('LAST DEL PCS DATE')
     A            OTDELF         1A         TEXT('DELETE PCS DONE FLAG')
     A            OTPFRM         7  0       TEXT('SEL JOB FROM DATE')
     A            OTPTO          7  0       TEXT('SEL JOB TO DATE')
      *
      *  Batch and Backup User Options
      *
     A            OTBATS         1A         TEXT('RUN SELECT & COPY IN BATCH')
     A            OTBATD         1A         TEXT('RUN S,C,D FROM DASD IN BATCH')
     A            OTRETD         3  0       TEXT('RETENTION DAYS')
     A            OTLPDT         7  0       TEXT('LAST PROCESS DATE')
     A            OTBATB         1A         TEXT('BACKUP TO DASD VIA SAVFILE')
     A            OTBKUP         1A         TEXT('TYPE OF OPTICAL BACKUP')
     A            OTFREQ         3  0       TEXT('BATCH FREQUENCY')
     A            OTMBRN        10          TEXT('MEMBER NAME')
      *
