     A*  (C) Copyright Progressive Data Systems, Inc., 1990
     A**
     A** SYSTEM WIDE COMMENTS ****
     A**
     A* * * PROGRAM/PATH RECORD * * *
     A*****************************************************************
     A*  REVISIONS
     A*                                                              *
     A* 01/01/01  C:33  PROJECT: DR143                               *
     A*                 ADD GROUP                                    *
     A*                                                              *
     A*       12/12/97    C:86   PROJECT: DR051
     A*             ADDED PPDESC, PPIPGM, PPITIM, AND PPIDT
     A*****************************************************************
     A                                      REF(SCREFP)
     A          R PPP01                     TEXT('PROGRAM/PATH RECORD')
     A            PPPGMN    R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM NAME')
     A            PPPATH    R               REFFLD(PATH)
     A                                      COLHDG('PATH ID')
     A            PPPNAM    R               REFFLD(PGM)
     A                                      COLHDG('RECORD CREATED BY' 'PRGRM')
     A********** BEGIN ADD *************** 12/12/97 *******************
     A            PPDESC    R               REFFLD(DS40)
     A                                      COLHDG('DESCRIPTION')
     A********** END   ADD *************** 12/12/97 *******************
     A******
     A            PPSTAT    R               REFFLD(STAT)
     A            PPUSER    R               REFFLD(USER)
     A            PPPGM     R               REFFLD(PGM)
     A            PPTIME    R               REFFLD(TIME)
     A            PPDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            PPIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A********** BEGIN ADD *************** 12/12/97 *******************
     A            PPIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INIT PGM')
     A            PPITIM    R               REFFLD(TIME)
     A                                      COLHDG('INIT TIME')
     A            PPIDT     R               REFFLD(DT)
     A                                      COLHDG('INIT DATE')
     A********** END   ADD *************** 12/12/97 *******************
     A***  BEGIN ADD  ***  01/01/01  *********************************
     A            PPGRP     R     S         REFFLD(FND)
     A***  END   ADD  ***  01/01/01  *********************************
