     A* (c) 2022 Sapiens. All Rights Reserved.                             *
     A*                                                                    *
     A* Secured Key File                                                   *
     A**********************************************************************
     A* Created on 09/22/2022 by C:291 for Project WC2838                  *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(SREFP)
     A          R PSK01                     TEXT('Secured Key File')
     A*
     A            SKKEY         32A         COLHDG('Key')
     A                                      CCSID(65535)
     A            SKUSER    R               REFFLD(USER)
     A                                      COLHDG('Maintenance User')
     A            SKPGM     R               REFFLD(PGM)
     A                                      COLHDG('Maintenance Program')
     A            SKTIME    R     S         REFFLD(TIME)
     A                                      COLHDG('Maintenance Time')
     A            SKDT      R     S         REFFLD(DT)
     A                                      COLHDG('Maintenance Date')
     A            SKIUSR    R               REFFLD(USER)
     A                                      COLHDG('Initial User')
     A            SKIPGM    R               REFFLD(PGM)
     A                                      COLHDG('Initial Program')
     A            SKITIM    R     S         REFFLD(TIME)
     A                                      COLHDG('Initial Time')
     A            SKIDT     R     S         REFFLD(DT)
     A                                      COLHDG('Initial Date')
