     A*  (C) Copyright Progressive Data Systems, Inc., 1990
     A**
     A** SYSTEM WIDE COMMENTS ****
     A**
     A* * * COMMENT SECURITY FILE * *
     A*
     A          R PSL01                     PFILE(SMSLP)
     A          K SLUSRP
     A          S SLSTAT                    COMP(NE 'I')
