     A**
     A** IPDS PRINTER TEXT OUPUT FILE
     A**
     A***
      *   IPDS TEXT FILE WILL HOLD THE TEXT LINES FOR OUTPUT IPDS FORMS,
      *   OVERLAYS,  ETC.
     A***
     A          R PTX01                     TEXT('IPDS PRINTER TEXT FILE')
     A            TXPGM         10          COLHDG('PROGRAM NAME')
     A            TXFNAM         8          COLHDG('FILE NAME(PRINTER)')
     A            TXGRP          8          COLHDG('GROUPING ID')
     A            TXLIN#         3  0       COLHDG('LINE #')
     A            TXTEXT       378          COLHDG('TEXT LINE')
     A******************* KEY INFO *********************************
     A          K TXPGM
     A          K TXFNAM
     A          K TXLIN#
