      * (c) 2012 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
     A**
     A** USER GROUP FILE
     A**
     A*  CREATED  11/15/12
     A*  C:191
     A*  PROJECT: TRANSFORM
     A**
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A*
     A          R PUG01                     PFILE(SMUGP)
     A          K UGCO#
     A          K UGUGRP
