     A*  (C) Copyright Progressive Data Solutions, Inc., 1994
     A*
     A*  SPOOL COPY FILE
     A*
     A*****************************************************************
     A*                                                               *
     A* 07/12/94 C:24 PROJECT 03AZK                                   *
     A*               COPY SPOOLED DATA FOR RESOLVED OUTPUT           *
     A*                                                               *
     A*****************************************************************
     A          R SPL001                    TEXT('Spool File/CPYSPLF INFO')
     A            SPLFLD       202          TEXT('SPOOLED DATA')
