     A                                      REF(*LIBL/WREFP)
     A                                      INDARA
     A          R RCDTABENDR
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RASSUME    0     ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdTabEndr","description":"WC 0-
     A                                      4 03 40 B - Additional Input","over-
     A                                      lay":"true","assume":"true"},"items-
     A                                      ":[{"id":"BtnExitButton","field typ-
     A                                      e":"button","css class":"button","v-
     A                                      alue":"Exit","left":"605px","top":"-
     A                                      10px","width":"100px","cursor":"def-
     A                                      ault","description":"Exit Button","-
     A                                      response":{"fieldName":"ExitNow","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"sh-
     A                                      ortcut key":"F3","visibility":"hidd-
     A                                      en"},{"id":"TabEndr040340B","field -
     A                                      type":"tab panel","css class":"tab--
     A                                      panel","left":"250px","top":"70px",-
     A                                      "width":"970px","height":{"fieldNam-
     A                                      e":"TabHeight","dataLength":"5","de-
     A                                      cPos":"0","numSep":"false","zeroBal-
     A                                      ance":"false","zeroFill":"false","c-
     A                                      urSym":"","dataType":"zoned","forma-
     A                                      tting":"Number","units":"px","negNu-
     A                                      m":"-999.00","designValue":"3270px"-
     A                                      },"tab names":"WC 04 03 40 B - Addi-
     A                                      tional Input","z index":"0","tab pa-
     A                                      nel style":"CompSuite Tab Panel","v-
     A                                      alue":"value text","active tab":{"f-
     A                                      ieldName":"TabIndex","dataLength":"-
     A                                      5","decPos":"0","numSep":"false","z-
     A                                      eroBalance":"false","zeroFill":"fal-
     A                                      se","curSym":"","dataType":"zoned",-
     A                                      "formatting":"Number","units":"","n-
     A                                      egNum":"-999.00"},"ontabclick":"pui-
     A                                      .click(\"BtnTabClick\")"},{"id":"Bt-
     A                                      nTabClick","field type":"button","c-
     A                                      ss class":"button","cursor":"defaul-
     A                                      t","description":"tab click button"-
     A                                      ,"value":"Tab","response":{"fieldNa-
     A                                      me":"tabClick","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"shortcut key":"F3","-
     A                                      left":"565px","top":"10px","width":-
     A                                      "35px","visibility":"hidden"},{"id"-
     A                                      :"btnRefresh","field type":"button"-
     A                                      ,"css class":"button","value":"Refr-
     A                                      esh","left":"710px","top":"10px","w-
     A                                      idth":"100px","cursor":"default","r-
     A                                      esponse":{"fieldName":"BtnRefresh",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"},"-
     A                                      visibility":"hidden"}]}')
     A            BTNREFRESH     1A  H
     A            EXITNOW        1A  H
     A            TABCLICK       1A  H
     A            TABHEIGHT      5S 0H
     A            TABINDEX       5S 0H
     A          R SFLENDR                   SFL
     A            QPUI000001     1A  O  2  2
     A            DSPVISB        1A  H
     A            SCADDTLTP     80A  H
     A            SCENDRDEL      1A  H
     A            SCENDREDT      1A  H
     A            SCENDROWSL     1A  H
     A            SCENDRRRN#     9S 0H
     A            SCLOCADDR     80A  H
     A            SCLOCNO        5S 0H
     A            SCOPRNM       40A  H
     A          R QSFLCTL001                SFLCTL(SFLENDR)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLRCDENDR')
     A          R RCDENDR
     A                                  1  2HTML('QPUICTL1    SFLENDR   5    RS-
     A                                      FLDSP    0    FDSPENDRSUBRSFLDSPCTL-
     A                                       0    FDSPENDRCTLRSFLCLR    0    FC-
     A                                      LRENDR   RSFLPAG    1    C1    7 RS-
     A                                      FLSIZ    1    C1    8 0    3    ROV-
     A                                      ERLAY   0     RASSUME    0     RROW-
     A                                      S      2    C1    1C1    1 ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdEndr","overlay":"true","exte-
     A                                      rnal css":"label","description":"Ad-
     A                                      ditional Info for WC040340B","assum-
     A                                      e":"true","overlay range":"1-1","de-
     A                                      sign overlay formats":"RcdTabEndr",-
     A                                      "header text align":"Left,Right","c-
     A                                      sv file name":"Payment Value 1 Code-
     A                                      s","selection value":"A"},"items":[-
     A                                      {"id":"BtnExitButtonAll","field typ-
     A                                      e":"button","css class":"button","v-
     A                                      alue":"Exit","left":"395px","top":"-
     A                                      10px","width":"100px","cursor":"def-
     A                                      ault","description":"Exit Button","-
     A                                      response":{"fieldName":"ExitNow","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"sh-
     A                                      ortcut key":"F3","visibility":"hidd-
     A                                      en"},{"id":"BtnEndrAdd","field type-
     A                                      ":"button","css class":"button","va-
     A                                      lue":"Add","left":"945px","top":"34-
     A                                      9px","width":"80px","cursor":"defau-
     A                                      lt","response":{"fieldName":"btnEnd-
     A                                      rAdd","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"1 /-
     A                                       0"},"visibility":{"fieldName":"dsp-
     A                                      Visb","dataType":"indicator","forma-
     A                                      tting":"Indicator","indFormat":"vis-
     A                                      ible / hidden"}},{"id":"sflEndr","f-
     A                                      ield type":"grid","css class":"subf-
     A                                      ilegrid","left":"260px","top":"169p-
     A                                      x","number of rows":"8","number of -
     A                                      columns":"4","column widths":"83,27-
     A                                      8,318,102","column headings":"Locat-
     A                                      ion No.,Operation Name, Location Ad-
     A                                      dress ","header height":"21","row h-
     A                                      eight":"22","csv export":"true","cs-
     A                                      v file name":"WC040340A","export wi-
     A                                      th headings":"true","sortable colum-
     A                                      ns":"true","resizable columns":"tru-
     A                                      e","movable columns":"true","height-
     A                                      ":"175px","width":"782px","record f-
     A                                      ormat name":"sflEndr","display subf-
     A                                      ile":{"fieldName":"dspEndrSub","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"true / false"-
     A                                      },"display control record":{"fieldN-
     A                                      ame":"dspEndrCtl","dataType":"indic-
     A                                      ator","formatting":"Indicator","ind-
     A                                      Format":"true / false"},"clear subf-
     A                                      ile":{"fieldName":"clrEndr","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      subfile record number":{"fieldName"-
     A                                      :"rrnEndr","dataLength":"5","decPos-
     A                                      ":"0","numSep":"false","zeroBalance-
     A                                      ":"false","numBlankFill":"false","z-
     A                                      eroFill":"false","curSym":"","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "negNum":"-999.00","units":""},"hea-
     A                                      der text align":"center,left,left,"-
     A                                      ,"onrowclick":"pui.click(); ","row -
     A                                      selection":"single","selection fiel-
     A                                      d":{"fieldName":"scEndRowSl","dataL-
     A                                      ength":"1","trimLeading":"false","t-
     A                                      rimTrailing":"true","blankFill":"fa-
     A                                      lse","rjZeroFill":"false","dataType-
     A                                      ":"char","formatting":"Text","textT-
     A                                      ransform":"none"},"selection value"-
     A                                      :"A","description":"Additional Info-
     A                                       Grid for WC040340B"},{"id":"BtnEnd-
     A                                      rCan","field type":"b')
     A                                  1  2HTML('utton","css class":"button","-
     A                                      cursor":"default","value":"Cancel",-
     A                                      "response":{"fieldName":"btnEndrCan-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"left":"855px","top":"349px","widt-
     A                                      h":"80px","visibility":{"fieldName"-
     A                                      :"dspVisb","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"visible / hidden"}},{"id":"Output-
     A                                      Field1","field type":"output field"-
     A                                      ,"css class":"label","value":"Desig-
     A                                      nated Locations Coverage Endorsemen-
     A                                      t","left":"260px","top":"125px","wi-
     A                                      dth":"355px"},{"id":"OutLocationNo"-
     A                                      ,"field type":"output field","css c-
     A                                      lass":"output-field","value":{"fiel-
     A                                      dName":"scLocNo","dataLength":"5","-
     A                                      decPos":"0","numSep":"false","zeroB-
     A                                      alance":"false","numBlankFill":"fal-
     A                                      se","zeroFill":"false","noExtraSpac-
     A                                      es":"false","curSym":"","dataType":-
     A                                      "zoned","formatting":"Number","negN-
     A                                      um":"-999.00","units":"","designVal-
     A                                      ue":"[scLocNo]"},"text align":"cent-
     A                                      er","left":"15px","top":"5px","widt-
     A                                      h":"60px","grid":"sflEndr","column"-
     A                                      :"0"},{"id":"OutAddr","field type":-
     A                                      "output field","css class":"output--
     A                                      field","value":{"fieldName":"scLocA-
     A                                      ddr","dataLength":"80","trimLeading-
     A                                      ":"false","trimTrailing":"true","bl-
     A                                      ankFill":"false","rjZeroFill":"fals-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none","desig-
     A                                      nValue":"[scLocAddr]"},"text align"-
     A                                      :"left","left":"5px","top":"5px","w-
     A                                      idth":"305px","tool tip":{"fieldNam-
     A                                      e":"scAddTlTp","dataLength":"80","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne","designValue":"[scAddTlTp]"},"g-
     A                                      rid":"sflEndr","column":"2"},{"id":-
     A                                      "OutEndrRRN","field type":"output f-
     A                                      ield","css class":"output-field","v-
     A                                      alue":{"fieldName":"scEndrRrn#","da-
     A                                      taLength":"9","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"false","num-
     A                                      BlankFill":"false","zeroFill":"true-
     A                                      ","curSym":"","dataType":"zoned","f-
     A                                      ormatting":"Number","negNum":"999.0-
     A                                      0","units":"","designValue":"[scEnd-
     A                                      rRrn#]"},"left":"55px","top":"5px",-
     A                                      "visibility":"hidden","grid":"sflEn-
     A                                      dr","column":"2"},{"id":"LnkEndrEdi-
     A                                      t","field type":"hyperlink","css cl-
     A                                      ass":"link","value":"Edit","respons-
     A                                      e":{"fieldName":"scEndrEdt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"},"left":"-
     A                                      10px","top":"5px","visibility":{"fi-
     A                                      eldName":"dspVisb","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"grid"-
     A                                      :"sflEndr","column":"3"},{"id":"Lnk-
     A                                      EndrDel","field type":"hyperlink","-
     A                                      css class":"link","value":"Delete",-
     A                                      "response":{"fieldName":"scEndrDel"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFor')
     A                                  1  2HTML('mat":"1 / 0"},"left":"40px","-
     A                                      top":"5px","visibility":{"fieldName-
     A                                      ":"dspVisb","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"visible / hidden"},"grid":"sflEn-
     A                                      dr","column":"3"},{"id":"OutOperati-
     A                                      onName","field type":"output field"-
     A                                      ,"css class":"output-field","value"-
     A                                      :{"fieldName":"scOprNm","dataLength-
     A                                      ":"40","trimLeading":"false","trimT-
     A                                      railing":"true","blankFill":"false"-
     A                                      ,"rjZeroFill":"false","dataType":"c-
     A                                      har","formatting":"Text","textTrans-
     A                                      form":"none","designValue":"[scOprN-
     A                                      m]"},"text align":"left","left":"5p-
     A                                      x","top":"5px","width":"265px","gri-
     A                                      d":"sflEndr","column":"1"}]}')
     A            BTNENDRADD     1A  H
     A            BTNENDRCAN     1A  H
     A            CLRENDR        1A  H
     A            DSPENDRCTL     1A  H
     A            DSPENDRSUB     1A  H
     A            DSPVISB        1A  H
     A            EXITNOW        1A  H
     A            RRNENDR        5S 0H
     A          R RCDADENDR
     A                                  1  2HTML('QPUIREC13   RWINDOW    0     -
     A                                      RASSUME    0     REMSG      2    C1-
     A                                      2   TxbLocNumberFMGLOCNOA  FERLOCNO-
     A                                      A  REMSG      2    C11   TxbOperNam-
     A                                      eFMGOPRNMA  FEROPRNMA  REMSG      2-
     A                                          C8    TxbAddr2FMGADDRESS FERADD-
     A                                      RESS REMSG      2    C6    TxbCtyFM-
     A                                      GCTY     FERCTY     REMSG      2   -
     A                                       C5    TxbStFMGST      FERST      R-
     A                                      EMSG      2    C7    TxbZip1FMGZIP -
     A                                          FERZIP     REMSG      2    C14 -
     A                                        TxbInsuredNameFMGINSDNAMEFERINSDN-
     A                                      AMEREMSG      2    C10   TxbInsurer-
     A                                      FMGINSURER FERINSURER REMSG      2 -
     A                                         C11   TxbpolicyNoFMGPOL#    FERP-
     A                                      OL#    RERRMSG    2    C8    DatEff-
     A                                      DtFMGEFFDT   FEREFFDT   RERRMSG    -
     A                                      2    C8    DatExpDtFMGEXPDT   FEREX-
     A                                      PDT   ')
     A                                  1  2HTML('{"screen":{"record format nam-
     A                                      e":"RcdAdEndr","description":"Add/E-
     A                                      dt Endorse Record ","assume":"true"-
     A                                      ,"show as window":"true"},"items":[-
     A                                      {"id":"PanAddEdt","field type":"pan-
     A                                      el","css class":"dialog","value":"D-
     A                                      esignated Locations Coverage Endors-
     A                                      ement","left":"265px","top":"95px",-
     A                                      "width":"635px","height":"370px","p-
     A                                      anel style":"Transform Dialog","z i-
     A                                      ndex":"8","locked in place":"true"}-
     A                                      ,{"id":"LblLocationNumber","field t-
     A                                      ype":"output field","css class":"la-
     A                                      bel","value":"Location Number","lef-
     A                                      t":"280px","top":"130px","width":"1-
     A                                      85px"},{"id":"Image1_copy112","fiel-
     A                                      d type":"image","css class":"image"-
     A                                      ,"image source":"/profoundui/userda-
     A                                      ta/images/asterisk_orange_small.png-
     A                                      ","left":"380px","top":"133px","hei-
     A                                      ght":"8px","width":"8px","z index":-
     A                                      "100"},{"id":"TxbLocNumber","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"value":{"fieldName":"scLocNoA","d-
     A                                      ataLength":"5","decPos":"0","numSep-
     A                                      ":"false","zeroBalance":"false","nu-
     A                                      mBlankFill":"false","zeroFill":"fal-
     A                                      se","noExtraSpaces":"false","curSym-
     A                                      ":"","dataType":"zoned","formatting-
     A                                      ":"Number","negNum":"999.00","units-
     A                                      ":"","designValue":"[scLocNoA]"},"l-
     A                                      eft":"280px","top":"145px","css cla-
     A                                      ss 2":"textbox","text align":"right-
     A                                      ","width":"50px","error messages":"-
     A                                      1 message","error message":{"fieldN-
     A                                      ame":"mgLocNoA","dataLength":"100",-
     A                                      "trimLeading":"false","trimTrailing-
     A                                      ":"true","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"error condition":{"fieldNam-
     A                                      e":"erLocNoA","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"error enhanced mode":"1-
     A                                      "},{"id":"LblOperationName","field -
     A                                      type":"output field","css class":"l-
     A                                      abel","value":"Operation Name","lef-
     A                                      t":"280px","top":"170px","width":"1-
     A                                      40px"},{"id":"LblOperationTitle","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"label","value":"Operation Title-
     A                                      ","left":"615px","top":"170px","wid-
     A                                      th":"95px"},{"id":"Image1_copy1122"-
     A                                      ,"field type":"image","css class":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/asterisk_orange_sma-
     A                                      ll.png","left":"375px","top":"173px-
     A                                      ","height":"8px","width":"8px","z i-
     A                                      ndex":"100"},{"id":"TxbOperName","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","value":{"fieldName":"scOprNm-
     A                                      A","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scOprNmA]"},"text align":"l-
     A                                      eft","left":"280px","top":"185px","-
     A                                      width":"300px","css class 2":"textb-
     A                                      ox","error message":{"fieldName":"m-
     A                                      gOprNmA","dataLength"')
     A                                  1  2HTML(':"100","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"},"error conditio-
     A                                      n":{"fieldName":"erOprNmA","customT-
     A                                      rue":"","customFalse":"","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"},"error enha-
     A                                      nced mode":"1","error messages":"1 -
     A                                      message","set focus":"true"},{"id":-
     A                                      "TxbOperTitle","field type":"textbo-
     A                                      x","css class":"input","value":{"fi-
     A                                      eldName":"scOprTitl","dataLength":"-
     A                                      40","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scOprTitl-
     A                                      ]"},"text align":"left","left":"615-
     A                                      px","top":"185px","width":"265px","-
     A                                      css class 2":"textbox"},{"id":"LblA-
     A                                      ddr","field type":"output field","c-
     A                                      ss class":"label","value":"Address"-
     A                                      ,"left":"280px","top":"210px","widt-
     A                                      h":"95px"},{"id":"Image1_copy11222"-
     A                                      ,"field type":"image","css class":"-
     A                                      image","image source":"/profoundui/-
     A                                      userdata/images/asterisk_orange_sma-
     A                                      ll.png","left":"330px","top":"213px-
     A                                      ","height":"8px","width":"8px","z i-
     A                                      ndex":"100"},{"id":"TxbAddr2","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","value":{"fieldName":"scAddress"-
     A                                      ,"refField":"PREF01/NAME *LIBL/WREF-
     A                                      P","trimLeading":"false","trimTrail-
     A                                      ing":"true","blankFill":"false","rj-
     A                                      ZeroFill":"false","dataType":"refer-
     A                                      ence","formatting":"Text","textTran-
     A                                      sform":"none","designValue":"[scAdd-
     A                                      ress]"},"text align":"left","left":-
     A                                      "280px","top":"225px","width":"300p-
     A                                      x","css class 2":"textbox","error m-
     A                                      essage":{"fieldName":"mgAddress","d-
     A                                      ataLength":"100","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"},"error cond-
     A                                      ition":{"fieldName":"erAddress","cu-
     A                                      stomTrue":"","customFalse":"","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       enhanced mode":"1","error messages-
     A                                      ":"1 message"},{"id":"TxbCty","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","value":{"fieldName":"scCty","da-
     A                                      taLength":"20","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none","designValue":-
     A                                      "[scCty]"},"text align":"left","lef-
     A                                      t":"280px","top":"245px","width":"1-
     A                                      70px","css class 2":"textbox","erro-
     A                                      r messages":"1 message","error mess-
     A                                      age":{"fieldName":"mgCty","dataLeng-
     A                                      th":"100","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","dataType"-
     A                                      :"char","formatting":"Text","textTr-
     A                                      ansform":"none"},"err')
     A                                  1  2HTML('or condition":{"fieldName":"e-
     A                                      rCty","customTrue":"","customFalse"-
     A                                      :"","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"error enhanced mode":"1"},{"id"-
     A                                      :"TxbSt","field type":"select box",-
     A                                      "css class":"input","value":{"field-
     A                                      Name":"scST","refField":"PREF01/ST -
     A                                      *LIBL/WREFP","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"textTransform":"uppercase","desig-
     A                                      nValue":"[scST]"},"left":"455px","t-
     A                                      op":"245px","width":"50px","css cla-
     A                                      ss 2":"dropdown","choices database -
     A                                      file":"STSTP","choice options field-
     A                                      ":"STKEY","choice values field":"ST-
     A                                      KEY","choices selection criteria":"-
     A                                      STSTAT <> ''I''","order by":"STKEY"-
     A                                      ,"error message":{"fieldName":"mgST-
     A                                      ","dataLength":"100","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none"},"error -
     A                                      condition":{"fieldName":"erST","cus-
     A                                      tomTrue":"","customFalse":"","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      enhanced mode":"1","error messages"-
     A                                      :"1 message"},{"id":"TxbZip1","fiel-
     A                                      d type":"textbox","css class":"inpu-
     A                                      t","value":{"fieldName":"scZip","da-
     A                                      taLength":"9","decPos":"0","numSep"-
     A                                      :"false","zeroBalance":"true","numB-
     A                                      lankFill":"false","zeroFill":"true"-
     A                                      ,"edtWrd":"''     -    ''","edtMsk"-
     A                                      :"''     &    ''","curSym":"","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"negNum":"-999.00","units":"","des-
     A                                      ignValue":"[scZip]"},"text align":"-
     A                                      left","left":"505px","top":"245px",-
     A                                      "width":"75px","css class 2":"textb-
     A                                      ox","error message":{"fieldName":"m-
     A                                      gZip","dataLength":"100","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"},"er-
     A                                      ror condition":{"fieldName":"erZip"-
     A                                      ,"customTrue":"","customFalse":"","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror enhanced mode":"1","error mess-
     A                                      ages":"1 message"},{"id":"LblInsure-
     A                                      dName","field type":"output field",-
     A                                      "css class":"label","value":"Insure-
     A                                      d Name","left":"280px","top":"275px-
     A                                      ","width":"95px"},{"id":"LblInsurer-
     A                                      ","field type":"output field","css -
     A                                      class":"label","value":"Insurer","l-
     A                                      eft":"615px","top":"275px","width":-
     A                                      "95px"},{"id":"TxbInsuredName","fie-
     A                                      ld type":"textbox","css class":"inp-
     A                                      ut","value":{"fieldName":"scInsdNam-
     A                                      e","dataLength":"40","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[scInsdName]"}')
     A                                  1  2HTML(',"text align":"left","left":"-
     A                                      280px","top":"290px","width":"260px-
     A                                      ","css class 2":"textbox","error me-
     A                                      ssage":{"fieldName":"mgInsdName","d-
     A                                      ataLength":"100","trimLeading":"fal-
     A                                      se","trimTrailing":"true","blankFil-
     A                                      l":"false","rjZeroFill":"false","da-
     A                                      taType":"char","formatting":"Text",-
     A                                      "textTransform":"none"},"error cond-
     A                                      ition":{"fieldName":"erInsdName","c-
     A                                      ustomTrue":"","customFalse":"","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"},"erro-
     A                                      r enhanced mode":"1","error message-
     A                                      s":"1 message"},{"id":"TxbInsurer",-
     A                                      "field type":"textbox","css class":-
     A                                      "input","value":{"fieldName":"scIns-
     A                                      urer","dataLength":"40","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none","desi-
     A                                      gnValue":"[scInsurer]"},"text align-
     A                                      ":"left","error messages":"1 messag-
     A                                      e","left":"615px","top":"290px","wi-
     A                                      dth":"265px","css class 2":"textbox-
     A                                      ","error message":{"fieldName":"mgI-
     A                                      nsurer","dataLength":"100","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      error condition":{"fieldName":"erIn-
     A                                      surer","customTrue":"","customFalse-
     A                                      ":"","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"error enhanced mode":"1"},{"id-
     A                                      ":"LblPolicyNo","field type":"outpu-
     A                                      t field","css class":"label","value-
     A                                      ":"Policy #","left":"280px","top":"-
     A                                      315px","width":"95px"},{"id":"LblEf-
     A                                      fDate","field type":"output field",-
     A                                      "css class":"label","value":"Effect-
     A                                      ive Date","disabled":{"fieldName":"-
     A                                      readOnly","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "true / false"},"left":"615px","top-
     A                                      ":"315px","width":"90px","z index":-
     A                                      "25","locked in place":"false"},{"i-
     A                                      d":"LblExpirationDt","field type":"-
     A                                      output field","css class":"label","-
     A                                      value":"Expiration Date","disabled"-
     A                                      :{"fieldName":"readOnly","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"true / false"},"lef-
     A                                      t":"755px","top":"315px","width":"9-
     A                                      0px","z index":"25","locked in plac-
     A                                      e":"false"},{"id":"TxbpolicyNo","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","value":{"fieldName":"scPol#",-
     A                                      "dataLength":"30","trimLeading":"fa-
     A                                      lse","trimTrailing":"true","blankFi-
     A                                      ll":"false","rjZeroFill":"false","d-
     A                                      ataType":"char","formatting":"Text"-
     A                                      ,"textTransform":"none","designValu-
     A                                      e":"[scPol#]"},"text align":"left",-
     A                                      "error messages":"1 message","left"-
     A                                      :"280px","top":"330px","width":"225-
     A                                      px","css class 2":"textbox","error -
     A                                      message":{"fieldName":"mgPol#","dat-
     A                                      aLength":"100","trimLeading":"false-
     A                                      ","trimTrailing":"tru')
     A                                  1  2HTML('e","blankFill":"false","rjZer-
     A                                      oFill":"false","dataType":"char","f-
     A                                      ormatting":"Text","textTransform":"-
     A                                      none"},"error condition":{"fieldNam-
     A                                      e":"erPol#","customTrue":"","custom-
     A                                      False":"","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"},"error enhanced mode":"1"}-
     A                                      ,{"id":"DatEffDt","field type":"dat-
     A                                      e field","css class":"input","value-
     A                                      ":{"fieldName":"scEffdt","dataLengt-
     A                                      h":"8","decPos":"0","numSep":"false-
     A                                      ","zeroBalance":"false","numBlankFi-
     A                                      ll":"false","zeroFill":"false","noE-
     A                                      xtraSpaces":"false","edtWrd":"''  /-
     A                                        /    ''","curSym":"","dataType":"-
     A                                      zoned","formatting":"Number","negNu-
     A                                      m":"-999.00","units":"","designValu-
     A                                      e":"[scEffdt]"},"error messages":"1-
     A                                       message","left":"615px","top":"330-
     A                                      px","width":"95px","z index":"25","-
     A                                      locked in place":"false","error mes-
     A                                      sage":{"fieldName":"mgEffdt","dataL-
     A                                      ength":"100","trimLeading":"false",-
     A                                      "trimTrailing":"true","blankFill":"-
     A                                      false","rjZeroFill":"false","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"},"error conditio-
     A                                      n":{"fieldName":"erEffDt","customTr-
     A                                      ue":"","customFalse":"","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"error enhan-
     A                                      ced mode":"0"},{"id":"DatExpDt","fi-
     A                                      eld type":"date field","css class":-
     A                                      "input","value":{"fieldName":"scExp-
     A                                      dt","dataLength":"8","decPos":"0","-
     A                                      numSep":"false","zeroBalance":"fals-
     A                                      e","numBlankFill":"false","zeroFill-
     A                                      ":"false","noExtraSpaces":"false","-
     A                                      edtWrd":"''  /  /    ''","curSym":"-
     A                                      ","dataType":"zoned","formatting":"-
     A                                      Number","negNum":"-999.00","units":-
     A                                      "","designValue":"[scExpdt]"},"erro-
     A                                      r messages":"1 message","left":"755-
     A                                      px","top":"330px","width":"95px","z-
     A                                       index":"25","locked in place":"fal-
     A                                      se","error message":{"fieldName":"m-
     A                                      gExpdt","dataLength":"100","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"blankFill":"false","rjZeroFill":"-
     A                                      false","dataType":"char","formattin-
     A                                      g":"Text","textTransform":"none"},"-
     A                                      error condition":{"fieldName":"erEx-
     A                                      pDt","customTrue":"","customFalse":-
     A                                      "","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      },"error enhanced mode":"0"},{"id":-
     A                                      "ChkAffWrt","field type":"checkbox"-
     A                                      ,"css class":"input","description":-
     A                                      "Affirming in Writing","value":{"fi-
     A                                      eldName":"scAffirWrt","dataLength":-
     A                                      "1","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none","designValue":"[scAffirWr-
     A                                      t]"},"checked value":"Y","unchecked-
     A                                       value":"N","label":"Policyholder h-
     A                                      as affirmed in writing that other c-
     A                                      overage is secured or the entity is-
     A                                       lawfully uninsured","left":"280px"-
     A                                      ,"top":"355px","z ind')
     A                                  1  2HTML('ex":"8","locked in place":"fa-
     A                                      lse","css class 2":"checkbox"},{"id-
     A                                      ":"ChkLiabUnissued","field type":"c-
     A                                      heckbox","css class":"input","descr-
     A                                      iption":"Affirming in Writing","val-
     A                                      ue":{"fieldName":"scLiabUnis","data-
     A                                      Length":"1","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none","designValue":"[s-
     A                                      cLiabUnis]"},"checked value":"Y","u-
     A                                      nchecked value":"N","label":"Liabil-
     A                                      ity is lawfully uninsured","left":"-
     A                                      280px","top":"375px","z index":"8",-
     A                                      "locked in place":"false","css clas-
     A                                      s 2":"checkbox"},{"id":"BtnCancel",-
     A                                      "field type":"button","css class":"-
     A                                      button","value":"Cancel","left":{"f-
     A                                      ieldName":"scCanLft","dataLength":"-
     A                                      5","decPos":"0","numSep":"false","z-
     A                                      eroBalance":"false","numBlankFill":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","dataType":"zoned","formatting"-
     A                                      :"Number","negNum":"-999.00","units-
     A                                      ":"px","designValue":"570px"},"top"-
     A                                      :"430px","width":"100px","cursor":"-
     A                                      default","shortcut key":"Escape","r-
     A                                      esponse":{"fieldName":"BtnCanRcd","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"BtAddNxt","field type":"butto-
     A                                      n","css class":"button","cursor":"d-
     A                                      efault","value":"Save / Add Next","-
     A                                      response":{"fieldName":"BtnAdNxRcd"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "left":"680px","top":"430px","width-
     A                                      ":"100px","visibility":{"fieldName"-
     A                                      :"indSvAdNx","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"visible / hidden"}},{"id":"BtnA-
     A                                      dd","field type":"button","css clas-
     A                                      s":"button","cursor":"default","val-
     A                                      ue":"Save","response":{"fieldName":-
     A                                      "BtnAddRcd","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"shortcut key":"Enter","-
     A                                      left":"790px","top":"430px","width"-
     A                                      :"100px"}]}')
     A            BTNADDRCD      1A  H
     A            BTNADNXRCD     1A  H
     A            BTNCANRCD      1A  H
     A            ERADDRESS      1A  H
     A            ERCTY          1A  H
     A            EREFFDT        1A  H
     A            EREXPDT        1A  H
     A            ERINSDNAME     1A  H
     A            ERINSURER      1A  H
     A            ERLOCNOA       1A  H
     A            EROPRNMA       1A  H
     A            ERPOL#         1A  H
     A            ERST           1A  H
     A            ERZIP          1A  H
     A            INDSVADNX      1A  H
     A            MGADDRESS    100A  H
     A            MGCTY        100A  H
     A            MGEFFDT      100A  H
     A            MGEXPDT      100A  H
     A            MGINSDNAME   100A  H
     A            MGINSURER    100A  H
     A            MGLOCNOA     100A  H
     A            MGOPRNMA     100A  H
     A            MGPOL#       100A  H
     A            MGST         100A  H
     A            MGZIP        100A  H
     A            READONLY       1A  H
     A            SCAFFIRWRT     1A  H
     A            SCCANLFT       5S 0H
     A            SCCTY         20A  H
     A            SCEFFDT        8S 0H
     A            SCEXPDT        8S 0H
     A            SCINSDNAME    40A  H
     A            SCINSURER     40A  H
     A            SCLIABUNIS     1A  H
     A            SCLOCNOA       5S 0H
     A            SCOPRNMA      40A  H
     A            SCOPRTITL     40A  H
     A            SCPOL#        30A  H
     A            SCZIP          9S 0H
     A            SCADDRESS R        H      REFFLD(PREF01/NAME *LIBL/WREFP)
     A            SCST      R        H      REFFLD(PREF01/ST *LIBL/WREFP)
