     A                                      REF(*LIBL/WREFP)
     A*PUI                                  SFLDEFINE(01)
     A*PUI                                  SFLDEFINE(02)
     A          R SCR01S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A  05 07 08  QPUI000001     1A  O  2  2
     A            SCDATA        74A  H
     A            SCDBRR         9S 0H
     A            SCL001        79A  H
     A            SCSEL          2A  H
     A            SCSEQ#         5S 0H
     A          R QSFLCTL001                SFLCTL(SCR01S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR01C')
     A          R SCR01C
     A  01 02 03
     A  04 21 22
     A  23 24 25                            CA01(01 'Response Indicator *IN01')
     A  26 27 28
     A  29 41 91
     A  92 93 94                            CA02(02 'Response Indicator *IN02')
     A  95 06 63                            CA03
     A                                  1  2HTML('QPUICTL1    SCR01S    5    RS-
     A                                      FLDSP    0    E1    3     04RSFLDSP-
     A                                      CTL 0    E1    3    N03RSFLCLR    0-
     A                                          E1    3     03RSFLPAG    1    C-
     A                                      1    8 RSFLSIZ    1    C1    9 1   -
     A                                       RSFLNXTCHG 0    E1    3     087   -
     A                                       ROVERLAY   0     RROWS      2    C-
     A                                      1    1C2    21 RSFLMSGID  4    C7  -
     A                                        CPD6A81C7    QCPFMSGC5    *LIBLC0-
     A                                          E1    3     92RSFLMSGID  4    C-
     A                                      7    CPD6A7CC7    QCPFMSGC5    *LIB-
     A                                      LC0    E1    3     93RERRMSGID  5  -
     A                                        C6    SCCONMC7    CPF5203C7    QC-
     A                                      PFMSGC5    *LIBLC0    E1    3     9-
     A                                      1RERRMSGID  5    C6    SCCONMC7    -
     A                                      CPF5204C7    QCPFMSGC5    *LIBLC0  -
     A                                        E1    3     94FSCPST1    INPUTONL-
     A                                      Y 0     ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","error message id-
     A                                      ":"CPD6A81","error message file":"Q-
     A                                      CPFMSG","error message library":"*L-
     A                                      IBL","error condition":{"fieldName"-
     A                                      :"92","dataType":"expression","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"},"error messages":"2 messages"-
     A                                      ,"error message id 2":"CPD6A7C","er-
     A                                      ror message file 2":"QCPFMSG","erro-
     A                                      r message library 2":"*LIBL","error-
     A                                       condition 2":{"fieldName":"93","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"ov-
     A                                      erlay range":"1-21"},"items":[{"id"-
     A                                      :"SCPST6","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"26","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST6","designValue":"[SCPST6]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SCOPL2","field type":"ou-
     A                                      tput field","visibility":"hidden","-
     A                                      value":{"fieldName":"SCOPL2","desig-
     A                                      nValue":"[SCOPL2]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"true","tex-
     A                                      tTransform":"none","dataLength":"76-
     A                                      "},"left":"0px","top":"-30px","css -
     A                                      class":"profound-converted"},{"id":-
     A                                      "SCPST5","field type":"output field-
     A                                      ","visibility":{"fieldName":"25","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"visible / -
     A                                      hidden"},"value":{"fieldName":"SCPS-
     A                                      T5","designValue":"[SCPST5]","dataT-
     A                                      ype":"char","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","textTransform":"none","dataL-
     A                                      ength":"1"},"left":"0px","top":"-30-
     A                                      px","css class":"profound-converted-
     A                                      "},{"id":"SCPST4","field type":"out-
     A                                      put field","visibility":{"fieldName-
     A                                      ":"24","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"v-
     A                                      isible / hidden"},"value":{"fieldNa-
     A                                      me":"SCPST4","designValue":"[SCPST4-
     A                                      ]","dataType":"char","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"true","textTransform":"non-
     A                                      e","dataLength":"1"},"left":"0px","-
     A                                      top":"-30px","css class":"profound--
     A                                      converted"},{"id":"SCPST3","field t-
     A                                      ype":"output field","visibility":{"-
     A                                      fieldName":"23","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"visible / hidden"},"value":-
     A                                      {"fieldName":"SCPST3","designValue"-
     A                                      :"[SCPST3]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"none","dataLength":"1"},"left-
     A                                      ":"0px","top":"-30px","css class":"-
     A                                      profound-converted"},{"id":"SCPST2"-
     A                                      ,"field type":"output field","visib-
     A                                      ility":{"fieldName":"22","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"visible / hidden"}-
     A                                      ,"value":{"fieldName":"SCPST2","des-
     A                                      ignValue":"[SCPST2]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"none","dataLength":"-
     A                                      1"},"left":"0px","top":"-30px","css-
     A                                       class":"profound-converted"},{"id"-
     A                                      :"SCPST9","field type":"output fiel-
     A                                      d","visibility":{"fieldName":"29","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"visible /-
     A                                       hidden"},"value":{"fieldName":"SCP-
     A                                      ST9","designValue":"[SCPST9]","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","textTransform":"none","data-
     A                                      Length":"1"},"left":"0px","top":"-3-
     A                                      0px","css class":"profound-converte-
     A                                      d"},{"id":"SCPST8","field type":"ou-
     A                                      tput field","visibility":{"fieldNam-
     A                                      e":"28","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      visible / hidden"},"value":{"fieldN-
     A                                      ame":"SCPST8","designValue":"[SCPST-
     A                                      8]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"true","textTransform":"no-
     A                                      ne","dataLength":"1"},"left":"0px",-
     A                                      "top":"-30px","css class":"profound-
     A                                      -converted"},{"id":"SCPST7","field -
     A                                      type":"output field","visibility":{-
     A                                      "fieldName":"27","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"visible / hidden"},"value"-
     A                                      :{"fieldName":"SCPST7","designValue-
     A                                      ":"[SCPST7]","dataType":"char","for-
     A                                      matting":"Text","trimLeading":"fals-
     A                                      e","trimTrailing":"true","textTrans-
     A                                      form":"none","dataLength":"1"},"lef-
     A                                      t":"0px","top":"-30px","css class":-
     A                                      "profound-converted"},{"id":"SFLMOD-
     A                                      ","field type":"output field","visi-
     A                                      bility":"hidden","value":{"fieldNam-
     A                                      e":"SFLMOD","designValue":"[SFLMOD]-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","trimLeading":"false","trimTra-
     A                                      iling":"true","textTransform":"none-
     A                                      ","dataLength":"1"},"left":"0px","t-
     A                                      op":"-30px","css class":"profound-c-
     A                                      onverted"},{"id":"SCRRN1","field ty-
     A                                      pe":"output field","visibi')
     A                                  1  4HTML('lity":"hidden","value":{"fiel-
     A                                      dName":"SCRRN1","designValue":"[SCR-
     A                                      RN1]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"4","decPos":"0"}-
     A                                      ,"left":"0px","top":"-30px","width"-
     A                                      :"28px","text align":"right","css c-
     A                                      lass":"profound-converted"},{"id":"-
     A                                      SRMISCF_SCR01C_avKeys","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"AV_KEYS","dataLength":"1134","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e","designValue":"[AV_KEYS]"},"left-
     A                                      ":"0px","top":"0px","visibility":"h-
     A                                      idden"},{"id":"SRMISCF_SCR01C_actio-
     A                                      n","field type":"html container","w-
     A                                      hite space":"normal","left":"0px","-
     A                                      top":"10px","width":"230px","css cl-
     A                                      ass":"action-panel-converted","heig-
     A                                      ht":"700px","html":"<div class=\"to-
     A                                      p\"></div><div class=\"imagetop\"><-
     A                                      img src=\"/profoundui/userdata/imag-
     A                                      es/bar_top.png\" /></div><div class-
     A                                      =\"menulinks\"></div><div class=\"i-
     A                                      magebottom\"><img src=\"/profoundui-
     A                                      /userdata/images/bar_bottom.png\" /-
     A                                      ></div><div class=\"bottom\"></div>-
     A                                      "},{"field type":"icon menu button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"32px",-
     A                                      "z index":"20","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1170px","id":"SR-
     A                                      MISCF_SCR01C_BtnIconMenuSystemTools-
     A                                      ","tool tip":"System Tools","icon a-
     A                                      lignment":"middle left","icon width-
     A                                      ":"16px","icon height":"24px","icon-
     A                                       source":"/profoundui/userdata/imag-
     A                                      es/systool/systools.png","data func-
     A                                      tion":"SystemToolbarSystools","show-
     A                                       down arrow":"Yes"},{"field type":"-
     A                                      panel","panel style":"TransformButt-
     A                                      onBar","id":"SRMISCF_SCR01C_ButtonB-
     A                                      ar","top":"35px","left":"1036px","w-
     A                                      idth":"187px","height":"28px","css -
     A                                      class":"stationary","visibility":"h-
     A                                      idden","locked in place":"true"},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1040px","id":"S-
     A                                      RMISCF_SCR01C_BtnSave","tool tip":"-
     A                                      Save","onclick":"SystemToolbarSave"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/save.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1066px-
     A                                      ","id":"SRMISCF_SCR01C_BtnRefresh",-
     A                                      "tool tip":"Refresh","onclick":"Sys-
     A                                      temToolbarRefresh","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/refresh.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1092px","id":"SRMISC-
     A                                      F_SCR01C_BtnSearch","tool tip":"Sea-
     A                                      rch","onclick":"SystemToolbarSearch-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/search-
     A                                      .png'')"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"111-
     A                                      8px","id":"SRMISCF_SCR01C_BtnDiaryI-
     A                                      tems","tool tip":"Diary/Work Items -
     A                                      - IDARTS","onclick":"SystemToolbarD-
     A                                      iary","background image":{"fieldNam-
     A                                      e":"DryIcnURL","dataLength":"128","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","blankFill":"false","rjZero-
     A                                      Fill":"false","dataType":"char","fo-
     A                                      rmatting":"Text","textTransform":"n-
     A                                      one"}},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1144px-
     A                                      ","id":"SRMISCF_SCR01C_BtnSystemMes-
     A                                      sages","tool tip":"System Messages"-
     A                                      ,"onclick":"SystemToolbarMessages",-
     A                                      "background image":{"fieldName":"Ms-
     A                                      gIcnURL","dataLength":"128')
     A                                  1  5HTML('","trimLeading":"false","trim-
     A                                      Trailing":"true","blankFill":"false-
     A                                      ","rjZeroFill":"false","dataType":"-
     A                                      char","formatting":"Text","textTran-
     A                                      sform":"none"}},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1196px","id":"SRMISCF_SCR01C_Btn-
     A                                      Help","tool tip":"Help","onclick":"-
     A                                      SystemToolbarHelp","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/help.png'')"},{"id":"SRM-
     A                                      ISCF_SCR01C_ImgSysToolBottom","fiel-
     A                                      d type":"image","image source":"/pr-
     A                                      ofoundui/userdata/images/systool/bu-
     A                                      tbarbot.png","left":"1036px","top":-
     A                                      "64px","width":"187px","locked in p-
     A                                      lace":"true","css class":"stationar-
     A                                      y","visibility":"hidden"},{"id":"SR-
     A                                      MISCF_SCR01C_MainTabPanel","field t-
     A                                      ype":"tab panel","tab panel style":-
     A                                      "Transform","tab names":{"fieldName-
     A                                      ":"SCPRDS","designValue":"[SCPRDS]"-
     A                                      ,"refField":"NAME","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"active t-
     A                                      ab":"0","left":"250px","top":"70px"-
     A                                      ,"width":"970px","height":"657px","-
     A                                      z index":"8","locked in place":"tru-
     A                                      e","css class":"tab-panel","css cla-
     A                                      ss 2":"stationary"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"SRMISCF_SCR01C_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant1","field type":"outp-
     A                                      ut field","left":"281px","cursor co-
     A                                      lumn":"2","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentUser()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "SRMISCF_SCR01C_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"id":"SCCONM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCCONM","designValue":"[SCC-
     A                                      ONM]","refField":"NAME","dataType":-
     A                                      "reference","formatting":"Text","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      false","textTransform":"none"},"css-
     A                                       class":"output-field","left":"414p-
     A                                      x","cursor column":"21","top":"110p-
     A                                      x","cursor row":"1","css class 2":"-
     A                                      top-line","css class 3":"HI","error-
     A                                       message id":"CPF5203","error messa-
     A                                      ge file":"QCPFMSG","error message l-
     A                                      ibrary":"*LIBL","error condition":{-
     A                                      "fieldName":"91","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      2 messages","error message id 2":"C-
     A                                      PF5204","error message file 2":"QCP-
     A                                      FMSG","error message library 2":"*L-
     A                                      IBL","error condition 2":{"fieldNam-
     A                                      e":"94","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      1 / 0"},"parent tab panel":"SRMISCF-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 4":"profound-convert-
     A                                      ed"},{"id":"constant2","field type"-
     A                                      :"output field","left":"778px","cur-
     A                                      sor column":"73","top":"110px","cur-
     A                                      sor row":"1","css class":"top-line"-
     A                                      ,"value":"js: currentDate()","css c-
     A                                      lass 2":"output-field","parent tab -
     A                                      panel":"SRMISCF_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 3":"p-
     A                                      rofound-converted"},{"id":"SRMISCF_-
     A                                      SCR01C_fkeyMenu","field type":"menu-
     A                                      ","left":"10px","top":"120px","heig-
     A                                      ht":"350px","width":"230px","hover -
     A                                      background color":"#9AAA61","hover -
     A                                      text color":"#FFFFFF","border color-
     A                                      ":"#4C6106","menu option indent":"1-
     A                                      0px","background color":"#758B27","-
     A                                      css class":"action-menu","css class-
     A                                       2":"stationary","z index":"101"},{-
     A                                      "field type":"button","left":"1140p-
     A                                      x","height":"18px","width":"75px","-
     A                                      locked in place":"true","css class"-
     A                                      :"button","cursor":"default","visib-
     A                                      ility":"hidden","id":"SRMISCF_SCR01-
     A                                      C_BtnHiddenRefresh","value":"btnRef-
     A                                      resh","top":"125px","response":{"fi-
     A                                      eldName":"btnRefresh","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"id":"Q1PGM"-
     A                                      ,"field type":"output field","value-
     A                                      ":{"fieldName":"Q1PGM","designValue-
     A                                      ":"[Q1PGM]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"false","textTrans-
     A                                      form":"none","dataLength":"10"},"cs-
     A                                      s class":"output-field","left":"281-
     A                                      px","cursor column":"2","top":"130p-
     A                                      x","cursor row":"2","parent tab pan-
     A                                      el":"SRMISCF_SCR01C_MainTabPanel","-
     A                                      parent tab":"0","css class 2":"prof-
     A                                      ound-converted"},{"id":"SCPRDS","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"SCPRDS","designValue":"-
     A                                      [SCPRDS]","refField":"NAME","dataTy-
     A                                      pe":"reference","formatting":"Text"-
     A                                      ,"trimLeading":"false","trimTrailin-
     A                                      g":"false","textTransform":"none"},-
     A                                      "css class":"output-field"')
     A                                  1  6HTML(',"left":"414px","cursor colum-
     A                                      n":"21","top":"130px","cursor row":-
     A                                      "2","css class 2":"HI","parent tab -
     A                                      panel":"SRMISCF_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","visibility":"hi-
     A                                      dden","css class 3":"profound-conve-
     A                                      rted"},{"id":"constant3","field typ-
     A                                      e":"output field","value":"SCR01","-
     A                                      css class":"constant","left":"799px-
     A                                      ","cursor column":"76","top":"130px-
     A                                      ","cursor row":"2","parent tab pane-
     A                                      l":"SRMISCF_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"constant4","-
     A                                      field type":"output field","value":-
     A                                      "Group:","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"150px","cursor row":"3","parent-
     A                                       tab panel":"SRMISCF_SCR01C_MainTab-
     A                                      Panel","parent tab":"0","css class -
     A                                      2":"profound-converted"},{"id":"SCF-
     A                                      ND","field type":"output field","va-
     A                                      lue":{"fieldName":"SCFND","designVa-
     A                                      lue":"[SCFND]","refField":"FND","da-
     A                                      taType":"reference","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"false","zeroFill":"false","curS-
     A                                      ym":"","units":"","negNum":"999.00"-
     A                                      },"css class":"output-field","left"-
     A                                      :"337px","cursor column":"10","top"-
     A                                      :"150px","cursor row":"3","width":"-
     A                                      21px","text align":"right","parent -
     A                                      tab panel":"SRMISCF_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 2-
     A                                      ":"profound-converted"},{"id":"SCFN-
     A                                      AM","field type":"output field","va-
     A                                      lue":{"fieldName":"SCFNAM","designV-
     A                                      alue":"[SCFNAM]","refField":"NAME",-
     A                                      "dataType":"reference","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none"},"css class":"output-field","-
     A                                      left":"365px","cursor column":"14",-
     A                                      "top":"150px","cursor row":"3","des-
     A                                      cription":"NAME","parent tab panel"-
     A                                      :"SRMISCF_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 2":"profoun-
     A                                      d-converted"},{"id":"constant5","fi-
     A                                      eld type":"output field","value":"P-
     A                                      rv Grp #:","css class":"constant","-
     A                                      visibility":{"fieldName":"N63","dat-
     A                                      aType":"expression","formatting":"I-
     A                                      ndicator","indFormat":"visible / hi-
     A                                      dden"},"left":"652px","cursor colum-
     A                                      n":"55","top":"150px","cursor row":-
     A                                      "3","parent tab panel":"SRMISCF_SCR-
     A                                      01C_MainTabPanel","parent tab":"0",-
     A                                      "css class 2":"profound-converted"}-
     A                                      ,{"id":"SCOFND","field type":"outpu-
     A                                      t field","value":{"fieldName":"SCOF-
     A                                      ND","designValue":"[SCOFND]","dataT-
     A                                      ype":"zoned","formatting":"Number",-
     A                                      "numSep":"false","zeroBalance":"tru-
     A                                      e","zeroFill":"true","curSym":"","u-
     A                                      nits":"","negNum":"-999.00","dataLe-
     A                                      ngth":"3","decPos":"0"},"css class"-
     A                                      :"output-field","visibility":{"fiel-
     A                                      dName":"N63","dataType":"expression-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"visible / hidden"},"left":"729-
     A                                      px","cursor column":"66","top":"150-
     A                                      px","cursor row":"3","width":"21px"-
     A                                      ,"text align":"right","css class 2"-
     A                                      :{"fieldName":"N63","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"Custom Values","customT-
     A                                      rue":"RI","customFalse":""},"descri-
     A                                      ption":"Old Fund Number","parent ta-
     A                                      b panel":"SRMISCF_SCR01C_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"SRMISCF_SCR01C_BtnHiddenS-
     A                                      earch","value":"btnSearch","top":"1-
     A                                      50px","response":{"fieldName":"btnS-
     A                                      earch","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant6","field typ-
     A                                      e":"output field","value":"Emp #:",-
     A                                      "css class":"constant","left":"281p-
     A                                      x","cursor column":"2","top":"170px-
     A                                      ","cursor row":"4","parent tab pane-
     A                                      l":"SRMISCF_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 2":"profo-
     A                                      und-converted"},{"id":"SCEDN","fiel-
     A                                      d type":"output field","value":{"fi-
     A                                      eldName":"SCEDN","designValue":"[SC-
     A                                      EDN]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"false","textTransform":-
     A                                      "none","dataLength":"44"},"css clas-
     A                                      s":"output-field","left":"337px","c-
     A                                      ursor column":"10","top":"170px","c-
     A                                      ursor row":"4","parent tab panel":"-
     A                                      SRMISCF_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"constant7","fiel-
     A                                      d type":"output field","value":"Prv-
     A                                       Emp #:","css class":"constant","vi-
     A                                      sibility":{"fieldName":"N63","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"visible / hidd-
     A                                      en"},"left":"652px","cursor column"-
     A                                      :"55","top":"170px","cursor row":"4-
     A                                      ","parent tab panel":"SRMISCF_SCR01-
     A                                      C_MainTabPanel","parent tab":"0","c-
     A                                      ss class 2":"profound-converted"},{-
     A                                      "id":"SCOEMP","field type":"output -
     A                                      field","value":{"fieldName":"SCOEMP-
     A                                      ","designValue":"[SCOEMP]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"false-
     A                                      ","zeroFill":"false","curSym":"","u-
     A                                      nits":"","negNum":"999.00","dataLen-
     A                                      gth":"9","decPos":"0"},"css class":-
     A                                      "output-field","visibility')
     A                                  1  7HTML('":{"fieldName":"N63","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"visible / hidden-
     A                                      "},"left":"729px","cursor column":"-
     A                                      66","top":"170px","cursor row":"4",-
     A                                      "width":"63px","text align":"right"-
     A                                      ,"css class 2":{"fieldName":"N63","-
     A                                      dataType":"expression","formatting"-
     A                                      :"Indicator","indFormat":"Custom Va-
     A                                      lues","customTrue":"RI","customFals-
     A                                      e":""},"description":"Old Employer -
     A                                      Number","parent tab panel":"SRMISCF-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SCODIV","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCODIV","designValue":"[SCODIV]","d-
     A                                      ataType":"zoned","formatting":"Numb-
     A                                      er","numSep":"false","zeroBalance":-
     A                                      "false","zeroFill":"false","curSym"-
     A                                      :"","units":"","negNum":"999.00","d-
     A                                      ataLength":"5","decPos":"0"},"css c-
     A                                      lass":"output-field","visibility":{-
     A                                      "fieldName":"N63","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"visible / hidden"},"left"-
     A                                      :"799px","cursor column":"76","top"-
     A                                      :"170px","cursor row":"4","width":"-
     A                                      35px","text align":"right","css cla-
     A                                      ss 2":{"fieldName":"N63","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"Custom Values","cu-
     A                                      stomTrue":"RI","customFalse":""},"d-
     A                                      escription":"Old division","parent -
     A                                      tab panel":"SRMISCF_SCR01C_MainTabP-
     A                                      anel","parent tab":"0","css class 3-
     A                                      ":"profound-converted"},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"SRMISCF_SCR01C_BtnHidde-
     A                                      nDiaryItems","value":"btnDiary","to-
     A                                      p":"175px","response":{"fieldName":-
     A                                      "btnDiary","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"}},{"id":"constant8","field-
     A                                       type":"output field","value":"Agt -
     A                                      #:","css class":"constant","left":"-
     A                                      281px","cursor column":"2","top":"1-
     A                                      90px","cursor row":"5","parent tab -
     A                                      panel":"SRMISCF_SCR01C_MainTabPanel-
     A                                      ","parent tab":"0","css class 2":"p-
     A                                      rofound-converted"},{"id":"SCAGT#",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"SCAGT#","designValue-
     A                                      ":"[SCAGT#]","refField":"AGT#","dat-
     A                                      aType":"reference","formatting":"Nu-
     A                                      mber","numSep":"false","zeroBalance-
     A                                      ":"false","zeroFill":"false","curSy-
     A                                      m":"","units":"","negNum":"999.00"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "337px","cursor column":"10","top":-
     A                                      "190px","cursor row":"5","width":"3-
     A                                      5px","text align":"right","parent t-
     A                                      ab panel":"SRMISCF_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"SCANA-
     A                                      M","field type":"output field","val-
     A                                      ue":{"fieldName":"SCANAM","designVa-
     A                                      lue":"[SCANAM]","refField":"NM20","-
     A                                      dataType":"reference","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one"},"css class":"output-field","l-
     A                                      eft":"386px","cursor column":"17","-
     A                                      top":"190px","cursor row":"5","pare-
     A                                      nt tab panel":"SRMISCF_SCR01C_MainT-
     A                                      abPanel","parent tab":"0","css clas-
     A                                      s 2":"profound-converted"},{"id":"c-
     A                                      onstant9","field type":"output fiel-
     A                                      d","value":"Producer:","css class":-
     A                                      "constant","left":"575px","cursor c-
     A                                      olumn":"44","top":"190px","cursor r-
     A                                      ow":"5","parent tab panel":"SRMISCF-
     A                                      _SCR01C_MainTabPanel","parent tab":-
     A                                      "0","css class 2":"profound-convert-
     A                                      ed"},{"id":"SCPROD","field type":"o-
     A                                      utput field","value":{"fieldName":"-
     A                                      SCPROD","designValue":"[SCPROD]","r-
     A                                      efField":"AGT#","dataType":"referen-
     A                                      ce","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"999.00"},"css class":"o-
     A                                      utput-field","left":"652px","cursor-
     A                                       column":"55","top":"190px","cursor-
     A                                       row":"5","width":"35px","text alig-
     A                                      n":"right","parent tab panel":"SRMI-
     A                                      SCF_SCR01C_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCPNAM","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCPNAM","designValue":"[SCPNAM]"-
     A                                      ,"refField":"NM20","dataType":"refe-
     A                                      rence","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"false-
     A                                      ","textTransform":"none"},"css clas-
     A                                      s":"output-field","left":"694px","c-
     A                                      ursor column":"61","top":"190px","c-
     A                                      ursor row":"5","parent tab panel":"-
     A                                      SRMISCF_SCR01C_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"field type":"button",-
     A                                      "left":"1140px","height":"18px","wi-
     A                                      dth":"75px","locked in place":"true-
     A                                      ","css class":"button","cursor":"de-
     A                                      fault","visibility":"hidden","id":"-
     A                                      SRMISCF_SCR01C_BtnHiddenSystemMessa-
     A                                      ges","value":"btnMessage","top":"20-
     A                                      0px","response":{"fieldName":"btnMe-
     A                                      ssage","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant10","field ty-
     A                                      pe":"output field","value":"Year :"-
     A                                      ,"css class":"constant","left":"281-
     A                                      px","cursor column":"2","top":"210p-
     A                                      x","cursor row":"6","parent tab pan-
     A                                      el":"SRMISCF_SCR01C_MainTa')
     A                                  1  8HTML('bPanel","parent tab":"0","css-
     A                                       class 2":"profound-converted"},{"i-
     A                                      d":"SCFYR","field type":"output fie-
     A                                      ld","value":{"fieldName":"SCFYR","d-
     A                                      esignValue":"[SCFYR]","refField":"F-
     A                                      YR","dataType":"reference","formatt-
     A                                      ing":"Number","numSep":"false","zer-
     A                                      oBalance":"true","zeroFill":"true",-
     A                                      "curSym":"","units":"","negNum":"-9-
     A                                      99.00"},"css class":"output-field",-
     A                                      "left":"337px","cursor column":"10"-
     A                                      ,"top":"210px","cursor row":"6","wi-
     A                                      dth":"21px","text align":"right","p-
     A                                      arent tab panel":"SRMISCF_SCR01C_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant11","field type":"output -
     A                                      field","value":"Policy Year Status:-
     A                                      ","css class":"constant","left":"38-
     A                                      6px","cursor column":"17","top":"21-
     A                                      0px","cursor row":"6","parent tab p-
     A                                      anel":"SRMISCF_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","css class 2":"pr-
     A                                      ofound-converted"},{"id":"SCPYST","-
     A                                      field type":"output field","value":-
     A                                      {"fieldName":"SCPYST","designValue"-
     A                                      :"[SCPYST]","refField":"DS10","data-
     A                                      Type":"reference","formatting":"Tex-
     A                                      t","trimLeading":"false","trimTrail-
     A                                      ing":"false","textTransform":"none"-
     A                                      },"css class":"output-field","left"-
     A                                      :"533px","cursor column":"38","top"-
     A                                      :"210px","cursor row":"6","parent t-
     A                                      ab panel":"SRMISCF_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant12","field type":"output field",-
     A                                      "value":"Cx Date:","css class":"con-
     A                                      stant","visibility":{"fieldName":"4-
     A                                      1","dataType":"expression","formatt-
     A                                      ing":"Indicator","indFormat":"visib-
     A                                      le / hidden"},"left":"701px","curso-
     A                                      r column":"62","top":"210px","curso-
     A                                      r row":"6","parent tab panel":"SRMI-
     A                                      SCF_SCR01C_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCCXDT","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCCXDT","designValue":"[SCCXDT]"-
     A                                      ,"refField":"DT8","dataType":"refer-
     A                                      ence","formatting":"Number","numSep-
     A                                      ":"false","zeroBalance":"true","zer-
     A                                      oFill":"true","curSym":"","units":"-
     A                                      ","negNum":"-999.00","edtWrd":"''  -
     A                                      /  /    ''"},"css class":"output-fi-
     A                                      eld","visibility":{"fieldName":"41"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"visible-
     A                                       / hidden"},"left":"764px","cursor -
     A                                      column":"71","top":"210px","cursor -
     A                                      row":"6","width":"70px","text align-
     A                                      ":"right","parent tab panel":"SRMIS-
     A                                      CF_SCR01C_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"SRMIS-
     A                                      CF_SCR01C_BtnHiddenWorkSubmitJob","-
     A                                      value":"btnWrksbmjob","top":"225px"-
     A                                      ,"response":{"fieldName":"btnWrkJob-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"constant13","field type":"-
     A                                      output field","value":"Position to -
     A                                      . . .","css class":"constant","left-
     A                                      ":"281px","cursor column":"2","top"-
     A                                      :"250px","cursor row":"8","parent t-
     A                                      ab panel":"SRMISCF_SCR01C_MainTabPa-
     A                                      nel","parent tab":"0","css class 2"-
     A                                      :"profound-converted"},{"id":"const-
     A                                      ant15","field type":"output field",-
     A                                      "value":"Sequence #:","css class":"-
     A                                      constant","left":"407px","cursor co-
     A                                      lumn":"20","top":"250px","cursor ro-
     A                                      w":"8","parent tab panel":"SRMISCF_-
     A                                      SCR01C_MainTabPanel","parent tab":"-
     A                                      0","css class 2":"profound-converte-
     A                                      d"},{"id":"SCPST1","field type":"te-
     A                                      xtbox","css class":"input","css cla-
     A                                      ss 2":"textbox","input only":"true"-
     A                                      ,"value":{"fieldName":"SCPST1","des-
     A                                      ignValue":"[SCPST1]","dataType":"ch-
     A                                      ar","formatting":"Number","numSep":-
     A                                      "false","zeroBalance":"false","zero-
     A                                      Fill":"false","curSym":"","units":"-
     A                                      ","negNum":"-999.00","dataLength":"-
     A                                      5","numBlankFill":"true"},"visibili-
     A                                      ty":{"fieldName":"21","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"visible / hidden"},"l-
     A                                      eft":"491px","cursor column":"32","-
     A                                      top":"250px","cursor row":"8","widt-
     A                                      h":"36px","text align":"right","set-
     A                                       focus":{"fieldName":"N06","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      parent tab panel":"SRMISCF_SCR01C_M-
     A                                      ainTabPanel","parent tab":"0","css -
     A                                      class 3":"profound-converted"},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"SRMISCF_SCR01C_B-
     A                                      tnHiddenWorkPrinterOutput","value":-
     A                                      "btnWrkprtout","top":"250px","respo-
     A                                      nse":{"fieldName":"btnWrkPrnt","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"SRMISCF_SCR01C_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataT')
     A                                  1  9HTML('ype":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"id":"constant14","field type":"ou-
     A                                      tput field","value":"Type options, -
     A                                      press Enter.","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"290px","cursor row":"10","-
     A                                      css class 2":"BLU","parent tab pane-
     A                                      l":"SRMISCF_SCR01C_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"SRMISCF_SCR01C_BtnHiddenHelp","-
     A                                      value":"btnHelp","top":"300px","res-
     A                                      ponse":{"fieldName":"btnHelp","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"id"-
     A                                      :"SCOPL1","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCOPL1","d-
     A                                      esignValue":"[SCOPL1]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"false"-
     A                                      ,"textTransform":"none","dataLength-
     A                                      ":"76"},"css class":"output-field",-
     A                                      "left":"295px","cursor column":"4",-
     A                                      "top":"310px","cursor row":"11","cs-
     A                                      s class 2":"BLU","parent tab panel"-
     A                                      :"SRMISCF_SCR01C_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCHDL1","field-
     A                                       type":"output field","value":{"fie-
     A                                      ldName":"SCHDL1","designValue":"[SC-
     A                                      HDL1]","dataType":"char","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none","dataLength":"78"},"css cla-
     A                                      ss":"output-field","left":"281px","-
     A                                      cursor column":"2","top":"350px","c-
     A                                      ursor row":"13","css class 2":"HI",-
     A                                      "parent tab panel":"SRMISCF_SCR01C_-
     A                                      MainTabPanel","parent tab":"0","css-
     A                                       class 3":"profound-converted","css-
     A                                       class 4":"subfile-heading"},{"id":-
     A                                      "SCR01S","field type":"grid","numbe-
     A                                      r of columns":"2","record format na-
     A                                      me":"SCR01S","subfile next changed"-
     A                                      :{"fieldName":"08","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"true / false"},"display -
     A                                      subfile":{"fieldName":"04","dataTyp-
     A                                      e":"expression","formatting":"Indic-
     A                                      ator","indFormat":"true / false"},"-
     A                                      display control record":{"fieldName-
     A                                      ":"N03","dataType":"expression","fo-
     A                                      rmatting":"Indicator","indFormat":"-
     A                                      true / false"},"clear subfile":{"fi-
     A                                      eldName":"03","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"true / false"},"subfile size"-
     A                                      :"9","place cursor":"true","header -
     A                                      height":"20","row height":"20","css-
     A                                       class":"subfilegrid","css class 2"-
     A                                      :"profound-converted","parent tab p-
     A                                      anel":"SRMISCF_SCR01C_MainTabPanel"-
     A                                      ,"parent tab":"0","subfile end":{"f-
     A                                      ieldName":"95","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"},"page down re-
     A                                      sponse":{"fieldName":"*IN01","dataT-
     A                                      ype":"indicator","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"page u-
     A                                      p response":{"fieldName":"*IN02","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"},"sh-
     A                                      ow paging controls":"true","scrollb-
     A                                      ar":"none","number of rows":"9","to-
     A                                      p":"350px","left":"276px","column w-
     A                                      idths":"28,553","return mode":{"fie-
     A                                      ldName":"SFLMOD","dataLength":"1","-
     A                                      dataType":"char","formatting":"Text-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","textTransform":"none"},-
     A                                      "subfile record number":{"fieldName-
     A                                      ":"SCRRN1","designValue":"[SCRRN1]"-
     A                                      ,"dataType":"zoned","formatting":"N-
     A                                      umber","numSep":"false","zeroBalanc-
     A                                      e":"true","zeroFill":"true","curSym-
     A                                      ":"","units":"","negNum":"-999.00",-
     A                                      "dataLength":"4","decPos":"0"}},{"i-
     A                                      d":"btnSubmit","field type":"button-
     A                                      ","value":"Enter","shortcut key":"E-
     A                                      nter","left":"14px","top":"150px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"},{"id":"btnC-
     A                                      F03","field type":"button","value":-
     A                                      "F3","shortcut key":"F3","left":"14-
     A                                      px","top":"183px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF05","field type-
     A                                      ":"button","value":"F5","shortcut k-
     A                                      ey":"F5","left":"14px","top":"216px-
     A                                      ","width":"100px","height":"23px","-
     A                                      css class":"button","auto arrange":-
     A                                      "true","cursor":"default"},{"id":"b-
     A                                      tnCF06","field type":"button","valu-
     A                                      e":"F6","shortcut key":"F6","left":-
     A                                      "14px","top":"249px","width":"100px-
     A                                      ","height":"23px","css class":"butt-
     A                                      on","auto arrange":"true","cursor":-
     A                                      "default"},{"id":"btnCF11","field t-
     A                                      ype":"button","value":"F11","shortc-
     A                                      ut key":"F11","left":"14px","top":"-
     A                                      282px","width":"100px","height":"23-
     A                                      px","css class":"button","auto arra-
     A                                      nge":"true","cursor":"default"},{"i-
     A                                      d":"btnCF12","field type":"button",-
     A                                      "value":"Cancel","shortcut key":"F1-
     A                                      2","left":"14px","top":"315px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"},{"id":"btnCF17-
     A                                      ","field type":"button","value":"F1-
     A                                      7","shortcut key":"F17","left":"14p-
     A                                      x","top":"348px","width":"')
     A                                  1 10HTML('100px","height":"23px","css c-
     A                                      lass":"button","auto arrange":"true-
     A                                      ","cursor":"default"},{"id":"btnCF2-
     A                                      3","field type":"button","value":"F-
     A                                      23","shortcut key":"F23","left":"14-
     A                                      px","top":"381px","width":"100px","-
     A                                      height":"23px","css class":"button"-
     A                                      ,"auto arrange":"true","cursor":"de-
     A                                      fault"},{"id":"btnCF24","field type-
     A                                      ":"button","value":"F24","shortcut -
     A                                      key":"F24","left":"14px","top":"414-
     A                                      px","width":"100px","height":"23px"-
     A                                      ,"css class":"button","auto arrange-
     A                                      ":"true","cursor":"default"},{"id":-
     A                                      "SCDBRR","field type":"output field-
     A                                      ","visibility":"hidden","value":{"f-
     A                                      ieldName":"SCDBRR","designValue":"[-
     A                                      SCDBRR]","dataType":"zoned","format-
     A                                      ting":"Number","numSep":"false","ze-
     A                                      roBalance":"true","zeroFill":"true"-
     A                                      ,"curSym":"","units":"","negNum":"--
     A                                      999.00","dataLength":"9","decPos":"-
     A                                      0"},"left":"-58px","top":"-399px","-
     A                                      width":"63px","text align":"right",-
     A                                      "css class":"profound-converted","g-
     A                                      rid":"SCR01S","column":"0"},{"id":"-
     A                                      SCL001","field type":"output field"-
     A                                      ,"visibility":"hidden","value":{"fi-
     A                                      eldName":"SCL001","designValue":"[S-
     A                                      CL001]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"none","dataLength":"79"},"left":"-
     A                                      -45px","top":"-399px","css class":"-
     A                                      profound-converted","grid":"SCR01S"-
     A                                      ,"column":"0"},{"id":"SCSEQ#","fiel-
     A                                      d type":"output field","visibility"-
     A                                      :"hidden","value":{"fieldName":"SCS-
     A                                      EQ#","designValue":"[SCSEQ#]","data-
     A                                      Type":"zoned","formatting":"Number"-
     A                                      ,"numSep":"false","zeroBalance":"tr-
     A                                      ue","zeroFill":"true","curSym":"","-
     A                                      units":"","negNum":"-999.00","dataL-
     A                                      ength":"5","decPos":"0"},"left":"-3-
     A                                      0px","top":"-399px","width":"35px",-
     A                                      "text align":"right","css class":"p-
     A                                      rofound-converted","grid":"SCR01S",-
     A                                      "column":"0"},{"id":"SCSEL","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCSEL","designValue":"[-
     A                                      SCSEL]","dataType":"char","formatti-
     A                                      ng":"Text","trimLeading":"false","t-
     A                                      rimTrailing":"true","textTransform"-
     A                                      :"uppercase","dataLength":"2"},"tex-
     A                                      t transform":"uppercase","left":"5p-
     A                                      x","cursor column":"2","top":"1px",-
     A                                      "cursor row":"14","width":"15px","s-
     A                                      et focus":{"fieldName":"07","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"true / false"},-
     A                                      "css class 3":{"fieldName":"05","da-
     A                                      taType":"expression","formatting":"-
     A                                      Indicator","indFormat":"Custom Valu-
     A                                      es","customTrue":"RI","customFalse"-
     A                                      :""},"description":"Selection Field-
     A                                      ","css class 4":"profound-converted-
     A                                      ","grid":"SCR01S","column":"0"},{"i-
     A                                      d":"SCDATA","field type":"output fi-
     A                                      eld","value":{"fieldName":"SCDATA",-
     A                                      "designValue":"[SCDATA]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none","dataLeng-
     A                                      th":"74"},"css class":"output-field-
     A                                      ","left":"5px","cursor column":"6",-
     A                                      "top":"1px","cursor row":"14","css -
     A                                      class 2":"profound-converted","grid-
     A                                      ":"SCR01S","column":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCEDN         44A  H
     A            SCHDL1        78A  H
     A            SCODIV         5S 0H
     A            SCOEMP         9S 0H
     A            SCOFND         3S 0H
     A            SCOPL1        76A  H
     A            SCOPL2        76A  H
     A            SCPST1         5A  H
     A            SCPST2         1A  H
     A            SCPST3         1A  H
     A            SCPST4         1A  H
     A            SCPST5         1A  H
     A            SCPST6         1A  H
     A            SCPST7         1A  H
     A            SCPST8         1A  H
     A            SCPST9         1A  H
     A            SCRRN1         4S 0H
     A            SFLMOD         1A  H
     A            SCAGT#    R        H      REFFLD(AGT#)
     A            SCANAM    R        H      REFFLD(NM20)
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCCXDT    R        H      REFFLD(DT8)
     A            SCFNAM    R        H      REFFLD(NAME)
     A            SCFND     R        H      REFFLD(FND)
     A            SCFYR     R        H      REFFLD(FYR)
     A            SCPNAM    R        H      REFFLD(NM20)
     A            SCPRDS    R        H      REFFLD(NAME)
     A            SCPROD    R        H      REFFLD(AGT#)
     A            SCPYST    R        H      REFFLD(DS10)
     A          R SCR01
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    ROVERLAY   0     -
     A                                      RROWS      2    C2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay":"true","overlay range":"2-
     A                                      3-23"},"items":[{"id":"SCFKL2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      FKL2","designValue":"[SCFKL2]","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      trimLeading":"false","trimTrailing"-
     A                                      :"true","textTransform":"none","dat-
     A                                      aLength":"78"},"left":"0px","top":"-
     A                                      -30px","css class":"profound-conver-
     A                                      ted"},{"id":"SRMISCF_SCR01_avKeys",-
     A                                      "field type":"output field","value"-
     A                                      :{"fieldName":"AV_KEYS","dataLength-
     A                                      ":"1134","trimLeading":"false","tri-
     A                                      mTrailing":"true","blankFill":"fals-
     A                                      e","rjZeroFill":"false","dataType":-
     A                                      "char","formatting":"Text","textTra-
     A                                      nsform":"none","designValue":"[AV_K-
     A                                      EYS]"},"left":"0px","top":"0px","vi-
     A                                      sibility":"hidden"},{"id":"SRMISCF_-
     A                                      SCR01_action","field type":"html co-
     A                                      ntainer","white space":"normal","le-
     A                                      ft":"0px","top":"10px","width":"230-
     A                                      px","css class":"action-panel-conve-
     A                                      rted","height":"700px","html":"<div-
     A                                       class=\"top\"></div><div class=\"i-
     A                                      magetop\"><img src=\"/profoundui/us-
     A                                      erdata/images/bar_top.png\" /></div-
     A                                      ><div class=\"menulinks\"></div><di-
     A                                      v class=\"imagebottom\"><img src=\"-
     A                                      /profoundui/userdata/images/bar_bot-
     A                                      tom.png\" /></div><div class=\"bott-
     A                                      om\"></div>"},{"field type":"icon m-
     A                                      enu button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"32px","z index":"20","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1170p-
     A                                      x","id":"SRMISCF_SCR01_BtnIconMenuS-
     A                                      ystemTools","tool tip":"System Tool-
     A                                      s","icon alignment":"middle left","-
     A                                      icon width":"16px","icon height":"2-
     A                                      4px","icon source":"/profoundui/use-
     A                                      rdata/images/systool/systools.png",-
     A                                      "data function":"SystemToolbarSysto-
     A                                      ols","show down arrow":"Yes"},{"fie-
     A                                      ld type":"panel","panel style":"Tra-
     A                                      nsformButtonBar","id":"SRMISCF_SCR0-
     A                                      1_ButtonBar","top":"35px","left":"1-
     A                                      036px","width":"187px","height":"28-
     A                                      px","css class":"stationary","visib-
     A                                      ility":"hidden","locked in place":"-
     A                                      true"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1040px-
     A                                      ","id":"SRMISCF_SCR01_BtnSave","too-
     A                                      l tip":"Save","onclick":"SystemTool-
     A                                      barSave","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /save.png'')"},{"field type":"butto-
     A                                      n","css class":"stationary","width"-
     A                                      :"25px","height":"24px","top":"40px-
     A                                      ","background color":"#FFFFFF","bac-
     A                                      kground repeat":"no-repeat","border-
     A                                       top style":"none","border right st-
     A                                      yle":"none","border bottom style":"-
     A                                      none","border left style":"none","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","locked in place":"true","left"-
     A                                      :"1066px","id":"SRMISCF_SCR01_BtnRe-
     A                                      fresh","tool tip":"Refresh","onclic-
     A                                      k":"SystemToolbarRefresh","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/refresh.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1092px","id":-
     A                                      "SRMISCF_SCR01_BtnSearch","tool tip-
     A                                      ":"Search","onclick":"SystemToolbar-
     A                                      Search","background image":"url(''/-
     A                                      profoundui/userdata/images/systool/-
     A                                      search.png'')"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1118px","id":"SRMISCF_SCR01_BtnD-
     A                                      iaryItems","tool tip":"Diary/Work I-
     A                                      tems - IDARTS","onclick":"SystemToo-
     A                                      lbarDiary","background image":{"fie-
     A                                      ldName":"DryIcnURL","dataLength":"1-
     A                                      28","trimLeading":"false","trimTrai-
     A                                      ling":"true","blankFill":"false","r-
     A                                      jZeroFill":"false","dataType":"char-
     A                                      ","formatting":"Text","textTransfor-
     A                                      m":"none"}},{"field type":"button",-
     A                                      "css class":"stationary","width":"2-
     A                                      5px","height":"24px","top":"40px","-
     A                                      background color":"#FFFFFF","backgr-
     A                                      ound repeat":"no-repeat","border to-
     A                                      p style":"none","border right style-
     A                                      ":"none","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility"')
     A                                  1  4HTML(':"hidden","locked in place":"-
     A                                      true","left":"1144px","id":"SRMISCF-
     A                                      _SCR01_BtnSystemMessages","tool tip-
     A                                      ":"System Messages","onclick":"Syst-
     A                                      emToolbarMessages","background imag-
     A                                      e":{"fieldName":"MsgIcnURL","dataLe-
     A                                      ngth":"128","trimLeading":"false","-
     A                                      trimTrailing":"true","blankFill":"f-
     A                                      alse","rjZeroFill":"false","dataTyp-
     A                                      e":"char","formatting":"Text","text-
     A                                      Transform":"none"}},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1196px","id":"SRMISCF_SCR01_-
     A                                      BtnHelp","tool tip":"Help","onclick-
     A                                      ":"SystemToolbarHelp","background i-
     A                                      mage":"url(''/profoundui/userdata/i-
     A                                      mages/systool/help.png'')"},{"id":"-
     A                                      SRMISCF_SCR01_ImgSysToolBottom","fi-
     A                                      eld type":"image","image source":"/-
     A                                      profoundui/userdata/images/systool/-
     A                                      butbarbot.png","left":"1036px","top-
     A                                      ":"64px","width":"187px","locked in-
     A                                       place":"true","css class":"station-
     A                                      ary","visibility":"hidden"},{"id":"-
     A                                      SRMISCF_SCR01_MainTabPanel","field -
     A                                      type":"tab panel","tab panel style"-
     A                                      :"Transform","tab names":"Tab 1","a-
     A                                      ctive tab":"0","left":"250px","top"-
     A                                      :"70px","width":"970px","height":"6-
     A                                      57px","z index":"8","locked in plac-
     A                                      e":"true","css class":"tab-panel","-
     A                                      css class 2":"stationary"},{"field -
     A                                      type":"button","left":"1140px","hei-
     A                                      ght":"18px","width":"75px","locked -
     A                                      in place":"true","css class":"butto-
     A                                      n","cursor":"default","visibility":-
     A                                      "hidden","id":"SRMISCF_SCR01_BtnHid-
     A                                      denSave","value":"btnSave","top":"1-
     A                                      00px","response":{"fieldName":"btnS-
     A                                      ave","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"SRMISCF_SCR01_fkeyMenu"-
     A                                      ,"field type":"menu","left":"10px",-
     A                                      "top":"120px","height":"350px","wid-
     A                                      th":"230px","hover background color-
     A                                      ":"#9AAA61","hover text color":"#FF-
     A                                      FFFF","border color":"#4C6106","men-
     A                                      u option indent":"10px","background-
     A                                       color":"#758B27","css class":"acti-
     A                                      on-menu","css class 2":"stationary"-
     A                                      ,"z index":"101"},{"field type":"bu-
     A                                      tton","left":"1140px","height":"18p-
     A                                      x","width":"75px","locked in place"-
     A                                      :"true","css class":"button","curso-
     A                                      r":"default","visibility":"hidden",-
     A                                      "id":"SRMISCF_SCR01_BtnHiddenRefres-
     A                                      h","value":"btnRefresh","top":"125p-
     A                                      x","response":{"fieldName":"btnRefr-
     A                                      esh","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"field type":"button","left":-
     A                                      "1140px","height":"18px","width":"7-
     A                                      5px","locked in place":"true","css -
     A                                      class":"button","cursor":"default",-
     A                                      "visibility":"hidden","id":"SRMISCF-
     A                                      _SCR01_BtnHiddenSearch","value":"bt-
     A                                      nSearch","top":"150px","response":{-
     A                                      "fieldName":"btnSearch","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"SRMISCF_SCR01_BtnHidden-
     A                                      DiaryItems","value":"btnDiary","top-
     A                                      ":"175px","response":{"fieldName":"-
     A                                      btnDiary","dataType":"indicator","f-
     A                                      ormatting":"Indicator","indFormat":-
     A                                      "1 / 0"}},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"SR-
     A                                      MISCF_SCR01_BtnHiddenSystemMessages-
     A                                      ","value":"btnMessage","top":"200px-
     A                                      ","response":{"fieldName":"btnMessa-
     A                                      ge","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"SRMISCF_-
     A                                      SCR01_BtnHiddenWorkSubmitJob","valu-
     A                                      e":"btnWrksbmjob","top":"225px","re-
     A                                      sponse":{"fieldName":"btnWrkJob","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"SRMISCF_SCR01_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"SRMISCF_SCR01_B-
     A                                      tnHiddenImageQueue","value":"btnImg-
     A                                      Que","top":"275px","response":{"fie-
     A                                      ldName":"btnImgQue","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locke')
     A                                  1  5HTML('d in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"SRMISCF_SCR0-
     A                                      1_BtnHiddenHelp","value":"btnHelp",-
     A                                      "top":"300px","response":{"fieldNam-
     A                                      e":"btnHelp","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"id":"SCFKL1","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"SCFKL1","designValue":"[SCF-
     A                                      KL1]","dataType":"char","formatting-
     A                                      ":"Text","trimLeading":"false","tri-
     A                                      mTrailing":"true","textTransform":"-
     A                                      none","dataLength":"78"},"left":"28-
     A                                      1px","cursor column":"2","top":"550-
     A                                      px","cursor row":"23","css class":"-
     A                                      BLU","parent tab panel":"SRMISCF_SC-
     A                                      R01_MainTabPanel","parent tab":"0",-
     A                                      "visibility":"hidden","css class 2"-
     A                                      :"profound-converted"},{"id":"btnSu-
     A                                      bmit","field type":"button","value"-
     A                                      :"Enter","shortcut key":"Enter","le-
     A                                      ft":"14px","top":"150px","width":"1-
     A                                      00px","height":"23px","css class":"-
     A                                      button","auto arrange":"true","curs-
     A                                      or":"default"},{"id":"btnPAGEDOWN",-
     A                                      "field type":"button","value":"Page-
     A                                       Down","shortcut key":"PageDown","r-
     A                                      esponse":{"fieldName":"*IN01","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"left"-
     A                                      :"14px","top":"183px","width":"100p-
     A                                      x","height":"23px","css class":"but-
     A                                      ton","auto arrange":"true","cursor"-
     A                                      :"default"},{"id":"btnPAGEUP","fiel-
     A                                      d type":"button","value":"Page Up",-
     A                                      "shortcut key":"PageUp","response":-
     A                                      {"fieldName":"*IN02","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"14px","-
     A                                      top":"216px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            SCFKL1        78A  H
     A            SCFKL2        78A  H
     A          R SCR02S                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            SCDATA        74A  H
     A            SCDBRR         9S 0H
     A            SCSEL          2A  H
     A            SCSF1R         4S 0H
     A          R QSFLCTL002                SFLCTL(SCR02S)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLSCR02C')
     A          R SCR02C
     A  01 02 13
     A  14 15                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    SCR02S    5    RS-
     A                                      FLDSP    0    E1    3     14RSFLDSP-
     A                                      CTL 0    E1    3    N13RSFLCLR    0-
     A                                          E1    3     13RSFLPAG    1    C-
     A                                      1    8 RSFLSIZ    1    C1    9 1   -
     A                                       RSFLNXTCHG 0     2    ROVERLAY   0-
     A                                           RROWS      2    C1    1C2    1-
     A                                      5 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02C","onload":"pui.buildFKey-
     A                                      Menu({skipHelp: true, availableKeys-
     A                                      : file + \"_\" + format + \"_\" + \-
     A                                      "avKeys\", fkeyMenuId:file + \"_\" -
     A                                      + format + \"_\" + \"fkeyMenu\" })"-
     A                                      ,"overlay":"true","overlay range":"-
     A                                      1-15"},"items":[{"id":"SCRRN2","fie-
     A                                      ld type":"output field","visibility-
     A                                      ":"hidden","value":{"fieldName":"SC-
     A                                      RRN2","designValue":"[SCRRN2]","dat-
     A                                      aType":"zoned","formatting":"Number-
     A                                      ","numSep":"false","zeroBalance":"t-
     A                                      rue","zeroFill":"true","curSym":"",-
     A                                      "units":"","negNum":"-999.00","data-
     A                                      Length":"4","decPos":"0"},"left":"0-
     A                                      px","top":"-30px","width":"28px","t-
     A                                      ext align":"right","css class":"pro-
     A                                      found-converted"},{"id":"SRMISCF_SC-
     A                                      R02C_avKeys","field type":"output f-
     A                                      ield","value":{"fieldName":"AV_KEYS-
     A                                      ","dataLength":"1134","trimLeading"-
     A                                      :"false","trimTrailing":"true","bla-
     A                                      nkFill":"false","rjZeroFill":"false-
     A                                      ","dataType":"char","formatting":"T-
     A                                      ext","textTransform":"none","design-
     A                                      Value":"[AV_KEYS]"},"left":"0px","t-
     A                                      op":"0px","visibility":"hidden"},{"-
     A                                      id":"SRMISCF_SCR02C_action","field -
     A                                      type":"html container","white space-
     A                                      ":"normal","left":"0px","top":"10px-
     A                                      ","width":"230px","css class":"acti-
     A                                      on-panel-converted","height":"700px-
     A                                      ","html":"<div class=\"top\"></div>-
     A                                      <div class=\"imagetop\"><img src=\"-
     A                                      /profoundui/userdata/images/bar_top-
     A                                      .png\" /></div><div class=\"menulin-
     A                                      ks\"></div><div class=\"imagebottom-
     A                                      \"><img src=\"/profoundui/userdata/-
     A                                      images/bar_bottom.png\" /></div><di-
     A                                      v class=\"bottom\"></div>"},{"field-
     A                                       type":"icon menu button","css clas-
     A                                      s":"stationary","width":"25px","hei-
     A                                      ght":"24px","top":"32px","z index":-
     A                                      "20","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1170px","id":"SRMISCF_SCR0-
     A                                      2C_BtnIconMenuSystemTools","tool ti-
     A                                      p":"System Tools","icon alignment":-
     A                                      "middle left","icon width":"16px","-
     A                                      icon height":"24px","icon source":"-
     A                                      /profoundui/userdata/images/systool-
     A                                      /systools.png","data function":"Sys-
     A                                      temToolbarSystools","show down arro-
     A                                      w":"Yes"},{"field type":"panel","pa-
     A                                      nel style":"TransformButtonBar","id-
     A                                      ":"SRMISCF_SCR02C_ButtonBar","top":-
     A                                      "35px","left":"1036px","width":"187-
     A                                      px","height":"28px","css class":"st-
     A                                      ationary","visibility":"hidden","lo-
     A                                      cked in place":"true"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1040px","id":"SRMISCF_SCR-
     A                                      02C_BtnSave","tool tip":"Save","onc-
     A                                      lick":"SystemToolbarSave","backgrou-
     A                                      nd image":"url(''/profoundui/userda-
     A                                      ta/images/systool/save.png'')"},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1066px","id":"SR-
     A                                      MISCF_SCR02C_BtnRefresh","tool tip"-
     A                                      :"Refresh","onclick":"SystemToolbar-
     A                                      Refresh","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /refresh.png'')"},{"field type":"bu-
     A                                      tton","css class":"stationary","wid-
     A                                      th":"25px","height":"24px","top":"4-
     A                                      0px","background color":"#FFFFFF","-
     A                                      background repeat":"no-repeat","bor-
     A                                      der top style":"none","border right-
     A                                       style":"none","border bottom style-
     A                                      ":"none","border left style":"none"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","locked in place":"true","le-
     A                                      ft":"1092px","id":"SRMISCF_SCR02C_B-
     A                                      tnSearch","tool tip":"Search","oncl-
     A                                      ick":"SystemToolbarSearch","backgro-
     A                                      und image":"url(''/profoundui/userd-
     A                                      ata/images/systool/search.png'')"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1118px","id":-
     A                                      "SRMISCF_SCR02C_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"non')
     A                                  1  4HTML('e","border bottom style":"non-
     A                                      e","border left style":"none","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"locked in place":"true","left":"1-
     A                                      144px","id":"SRMISCF_SCR02C_BtnSyst-
     A                                      emMessages","tool tip":"System Mess-
     A                                      ages","onclick":"SystemToolbarMessa-
     A                                      ges","background image":{"fieldName-
     A                                      ":"MsgIcnURL","dataLength":"128","t-
     A                                      rimLeading":"false","trimTrailing":-
     A                                      "true","blankFill":"false","rjZeroF-
     A                                      ill":"false","dataType":"char","for-
     A                                      matting":"Text","textTransform":"no-
     A                                      ne"}},{"field type":"button","css c-
     A                                      lass":"stationary","width":"25px","-
     A                                      height":"24px","top":"40px","backgr-
     A                                      ound color":"#FFFFFF","background r-
     A                                      epeat":"no-repeat","border top styl-
     A                                      e":"none","border right style":"non-
     A                                      e","border bottom style":"none","bo-
     A                                      rder left style":"none","cursor":"d-
     A                                      efault","visibility":"hidden","lock-
     A                                      ed in place":"true","left":"1196px"-
     A                                      ,"id":"SRMISCF_SCR02C_BtnHelp","too-
     A                                      l tip":"Help","onclick":"SystemTool-
     A                                      barHelp","background image":"url(''-
     A                                      /profoundui/userdata/images/systool-
     A                                      /help.png'')"},{"id":"SRMISCF_SCR02-
     A                                      C_ImgSysToolBottom","field type":"i-
     A                                      mage","image source":"/profoundui/u-
     A                                      serdata/images/systool/butbarbot.pn-
     A                                      g","left":"1036px","top":"64px","wi-
     A                                      dth":"187px","locked in place":"tru-
     A                                      e","css class":"stationary","visibi-
     A                                      lity":"hidden"},{"id":"SRMISCF_SCR0-
     A                                      2C_MainTabPanel","field type":"tab -
     A                                      panel","tab panel style":"Transform-
     A                                      ","tab names":{"fieldName":"SCPRD2"-
     A                                      ,"designValue":"[SCPRD2]","refField-
     A                                      ":"NAME","dataType":"reference","fo-
     A                                      rmatting":"Text","trimLeading":"fal-
     A                                      se","trimTrailing":"false","textTra-
     A                                      nsform":"none"},"active tab":"0","l-
     A                                      eft":"250px","top":"70px","width":"-
     A                                      970px","height":"657px","z index":"-
     A                                      8","locked in place":"true","css cl-
     A                                      ass":"tab-panel","css class 2":"sta-
     A                                      tionary"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"SR-
     A                                      MISCF_SCR02C_BtnHiddenSave","value"-
     A                                      :"btnSave","top":"100px","response"-
     A                                      :{"fieldName":"btnSave","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"id":"cons-
     A                                      tant16","field type":"output field"-
     A                                      ,"left":"281px","cursor column":"2"-
     A                                      ,"top":"110px","cursor row":"1","cs-
     A                                      s class":"top-line","value":"js: cu-
     A                                      rrentUser()","css class 2":"output--
     A                                      field","parent tab panel":"SRMISCF_-
     A                                      SCR02C_MainTabPanel","parent tab":"-
     A                                      0","css class 3":"profound-converte-
     A                                      d"},{"id":"SCR02C_SCCONM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCONM","designValue":"[SCCON-
     A                                      M]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","css class 3":"HI","parent -
     A                                      tab panel":"SRMISCF_SCR02C_MainTabP-
     A                                      anel","parent tab":"0","css class 4-
     A                                      ":"profound-converted"},{"id":"cons-
     A                                      tant17","field type":"output field"-
     A                                      ,"left":"778px","cursor column":"73-
     A                                      ","top":"110px","cursor row":"1","c-
     A                                      ss class":"top-line","value":"js: c-
     A                                      urrentDate()","css class 2":"output-
     A                                      -field","parent tab panel":"SRMISCF-
     A                                      _SCR02C_MainTabPanel","parent tab":-
     A                                      "0","css class 3":"profound-convert-
     A                                      ed"},{"id":"SRMISCF_SCR02C_fkeyMenu-
     A                                      ","field type":"menu","left":"10px"-
     A                                      ,"top":"120px","height":"350px","wi-
     A                                      dth":"230px","hover background colo-
     A                                      r":"#9AAA61","hover text color":"#F-
     A                                      FFFFF","border color":"#4C6106","me-
     A                                      nu option indent":"10px","backgroun-
     A                                      d color":"#758B27","css class":"act-
     A                                      ion-menu","css class 2":"stationary-
     A                                      ","z index":"101"},{"field type":"b-
     A                                      utton","left":"1140px","height":"18-
     A                                      px","width":"75px","locked in place-
     A                                      ":"true","css class":"button","curs-
     A                                      or":"default","visibility":"hidden"-
     A                                      ,"id":"SRMISCF_SCR02C_BtnHiddenRefr-
     A                                      esh","value":"btnRefresh","top":"12-
     A                                      5px","response":{"fieldName":"btnRe-
     A                                      fresh","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"SCR02C_Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValue":"[Q1PG-
     A                                      M]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"10"},"css class"-
     A                                      :"output-field","left":"281px","cur-
     A                                      sor column":"2","top":"130px","curs-
     A                                      or row":"2","parent tab panel":"SRM-
     A                                      ISCF_SCR02C_MainTabPanel","parent t-
     A                                      ab":"0","css class 2":"profound-con-
     A                                      verted"},{"id":"SCPRD2","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCPRD2","designValue":"[SCPRD2]-
     A                                      ","refField":"NAME","dataType":"ref-
     A                                      erence","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"fals-
     A                                      e","textTransform":"none"},"css cla-
     A                                      ss":"output-field","left":"414px","-
     A                                      cursor column":"21","top":"130px","-
     A                                      cursor row":"2","css class 2":"HI",-
     A                                      "parent tab panel":"SRMISC')
     A                                  1  5HTML('F_SCR02C_MainTabPanel","paren-
     A                                      t tab":"0","css class 3":"profound--
     A                                      converted"},{"id":"constant18","fie-
     A                                      ld type":"output field","value":"SC-
     A                                      R02","css class":"constant","left":-
     A                                      "799px","cursor column":"76","top":-
     A                                      "130px","cursor row":"2","parent ta-
     A                                      b panel":"SRMISCF_SCR02C_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"SRMISCF_SCR02C_BtnHiddenS-
     A                                      earch","value":"btnSearch","top":"1-
     A                                      50px","response":{"fieldName":"btnS-
     A                                      earch","dataType":"indicator","form-
     A                                      atting":"Indicator","indFormat":"1 -
     A                                      / 0"}},{"id":"constant19","field ty-
     A                                      pe":"output field","value":"Press E-
     A                                      nter to confirm your choices for 4=-
     A                                      Delete.","css class":"constant","le-
     A                                      ft":"281px","cursor column":"2","to-
     A                                      p":"170px","cursor row":"4","css cl-
     A                                      ass 2":"BLU","parent tab panel":"SR-
     A                                      MISCF_SCR02C_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"field type":"button","l-
     A                                      eft":"1140px","height":"18px","widt-
     A                                      h":"75px","locked in place":"true",-
     A                                      "css class":"button","cursor":"defa-
     A                                      ult","visibility":"hidden","id":"SR-
     A                                      MISCF_SCR02C_BtnHiddenDiaryItems","-
     A                                      value":"btnDiary","top":"175px","re-
     A                                      sponse":{"fieldName":"btnDiary","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"i-
     A                                      d":"constant20","field type":"outpu-
     A                                      t field","value":"Press F12 to retu-
     A                                      rn to change your choices.","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"190px","curs-
     A                                      or row":"5","css class 2":"BLU","pa-
     A                                      rent tab panel":"SRMISCF_SCR02C_Mai-
     A                                      nTabPanel","parent tab":"0","css cl-
     A                                      ass 3":"profound-converted"},{"fiel-
     A                                      d type":"button","left":"1140px","h-
     A                                      eight":"18px","width":"75px","locke-
     A                                      d in place":"true","css class":"but-
     A                                      ton","cursor":"default","visibility-
     A                                      ":"hidden","id":"SRMISCF_SCR02C_Btn-
     A                                      HiddenSystemMessages","value":"btnM-
     A                                      essage","top":"200px","response":{"-
     A                                      fieldName":"btnMessage","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"SRMISCF_SCR02C_BtnHidde-
     A                                      nWorkSubmitJob","value":"btnWrksbmj-
     A                                      ob","top":"225px","response":{"fiel-
     A                                      dName":"btnWrkJob","dataType":"indi-
     A                                      cator","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"}},{"id":"SCR02C_SC-
     A                                      HDL1","field type":"output field","-
     A                                      value":{"fieldName":"SCHDL1","desig-
     A                                      nValue":"[SCHDL1]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"7-
     A                                      8"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"230px","cursor row":"7","css cla-
     A                                      ss 2":"HI","parent tab panel":"SRMI-
     A                                      SCF_SCR02C_MainTabPanel","parent ta-
     A                                      b":"0","css class 3":"profound-conv-
     A                                      erted","css class 4":"subfile-headi-
     A                                      ng"},{"id":"SCR02S","field type":"g-
     A                                      rid","number of columns":"2","recor-
     A                                      d format name":"SCR02S","subfile ne-
     A                                      xt changed":"true","display subfile-
     A                                      ":{"fieldName":"14","dataType":"exp-
     A                                      ression","formatting":"Indicator","-
     A                                      indFormat":"true / false"},"display-
     A                                       control record":{"fieldName":"N13"-
     A                                      ,"dataType":"expression","formattin-
     A                                      g":"Indicator","indFormat":"true / -
     A                                      false"},"clear subfile":{"fieldName-
     A                                      ":"13","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"t-
     A                                      rue / false"},"subfile size":"9","h-
     A                                      eader height":"20","row height":"20-
     A                                      ","css class":"subfilegrid","css cl-
     A                                      ass 2":"profound-converted","parent-
     A                                       tab panel":"SRMISCF_SCR02C_MainTab-
     A                                      Panel","parent tab":"0","subfile en-
     A                                      d":{"fieldName":"N15","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"true / false"},"page -
     A                                      down response":{"fieldName":"*IN01"-
     A                                      ,"dataType":"indicator","formatting-
     A                                      ":"Indicator","indFormat":"1 / 0"},-
     A                                      "page up response":{"fieldName":"*I-
     A                                      N02","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"},"show paging controls":"true","-
     A                                      scrollbar":"none","number of rows":-
     A                                      "9","top":"230px","left":"276px","c-
     A                                      olumn widths":"28,553","subfile rec-
     A                                      ord number":{"fieldName":"SCRRN2","-
     A                                      designValue":"[SCRRN2]","dataType":-
     A                                      "zoned","formatting":"Number","numS-
     A                                      ep":"false","zeroBalance":"true","z-
     A                                      eroFill":"true","curSym":"","units"-
     A                                      :"","negNum":"-999.00","dataLength"-
     A                                      :"4","decPos":"0"}},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"SRMISCF_SCR02C_BtnHiddenWor-
     A                                      kPrinterOutput","value":"btnWrkprto-
     A                                      ut","top":"250px","response":{"fiel-
     A                                      dName":"btnWrkPrnt","dataType":"ind-
     A                                      icator","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"}},{"fiel')
     A                                  1  6HTML('d type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"SRMISCF_SCR0-
     A                                      2C_BtnHiddenImageQueue","value":"bt-
     A                                      nImgQue","top":"302px","response":{-
     A                                      "fieldName":"btnImgQue","dataType":-
     A                                      "indicator","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"}},{"field typ-
     A                                      e":"button","left":"1140px","height-
     A                                      ":"18px","width":"75px","locked in -
     A                                      place":"true","css class":"button",-
     A                                      "cursor":"default","visibility":"hi-
     A                                      dden","id":"SRMISCF_SCR02C_BtnHidde-
     A                                      nHelp","value":"btnHelp","top":"327-
     A                                      px","response":{"fieldName":"btnHel-
     A                                      p","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"id":"btnSubmit","field type":"-
     A                                      button","value":"Enter","shortcut k-
     A                                      ey":"Enter","left":"14px","top":"15-
     A                                      0px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnCF12","field type":"button","v-
     A                                      alue":"Cancel","shortcut key":"F12"-
     A                                      ,"left":"14px","top":"183px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"},{"id":"SCR02S_SC-
     A                                      DBRR","field type":"output field","-
     A                                      visibility":"hidden","value":{"fiel-
     A                                      dName":"SCDBRR","designValue":"[SCD-
     A                                      BRR]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"9","decPos":"0"}-
     A                                      ,"left":"-58px","top":"-279px","wid-
     A                                      th":"63px","text align":"right","cs-
     A                                      s class":"profound-converted","grid-
     A                                      ":"SCR02S","column":"0"},{"id":"SCS-
     A                                      F1R","field type":"output field","v-
     A                                      isibility":"hidden","value":{"field-
     A                                      Name":"SCSF1R","designValue":"[SCSF-
     A                                      1R]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"true","cu-
     A                                      rSym":"","units":"","negNum":"-999.-
     A                                      00","dataLength":"4","decPos":"0"},-
     A                                      "left":"-23px","top":"-279px","widt-
     A                                      h":"28px","text align":"right","css-
     A                                       class":"profound-converted","grid"-
     A                                      :"SCR02S","column":"0"},{"id":"SCR0-
     A                                      2S_SCSEL","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCSEL","de-
     A                                      signValue":"[SCSEL]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"false","-
     A                                      textTransform":"none","dataLength":-
     A                                      "2"},"css class":"output-field","le-
     A                                      ft":"5px","cursor column":"2","top"-
     A                                      :"1px","cursor row":"8","descriptio-
     A                                      n":"Selection Field","css class 2":-
     A                                      "profound-converted","grid":"SCR02S-
     A                                      ","column":"0"},{"id":"SCR02S_SCDAT-
     A                                      A","field type":"output field","val-
     A                                      ue":{"fieldName":"SCDATA","designVa-
     A                                      lue":"[SCDATA]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"false","textT-
     A                                      ransform":"none","dataLength":"74"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "5px","cursor column":"6","top":"1p-
     A                                      x","cursor row":"8","css class 2":"-
     A                                      profound-converted","grid":"SCR02S"-
     A                                      ,"column":"1"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCHDL1        78A  H
     A            SCRRN2         4S 0H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCPRD2    R        H      REFFLD(NAME)
     A          R SCR02
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC1    RROWS      2    C-
     A                                      2    23C2    23 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR02","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "overlay range":"23-23"},"items":[{-
     A                                      "id":"SRMISCF_SCR02_avKeys","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"AV_KEYS","dataLength":"1134-
     A                                      ","trimLeading":"false","trimTraili-
     A                                      ng":"true","blankFill":"false","rjZ-
     A                                      eroFill":"false","dataType":"char",-
     A                                      "formatting":"Text","textTransform"-
     A                                      :"none","designValue":"[AV_KEYS]"},-
     A                                      "left":"0px","top":"0px","visibilit-
     A                                      y":"hidden"},{"id":"SRMISCF_SCR02_a-
     A                                      ction","field type":"html container-
     A                                      ","white space":"normal","left":"0p-
     A                                      x","top":"10px","width":"230px","cs-
     A                                      s class":"action-panel-converted","-
     A                                      height":"700px","html":"<div class=-
     A                                      \"top\"></div><div class=\"imagetop-
     A                                      \"><img src=\"/profoundui/userdata/-
     A                                      images/bar_top.png\" /></div><div c-
     A                                      lass=\"menulinks\"></div><div class-
     A                                      =\"imagebottom\"><img src=\"/profou-
     A                                      ndui/userdata/images/bar_bottom.png-
     A                                      \" /></div><div class=\"bottom\"></-
     A                                      div>"},{"field type":"icon menu but-
     A                                      ton","css class":"stationary","widt-
     A                                      h":"25px","height":"24px","top":"32-
     A                                      px","z index":"20","cursor":"defaul-
     A                                      t","visibility":"hidden","locked in-
     A                                       place":"true","left":"1170px","id"-
     A                                      :"SRMISCF_SCR02_BtnIconMenuSystemTo-
     A                                      ols","tool tip":"System Tools","ico-
     A                                      n alignment":"middle left","icon wi-
     A                                      dth":"16px","icon height":"24px","i-
     A                                      con source":"/profoundui/userdata/i-
     A                                      mages/systool/systools.png","data f-
     A                                      unction":"SystemToolbarSystools","s-
     A                                      how down arrow":"Yes"},{"field type-
     A                                      ":"panel","panel style":"TransformB-
     A                                      uttonBar","id":"SRMISCF_SCR02_Butto-
     A                                      nBar","top":"35px","left":"1036px",-
     A                                      "width":"187px","height":"28px","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden","locked in place":"true"},-
     A                                      {"field type":"button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"40px","background c-
     A                                      olor":"#FFFFFF","background repeat"-
     A                                      :"no-repeat","border top style":"no-
     A                                      ne","border right style":"none","bo-
     A                                      rder bottom style":"none","border l-
     A                                      eft style":"none","cursor":"default-
     A                                      ","visibility":"hidden","locked in -
     A                                      place":"true","left":"1040px","id":-
     A                                      "SRMISCF_SCR02_BtnSave","tool tip":-
     A                                      "Save","onclick":"SystemToolbarSave-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/save.p-
     A                                      ng'')"},{"field type":"button","css-
     A                                       class":"stationary","width":"25px"-
     A                                      ,"height":"24px","top":"40px","back-
     A                                      ground color":"#FFFFFF","background-
     A                                       repeat":"no-repeat","border top st-
     A                                      yle":"none","border right style":"n-
     A                                      one","border bottom style":"none","-
     A                                      border left style":"none","cursor":-
     A                                      "default","visibility":"hidden","lo-
     A                                      cked in place":"true","left":"1066p-
     A                                      x","id":"SRMISCF_SCR02_BtnRefresh",-
     A                                      "tool tip":"Refresh","onclick":"Sys-
     A                                      temToolbarRefresh","background imag-
     A                                      e":"url(''/profoundui/userdata/imag-
     A                                      es/systool/refresh.png'')"},{"field-
     A                                       type":"button","css class":"statio-
     A                                      nary","width":"25px","height":"24px-
     A                                      ","top":"40px","background color":"-
     A                                      #FFFFFF","background repeat":"no-re-
     A                                      peat","border top style":"none","bo-
     A                                      rder right style":"none","border bo-
     A                                      ttom style":"none","border left sty-
     A                                      le":"none","cursor":"default","visi-
     A                                      bility":"hidden","locked in place":-
     A                                      "true","left":"1092px","id":"SRMISC-
     A                                      F_SCR02_BtnSearch","tool tip":"Sear-
     A                                      ch","onclick":"SystemToolbarSearch"-
     A                                      ,"background image":"url(''/profoun-
     A                                      dui/userdata/images/systool/search.-
     A                                      png'')"},{"field type":"button","cs-
     A                                      s class":"stationary","width":"25px-
     A                                      ","height":"24px","top":"40px","bac-
     A                                      kground color":"#FFFFFF","backgroun-
     A                                      d repeat":"no-repeat","border top s-
     A                                      tyle":"none","border right style":"-
     A                                      none","border bottom style":"none",-
     A                                      "border left style":"none","cursor"-
     A                                      :"default","visibility":"hidden","l-
     A                                      ocked in place":"true","left":"1118-
     A                                      px","id":"SRMISCF_SCR02_BtnDiaryIte-
     A                                      ms","tool tip":"Diary/Work Items - -
     A                                      IDARTS","onclick":"SystemToolbarDia-
     A                                      ry","background image":{"fieldName"-
     A                                      :"DryIcnURL","dataLength":"128","tr-
     A                                      imLeading":"false","trimTrailing":"-
     A                                      true","blankFill":"false","rjZeroFi-
     A                                      ll":"false","dataType":"char","form-
     A                                      atting":"Text","textTransform":"non-
     A                                      e"}},{"field type":"button","css cl-
     A                                      ass":"stationary","width":"25px","h-
     A                                      eight":"24px","top":"40px","backgro-
     A                                      und color":"#FFFFFF","background re-
     A                                      peat":"no-repeat","border top style-
     A                                      ":"none","border right style":"none-
     A                                      ","border bottom style":"none","bor-
     A                                      der left style":"none","cursor":"de-
     A                                      fault","visibility":"hidden","locke-
     A                                      d in place":"true","left":"1144px",-
     A                                      "id":"SRMISCF_SCR02_BtnSystemMessag-
     A                                      es","tool tip":"System Messages","o-
     A                                      nclick":"SystemToolbarMessages","ba-
     A                                      ckground image":{"fieldName":"MsgIc-
     A                                      nURL","dataLength":"128","trimLeadi-
     A                                      ng":"false","trimTrailing":"true","-
     A                                      blankFill":"false","rjZeroFill":"fa-
     A                                      lse","dataType":"char","fo')
     A                                  1  4HTML('rmatting":"Text","textTransfo-
     A                                      rm":"none"}},{"field type":"button"-
     A                                      ,"css class":"stationary","width":"-
     A                                      25px","height":"24px","top":"40px",-
     A                                      "background color":"#FFFFFF","backg-
     A                                      round repeat":"no-repeat","border t-
     A                                      op style":"none","border right styl-
     A                                      e":"none","border bottom style":"no-
     A                                      ne","border left style":"none","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","locked in place":"true","left":"-
     A                                      1196px","id":"SRMISCF_SCR02_BtnHelp-
     A                                      ","tool tip":"Help","onclick":"Syst-
     A                                      emToolbarHelp","background image":"-
     A                                      url(''/profoundui/userdata/images/s-
     A                                      ystool/help.png'')"},{"id":"SRMISCF-
     A                                      _SCR02_ImgSysToolBottom","field typ-
     A                                      e":"image","image source":"/profoun-
     A                                      dui/userdata/images/systool/butbarb-
     A                                      ot.png","left":"1036px","top":"64px-
     A                                      ","width":"187px","locked in place"-
     A                                      :"true","css class":"stationary","v-
     A                                      isibility":"hidden"},{"id":"SRMISCF-
     A                                      _SCR02_MainTabPanel","field type":"-
     A                                      tab panel","tab panel style":"Trans-
     A                                      form","tab names":"Tab 1","active t-
     A                                      ab":"0","left":"250px","top":"70px"-
     A                                      ,"width":"970px","height":"657px","-
     A                                      z index":"8","locked in place":"tru-
     A                                      e","css class":"tab-panel","css cla-
     A                                      ss 2":"stationary"},{"field type":"-
     A                                      button","left":"1140px","height":"1-
     A                                      8px","width":"75px","locked in plac-
     A                                      e":"true","css class":"button","cur-
     A                                      sor":"default","visibility":"hidden-
     A                                      ","id":"SRMISCF_SCR02_BtnHiddenSave-
     A                                      ","value":"btnSave","top":"100px","-
     A                                      response":{"fieldName":"btnSave","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      id":"SRMISCF_SCR02_fkeyMenu","field-
     A                                       type":"menu","left":"10px","top":"-
     A                                      120px","height":"350px","width":"23-
     A                                      0px","hover background color":"#9AA-
     A                                      A61","hover text color":"#FFFFFF","-
     A                                      border color":"#4C6106","menu optio-
     A                                      n indent":"10px","background color"-
     A                                      :"#758B27","css class":"action-menu-
     A                                      ","css class 2":"stationary","z ind-
     A                                      ex":"101"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"S-
     A                                      RMISCF_SCR02_BtnHiddenRefresh","val-
     A                                      ue":"btnRefresh","top":"125px","res-
     A                                      ponse":{"fieldName":"btnRefresh","d-
     A                                      ataType":"indicator","formatting":"-
     A                                      Indicator","indFormat":"1 / 0"}},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"SRMISCF_SCR02_-
     A                                      BtnHiddenSearch","value":"btnSearch-
     A                                      ","top":"150px","response":{"fieldN-
     A                                      ame":"btnSearch","dataType":"indica-
     A                                      tor","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"}},{"field type":"but-
     A                                      ton","left":"1140px","height":"18px-
     A                                      ","width":"75px","locked in place":-
     A                                      "true","css class":"button","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      id":"SRMISCF_SCR02_BtnHiddenDiaryIt-
     A                                      ems","value":"btnDiary","top":"175p-
     A                                      x","response":{"fieldName":"btnDiar-
     A                                      y","dataType":"indicator","formatti-
     A                                      ng":"Indicator","indFormat":"1 / 0"-
     A                                      }},{"field type":"button","left":"1-
     A                                      140px","height":"18px","width":"75p-
     A                                      x","locked in place":"true","css cl-
     A                                      ass":"button","cursor":"default","v-
     A                                      isibility":"hidden","id":"SRMISCF_S-
     A                                      CR02_BtnHiddenSystemMessages","valu-
     A                                      e":"btnMessage","top":"200px","resp-
     A                                      onse":{"fieldName":"btnMessage","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"SRMISCF_SCR02_B-
     A                                      tnHiddenWorkSubmitJob","value":"btn-
     A                                      Wrksbmjob","top":"225px","response"-
     A                                      :{"fieldName":"btnWrkJob","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"field t-
     A                                      ype":"button","left":"1140px","heig-
     A                                      ht":"18px","width":"75px","locked i-
     A                                      n place":"true","css class":"button-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","id":"SRMISCF_SCR02_BtnHidd-
     A                                      enWorkPrinterOutput","value":"btnWr-
     A                                      kprtout","top":"250px","response":{-
     A                                      "fieldName":"btnWrkPrnt","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"field ty-
     A                                      pe":"button","left":"1140px","heigh-
     A                                      t":"18px","width":"75px","locked in-
     A                                       place":"true","css class":"button"-
     A                                      ,"cursor":"default","visibility":"h-
     A                                      idden","id":"SRMISCF_SCR02_BtnHidde-
     A                                      nImageQueue","value":"btnImgQue","t-
     A                                      op":"275px","response":{"fieldName"-
     A                                      :"btnImgQue","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"}},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "SRMISCF_SCR02_BtnHiddenHelp","valu-
     A                                      e":"btnHelp","top":"300px","respons-
     A                                      e":{"fieldName":"btnHelp","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"bt-
     A                                      nSubmit","field type":"button","val-
     A                                      ue":"Enter","shortcut key"')
     A                                  1  5HTML(':"Enter","left":"14px","top":-
     A                                      "150px","width":"100px","height":"2-
     A                                      3px","css class":"button","auto arr-
     A                                      ange":"true","cursor":"default"},{"-
     A                                      id":"btnPAGEDOWN","field type":"but-
     A                                      ton","value":"Page Down","shortcut -
     A                                      key":"PageDown","response":{"fieldN-
     A                                      ame":"*IN01","dataType":"indicator"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"left":"14px","top":"18-
     A                                      3px","width":"100px","height":"23px-
     A                                      ","css class":"button","auto arrang-
     A                                      e":"true","cursor":"default"},{"id"-
     A                                      :"btnPAGEUP","field type":"button",-
     A                                      "value":"Page Up","shortcut key":"P-
     A                                      ageUp","response":{"fieldName":"*IN-
     A                                      02","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "},"left":"14px","top":"216px","wid-
     A                                      th":"100px","height":"23px","css cl-
     A                                      ass":"button","auto arrange":"true"-
     A                                      ,"cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A          R SCR03
     A  01 02                               CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUIREC2    RWINDOW    0     -
     A                                      RROWS      2    C1    1C1    9 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR03","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "show as window":"true","window top-
     A                                      ":"3","window left":"4","overlay ra-
     A                                      nge":"1-9"},"items":[{"id":"SCR03",-
     A                                      "field type":"panel","panel style":-
     A                                      "Transform Dialog","text align":"ce-
     A                                      nter","left":"5px","top":"5px","hei-
     A                                      ght":"330px","width":"534px","z ind-
     A                                      ex":"8","locked in place":"true"},{-
     A                                      "id":"constant21","field type":"out-
     A                                      put field","left":"29px","cursor co-
     A                                      lumn":"2","top":"65px","cursor row"-
     A                                      :"1","value":"js: currentUser()","c-
     A                                      ss class":"output-field","css class-
     A                                       2":"profound-converted"},{"id":"SC-
     A                                      PRD3","field type":"output field","-
     A                                      value":{"fieldName":"SCPRD3","desig-
     A                                      nValue":"[SCPRD3]","refField":"NAME-
     A                                      ","dataType":"reference","formattin-
     A                                      g":"Text","trimLeading":"false","tr-
     A                                      imTrailing":"false","textTransform"-
     A                                      :"none"},"css class":"output-field"-
     A                                      ,"left":"127px","cursor column":"16-
     A                                      ","top":"65px","cursor row":"1","cs-
     A                                      s class 2":"HI","css class 3":"prof-
     A                                      ound-converted"},{"id":"constant22"-
     A                                      ,"field type":"output field","value-
     A                                      ":"SCR03","css class":"constant","l-
     A                                      eft":"477px","cursor column":"66","-
     A                                      top":"65px","cursor row":"1","css c-
     A                                      lass 2":"profound-converted"},{"id"-
     A                                      :"constant23","field type":"output -
     A                                      field","value":"Type choices, press-
     A                                       Enter.","css class":"constant","le-
     A                                      ft":"29px","cursor column":"2","top-
     A                                      ":"105px","cursor row":"3","css cla-
     A                                      ss 2":"BLU","css class 3":"profound-
     A                                      -converted"},{"id":"btnSubmit","fie-
     A                                      ld type":"button","value":"Enter","-
     A                                      shortcut key":"Enter","left":"14px"-
     A                                      ,"top":"290px","width":"80px","heig-
     A                                      ht":"23px","css class":"button","au-
     A                                      to arrange":"true","cursor":"defaul-
     A                                      t"},{"id":"btnCF12","field type":"b-
     A                                      utton","value":"Cancel","shortcut k-
     A                                      ey":"F12","left":"104px","top":"290-
     A                                      px","width":"80px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnPAGEDOWN","field type":"button",-
     A                                      "value":"Page Down","shortcut key":-
     A                                      "PageDown","response":{"fieldName":-
     A                                      "*IN01","dataType":"indicator","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"left":"194px","top":"290px"-
     A                                      ,"width":"80px","height":"23px","cs-
     A                                      s class":"button","auto arrange":"t-
     A                                      rue","visibility":"hidden","cursor"-
     A                                      :"default"},{"id":"btnPAGEUP","fiel-
     A                                      d type":"button","value":"Page Up",-
     A                                      "shortcut key":"PageUp","response":-
     A                                      {"fieldName":"*IN02","dataType":"in-
     A                                      dicator","formatting":"Indicator","-
     A                                      indFormat":"1 / 0"},"left":"284px",-
     A                                      "top":"290px","width":"80px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","visibility":"hid-
     A                                      den","cursor":"default"}]}')
     A            SCPRD3    R        H      REFFLD(NAME)
     A          R MSGSFL                    SFL
     A                                      SETOF(01)
     A                                      SETOF(02)
     A            QPUI00001      1A  O  2  2
     A            MSGKEY         4A  H
     A            Q1PGM         10A  H
     A          R QSFLCTL003                SFLCTL(MSGSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLMSGSFLC')
     A          R MSGSFLC
     A  01 02 10                            CA01(01 'Response Indicator *IN01')
     A                                      SETOF(02 'Response Indicator *IN02')
     A                                  1  2HTML('QPUICTL1    MSGSFL    6    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LINZ    0     RSFLPAG    1    C1   -
     A                                       1 RSFLSIZ    1    C1    5 FQ1PGM  -
     A                                         SFLPGMQ   0     2    FMSGKEY    -
     A                                      SFLMSGKEY 0     FQ1PGM     SFLPGMQ -
     A                                        0     1    RROWS      2    C2    -
     A                                      24C2    24 ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"MSGSFLC","onload":"pui.buildFKe-
     A                                      yMenu({skipHelp: true, availableKey-
     A                                      s: file + \"_\" + format + \"_\" + -
     A                                      \"avKeys\", fkeyMenuId:file + \"_\"-
     A                                       + format + \"_\" + \"fkeyMenu\" })-
     A                                      ","overlay range":"24-24"},"items":-
     A                                      [{"id":"SRMISCF_MSGSFLC_avKeys","fi-
     A                                      eld type":"output field","value":{"-
     A                                      fieldName":"AV_KEYS","dataLength":"-
     A                                      1134","trimLeading":"false","trimTr-
     A                                      ailing":"true","blankFill":"false",-
     A                                      "rjZeroFill":"false","dataType":"ch-
     A                                      ar","formatting":"Text","textTransf-
     A                                      orm":"none","designValue":"[AV_KEYS-
     A                                      ]"},"left":"0px","top":"0px","visib-
     A                                      ility":"hidden"},{"id":"SRMISCF_MSG-
     A                                      SFLC_action","field type":"html con-
     A                                      tainer","white space":"normal","lef-
     A                                      t":"0px","top":"10px","width":"230p-
     A                                      x","css class":"action-panel-conver-
     A                                      ted","height":"700px","html":"<div -
     A                                      class=\"top\"></div><div class=\"im-
     A                                      agetop\"><img src=\"/profoundui/use-
     A                                      rdata/images/bar_top.png\" /></div>-
     A                                      <div class=\"menulinks\"></div><div-
     A                                       class=\"imagebottom\"><img src=\"/-
     A                                      profoundui/userdata/images/bar_bott-
     A                                      om.png\" /></div><div class=\"botto-
     A                                      m\"></div>"},{"field type":"icon me-
     A                                      nu button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"32px","z index":"20","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1170px-
     A                                      ","id":"SRMISCF_MSGSFLC_BtnIconMenu-
     A                                      SystemTools","tool tip":"System Too-
     A                                      ls","icon alignment":"middle left",-
     A                                      "icon width":"16px","icon height":"-
     A                                      24px","icon source":"/profoundui/us-
     A                                      erdata/images/systool/systools.png"-
     A                                      ,"data function":"SystemToolbarSyst-
     A                                      ools","show down arrow":"Yes"},{"fi-
     A                                      eld type":"panel","panel style":"Tr-
     A                                      ansformButtonBar","id":"SRMISCF_MSG-
     A                                      SFLC_ButtonBar","top":"35px","left"-
     A                                      :"1036px","width":"187px","height":-
     A                                      "28px","css class":"stationary","vi-
     A                                      sibility":"hidden","locked in place-
     A                                      ":"true"},{"field type":"button","c-
     A                                      ss class":"stationary","width":"25p-
     A                                      x","height":"24px","top":"40px","ba-
     A                                      ckground color":"#FFFFFF","backgrou-
     A                                      nd repeat":"no-repeat","border top -
     A                                      style":"none","border right style":-
     A                                      "none","border bottom style":"none"-
     A                                      ,"border left style":"none","cursor-
     A                                      ":"default","visibility":"hidden","-
     A                                      locked in place":"true","left":"104-
     A                                      0px","id":"SRMISCF_MSGSFLC_BtnSave"-
     A                                      ,"tool tip":"Save","onclick":"Syste-
     A                                      mToolbarSave","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/save.png'')"},{"field type":"-
     A                                      button","css class":"stationary","w-
     A                                      idth":"25px","height":"24px","top":-
     A                                      "40px","background color":"#FFFFFF"-
     A                                      ,"background repeat":"no-repeat","b-
     A                                      order top style":"none","border rig-
     A                                      ht style":"none","border bottom sty-
     A                                      le":"none","border left style":"non-
     A                                      e","cursor":"default","visibility":-
     A                                      "hidden","locked in place":"true","-
     A                                      left":"1066px","id":"SRMISCF_MSGSFL-
     A                                      C_BtnRefresh","tool tip":"Refresh",-
     A                                      "onclick":"SystemToolbarRefresh","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/refresh.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1092px-
     A                                      ","id":"SRMISCF_MSGSFLC_BtnSearch",-
     A                                      "tool tip":"Search","onclick":"Syst-
     A                                      emToolbarSearch","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/search.png'')"},{"field ty-
     A                                      pe":"button","css class":"stationar-
     A                                      y","width":"25px","height":"24px","-
     A                                      top":"40px","background color":"#FF-
     A                                      FFFF","background repeat":"no-repea-
     A                                      t","border top style":"none","borde-
     A                                      r right style":"none","border botto-
     A                                      m style":"none","border left style"-
     A                                      :"none","cursor":"default","visibil-
     A                                      ity":"hidden","locked in place":"tr-
     A                                      ue","left":"1118px","id":"SRMISCF_M-
     A                                      SGSFLC_BtnDiaryItems","tool tip":"D-
     A                                      iary/Work Items - IDARTS","onclick"-
     A                                      :"SystemToolbarDiary","background i-
     A                                      mage":{"fieldName":"DryIcnURL","dat-
     A                                      aLength":"128","trimLeading":"false-
     A                                      ","trimTrailing":"true","blankFill"-
     A                                      :"false","rjZeroFill":"false","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"}},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1144px","id":"SRMISCF_MSG-
     A                                      SFLC_BtnSystemMessages","tool tip":-
     A                                      "System Messages","onclick":"System-
     A                                      ToolbarMessages","background image"-
     A                                      :{"fieldName":"MsgIcnURL","dataLeng-
     A                                      th":"128","trimLeading":"false","tr-
     A                                      imTrailing":"true","blankFill":"fal-
     A                                      se","rjZeroFill":"false","')
     A                                  1  4HTML('dataType":"char","formatting"-
     A                                      :"Text","textTransform":"none"}},{"-
     A                                      field type":"button","css class":"s-
     A                                      tationary","width":"25px","height":-
     A                                      "24px","top":"40px","background col-
     A                                      or":"#FFFFFF","background repeat":"-
     A                                      no-repeat","border top style":"none-
     A                                      ","border right style":"none","bord-
     A                                      er bottom style":"none","border lef-
     A                                      t style":"none","cursor":"default",-
     A                                      "visibility":"hidden","locked in pl-
     A                                      ace":"true","left":"1196px","id":"S-
     A                                      RMISCF_MSGSFLC_BtnHelp","tool tip":-
     A                                      "Help","onclick":"SystemToolbarHelp-
     A                                      ","background image":"url(''/profou-
     A                                      ndui/userdata/images/systool/help.p-
     A                                      ng'')"},{"id":"SRMISCF_MSGSFLC_ImgS-
     A                                      ysToolBottom","field type":"image",-
     A                                      "image source":"/profoundui/userdat-
     A                                      a/images/systool/butbarbot.png","le-
     A                                      ft":"1036px","top":"64px","width":"-
     A                                      187px","locked in place":"true","cs-
     A                                      s class":"stationary","visibility":-
     A                                      "hidden"},{"id":"SRMISCF_MSGSFLC_Ma-
     A                                      inTabPanel","field type":"tab panel-
     A                                      ","tab panel style":"Transform","ta-
     A                                      b names":"Tab 1","active tab":"0","-
     A                                      left":"250px","top":"70px","width":-
     A                                      "970px","height":"657px","z index":-
     A                                      "8","locked in place":"true","css c-
     A                                      lass":"tab-panel","css class 2":"st-
     A                                      ationary"},{"field type":"button","-
     A                                      left":"1140px","height":"18px","wid-
     A                                      th":"75px","locked in place":"true"-
     A                                      ,"css class":"button","cursor":"def-
     A                                      ault","visibility":"hidden","id":"S-
     A                                      RMISCF_MSGSFLC_BtnHiddenSave","valu-
     A                                      e":"btnSave","top":"100px","respons-
     A                                      e":{"fieldName":"btnSave","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"SR-
     A                                      MISCF_MSGSFLC_fkeyMenu","field type-
     A                                      ":"menu","left":"10px","top":"120px-
     A                                      ","height":"350px","width":"230px",-
     A                                      "hover background color":"#9AAA61",-
     A                                      "hover text color":"#FFFFFF","borde-
     A                                      r color":"#4C6106","menu option ind-
     A                                      ent":"10px","background color":"#75-
     A                                      8B27","css class":"action-menu","cs-
     A                                      s class 2":"stationary","z index":"-
     A                                      101"},{"field type":"button","left"-
     A                                      :"1140px","height":"18px","width":"-
     A                                      75px","locked in place":"true","css-
     A                                       class":"button","cursor":"default"-
     A                                      ,"visibility":"hidden","id":"SRMISC-
     A                                      F_MSGSFLC_BtnHiddenRefresh","value"-
     A                                      :"btnRefresh","top":"125px","respon-
     A                                      se":{"fieldName":"btnRefresh","data-
     A                                      Type":"indicator","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"}},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"SRMISCF_MSGSFLC_B-
     A                                      tnHiddenSearch","value":"btnSearch"-
     A                                      ,"top":"150px","response":{"fieldNa-
     A                                      me":"btnSearch","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"}},{"field type":"butt-
     A                                      on","left":"1140px","height":"18px"-
     A                                      ,"width":"75px","locked in place":"-
     A                                      true","css class":"button","cursor"-
     A                                      :"default","visibility":"hidden","i-
     A                                      d":"SRMISCF_MSGSFLC_BtnHiddenDiaryI-
     A                                      tems","value":"btnDiary","top":"175-
     A                                      px","response":{"fieldName":"btnDia-
     A                                      ry","dataType":"indicator","formatt-
     A                                      ing":"Indicator","indFormat":"1 / 0-
     A                                      "}},{"field type":"button","left":"-
     A                                      1140px","height":"18px","width":"75-
     A                                      px","locked in place":"true","css c-
     A                                      lass":"button","cursor":"default","-
     A                                      visibility":"hidden","id":"SRMISCF_-
     A                                      MSGSFLC_BtnHiddenSystemMessages","v-
     A                                      alue":"btnMessage","top":"200px","r-
     A                                      esponse":{"fieldName":"btnMessage",-
     A                                      "dataType":"indicator","formatting"-
     A                                      :"Indicator","indFormat":"1 / 0"}},-
     A                                      {"field type":"button","left":"1140-
     A                                      px","height":"18px","width":"75px",-
     A                                      "locked in place":"true","css class-
     A                                      ":"button","cursor":"default","visi-
     A                                      bility":"hidden","id":"SRMISCF_MSGS-
     A                                      FLC_BtnHiddenWorkSubmitJob","value"-
     A                                      :"btnWrksbmjob","top":"225px","resp-
     A                                      onse":{"fieldName":"btnWrkJob","dat-
     A                                      aType":"indicator","formatting":"In-
     A                                      dicator","indFormat":"1 / 0"}},{"fi-
     A                                      eld type":"button","left":"1140px",-
     A                                      "height":"18px","width":"75px","loc-
     A                                      ked in place":"true","css class":"b-
     A                                      utton","cursor":"default","visibili-
     A                                      ty":"hidden","id":"SRMISCF_MSGSFLC_-
     A                                      BtnHiddenWorkPrinterOutput","value"-
     A                                      :"btnWrkprtout","top":"250px","resp-
     A                                      onse":{"fieldName":"btnWrkPrnt","da-
     A                                      taType":"indicator","formatting":"I-
     A                                      ndicator","indFormat":"1 / 0"}},{"f-
     A                                      ield type":"button","left":"1140px"-
     A                                      ,"height":"18px","width":"75px","lo-
     A                                      cked in place":"true","css class":"-
     A                                      button","cursor":"default","visibil-
     A                                      ity":"hidden","id":"SRMISCF_MSGSFLC-
     A                                      _BtnHiddenImageQueue","value":"btnI-
     A                                      mgQue","top":"275px","response":{"f-
     A                                      ieldName":"btnImgQue","dataType":"i-
     A                                      ndicator","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"}},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"SRMISCF_MSGSFLC_BtnHidden-
     A                                      Help","value":"btnHelp","top":"300p-
     A                                      x","response":{"fieldName":"btnHelp-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      },{"id":"MSGSFL","field ty')
     A                                  1  5HTML('pe":"grid","number of columns-
     A                                      ":"1","record format name":"MSGSFL"-
     A                                      ,"display subfile":"true","display -
     A                                      control record":"true","subfile siz-
     A                                      e":"5","initialize subfile":"true",-
     A                                      "row height":"20","css class":"subf-
     A                                      ilegrid","css class 2":"profound-co-
     A                                      nverted","parent tab panel":"SRMISC-
     A                                      F_MSGSFLC_MainTabPanel","parent tab-
     A                                      ":"0","subfile end":{"fieldName":"N-
     A                                      10","dataType":"expression","format-
     A                                      ting":"Indicator","indFormat":"true-
     A                                       / false"},"number of rows":"1","ha-
     A                                      s header":"false","subfile program -
     A                                      message queue":{"fieldName":"Q1PGM"-
     A                                      ,"dataLength":"10","trimLeading":"f-
     A                                      alse","trimTrailing":"true","dataTy-
     A                                      pe":"char","formatting":"Text","tex-
     A                                      tTransform":"none"},"subfile contro-
     A                                      l program message queue":{"fieldNam-
     A                                      e":"Q1PGM","dataLength":"10","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","dataType":"char","formatting":"-
     A                                      Text","textTransform":"none"},"subf-
     A                                      ile message key":{"fieldName":"MSGK-
     A                                      EY","dataLength":"4","trimLeading":-
     A                                      "false","trimTrailing":"true","data-
     A                                      Type":"char","formatting":"Text","t-
     A                                      extTransform":"none"},"top":"570px"-
     A                                      ,"left":"269px","column widths":"59-
     A                                      5"},{"id":"btnSubmit","field type":-
     A                                      "button","value":"Enter","shortcut -
     A                                      key":"Enter","left":"14px","top":"1-
     A                                      50px","width":"100px","height":"23p-
     A                                      x","css class":"button","auto arran-
     A                                      ge":"true","cursor":"default"},{"id-
     A                                      ":"btnPAGEDOWN","field type":"butto-
     A                                      n","value":"Page Down","shortcut ke-
     A                                      y":"PageDown","response":{"fieldNam-
     A                                      e":"*IN01","dataType":"indicator","-
     A                                      formatting":"Indicator","indFormat"-
     A                                      :"1 / 0"},"left":"14px","top":"183p-
     A                                      x","width":"100px","height":"23px",-
     A                                      "css class":"button","auto arrange"-
     A                                      :"true","cursor":"default"},{"id":"-
     A                                      btnPAGEUP","field type":"button","v-
     A                                      alue":"Page Up","shortcut key":"Pag-
     A                                      eUp","response":{"fieldName":"*IN02-
     A                                      ","dataType":"indicator","formattin-
     A                                      g":"Indicator","indFormat":"1 / 0"}-
     A                                      ,"left":"14px","top":"216px","width-
     A                                      ":"100px","height":"23px","css clas-
     A                                      s":"button","auto arrange":"true","-
     A                                      cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
