     A                                      REF(*LIBL/SREFP PREF01)
     A          R SCR01
     A  71 72 84                            CA01
     A                                  1  2HTML('QPUIREC18   RROWS      2    C-
     A                                      1    1C2    23 RERRMSGID  5    C6  -
     A                                        SCCONMC7    MCR0596C6    MMESGGC5-
     A                                          *LIBLC0    E1    3     84RERRMS-
     A                                      G    2    C9    SCPASWRD1C25   Inva-
     A                                      lid password entered.E1    3     72-
     A                                      RERRMSGID  5    C9    SCPASWRD1C7  -
     A                                        MCR0500C6    MMESGGC5    *LIBLC0 -
     A                                         E1    3     71RERRMSG    2    C9-
     A                                          SCPASWRD2C25   Invalid password-
     A                                       entered.E1    3     72RERRMSGID  5-
     A                                          C9    SCPASWRD2C7    MCR0500C6 -
     A                                         MMESGGC5    *LIBLC0    E1    3  -
     A                                         71RERRMSG    2    C9    SCPASWRD-
     A                                      3C25   Invalid password entered.E1 -
     A                                         3     72RERRMSGID  5    C9    SC-
     A                                      PASWRD3C7    MCR0500C6    MMESGGC5 -
     A                                         *LIBLC0    E1    3     71RERRMSG-
     A                                          2    C9    SCPASWRD4C25   Inval-
     A                                      id password entered.E1    3     72R-
     A                                      ERRMSGID  5    C9    SCPASWRD4C7   -
     A                                       MCR0500C6    MMESGGC5    *LIBLC0  -
     A                                        E1    3     71RERRMSG    2    C9 -
     A                                         SCPASWRD5C25   Invalid password -
     A                                      entered.E1    3     72RERRMSGID  5 -
     A                                         C9    SCPASWRD5C7    MCR0500C6  -
     A                                        MMESGGC5    *LIBLC0    E1    3   -
     A                                        71RERRMSG    2    C9    SCPASWRD6-
     A                                      C25   Invalid password entered.E1  -
     A                                        3     72RERRMSGID  5    C9    SCP-
     A                                      ASWRD6C7    MCR0500C6    MMESGGC5  -
     A                                        *LIBLC0    E1    3     71RERRMSG -
     A                                         2    C9    SCPASWRD7C25   Invali-
     A                                      d password entered.E1    3     72RE-
     A                                      RRMSGID  5    C9    SCPASWRD7C7    -
     A                                      MCR0500C6    MMESGGC5    *LIBLC0   -
     A                                       E1    3     71RERRMSG    2    C9  -
     A                                        SCPASWRD8C25   Invalid password e-
     A                                      ntered.E1    3     72RERRMSGID  5  -
     A                                        C9    SCPASWRD8C7    MCR0500C6   -
     A                                       MMESGGC5    *LIBLC0    E1    3    -
     A                                       71')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"SCR01","onload":"pui.buildFKeyM-
     A                                      enu({skipHelp: true, availableKeys:-
     A                                       file + \"_\" + format + \"_\" + \"-
     A                                      avKeys\", fkeyMenuId:file + \"_\" +-
     A                                       format + \"_\" + \"fkeyMenu\" })",-
     A                                      "return cursor record":{"fieldName"-
     A                                      :"HREC","dataLength":"10","dataType-
     A                                      ":"char","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"tru-
     A                                      e","textTransform":"none"},"return -
     A                                      cursor field":{"fieldName":"HFLD","-
     A                                      dataLength":"10","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"none"},"overlay range":"-
     A                                      1-23"},"items":[{"id":"HREC","field-
     A                                       type":"output field","visibility":-
     A                                      "hidden","value":{"fieldName":"HREC-
     A                                      ","designValue":"[HREC]","dataType"-
     A                                      :"char","formatting":"Text","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","textTransform":"none","dataLengt-
     A                                      h":"10"},"left":"0px","top":"-30px"-
     A                                      ,"css class":"profound-converted"},-
     A                                      {"id":"HFLD","field type":"output f-
     A                                      ield","visibility":"hidden","value"-
     A                                      :{"fieldName":"HFLD","designValue":-
     A                                      "[HFLD]","dataType":"char","formatt-
     A                                      ing":"Text","trimLeading":"false","-
     A                                      trimTrailing":"true","textTransform-
     A                                      ":"none","dataLength":"10"},"left":-
     A                                      "0px","top":"-30px","css class":"pr-
     A                                      ofound-converted"},{"id":"SS015F_SC-
     A                                      R01_avKeys","field type":"output fi-
     A                                      eld","value":{"fieldName":"AV_KEYS"-
     A                                      ,"dataLength":"1134","trimLeading":-
     A                                      "false","trimTrailing":"true","blan-
     A                                      kFill":"false","rjZeroFill":"false"-
     A                                      ,"dataType":"char","formatting":"Te-
     A                                      xt","textTransform":"none","designV-
     A                                      alue":"[AV_KEYS]"},"left":"0px","to-
     A                                      p":"0px","visibility":"hidden"},{"i-
     A                                      d":"SS015F_SCR01_action","field typ-
     A                                      e":"html container","white space":"-
     A                                      normal","left":"0px","top":"10px","-
     A                                      width":"230px","css class":"action--
     A                                      panel-converted","height":"700px","-
     A                                      html":"<div class=\"top\"></div><di-
     A                                      v class=\"imagetop\"><img src=\"/pr-
     A                                      ofoundui/userdata/images/bar_top.pn-
     A                                      g\" /></div><div class=\"menulinks\-
     A                                      "></div><div class=\"imagebottom\">-
     A                                      <img src=\"/profoundui/userdata/ima-
     A                                      ges/bar_bottom.png\" /></div><div c-
     A                                      lass=\"bottom\"></div>"},{"field ty-
     A                                      pe":"icon menu button","css class":-
     A                                      "stationary","width":"25px","height-
     A                                      ":"24px","top":"32px","z index":"20-
     A                                      ","cursor":"default","visibility":"-
     A                                      hidden","locked in place":"true","l-
     A                                      eft":"1170px","id":"SS015F_SCR01_Bt-
     A                                      nIconMenuSystemTools","tool tip":"S-
     A                                      ystem Tools","icon alignment":"midd-
     A                                      le left","icon width":"16px","icon -
     A                                      height":"24px","icon source":"/prof-
     A                                      oundui/userdata/images/systool/syst-
     A                                      ools.png","data function":"SystemTo-
     A                                      olbarSystools","show down arrow":"Y-
     A                                      es"},{"field type":"panel","panel s-
     A                                      tyle":"TransformButtonBar","id":"SS-
     A                                      015F_SCR01_ButtonBar","top":"35px",-
     A                                      "left":"1036px","width":"187px","he-
     A                                      ight":"28px","css class":"stationar-
     A                                      y","visibility":"hidden","locked in-
     A                                       place":"true"},{"field type":"butt-
     A                                      on","css class":"stationary","width-
     A                                      ":"25px","height":"24px","top":"40p-
     A                                      x","background color":"#FFFFFF","ba-
     A                                      ckground repeat":"no-repeat","borde-
     A                                      r top style":"none","border right s-
     A                                      tyle":"none","border bottom style":-
     A                                      "none","border left style":"none","-
     A                                      cursor":"default","visibility":"hid-
     A                                      den","locked in place":"true","left-
     A                                      ":"1040px","id":"SS015F_SCR01_BtnSa-
     A                                      ve","tool tip":"Save","onclick":"Sy-
     A                                      stemToolbarSave","background image"-
     A                                      :"url(''/profoundui/userdata/images-
     A                                      /systool/save.png'')"},{"field type-
     A                                      ":"button","css class":"stationary"-
     A                                      ,"width":"25px","height":"24px","to-
     A                                      p":"40px","background color":"#FFFF-
     A                                      FF","background repeat":"no-repeat"-
     A                                      ,"border top style":"none","border -
     A                                      right style":"none","border bottom -
     A                                      style":"none","border left style":"-
     A                                      none","cursor":"default","visibilit-
     A                                      y":"hidden","locked in place":"true-
     A                                      ","left":"1066px","id":"SS015F_SCR0-
     A                                      1_BtnRefresh","tool tip":"Refresh",-
     A                                      "onclick":"SystemToolbarRefresh","b-
     A                                      ackground image":"url(''/profoundui-
     A                                      /userdata/images/systool/refresh.pn-
     A                                      g'')"},{"field type":"button","css -
     A                                      class":"stationary","width":"25px",-
     A                                      "height":"24px","top":"40px","backg-
     A                                      round color":"#FFFFFF","background -
     A                                      repeat":"no-repeat","border top sty-
     A                                      le":"none","border right style":"no-
     A                                      ne","border bottom style":"none","b-
     A                                      order left style":"none","cursor":"-
     A                                      default","visibility":"hidden","loc-
     A                                      ked in place":"true","left":"1092px-
     A                                      ","id":"SS015F_SCR01_BtnSearch","to-
     A                                      ol tip":"Search","onclick":"SystemT-
     A                                      oolbarSearch","background image":"u-
     A                                      rl(''/profoundui/userdata/images/sy-
     A                                      stool/search.png'')"},{"field type"-
     A                                      :"button","css class":"stationary",-
     A                                      "width":"25px","height":"24px","top-
     A                                      ":"40px","background color":"#FFFFF-
     A                                      F","background repeat":"no-repeat",-
     A                                      "border top style":"none","border r-
     A                                      ight style":"none","border bottom s-
     A                                      tyle":"none","border left style":"n-
     A                                      one","cursor":"default","visibility-
     A                                      ":"hidden","locked in place":"true"-
     A                                      ,"left":"1118px","id":"SS0')
     A                                  1  4HTML('15F_SCR01_BtnDiaryItems","too-
     A                                      l tip":"Diary/Work Items - IDARTS",-
     A                                      "onclick":"SystemToolbarDiary","bac-
     A                                      kground image":{"fieldName":"DryIcn-
     A                                      URL","dataLength":"128","trimLeadin-
     A                                      g":"false","trimTrailing":"true","b-
     A                                      lankFill":"false","rjZeroFill":"fal-
     A                                      se","dataType":"char","formatting":-
     A                                      "Text","textTransform":"none"}},{"f-
     A                                      ield type":"button","css class":"st-
     A                                      ationary","width":"25px","height":"-
     A                                      24px","top":"40px","background colo-
     A                                      r":"#FFFFFF","background repeat":"n-
     A                                      o-repeat","border top style":"none"-
     A                                      ,"border right style":"none","borde-
     A                                      r bottom style":"none","border left-
     A                                       style":"none","cursor":"default","-
     A                                      visibility":"hidden","locked in pla-
     A                                      ce":"true","left":"1144px","id":"SS-
     A                                      015F_SCR01_BtnSystemMessages","tool-
     A                                       tip":"System Messages","onclick":"-
     A                                      SystemToolbarMessages","background -
     A                                      image":{"fieldName":"MsgIcnURL","da-
     A                                      taLength":"128","trimLeading":"fals-
     A                                      e","trimTrailing":"true","blankFill-
     A                                      ":"false","rjZeroFill":"false","dat-
     A                                      aType":"char","formatting":"Text","-
     A                                      textTransform":"none"}},{"field typ-
     A                                      e":"button","css class":"stationary-
     A                                      ","width":"25px","height":"24px","t-
     A                                      op":"40px","background color":"#FFF-
     A                                      FFF","background repeat":"no-repeat-
     A                                      ","border top style":"none","border-
     A                                       right style":"none","border bottom-
     A                                       style":"none","border left style":-
     A                                      "none","cursor":"default","visibili-
     A                                      ty":"hidden","locked in place":"tru-
     A                                      e","left":"1196px","id":"SS015F_SCR-
     A                                      01_BtnHelp","tool tip":"Help","oncl-
     A                                      ick":"SystemToolbarHelp","backgroun-
     A                                      d image":"url(''/profoundui/userdat-
     A                                      a/images/systool/help.png'')"},{"id-
     A                                      ":"SS015F_SCR01_ImgSysToolBottom","-
     A                                      field type":"image","image source":-
     A                                      "/profoundui/userdata/images/systoo-
     A                                      l/butbarbot.png","left":"1036px","t-
     A                                      op":"64px","width":"187px","locked -
     A                                      in place":"true","css class":"stati-
     A                                      onary","visibility":"hidden"},{"id"-
     A                                      :"SS015F_SCR01_MainTabPanel","field-
     A                                       type":"tab panel","tab panel style-
     A                                      ":"Transform","tab names":{"fieldNa-
     A                                      me":"SCPRDS","designValue":"[SCPRDS-
     A                                      ]","refField":"NAME","dataType":"re-
     A                                      ference","formatting":"Text","trimL-
     A                                      eading":"false","trimTrailing":"fal-
     A                                      se","textTransform":"none"},"active-
     A                                       tab":"0","left":"250px","top":"70p-
     A                                      x","width":"970px","height":"657px"-
     A                                      ,"z index":"8","locked in place":"t-
     A                                      rue","css class":"tab-panel","css c-
     A                                      lass 2":"stationary"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"SS015F_SCR01_BtnHiddenSav-
     A                                      e","value":"btnSave","top":"100px",-
     A                                      "response":{"fieldName":"btnSave","-
     A                                      dataType":"indicator","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"}},{-
     A                                      "id":"constant1","field type":"outp-
     A                                      ut field","left":"281px","cursor co-
     A                                      lumn":"2","top":"110px","cursor row-
     A                                      ":"1","css class":"top-line","value-
     A                                      ":"js: currentUser()","css class 2"-
     A                                      :"output-field","parent tab panel":-
     A                                      "SS015F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCCONM","field ty-
     A                                      pe":"output field","value":{"fieldN-
     A                                      ame":"SCCONM","designValue":"[SCCON-
     A                                      M]","refField":"NAME","dataType":"r-
     A                                      eference","formatting":"Text","trim-
     A                                      Leading":"false","trimTrailing":"fa-
     A                                      lse","textTransform":"none"},"css c-
     A                                      lass":"output-field","left":"414px"-
     A                                      ,"cursor column":"21","top":"110px"-
     A                                      ,"cursor row":"1","css class 2":"to-
     A                                      p-line","css class 3":"HI","error m-
     A                                      essage id":"MCR0596","error message-
     A                                       file":"MMESGG","error message libr-
     A                                      ary":"*LIBL","error condition":{"fi-
     A                                      eldName":"84","dataType":"expressio-
     A                                      n","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"},"error messages":"1 m-
     A                                      essage","parent tab panel":"SS015F_-
     A                                      SCR01_MainTabPanel","parent tab":"0-
     A                                      ","css class 4":"profound-converted-
     A                                      "},{"id":"constant2","field type":"-
     A                                      output field","left":"778px","curso-
     A                                      r column":"73","top":"110px","curso-
     A                                      r row":"1","css class":"top-line","-
     A                                      value":"js: currentDate()","css cla-
     A                                      ss 2":"output-field","parent tab pa-
     A                                      nel":"SS015F_SCR01_MainTabPanel","p-
     A                                      arent tab":"0","css class 3":"profo-
     A                                      und-converted"},{"id":"SS015F_SCR01-
     A                                      _fkeyMenu","field type":"menu","lef-
     A                                      t":"10px","top":"120px","height":"3-
     A                                      50px","width":"230px","hover backgr-
     A                                      ound color":"#9AAA61","hover text c-
     A                                      olor":"#FFFFFF","border color":"#4C-
     A                                      6106","menu option indent":"10px","-
     A                                      background color":"#758B27","css cl-
     A                                      ass":"action-menu","css class 2":"s-
     A                                      tationary","z index":"101"},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"SS015F_SCR01_BtnHid-
     A                                      denRefresh","value":"btnRefresh","t-
     A                                      op":"125px","response":{"fieldName"-
     A                                      :"btnRefresh","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"Q1PGM","field -
     A                                      type":"output field","value":{"fiel-
     A                                      dName":"Q1PGM","designValu')
     A                                  1  5HTML('e":"[Q1PGM]","dataType":"char-
     A                                      ","formatting":"Text","trimLeading"-
     A                                      :"false","trimTrailing":"false","te-
     A                                      xtTransform":"none","dataLength":"1-
     A                                      0"},"css class":"output-field","lef-
     A                                      t":"281px","cursor column":"2","top-
     A                                      ":"130px","cursor row":"2","parent -
     A                                      tab panel":"SS015F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 2":-
     A                                      "profound-converted"},{"id":"SCPRDS-
     A                                      ","field type":"output field","valu-
     A                                      e":{"fieldName":"SCPRDS","designVal-
     A                                      ue":"[SCPRDS]","refField":"NAME","d-
     A                                      ataType":"reference","formatting":"-
     A                                      Text","trimLeading":"false","trimTr-
     A                                      ailing":"false","textTransform":"no-
     A                                      ne"},"css class":"output-field","le-
     A                                      ft":"414px","cursor column":"21","t-
     A                                      op":"130px","cursor row":"2","css c-
     A                                      lass 2":"HI","parent tab panel":"SS-
     A                                      015F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","visibility":"hidden","css c-
     A                                      lass 3":"profound-converted"},{"id"-
     A                                      :"constant3","field type":"output f-
     A                                      ield","value":"SCR01","css class":"-
     A                                      constant","left":"799px","cursor co-
     A                                      lumn":"76","top":"130px","cursor ro-
     A                                      w":"2","parent tab panel":"SS015F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 2":"profound-converted"-
     A                                      },{"id":"SCMODE","field type":"outp-
     A                                      ut field","value":{"fieldName":"SCM-
     A                                      ODE","designValue":"[SCMODE]","refF-
     A                                      ield":"PGM","dataType":"reference",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"false","text-
     A                                      Transform":"none"},"css class":"out-
     A                                      put-field","left":"764px","cursor c-
     A                                      olumn":"71","top":"150px","cursor r-
     A                                      ow":"3","css class 2":"HI","parent -
     A                                      tab panel":"SS015F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"field type"-
     A                                      :"button","left":"1140px","height":-
     A                                      "18px","width":"75px","locked in pl-
     A                                      ace":"true","css class":"button","c-
     A                                      ursor":"default","visibility":"hidd-
     A                                      en","id":"SS015F_SCR01_BtnHiddenSea-
     A                                      rch","value":"btnSearch","top":"150-
     A                                      px","response":{"fieldName":"btnSea-
     A                                      rch","dataType":"indicator","format-
     A                                      ting":"Indicator","indFormat":"1 / -
     A                                      0"}},{"id":"constant4","field type"-
     A                                      :"output field","value":"Serial num-
     A                                      ber                     :","css cla-
     A                                      ss":"constant","left":"281px","curs-
     A                                      or column":"2","top":"170px","curso-
     A                                      r row":"4","parent tab panel":"SS01-
     A                                      5F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 2":"profound-conver-
     A                                      ted"},{"id":"SCSRLNBR","field type"-
     A                                      :"output field","value":{"fieldName-
     A                                      ":"SCSRLNBR","designValue":"[SCSRLN-
     A                                      BR]","dataType":"char","formatting"-
     A                                      :"Text","trimLeading":"false","trim-
     A                                      Trailing":"false","textTransform":"-
     A                                      none","dataLength":"7"},"css class"-
     A                                      :"output-field","left":"547px","cur-
     A                                      sor column":"40","top":"170px","cur-
     A                                      sor row":"4","parent tab panel":"SS-
     A                                      015F_SCR01_MainTabPanel","parent ta-
     A                                      b":"0","css class 2":"profound-conv-
     A                                      erted"},{"id":"SCMODEL","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCMODEL","designValue":"[SCMODE-
     A                                      L]","dataType":"char","formatting":-
     A                                      "Text","trimLeading":"false","trimT-
     A                                      railing":"false","textTransform":"n-
     A                                      one","dataLength":"4"},"css class":-
     A                                      "output-field","left":"603px","curs-
     A                                      or column":"48","top":"170px","curs-
     A                                      or row":"4","parent tab panel":"SS0-
     A                                      15F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"field type":"button","left-
     A                                      ":"1140px","height":"18px","width":-
     A                                      "75px","locked in place":"true","cs-
     A                                      s class":"button","cursor":"default-
     A                                      ","visibility":"hidden","id":"SS015-
     A                                      F_SCR01_BtnHiddenDiaryItems","value-
     A                                      ":"btnDiary","top":"175px","respons-
     A                                      e":{"fieldName":"btnDiary","dataTyp-
     A                                      e":"indicator","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"}},{"id":"c-
     A                                      onstant5","field type":"output fiel-
     A                                      d","value":"Expiration date        -
     A                                                 :","css class":"constant-
     A                                      ","left":"281px","cursor column":"2-
     A                                      ","top":"190px","cursor row":"5","p-
     A                                      arent tab panel":"SS015F_SCR01_Main-
     A                                      TabPanel","parent tab":"0","css cla-
     A                                      ss 2":"profound-converted"},{"id":"-
     A                                      SCEXPDAT","field type":"output fiel-
     A                                      d","value":{"fieldName":"SCEXPDAT",-
     A                                      "designValue":"[SCEXPDAT]","dataTyp-
     A                                      e":"zoned","formatting":"Number","n-
     A                                      umSep":"false","zeroBalance":"true"-
     A                                      ,"zeroFill":"true","curSym":"","uni-
     A                                      ts":"","negNum":"-999.00","dataLeng-
     A                                      th":"8","decPos":"0","edtWrd":"''  -
     A                                      /  /    ''"},"css class":"output-fi-
     A                                      eld","left":"547px","cursor column"-
     A                                      :"40","top":"190px","cursor row":"5-
     A                                      ","width":"70px","text align":"righ-
     A                                      t","parent tab panel":"SS015F_SCR01-
     A                                      _MainTabPanel","parent tab":"0","cs-
     A                                      s class 2":"profound-converted"},{"-
     A                                      field type":"button","left":"1140px-
     A                                      ","height":"18px","width":"75px","l-
     A                                      ocked in place":"true","css class":-
     A                                      "button","cursor":"default","visibi-
     A                                      lity":"hidden","id":"SS015F_SCR01_B-
     A                                      tnHiddenSystemMessages","value":"bt-
     A                                      nMessage","top":"200px","response":-
     A                                      {"fieldName":"btnMessage","dataType-
     A                                      ":"indicator","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"}},{"id":"co-
     A                                      nstant6","field type":"output field-
     A                                      ","value":"Entry date     ')
     A                                  1  6HTML('                   :","css cl-
     A                                      ass":"constant","left":"281px","cur-
     A                                      sor column":"2","top":"210px","curs-
     A                                      or row":"6","parent tab panel":"SS0-
     A                                      15F_SCR01_MainTabPanel","parent tab-
     A                                      ":"0","css class 2":"profound-conve-
     A                                      rted"},{"id":"SCENTDAT","field type-
     A                                      ":"output field","value":{"fieldNam-
     A                                      e":"SCENTDAT","designValue":"[SCENT-
     A                                      DAT]","dataType":"zoned","formattin-
     A                                      g":"Number","numSep":"false","zeroB-
     A                                      alance":"true","zeroFill":"true","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"8","decPos":"0",-
     A                                      "edtWrd":"''  /  /    ''"},"css cla-
     A                                      ss":"output-field","left":"547px","-
     A                                      cursor column":"40","top":"210px","-
     A                                      cursor row":"6","width":"70px","tex-
     A                                      t align":"right","parent tab panel"-
     A                                      :"SS015F_SCR01_MainTabPanel","paren-
     A                                      t tab":"0","css class 2":"profound--
     A                                      converted"},{"id":"SCDAYS","field t-
     A                                      ype":"output field","value":{"field-
     A                                      Name":"SCDAYS","designValue":"[SCDA-
     A                                      YS]","dataType":"zoned","formatting-
     A                                      ":"Number","numSep":"false","zeroBa-
     A                                      lance":"true","zeroFill":"false","c-
     A                                      urSym":"","units":"","negNum":"-999-
     A                                      .00","dataLength":"5","decPos":"0"}-
     A                                      ,"css class":"output-field","left":-
     A                                      "624px","cursor column":"51","top":-
     A                                      "210px","cursor row":"6","width":"4-
     A                                      2px","text align":"right","parent t-
     A                                      ab panel":"SS015F_SCR01_MainTabPane-
     A                                      l","parent tab":"0","css class 2":"-
     A                                      profound-converted"},{"field type":-
     A                                      "button","left":"1140px","height":"-
     A                                      18px","width":"75px","locked in pla-
     A                                      ce":"true","css class":"button","cu-
     A                                      rsor":"default","visibility":"hidde-
     A                                      n","id":"SS015F_SCR01_BtnHiddenWork-
     A                                      SubmitJob","value":"btnWrksbmjob","-
     A                                      top":"225px","response":{"fieldName-
     A                                      ":"btnWrkJob","dataType":"indicator-
     A                                      ","formatting":"Indicator","indForm-
     A                                      at":"1 / 0"}},{"id":"constant7","fi-
     A                                      eld type":"output field","value":"T-
     A                                      ype information, press Enter.","css-
     A                                       class":"constant","left":"281px","-
     A                                      cursor column":"2","top":"250px","c-
     A                                      ursor row":"8","css class 2":"BLU",-
     A                                      "parent tab panel":"SS015F_SCR01_Ma-
     A                                      inTabPanel","parent tab":"0","css c-
     A                                      lass 3":"profound-converted"},{"fie-
     A                                      ld type":"button","left":"1140px","-
     A                                      height":"18px","width":"75px","lock-
     A                                      ed in place":"true","css class":"bu-
     A                                      tton","cursor":"default","visibilit-
     A                                      y":"hidden","id":"SS015F_SCR01_BtnH-
     A                                      iddenWorkPrinterOutput","value":"bt-
     A                                      nWrkprtout","top":"250px","response-
     A                                      ":{"fieldName":"btnWrkPrnt","dataTy-
     A                                      pe":"indicator","formatting":"Indic-
     A                                      ator","indFormat":"1 / 0"}},{"field-
     A                                       type":"button","left":"1140px","he-
     A                                      ight":"18px","width":"75px","locked-
     A                                       in place":"true","css class":"butt-
     A                                      on","cursor":"default","visibility"-
     A                                      :"hidden","id":"SS015F_SCR01_BtnHid-
     A                                      denImageQueue","value":"btnImgQue",-
     A                                      "top":"275px","response":{"fieldNam-
     A                                      e":"btnImgQue","dataType":"indicato-
     A                                      r","formatting":"Indicator","indFor-
     A                                      mat":"1 / 0"}},{"id":"constant8","f-
     A                                      ield type":"output field","value":"-
     A                                      Password                        :",-
     A                                      "css class":"constant","left":"295p-
     A                                      x","cursor column":"4","top":"290px-
     A                                      ","cursor row":"10","parent tab pan-
     A                                      el":"SS015F_SCR01_MainTabPanel","pa-
     A                                      rent tab":"0","css class 2":"profou-
     A                                      nd-converted"},{"id":"SCPASWRD1","f-
     A                                      ield type":"textbox","css class":"i-
     A                                      nput","css class 2":"textbox","valu-
     A                                      e":{"fieldName":"SCPASWRD1","design-
     A                                      Value":"[SCPASWRD1]","dataType":"ch-
     A                                      ar","formatting":"Text","trimLeadin-
     A                                      g":"false","trimTrailing":"true","t-
     A                                      extTransform":"uppercase","dataLeng-
     A                                      th":"4"},"text transform":"uppercas-
     A                                      e","left":"547px","cursor column":"-
     A                                      40","top":"290px","cursor row":"10"-
     A                                      ,"width":"29px","error message":"In-
     A                                      valid password entered.","error con-
     A                                      dition":{"fieldName":"72","dataType-
     A                                      ":"expression","formatting":"Indica-
     A                                      tor","indFormat":"1 / 0"},"error me-
     A                                      ssages":"2 messages","error message-
     A                                       id 2":"MCR0500","error message fil-
     A                                      e 2":"MMESGG","error message librar-
     A                                      y 2":"*LIBL","error condition 2":{"-
     A                                      fieldName":"71","dataType":"express-
     A                                      ion","formatting":"Indicator","indF-
     A                                      ormat":"1 / 0"},"parent tab panel":-
     A                                      "SS015F_SCR01_MainTabPanel","parent-
     A                                       tab":"0","css class 3":"profound-c-
     A                                      onverted"},{"id":"SCPASWRD2","field-
     A                                       type":"textbox","css class":"input-
     A                                      ","css class 2":"textbox","value":{-
     A                                      "fieldName":"SCPASWRD2","designValu-
     A                                      e":"[SCPASWRD2]","dataType":"char",-
     A                                      "formatting":"Text","trimLeading":"-
     A                                      false","trimTrailing":"true","textT-
     A                                      ransform":"uppercase","dataLength":-
     A                                      "4"},"text transform":"uppercase","-
     A                                      left":"582px","cursor column":"45",-
     A                                      "top":"290px","cursor row":"10","wi-
     A                                      dth":"29px","error message":"Invali-
     A                                      d password entered.","error conditi-
     A                                      on":{"fieldName":"72","dataType":"e-
     A                                      xpression","formatting":"Indicator"-
     A                                      ,"indFormat":"1 / 0"},"error messag-
     A                                      es":"2 messages","error message id -
     A                                      2":"MCR0500","error message file 2"-
     A                                      :"MMESGG","error message library 2"-
     A                                      :"*LIBL","error condition 2":{"fiel-
     A                                      dName":"71","dataType":"expression"-
     A                                      ,"formatting":"Indicator","indForma-
     A                                      t":"1 / 0"},"parent tab pa')
     A                                  1  7HTML('nel":"SS015F_SCR01_MainTabPan-
     A                                      el","parent tab":"0","css class 3":-
     A                                      "profound-converted"},{"id":"SCPASW-
     A                                      RD3","field type":"textbox","css cl-
     A                                      ass":"input","css class 2":"textbox-
     A                                      ","value":{"fieldName":"SCPASWRD3",-
     A                                      "designValue":"[SCPASWRD3]","dataTy-
     A                                      pe":"char","formatting":"Text","tri-
     A                                      mLeading":"false","trimTrailing":"t-
     A                                      rue","textTransform":"uppercase","d-
     A                                      ataLength":"4"},"text transform":"u-
     A                                      ppercase","left":"617px","cursor co-
     A                                      lumn":"50","top":"290px","cursor ro-
     A                                      w":"10","width":"29px","error messa-
     A                                      ge":"Invalid password entered.","er-
     A                                      ror condition":{"fieldName":"72","d-
     A                                      ataType":"expression","formatting":-
     A                                      "Indicator","indFormat":"1 / 0"},"e-
     A                                      rror messages":"2 messages","error -
     A                                      message id 2":"MCR0500","error mess-
     A                                      age file 2":"MMESGG","error message-
     A                                       library 2":"*LIBL","error conditio-
     A                                      n 2":{"fieldName":"71","dataType":"-
     A                                      expression","formatting":"Indicator-
     A                                      ","indFormat":"1 / 0"},"parent tab -
     A                                      panel":"SS015F_SCR01_MainTabPanel",-
     A                                      "parent tab":"0","css class 3":"pro-
     A                                      found-converted"},{"id":"SCPASWRD4"-
     A                                      ,"field type":"textbox","css class"-
     A                                      :"input","css class 2":"textbox","v-
     A                                      alue":{"fieldName":"SCPASWRD4","des-
     A                                      ignValue":"[SCPASWRD4]","dataType":-
     A                                      "char","formatting":"Text","trimLea-
     A                                      ding":"false","trimTrailing":"true"-
     A                                      ,"textTransform":"uppercase","dataL-
     A                                      ength":"4"},"text transform":"upper-
     A                                      case","left":"652px","cursor column-
     A                                      ":"55","top":"290px","cursor row":"-
     A                                      10","width":"29px","error message":-
     A                                      "Invalid password entered.","error -
     A                                      condition":{"fieldName":"72","dataT-
     A                                      ype":"expression","formatting":"Ind-
     A                                      icator","indFormat":"1 / 0"},"error-
     A                                       messages":"2 messages","error mess-
     A                                      age id 2":"MCR0500","error message -
     A                                      file 2":"MMESGG","error message lib-
     A                                      rary 2":"*LIBL","error condition 2"-
     A                                      :{"fieldName":"71","dataType":"expr-
     A                                      ession","formatting":"Indicator","i-
     A                                      ndFormat":"1 / 0"},"parent tab pane-
     A                                      l":"SS015F_SCR01_MainTabPanel","par-
     A                                      ent tab":"0","css class 3":"profoun-
     A                                      d-converted"},{"id":"SCPASWRD5","fi-
     A                                      eld type":"textbox","css class":"in-
     A                                      put","css class 2":"textbox","value-
     A                                      ":{"fieldName":"SCPASWRD5","designV-
     A                                      alue":"[SCPASWRD5]","dataType":"cha-
     A                                      r","formatting":"Text","trimLeading-
     A                                      ":"false","trimTrailing":"true","te-
     A                                      xtTransform":"uppercase","dataLengt-
     A                                      h":"4"},"text transform":"uppercase-
     A                                      ","left":"687px","cursor column":"6-
     A                                      0","top":"290px","cursor row":"10",-
     A                                      "width":"29px","error message":"Inv-
     A                                      alid password entered.","error cond-
     A                                      ition":{"fieldName":"72","dataType"-
     A                                      :"expression","formatting":"Indicat-
     A                                      or","indFormat":"1 / 0"},"error mes-
     A                                      sages":"2 messages","error message -
     A                                      id 2":"MCR0500","error message file-
     A                                       2":"MMESGG","error message library-
     A                                       2":"*LIBL","error condition 2":{"f-
     A                                      ieldName":"71","dataType":"expressi-
     A                                      on","formatting":"Indicator","indFo-
     A                                      rmat":"1 / 0"},"parent tab panel":"-
     A                                      SS015F_SCR01_MainTabPanel","parent -
     A                                      tab":"0","css class 3":"profound-co-
     A                                      nverted"},{"id":"SCPASWRD6","field -
     A                                      type":"textbox","css class":"input"-
     A                                      ,"css class 2":"textbox","value":{"-
     A                                      fieldName":"SCPASWRD6","designValue-
     A                                      ":"[SCPASWRD6]","dataType":"char","-
     A                                      formatting":"Text","trimLeading":"f-
     A                                      alse","trimTrailing":"true","textTr-
     A                                      ansform":"uppercase","dataLength":"-
     A                                      4"},"text transform":"uppercase","l-
     A                                      eft":"722px","cursor column":"65","-
     A                                      top":"290px","cursor row":"10","wid-
     A                                      th":"29px","error message":"Invalid-
     A                                       password entered.","error conditio-
     A                                      n":{"fieldName":"72","dataType":"ex-
     A                                      pression","formatting":"Indicator",-
     A                                      "indFormat":"1 / 0"},"error message-
     A                                      s":"2 messages","error message id 2-
     A                                      ":"MCR0500","error message file 2":-
     A                                      "MMESGG","error message library 2":-
     A                                      "*LIBL","error condition 2":{"field-
     A                                      Name":"71","dataType":"expression",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"},"parent tab panel":"SS01-
     A                                      5F_SCR01_MainTabPanel","parent tab"-
     A                                      :"0","css class 3":"profound-conver-
     A                                      ted"},{"id":"SCPASWRD7","field type-
     A                                      ":"textbox","css class":"input","cs-
     A                                      s class 2":"textbox","value":{"fiel-
     A                                      dName":"SCPASWRD7","designValue":"[-
     A                                      SCPASWRD7]","dataType":"char","form-
     A                                      atting":"Text","trimLeading":"false-
     A                                      ","trimTrailing":"true","textTransf-
     A                                      orm":"uppercase","dataLength":"4"},-
     A                                      "text transform":"uppercase","left"-
     A                                      :"757px","cursor column":"70","top"-
     A                                      :"290px","cursor row":"10","width":-
     A                                      "29px","error message":"Invalid pas-
     A                                      sword entered.","error condition":{-
     A                                      "fieldName":"72","dataType":"expres-
     A                                      sion","formatting":"Indicator","ind-
     A                                      Format":"1 / 0"},"error messages":"-
     A                                      2 messages","error message id 2":"M-
     A                                      CR0500","error message file 2":"MME-
     A                                      SGG","error message library 2":"*LI-
     A                                      BL","error condition 2":{"fieldName-
     A                                      ":"71","dataType":"expression","for-
     A                                      matting":"Indicator","indFormat":"1-
     A                                       / 0"},"parent tab panel":"SS015F_S-
     A                                      CR01_MainTabPanel","parent tab":"0"-
     A                                      ,"css class 3":"profound-converted"-
     A                                      },{"id":"SCPASWRD8","field type":"t-
     A                                      extbox","css class":"input')
     A                                  1  8HTML('","css class 2":"textbox","va-
     A                                      lue":{"fieldName":"SCPASWRD8","desi-
     A                                      gnValue":"[SCPASWRD8]","dataType":"-
     A                                      char","formatting":"Text","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "textTransform":"uppercase","dataLe-
     A                                      ngth":"4"},"text transform":"upperc-
     A                                      ase","left":"792px","cursor column"-
     A                                      :"75","top":"290px","cursor row":"1-
     A                                      0","width":"29px","error message":"-
     A                                      Invalid password entered.","error c-
     A                                      ondition":{"fieldName":"72","dataTy-
     A                                      pe":"expression","formatting":"Indi-
     A                                      cator","indFormat":"1 / 0"},"error -
     A                                      messages":"2 messages","error messa-
     A                                      ge id 2":"MCR0500","error message f-
     A                                      ile 2":"MMESGG","error message libr-
     A                                      ary 2":"*LIBL","error condition 2":-
     A                                      {"fieldName":"71","dataType":"expre-
     A                                      ssion","formatting":"Indicator","in-
     A                                      dFormat":"1 / 0"},"parent tab panel-
     A                                      ":"SS015F_SCR01_MainTabPanel","pare-
     A                                      nt tab":"0","css class 3":"profound-
     A                                      -converted"},{"field type":"button"-
     A                                      ,"left":"1140px","height":"18px","w-
     A                                      idth":"75px","locked in place":"tru-
     A                                      e","css class":"button","cursor":"d-
     A                                      efault","visibility":"hidden","id":-
     A                                      "SS015F_SCR01_BtnHiddenHelp","value-
     A                                      ":"btnHelp","top":"300px","response-
     A                                      ":{"fieldName":"btnHelp","dataType"-
     A                                      :"indicator","formatting":"Indicato-
     A                                      r","indFormat":"1 / 0"}},{"id":"btn-
     A                                      Submit","field type":"button","valu-
     A                                      e":"Enter","shortcut key":"Enter","-
     A                                      left":"14px","top":"150px","width":-
     A                                      "100px","height":"23px","css class"-
     A                                      :"button","auto arrange":"true","cu-
     A                                      rsor":"default"},{"id":"btnCF03","f-
     A                                      ield type":"button","value":"Exit",-
     A                                      "shortcut key":"F3","left":"14px","-
     A                                      top":"183px","width":"100px","heigh-
     A                                      t":"23px","css class":"button","aut-
     A                                      o arrange":"true","cursor":"default-
     A                                      "},{"id":"btnCF10","field type":"bu-
     A                                      tton","value":"F10","shortcut key":-
     A                                      "F10","left":"14px","top":"216px","-
     A                                      width":"100px","height":"23px","css-
     A                                       class":"button","auto arrange":"tr-
     A                                      ue","cursor":"default"}]}')
     A            AV_KEYS     1134A  H
     A            BTNDIARY       1A  H
     A            BTNHELP        1A  H
     A            BTNIMGQUE      1A  H
     A            BTNMESSAGE     1A  H
     A            BTNREFRESH     1A  H
     A            BTNSAVE        1A  H
     A            BTNSEARCH      1A  H
     A            BTNWRKJOB      1A  H
     A            BTNWRKPRNT     1A  H
     A            DRYICNURL    128A  H
     A            HFLD          10A  H
     A            HREC          10A  H
     A            MSGICNURL    128A  H
     A            Q1PGM         10A  H
     A            SCDAYS         5S 0H
     A            SCENTDAT       8S 0H
     A            SCEXPDAT       8S 0H
     A            SCMODEL        4A  H
     A            SCPASWRD1      4A  H
     A            SCPASWRD2      4A  H
     A            SCPASWRD3      4A  H
     A            SCPASWRD4      4A  H
     A            SCPASWRD5      4A  H
     A            SCPASWRD6      4A  H
     A            SCPASWRD7      4A  H
     A            SCPASWRD8      4A  H
     A            SCSRLNBR       7A  H
     A            SCCONM    R        H      REFFLD(NAME)
     A            SCMODE    R        H      REFFLD(PGM)
     A            SCPRDS    R        H      REFFLD(NAME)
