     A* (c) 2024 SAPIENS, Inc. All rights Reserved.                   *
     A*****************************************************************
     A* Contact Type Logical File                                     *
     A*****************************************************************
     A*  PROJECT:  WC2826       PROGRAMMER:  C:342                    *
     A*  CREATED:  03/04/24                                           *
     A*  DESCRIPTION:  This is the Contact Type Logical file          *
     A*                                                               *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*****************************************************************
     A*
     A          R PCN01                     PFILE(STCNP)
     A          K CNCO#
     A          K CNTYPE
     A          K CNCTXT
