      * (c) 2021 Sapiens. All Rights Reserved.                             *
     A*****************************************************************
     A* System Documents Sub-Category - Criteria Setup                *
     A*****************************************************************
     A*  Created:  04/26/21     C:33     WC2278                       *
     A*****************************************************************
     A* Revisions:                                                    *
     A*                                                               *
     A*****************************************************************
     A                                      REF(SREFP)
     A          R PDE01                     TEXT('SUB CATEGORY FILE')
     A            DECO#     R     S         REFFLD(CO#)
     A            DECAT     R               REFFLD(DS5)
     A                                      COLHDG('CATEGORY')
     A            DESUBC    R               REFFLD(DS5)
     A                                      TEXT('SUB CATEGORY')
     A            DECRITID      25A         COLHDG('CRITERIA ID')
     A            DECRITVAL     50A         COLHDG('CRITERIA VALUE')
     A*
     A            DESTAT    R               REFFLD(STAT)
     A            DEUSER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            DEPGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            DETIME    R     S         REFFLD(TIME)
     A                                      COLHDG('TIME')
     A            DEDT      R     S         REFFLD(DT)
     A                                      COLHDG('DATE')
     A            DEIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            DEIPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            DEITIM    R     S         REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            DEIDT     R     S         REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')

     A          K DECO#
     A          K DECAT
     A          K DESUBC
     A          K DECRITID
