     A* (c) 2015 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A*****************************************************************
     A* SYSTEM PRINTER FILE                                           *
     A*****************************************************************
     A*                                                               *
     A*  PROJECT:  SY251        PROGRAMMER:  C:65                     *
     A*  CREATED:  02/20/15                                           *
     A*  DESCRIPTION: THIS IS A FILE TO HOLD SYSTEM PRINTERS THAT     *
     A*               ARE AVAILABLE TO THE SCRIPTURA DOCUMENT SERVER. *
     A*                                                               *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A                                      REF(SREFP)
     A          R PP101                     TEXT('SYSTEM PRINTER FILE')
     A            P1KEY     R               REFFLD(KEY)
     A                                      COLHDG('PRINTER KEY/ID')
     A            P1NAME    R               REFFLD(DS50)
     A                                      COLHDG('PRINTER NAME')
     A            P1DESC       250A         COLHDG('PRINTER DESCRIPTION')
     A            P1UNCN       250A         COLHDG('PRINTER UNCN/ADDRESS')
     A            P1STAT    R               REFFLD(FLAG)
     A                                      COLHDG('PRINTER STATUS')
     A            P1USER    R               REFFLD(USER)
     A                                      COLHDG('USER')
     A            P1PGM     R               REFFLD(PGM)
     A                                      COLHDG('PROGRAM')
     A            P1TIME    R     S         REFFLD(TIME)
     A                                      COLHDG('TIME')
     A            P1DT      R     S         REFFLD(DT)
     A                                      COLHDG('DATE')
     A            P1IUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            P1IPGM    R               REFFLD(PGM)
     A                                      COLHDG('INITIAL' 'PROGRAM')
     A            P1ITIM    R     S         REFFLD(TIME)
     A                                      COLHDG('INITIAL' 'TIME')
     A            P1IDT     R     S         REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            P1TYPE    R               REFFLD(FLAG)
     A                                      COLHDG('NETWORK/OUTQ FLAG')
     A            P1OLIB    R               REFFLD(KEY)
     A                                      COLHDG('OUT QUEUE LIBRARY')
