     A* Copyright('(c) 2022 Sapiens. All Rights Reserved.')           *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A*****************************************************************
     A* SCRIPTURA PROCESSES SETUP LOGICAL FILE - TYPE                 *
     A*****************************************************************
     A*                                                               *
     A*  PROJECT:  SY371        PROGRAMMER:  C:65                     *
     A*  CREATED:  10/27/15                                           *
     A*  DESCRIPTION: THIS FILE HOLDS THE SETTINGS FOR EACH SCRIPTURA *
     A*               ENABLED PROCESS.                                *
     A*                                                               *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A*                                                               *
     A*****************************************************************
     A*
     A          R PSP01                     PFILE(STSPP)
     A          K SPTYPE
