     A*****************************************************************
     A* COPYRIGHT (C) 2019 SAPIENS INTERNATIONAL. ALL RIGHTS RESERVED.
     A*****************************************************************
     A**
     A** SYSTEM-WIDE ***
     A**
     A* * * STATE CODE TABLE FILE * * *
     A*
     A**********************************************************************
     A* REVISIONS                                                     *
     A*                                                               *
     A* 04/04/16  C:212 Project: OK022                                *
     A*                 Change description for STBS03                 *
     A*                                                               *
     A* 02/15/16  C:212 Project: 114MXB                               *
     A*                 Add Fee Schedule Type                         *
     A*                                                               *
     A* 02/11/16  C:307 SUPPORT:37159                                 *
     A*                 To Changes ST1A2 description                  *
     A*                                                               *
     A* 02/03/15  C:079 PROJECT:FS470                                 *
     A*                 Add Contractor/Carrier                        *
     A*                                                               *
     A* 08/01/14  C:212 PROJECT:C114MNV                               *
     A*                 Add Procura Audit flag                        *
     A*                                                               *
     A* 07/17/14  C:079 PROJECT:MC367                                 *
     A*                 Add EDI release                               *
     A*                                                               *
     A* 02/03/14  C:296 PROJECT:MS027                                 *
     A*                 ADD NEW FIELD ST1A7 AS "ADD ON FLAG".         *
     A*                                                               *
     A* 09/18/12  C:284 Project:TX079                                 *
     A*                 Add field 'MEDICARE ZIP + 4'                  *
     A*                                                               *
     A* 06/11/12  C:251 Project:114MER                                *
     A*                 Change description of ST7001 as no longer used*
     A*                                                               *
     A* 02/14/11  C:220 Project:WC1983                                *
     A*                 Added a flag field in the end of file for FROI*
     A*                                                               *
     A* 10/01/10  C:198 Project:WV009                                 *
     A*                 Added field for Medicare based FS flag.       *
     A*                                                               *
     A* 08/12/10  C:251 PROJECT:114MWS                                *
     A*                 Added field for Medicare based PPO processing *
     A*                                                               *
     A* 04/02/09  C:227 PROJECT:MC331                                 *
     A*                 Added field for NCCI Medical Data Call        *
     A*                                                               *
     A* 04/17/08  C:180 PROJECT:MC288                                 *
     A*                 NO UNITS BREAKDOWN                            *
     A*                                                               *
     A* 07/17/07  C:184 PROJECT:WC1529                                *
     A*                 ENDORSEMENTS - API TO SECURE BY CLIENT AND    *
     A*                 STATE                                         *
     A*                                                               *
     A* 04/04/07  C:188 PROJECT:FL061                                 *
     A*                 Chg'd field STBS06 heading                    *
    A*                                                               *
    A* 04/25/02  C:79  PROJECT:114MDC                                *
     A*                 Changing usage fo field ST7001 to CodeReview  *
     A*                 (CR) Knowledge Base (KB) usage                *
    A*                                                               *
    A* 12/08/00  C:79  PROJECT:PA008                                 *
     A*                 Chg'd a field STBS02, pos. 1 for whethor to   *
     A*                 use R&C file in provider bills.               *
     A*                                                               *
     A* 09/20/00  C:117 Project: FL031                                *
     A*                 Chg'd a field STBS01, pos. 1 for FL Provider  *
     A*                 Lic# flag.                                    *
     A*                                                               *
     A* 04/26/00  C:53  Support: 19768                                *
     A*                 Added comments/text for field ST1A5 to be     *
     A*                 used as selection criteria in STSTL3          *
     A*                                                               *
     A* 03/09/93  C:05  Project: FS100                                *
     A*                 Added new fields required for adjudication    *
     A*                                                               *
     A* 04/15/94  C:20  REQ/PROJ: 128/FS127                           *
     A*                 ADDED NEW FIELDS FOR DIFFERENT BILL SUB-TYPES AND
     A*                 SCREESN VALUES FOR BILL ENTRY                 *
     A*                                                               *
     A* 04/19/94  C:20  REQ/PROJ: 128/FS127                           *
     A*                 ADDED USE OF ST1A2 FOR ALLOWING USE OF CPT4 CODES
     A*                 ON SCR04 OF BILL ENTRY                        *
     A**********************************************************************
     A                                      REF(SYREFP)
     A          R PST01                     TEXT('STATE CODE FILE')
     A            STKEY     R               REFFLD(KEY)
     A            STNAME    R               REFFLD(NAME)
     A******
     A            STSTAT    R               REFFLD(STAT)
     A            STUSER    R               REFFLD(USER)
     A                                      COLHDG('RECORD' 'MAINTAINED BY')
     A            STPGM     R               REFFLD(PGM)
     A            STTIME    R               REFFLD(TIME)
     A            STDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            STIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD' 'CREATED BY')
     A            STIDT     R               REFFLD(DT)
     A                                      COLHDG('DATE' 'CREATED')
     A*** BEGIN ADD *** 03/09/93 *********************************************
     A            STINST    R               REFFLD(FLAG)
     A                                      COLHDG('IN-STATE' 'ADJ FLAG')
     A***                        Y     = Use this state for adjudication
     A***                        blank = Use Provider's state for adjudication
     A            ST20SC    R               REFFLD(PGM)
     A                                      COLHDG('F0020F' 'SCRN ID')
     A***                        Used to determine what screen to go to in
     A***                        Proc Code Maintenance after state is selected
     A            ST70SC    R               REFFLD(PGM)
     A                                      COLHDG('F0070F' 'SCRN ID')
     A***  POSSIBLE FUTURE USE:  Used to determine what screen to go to in
     A***                        Bill Entry after adj state is selected
     A            ST1A1     R               REFFLD(FLAG)
     A                                      TEXT('DIVIDE HOSPITAL CHARGES')
     A***                        USED IN BILL ENTRY TO DECIDE WHETHER OR NOT
     A***                        TO DIVIDE UNITS ON HOSPITAL CHARGES
     A            ST1A2     R               REFFLD(FLAG)
     A*** Beg Chg *** 02/11/16 **************************************  *******
     A                                      TEXT('No Actual Adjudication State')
     A***                                   TEXT('ALLOW CPT4 CODE ON SCR04')
     A*** End Chg *** 02/11/16 **************************************  *******
     A***                        USED IN BILL ENTRY TO DECIDE WHETHER OR NOT
     A***                        TO ALLOW USE OF CPT4 CODES ON SCR04
     A            ST1A3     R               REFFLD(FLAG)
     A                                      TEXT('STATE INSTALLED FOR MC')
     A            ST1A4     R               REFFLD(FLAG)
     A                                      TEXT('EDI USED IN MC')
     A            ST1A5     R               REFFLD(FLAG)
     A*** BEG CHG *** 04/26/00 **************************************  *******
     A                                      TEXT('OMIT RCD IN STSTL3')
     A************************************  TEXT('FUTURE USE')
     A***                        Y     = Invalid state
     A***                        blank = Valid state
     A*** END CHG *** 04/26/00 **************************************  *******
     A            ST10A1    R               REFFLD(DS10)
     A                                      TEXT('FUTURE USE')
     A****                                  MEDVIEW USAGE FOR PRODUCT TYPE IN
     A****                                  RECORD TYPE 10 - BATCH IDENTIFIER
     A************   ST10A1=WCMS NOI MAINT PGM NAME      *********************
     A            ST10A2    R               REFFLD(DS10)
     A*** Beg Chg *** 02/03/15 **************************************  *******
     A******************************        TEXT('FUTURE USE')
     A                                      TEXT('Contr/Carrier')
     A*** End Chg *** 02/03/15 **************************************  *******
     A            ST10A3    R               REFFLD(DS10)
     A*** Beg Chg *** 02/03/15 **************************************  *******
     A************************************* TEXT('FUTURE USE')
     A                                      TEXT('Contr/Carrier')
     A*** End Chg *** 02/03/15 **************************************  *******
     A            ST10A4    R               REFFLD(DS10)
     A*** Beg Chg *** 02/03/15 **************************************  *******
     A**********************************    TEXT('FUTURE USE')
     A                                      TEXT('Contr/Carrier')
     A*** End Chg *** 02/03/15 **************************************  *******
     A            ST10A5    R               REFFLD(DS10)
     A                                      TEXT('FUTURE USE')
     A*** END ADD ***** 03/09/93 *********************************************
     A*** BEG CHG *** 09/20/00 ****************************************
     A*********** STBS01    R               REFFLD(APP)
     A***********                           COLHDG('BILL' 'SUB-TYPE' '1')
     A            STBS01    R               REFFLD(APP)
     A                                      COLHDG('FL PROV' 'LIC# FLAG')
     A*                                        POS. 1 - FLAG
     A*                                        VALID VALUES: Y OR BLANK
     A*** END CHG *** 09/20/00 ****************************************
     A*** BEG CHG *** 12/08/00 ****************************************
     A*********** STBS02    R               REFFLD(APP)
     A***********                           COLHDG('BILL' 'SUB-TYPE' '2')
     A            STBS02    R               REFFLD(APP)
     A                                      COLHDG('USE R&C' 'FILE')
     A*                                        POS. 1 - FLAG
     A*                                        VALID VALUES: N OR BLANK
     A*** END CHG *** 12/08/00 ****************************************
     A            STBS03    R               REFFLD(APP)
     A***** Beg Chg *** 04/04/16 **************************************
     A                                      COLHDG('FSMRA' 'Adjustment')
     A*****                                 COLHDG('BILL' 'SUB-TYPE' '3')
     A***** End Chg *** 04/04/16 **************************************
     A            STBS04    R               REFFLD(APP)
     A                                      COLHDG('BILL' 'SUB-TYPE' '4')
     A            STBS05    R               REFFLD(APP)
     A                                      COLHDG('BILL' 'SUB-TYPE' '5')
     A            STBS06    R               REFFLD(APP)
     A                                      COLHDG('Req EDI' 'for out of' -
     A                                             'state bills')
     A*                               Pos. 1 Valid values:
     A*                                        blanks - Not required
     A*                                        Y - required
     A*
     A            STBS07    R               REFFLD(APP)
     A                                      COLHDG('BILL' 'SUB-TYPE' '7')
     A            STBS08    R               REFFLD(APP)
     A                                      COLHDG('BILL' 'SUB-TYPE' '8')
     A            STBS09    R               REFFLD(APP)
     A                                      COLHDG('BILL' 'SUB-TYPE' '9')
     A            STBS10    R               REFFLD(APP)
     A                                      COLHDG('BILL' 'SUB-TYPE' '10')
     A*
     A            ST7001    R               REFFLD(PGM)
     A*** Beg Chg *** 06/11/12 **********************************************
     A********                              COLHDG('CR KB USAGE')
     A                                      COLHDG('NO LONGER USED')
     A*** End Chg *** 06/11/12 **********************************************
     A*                               POS. 1 - 2 CR KNOWLEDGE BASE
     A*                               VALID VALUES: NN = KB NUMBER
     A*                                             *BLANK = CR NOT USED
     A*                               POS. 3 - 4 PM KNOWLEDGE BASE
     A*                               VALID VALUES: NN = KB NUMBER
     A*                                             *BLANK = CR NOT USED
     A*                               POS. 5 - 6 MEDICARE CR KNOWLEDGE BASE
     A*                               VALID VALUES: NN = KB NUMBER
     A*                                             *BLANK = CR NOT USED
     A*                               POS. 7 - 8 FREQUENCY KNOWLEDGE BASE
     A*                               VALID VALUES: NN = KB NUMBER
     A*                                             *BLANK = CR NOT USED
     A            ST7002    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '2')
     A            ST7003    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '3')
     A            ST7004    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '4')
     A            ST7005    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '5')
     A            ST7006    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '6')
     A            ST7007    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '7')
     A            ST7008    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '8')
     A            ST7009    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '9')
     A            ST7010    R               REFFLD(PGM)
     A                                      COLHDG('BILL ENTRY' 'SCREEN' '10')
     A            STNST     R               REFFLD(CODE)
     A                                      COLHDG('NCCI STATE NUMBER')
     A*** BEG ADD *** 07/17/07 ****************************************
     A            STENAU         1A
     A                                      COLHDG('POLICY ENDORSEMENT' +
     A                                      'PROCESSING ''ALLOWED')
     A***                      Y = Client allowed to process policy endn
     A***                          endorsement for state
     A***                      blank = client restricted from processing
     A***                            endorsement for state
     A*** END ADD *** 07/17/07 ****************************************
     A*** BEG ADD *** 04/17/08 ****************************************
     A            STMLSP    R               REFFLD(FLAG)
     A                                      COLHDG('SPLIT INTO' 'MULT LINES')
     A            STPHYS    R               REFFLD(FLAG)
     A                                      COLHDG('PHYS BILL' 'PAY MULT UNITS')
     A            STHOSP    R               REFFLD(FLAG)
     A                                      COLHDG('HOSP BILL' 'PAY MULT UNITS')
     A            STDENT    R               REFFLD(FLAG)
     A                                      COLHDG('DENT BILL' 'PAY MULT UNITS')
     A            STPHAR    R               REFFLD(FLAG)
     A                                      COLHDG('PHAR BILL' 'PAY MULT UNITS')
     A            STMLDT    R               REFFLD(DT)
     A                                      COLHDG('MULT LINES' 'EFF DATE')
     A*** END ADD *** 04/17/08 ****************************************
     A*** BEG ADD *** 04/02/09 ****************************************
     A            STNCDC    R               REFFLD(FLAG)
     A                                      COLHDG('NCCI' 'MEDICAL DATA CALL')
     A*** END ADD *** 04/02/09 ****************************************
     A*** BEG ADD *** 08/12/10 ****************************************
     A            STMPPO    R               REFFLD(FLAG)
     A                                      COLHDG('MEDICARE PPO' +
     A                                      'PROCESSING INSTALLED')
     A*** END ADD *** 08/12/10 ****************************************
     A*** Beg Add *** 10/01/10 ****************************************
     A            STMFS     R               REFFLD(FLAG)
     A                                      COLHDG('MEDICARE BASED' +
     A                                      'FEE SCHEDULE')
     A*** End Add *** 10/01/10 ****************************************
     A*** Beg Add *** 02/14/11 ****************************************
     A            ST1A6     R               REFFLD(FLAG)
     A                                      COLHDG('Flag')
     A*** End Add *** 02/14/11 ****************************************
     A*** Beg Add *** 09/18/12 ****************************************
     A            STZIP4    R               REFFLD(FLAG)
     A                                      COLHDG('MEDICARE ZIP + 4')
     A*** End Add *** 09/18/12 ****************************************
     A*** BEG CHG *** 02/03/14 ***********************************************
     A            ST1A7     R               REFFLD(FLAG)
     A                                      TEXT('ADD ON FLAG')
     A*** END CHG *** 02/03/14 ***********************************************
     A*** BEG CHG *** 07/17/14 ***********************************************
     A            STEDIREL      15A
     A                                      COLHDG('Medical EDI' +
     A                                           'Release')
     A*** END CHG *** 07/17/14 ***********************************************
     A*** BEG CHG *** 08/01/14 ***********************************************
     A            STPAUF    R               REFFLD(FLAG)
     A                                      COLHDG('Procura Audit' +
     A                                           'Flag')
     A*** END CHG *** 08/01/14 ***********************************************
     A***** Beg Add *** 02/15/16 *********************************************
     A            STFSTY    R               REFFLD(FLAG)
     A                                      COLHDG('Fee Schedule' +
     A                                      'Type')
     A***** End Add *** 02/15/16 *********************************************
