     A*  (C) Copyright Progressive Data Systems, Inc., 1998
     A*****************************************************************
     A**    02/06/98      C:86      PROJECT: DR049
     A*****************************************************************
     A**
     A** SYSTEM WIDE COMMENTS ****
     A**
     A* * * TABLE BACK-UP FILE  * * *
     A*
     A          R PTB01                     PFILE(STTBP)
     A          K TBCSID
     A          K TBFLD
     A          K TBVUN
