     A* (c) 2015 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A* Scriptura Commission Check WorkFile                                *
     A**********************************************************************
     A* Created on 11/12/2015 by c:62 for Project SY371                    *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(SREFP)
     A          R PAC01                     TEXT('Scriptura Commission -
     A                                      Check Work File')
     A*
     A            ACXML         60A         COLHDG('Unique XML File' -
     A                                      ' Name Key')
     A            ACAXOU        20A         COLHDG('Aux ON-US Fld up' -
     A                                      ' to 21A')
     A            ACTRAN        11A         COLHDG('Transaction Number')
     A            ACONUS        19A         COLHDG('ON-US FLd up to 19A')
     A            ACRTUP         7A         COLHDG('Routing Entry Upper')
     A            ACRTLW         7A         COLHDG('Routing Entry Lower')
     A            ACCHK#         7S 0       COLHDG('Check #')
     A            AC40A1        40A         COLHDG('Description 40A 1')
     A            AC40A2        40A         COLHDG('Description 40A 2')
     A            AC40A3        40A         COLHDG('Description 40A 3')
     A            AC40A4        40A         COLHDG('Description 40A 4')
     A            ACDATE         8S 0       COLHDG('Check Print Date')
     A            ACAI01        40A         COLHDG('Account Info Top' -
     A                                      ' Left 1')
     A            ACAI02        40A         COLHDG('Account Info Top' -
     A                                      ' Left 2')
     A            ACAI03        40A         COLHDG('Account Info Top' -
     A                                      ' Left 3')
     A            ACAMT         11S 2       COLHDG('Check Amount')
     A            ACAMT1        60A         COLHDG('Spelled out Check' -
     A                                      ' Amount 1')
     A            ACAMT2        60A         COLHDG('Spelled out Check' -
     A                                      ' Amount 2')
     A            ACVOID        19A         COLHDG('Void Text')
     A            ACAGNM        35A         COLHDG('Agent Name')
     A            ACAGAD        35A         COLHDG('Agent Address')
     A            ACAGCSZ       35A         COLHDG('Agent' -
     A                                      ' City/State/Zip')
     A            ACSGMS1        4A         COLHDG('Signature Message 1')
     A            AC$LMT         9S 0       COLHDG('$ Limit without' -
     A                                      ' Signature')
     A            ACSGMS2       23A         COLHDG('Signature Message 2')
     A            ACCMD1        23A         COLHDG('Sig 1 PCL5 CMD')
     A            ACCMD2        23A         COLHDG('Sig 2 PCL5 CMD')
     A            ACFND          3S 0       COLHDG('Group #')
     A            ACFNAM        60A         COLHDG('Group Name')
     A            ACAGT#         5S 0       COLHDG('Agent #')
     A            ACIDT          7S 0       COLHDG('Init Date')
