     A*  (C) Copyright FISERV INSURANCE SOLUTIONS Inc., 2004
     A**
     A                                      REF(SCREFP)
     A          R DLRCD                     TEXT('DL RECORD         -
     A                                      FILE(OPTICAL)')
     A            DLKEY     R               REFFLD(KEY)
     A            DLSEQ#    R               REFFLD(SEQ#)
     A                                      COLHDG('REMARK' 'SEQ')
     A            DLSYS          1A         TEXT('SYSTEM ID                  ')
     A            DLDCID        12A         TEXT('UNIQUE DOCUMENT ID         ')
     A            DLOSYS         1A         TEXT('OPTICAL SYSTEM ID          ')
     A            DLOFLD         8A         TEXT('OPTICAL FOLDER NAME        ')
     A            DLOSBD        12A         TEXT('OPTICAL SUBDIRECTORY NAME  ')
     A            DL#BYT         5S 1       TEXT('NUMBER OF  KBYTES IN DOCUME')
     A            DLDTWR         7  0       TEXT('DATE WRITTEN TO OPT        ')
     A            DLTMWR         6S 0       TEXT('TIME WRITTEN TO OPT        ')
     A            DLUSWR         8A         TEXT('USER WROTE TO OPT          ')
     A            DLPAGS         4S 0       TEXT('DOCUMENT PAGES             ')
     A            DLOPTF         1A         TEXT('OPTICAL STORE FLAG         ')
     A            DLVOL1        10A         TEXT('VOLUME ID-1                ')
     A            DLVOL2        10A         TEXT('VOLUME ID-2                ')
     A            DLVOL3        10A         TEXT('VOLUME ID-3                ')
      *
      ****** TAPE LOCATION INFORMATION *****************************************
     A            DLTAPF         1A         TEXT('TAPE    STORE FLAG         ')
     A            DLDTWT         7  0       TEXT('DATE WRITTEN TO TAPE       ')
     A            DLTMWT         6S 0       TEXT('TIME WRITTEN TO TAPE       ')
     A            DLUSWT         8A         TEXT('USER WROTE TO TAPE         ')
     A            DLTVOL        10A         TEXT('VOLUME ID-OF TAPE          ')
     A*
     A            DLBUL#    R               REFFLD(BUL#1)
     A                                      COLHDG('BATCH LOG NO.')
     A            DLFLD1        10A         TEXT('FUTURE USE                 ')
     A            DLSTAT    R               REFFLD(STAT)
     A            DLUSER    R               REFFLD(USER)
     A            DLPGM     R               REFFLD(PGM)
     A            DLTIME    R               REFFLD(TIME)
     A            DLDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            DLIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A            DLIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'DATE')
     A            DLTDOC        12A         TEXT('UNIQUE DOCUMENT ID-TAPE    ')
     A***********
     A*  NEW DOC ID
     A            CVNVOL        10A         TEXT('NEW OPT VOLUME')
     A*
     A            CVNDOC        12A         TEXT('NEW    OBJECT ID (ON OPT)  ')
     A            CVNFLD         8A         TEXT('NEW OPT FOLDER NAME        ')
     A            CVNSBD        12A         TEXT('NEW OPT SUBDIRECTORY NAME  ')
     A*  ERROR FLAG
     A            CVEFLG    R               REFFLD(FLAG)
     A* ERROR DESC
     A            CVERR     R               REFFLD(DS40)
     A*  PROCESSED FLAG  (STATUS)
     A            CVPRCS    R               REFFLD(FLAG)
     A*
