     A*  (C) Copyright Progressive Data Solutions, Inc., 2001
     A**
     A** FILE USED WITH COMMAND LSTIFS (TO LIST ENTRIES IN AN IFS
     A**  DIRECTORY)  (IF *OUTFILE IS SPECIFIED ON COMMAND)
     A*
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*****************************************************************
     A                                      REF(SCREFP)
     A          R PFL01
     A            FLTYPE        12          TEXT('OBJECT TYPE +
     A                                       *STMF, *DIR, ETC.')
     A            FLOBJN       132          TEXT('ACTUAL NAME OF ENTRY')
     A          K FLTYPE
