     A*  (C) Copyright Progressive Data Systems, Inc., 1991
     A**
     A** SYSTEM WIDE REMARKS ****
     A**
     A* * * DARTS/WCMS QUERY INTERFACE WORKFILE * * *
     A* * * CUSTOM GROUP ID DATA FILE - RECORD FORMAT "A" * * *
     A*
     A                                      REF(SCREFP)
     A          R PHD01                     TEXT('DATA FILE - FORMAT A')
     A            HDKEY     R               REFFLD(KEY)
     A            HDCSID    R               REFFLD(CSID)
     A            HDPNAM    R               REFFLD(PGM)
     A            HDUA01    R               REFFLD(UA)
     A            HDUA02    R               REFFLD(UA)
     A            HDUA03    R               REFFLD(UA)
     A            HDUA04    R               REFFLD(UA)
     A            HDUA05    R               REFFLD(UA)
     A            HDUA06    R               REFFLD(UA)
     A            HDUA07    R               REFFLD(UA)
     A            HDUA08    R               REFFLD(UA)
     A            HDUA09    R               REFFLD(UA)
     A            HDUA10    R               REFFLD(UA)
     A*
     A            HDUD01    R               REFFLD(UD)
     A            HDUD02    R               REFFLD(UD)
     A            HDUD03    R               REFFLD(UD)
     A            HDUD04    R               REFFLD(UD)
     A            HDUD05    R               REFFLD(UD)
     A*
     A            HDUN01    R               REFFLD(UN)
     A            HDUN02    R               REFFLD(UN)
     A            HDUN03    R               REFFLD(UN)
     A            HDUN04    R               REFFLD(UN)
     A            HDUN05    R               REFFLD(UN)
     A******
     A            HDSTAT    R               REFFLD(STAT)
     A            HDUSER    R               REFFLD(USER)
     A            HDPGM     R               REFFLD(PGM)
     A            HDTIME    R               REFFLD(TIME)
     A            HDDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            HDIUSR    R               REFFLD(USER)
     A                                      COLHDG('RECORD CREATED BY')
     A*
     A            HDRFMT    R               REFFLD(FLAG)
     A                                      COLHDG('RECORD FORMAT')
     ****** APPLICATION KEY FIELDS ****************************************
     A            HDCO#     R               REFFLD(CO#)
     A            HDFND     R               REFFLD(FND)
     A            HDFYR     R               REFFLD(FYR)
     A            HDCASE    R               REFFLD(CASE)
