     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC. 1996
     A*
     A*  SXHPF Logical using CO#/FND
     A*
     A          R SHP01                     PFILE(SXHPF)
     A          K XHCO#
