      * (c) 2015 StoneRiver, Inc. All rights Reserved.                     *
      * StoneRiver is a trademark of StoneRiver, Inc.                      *
      ****************************************************************
      * Menu Command Processing File
      ****************************************************************
      *  Created: 04/28/15   C:212    PROJECT: MC377
      ****************************************************************
      * REVISIONS:                                                   *
      *                                                              *
      * xx/xx/xx  C:xxx Project: xxxxx                               *
      ****************************************************************
     A                                      UNIQUE
     A          R PMC01                     PFILE(SXMCP)
      *
     A          K MCID
