     A* (c) 2018 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A* Scriptura Periodic Report and Status Report and Comp Receipt       *
     A**********************************************************************
     A* Created on 10/31/2018 by C:180 for Project 102WHL                  *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A* 02/28/20   C:180   Add field for Days as fraction of a week
     A*                                                                    *
     A**********************************************************************
     A                                      REF(SREFP)
     A          R PPR01                     TEXT('Scriptura Periodic Report -
     A                                      and Status Report and Comp Receipt')
      *
      * Header Information
      *
     A            PRXML         60A         COLHDG('Unique XML File' -
     A                                      ' Name Key')
     A            PRCO#          3S 0       COLHDG('Company #')
     A            PRFND          3S 0       COLHDG('Group #')
     A            PRFYR          3S 0       COLHDG('Year')
     A            PRCASE         7S 0       COLHDG('Case')
     A            PRACL#        25A         COLHDG('IC File #')
     A            PRCLM#        25A         COLHDG('Carrier File #')
     A            PREFEI         9S 0       COLHDG('Employer FEIN')
      *
      * Claim Information
      *
     A            PRCFSN        15A         COLHDG('Claimant First Name')
     A            PRCMID         1A         COLHDG('Claimant Middle Init')
     A            PRCLSN        30A         COLHDG('Claimant Last Name')
     A            PRCAD1        40A         COLHDG('Claimant Address 1')
     A            PRCAD2        40A         COLHDG('Claimant Address 2')
     A            PRCCTY        25A         COLHDG('Claim City')
     A            PRCST          2A         COLHDG('Claim State')
     A            PRCZIP         9S 0       COLHDG('Claim Zip Code')
     A            PRCAREA        3S 0       COLHDG('Claimant Area Code')
     A            PRCPHN#        7S 0       COLHDG('Claimant Phone #')
     A            PRWAREA        3S 0       COLHDG('Work Area Code')
     A            PRWPHN#        7S 0       COLHDG('Work Phone #')
      *
      * Employer Information
      *
     A            PRENAM        40A         COLHDG('Employer Name')
     A            PREAREA        3S 0       COLHDG('Employer Area Code')
     A            PREPHN#        7S 0       COLHDG('Employer Phone #')
     A            PREMAD1       40A         COLHDG('Employer Mailing' 'Addr 1')
     A            PREMAD2       40A         COLHDG('Employer Mailing' 'Addr 2')
     A            PREMCTY       25A         COLHDG('Employer Mailing' 'City')
     A            PREMST         2A         COLHDG('Employer Mailing' 'State')
     A            PREMZIP        9S 0       COLHDG('Employer Mailing' 'Zip')
     A            PREPAD1       40A         COLHDG('Employer Physical' 'Addr1')
     A            PREPAD2       40A         COLHDG('Employer Physical' 'Addr 2')
     A            PREPCTY       25A         COLHDG('Employer Physical' 'City')
     A            PREPST         2A         COLHDG('Employer Physical' 'State')
     A            PREPZIP        9S 0       COLHDG('Employer Physical' 'Zip')
      *
      * Other Information
      *
     A            PRFNAME       60A         COLHDG('Insurance Carrier' 'Name')
     A            PRACDT         8S 0       COLHDG('Accident Date')
     A            PRWEEKCMP      5S 0       COLHDG('Total Weeks' 'Comp Paid')
      *
      * Temporary Total
      *
     A            PRTTDESC      20A         COLHDG('TT Type' 'Description')
     A            PRWEEKTT       5S 0       COLHDG('TT Total Weeks')
     A            PRFRDTTT       8S 0       COLHDG('TT From Date')
     A            PRTODTTT       8S 0       COLHDG('TT To Date')
     A            PRAMTTT       11S 2       COLHDG('TT Total Amount')
      *
      * Temporary Partial
      *
     A            PRTPDESC      20A         COLHDG('TP Type' 'Description')
     A            PRWEEKTP       5S 0       COLHDG('TP Total Weeks')
     A            PRFRDTTP       8S 0       COLHDG('TP From Date')
     A            PRTODTTP       8S 0       COLHDG('TP To Date')
     A            PRAMTTP       11S 2       COLHDG('TP Total Amount')
      *
      * Payment Information
      *
     A            PRDTFSTPMT     8S 0       COLHDG('Date of 1st Payment')
     A            PRCMPAMT      11S 2       COLHDG('Total Comp Amount' 'TT  TP')
     A            PRMEDAMT      11S 2       COLHDG('Total Medical Amount')
      *
      * Permanent Partial
      *
     A            PRWEEKPP       5S 0       COLHDG('PP Total Weeks')
     A            PRFRDTPP       8S 0       COLHDG('PP From Date')
     A            PRTODTPP       8S 0       COLHDG('PP To Date')
     A            PRAMTPP       11S 2       COLHDG('PP Total Amount')
      *
      * Disfigurement
      *
     A            PRWEEKDF       5S 0       COLHDG('DF Total Weeks')
     A            PRAMTDF       11S 2       COLHDG('Disfigurement' 'Amount')
      *
      * Other Amounts
      *
     A            PRAMTAFR      11S 2       COLHDG('Agreement & Final' -
     A                                      ' Release Amount')
     A            PRAMTFNR      11S 2       COLHDG('Funeral Benefits' 'Amount')
     A            PRCMPAMT1     11S 2       COLHDG('Total Comp Amount' -
     A                                      ' TT TP PP DF CL')
      *
      * Footer Information
      *
     A            PRSUPNAME     50A         COLHDG('Supervisor Name')
     A            PRSUPFONA      3S 0       COLHDG('Supervisor Phone' -
     A                                      'Area Code')
     A            PRSUPFON       7S 0       COLHDG('Supervisor Phone')
      *
      * Scriptura Initial Date
      *
     A            PRSYSDT        8S 0       COLHDG('System Date')
      *
      * Total Days
      *
     A            PRDAYSCMP      5S 0       COLHDG('Total Days' 'Comp Paid')
     A            PRDAYSTT       5S 0       COLHDG('TT Total Days')
     A            PRDAYSTP       5S 0       COLHDG('TP Total Days')
     A            PRDAYSPP       5S 0       COLHDG('PP Total Days')
     A            PRDAYSDF       5S 0       COLHDG('DF Total Days')
