     A* (c) 2017 StoneRiver, Inc. All rights Reserved.                *
     A* StoneRiver is a trademark of StoneRiver, Inc.                 *
     A*                                                               *
     A*****************************************************************
     A* EOB DATA WORK FILE FOR REPORT HEADER - Managed Care           *
     A*****************************************************************
     A*                                                               *
     A*  PROJECT:  SY371        PROGRAMMER:  C:79                     *
     A*  CREATED:  05/24/17                                           *
     A*  DESCRIPTION:  THIS IS THE WORK FILE TO HOLD THE MANAGED CARE *
     A*                DATA FOR THE EOB SUMMARY REPORT HEADER         *
     A*                                                               *
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 05/30/17 C: 079 Project: SY395                                *
     A*                 Add initial date                              *
     A*****************************************************************
     A                                      REF(SREFP)
     A          R PRH01                     TEXT('EOB REPORT SUMMARY')
     A*
     A            RHXMLFILE     60A         COLHDG('XML FILE NAME')
     A            RHCONM        40A         COLHDG('Company Name')
     A            RHTITL        60A         COLHDG('Report Title')
     A            RHSUB#    R     S         REFFLD(SUB#)
     A                                      COLHDG('Subscriber')
     A            RHSBNM        40A         COLHDG('Subscriber Name')
     A            RHFND     R     S         REFFLD(FND)
     A                                      COLHDG('Group')
     A            RHFNNM        60A         COLHDG('Group Name')
     A            RHHMRA        10A         COLHDG('MRA Heading')
     A            RHHOT1        10A         COLHDG('Other 1 Heading')
     A            RHHOT2        10A         COLHDG('Other 2 Heading')
     A            RHHNET        10A         COLHDG('Network Heading')
     A*** Beg Add *** 05/30/17 ************************************
     A            RHIDT          7S 0       COLHDG('Init Maint Date')
     A*** End Add *** 05/30/17 ************************************
