     A* (c) 2016 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A* Scriptura Reserve Worksheet WorkFile - Benefits                    *
     A**********************************************************************
     A* Created on 10/10/2016 by c:62 for Project SY371                    *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(SREFP)
     A          R PRWB01                    TEXT('Scriptura Reserve -
     A                                      Worksheet Work File -
     A                                      Benefits')
     A*
     A            RWBXML        60A         COLHDG('Unique XML File' -
     A                                      ' Name Key')
     A            RWBSECHDR     40A         COLHDG('Section Header')
     A            RWBBENHDR     40A         COLHDG('Benefit Header')
     A            RWBBENPER      3A         COLHDG('Benefit %')
     A            RWBBENTO      15A         COLHDG('Benefit To')
     A            RWBWEEK        3S 0       COLHDG('Week')
     A            RWBCMPRT       7S 2       COLHDG('Comp Rate')
     A            RWBCMPAMT     11S 2       COLHDG('Week')
     A            RWBRSVCD       2A         COLHDG('Reserve Code')
     A            RWBRSVCDDS    40A         COLHDG('Reserve Code' +
     A                                      'Description')
     A            RWBIDT    R               REFFLD(DT)
     A                                      COLHDG('Init Date')
