     A* (c) 2016 StoneRiver, Inc. All rights Reserved.                     *
     A* StoneRiver is a trademark of StoneRiver, Inc.                      *
     A* Scriptura Reserve Worksheet WorkFile - Section Header              *
     A**********************************************************************
     A* Created on 10/10/2016 by c:62 for Project SY371                    *
     A**********************************************************************
     A* Revisions:                                                         *
     A*                                                                    *
     A**********************************************************************
     A                                      REF(SREFP)
     A          R PRWS01                    TEXT('Scriptura Reserve -
     A                                      Worksheet Work File -
     A                                      Section Header')
     A*
     A            RWSXML        60A         COLHDG('Unique XML File' -
     A                                      ' Name Key')
     A            RWSSECHDR     40A         COLHDG('Section Header')
     A            RWSDTLHDR     40A         COLHDG('Detail Header')
     A            RWSIDT    R               REFFLD(DT)
     A                                      COLHDG('Init Date')
