     A** (C) COPYRIGHT PROGRESSIVE DATA SOLUTIONS, INC., 1999
     A*
     A*  SYSTEM-WIDE BATCH PROCESS COMMUNICATION FILE
     A*
     A*****************************************************************
     A* REVISIONS:                                                    *
     A*                                                               *
     A* 01/26/99 C:62 PROJECT:MC145                                   *
     A*               CHANGED DATES FROM MDY(6.0) TO MDYY(8.0).       *
     A*                                                               *
     A*****************************************************************
     A* FIELDS COMMON TO ALL PRODUCTS
     A                                      REF(SREFP)
     A          R PDB01
     A            DBUSR     R               REFFLD(USER)
     A                                      COLHDG('SUBMITTING' 'USER')
     A            DBJOB     R               REFFLD(JOB)
     A                                      COLHDG('SUBMITTING' 'JOB')
     A            DBSDT     R               REFFLD(DT8)
     A                                      COLHDG('SUBMIT DATE')
     A            DBSTM     R               REFFLD(TIME)
     A                                      COLHDG('SUBMIT TIME')
     A            DBRTRT    R               REFFLD(FLAG)
     A                                      COLHDG('RESTART FLAG')
     A            DBTAG     R               REFFLD(TAG)
     A            DBTDT     R               REFFLD(DT8)
     A                                      COLHDG('LAST LOG DATE')
     A            DBTTM     R               REFFLD(TIME)
     A                                      COLHDG('LAST LOG TIME')
     A            DBNTRM    R               REFFLD(FLAG)
     A                                      COLHDG('NORMAL' 'TERMINATION')
     A            DBWKLY    R               REFFLD(FLAG)
     A                                      COLHDG('WEEKLY  PROCESS')
     A            DBMNTH    R               REFFLD(FLAG)
     A                                      COLHDG('MONTHLY PROCESS')
     A            DBYEAR    R               REFFLD(FLAG)
     A                                      COLHDG('YEARLY PROCESS')
     A            DBCO#     R               REFFLD(CO#)
     A                                      COLHDG('COMPANY NUMBER')
     A            DBFWDT    R               REFFLD(DT8)
     A                                      COLHDG('WEEKLY FROM' 'DATE')
     A            DBTWDT    R               REFFLD(DT8)
     A                                      COLHDG('WEEKLY  TO ' 'DATE')
     A            DBFMDT    R               REFFLD(DT8)
     A                                      COLHDG('MONTHLY FROM' 'DATE')
     A            DBTMDT    R               REFFLD(DT8)
     A                                      COLHDG('MONTHLY TO ' 'DATE')
     A            DBFYDT    R               REFFLD(DT8)
     A                                      COLHDG('YEARLY FROM' 'DATE')
     A            DBTYDT    R               REFFLD(DT8)
     A                                      COLHDG('YEARLY  TO ' 'DATE')
     A*
     A* ADDITIONAL FIELDS USED BY PRODUCTS
     A*
     A** PROPERTY & CASUALTY
     A*
     A            DBLSDT    R               REFFLD(DT8)
     A                                      COLHDG('LAST SUBMIT DATE')
     A*
     A* WORKERS' COMP
     A*
     A* REHAB
     A*
     A* FEE SCHEDULE
     A*
     A            DBSUB#    R               REFFLD(SUB#)
     A                                      COLHDG('LAST SUBMIT DATE')
     A*
     A* FEE SCHEDULE/WCMC STATE RULES INSTALLED
     A*
     A            DBST01    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST02    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST03    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST04    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST05    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST06    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST07    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST08    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST09    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A            DBST10    R               REFFLD(ST)
     A                                      COLHDG('STATE RULES')
     A*
     A* FEE SCHEDULE/WCMC STATE TAPE SUBMISSION INSTALLED
     A*
     A            DBTP01    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP02    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP03    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP04    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP05    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP06    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP07    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP08    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP09    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A            DBTP10    R               REFFLD(ST)
     A                                      COLHDG('TAPE FOR STATE')
     A*
     A* FEE SCHEDULE/WCMC PDS PRODUCTS INSTALLED
     A*
     A            DBFL01    R               REFFLD(FLAG)
     A                                      COLHDG('WC INTERFACE FLAG')
     A            DBFL02    R               REFFLD(FLAG)
     A                                      COLHDG('DIARY FUNCTION' 'INSTALLED')
     A            DBFL03    R               REFFLD(FLAG)
     A                                      COLHDG('ALLOW PROV MAINT' 'F007OR')
     A            DBFL04    R               REFFLD(FLAG)
     A                                      COLHDG('CLAIMS EDIT' 'INSTALLED?')
     A            DBFL05    R               REFFLD(FLAG)
     A                                      COLHDG('DME' 'INSTALLED?')
     A            DBFL06    R               REFFLD(FLAG)
     A                                      COLHDG('NETWORK/PPO' 'INSTALLED?')
     A            DBFL07    R               REFFLD(FLAG)
     A                                      COLHDG('UR INSTALLED?')
     A            DBFL08    R               REFFLD(FLAG)
     A                                      COLHDG('DEFAULT' 'LOS' 'REGION')
     A            DBFL09    R               REFFLD(FLAG)
     A                                      COLHDG('EOB IMMED' 'PROCESS')
     A            DBFL10    R               REFFLD(FLAG)
     A                                      COLHDG('PHARMACY' 'PROCESSING')
     A            DBFL11    R               REFFLD(FLAG)
     A                                      COLHDG('SUBMITTED' 'FLAG(Y/P)')
     A            DBFL12    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL13    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL14    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL15    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL16    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL17    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL18    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL19    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
     A            DBFL20    R               REFFLD(FLAG)
     A                                      COLHDG('*** FUTURE USE ***')
