     A*
     A** Internet Claim File Logical
     A*
     A          R PFR01                     PFILE(TFFRP)
     A          K FRCO
     A          K FRDATE
     A          K FRTIME
     A          K FRLSN
     A          K FRFSN
     A          S FRPROC                    COMP(EQ ' ')
