     A** (C) Copyright Progressive Data Solutions, Inc. 1992
     A**
     A** Utilization Review Concurrent/Retrospective Review Edit
     A** File
     A                                      REF(FSREFP)
     A          R PCR01                     TEXT('Concurrent/Retro Review Edit')
     A            CRCO#     R               REFFLD(CO#)
     A            CRSUB#    R               REFFLD(SUB#)
     A            CRFND     R               REFFLD(FND) COLHDG('GROUP#')
     A            CREDIT    R               REFFLD(EDIT)
     A            CREXT     R               REFFLD(EXT)
     A            CRDESC    R               REFFLD(DS50)
     A                                      COLHDG('EDIT DESCRIPTION ')
     A            CRAMT1    R               REFFLD(A92)
     A                                      COLHDG('DOLLAR ALLOWANCE')
     A            CRWKST    R               REFFLD(DYS)
     A                                      COLHDG('WEEKS OF' 'TREATMENT')
     A            CRAGE     R               REFFLD(A30)
     A                                      COLHDG('AGE OF CLAIMANT')
     A            CRVIST    R               REFFLD(A30)
     A                                      COLHDG('# OF VISITS')
     A            CRDIA1    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS #1')
     A            CRDIA2    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS #2')
     A            CRDIA3    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS #3')
     A            CRDIA4    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS #4')
     A            CRDIA5    R               REFFLD(DIA)
     A                                      COLHDG('DIAGNOSIS #5')
     A            CRCPT1    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 1')
     A            CRCPT2    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 2')
     A            CRCPT3    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 3')
     A            CRCPT4    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 4')
     A            CRCPT5    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 5')
     A            CRCPT6    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 6')
     A            CRCPT7    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 7')
     A            CRCPT8    R               REFFLD(CPT4)
     A                                      COLHDG('CPT4 PROCEDURE 8')
     A            CRSPCD    R               REFFLD(SPEC)
     A            CRFEIN    R               REFFLD(FEIN)
     A            CRMOD     R               REFFLD(MOD)
     A            CRLTFL    R               REFFLD(FLAG)
     A                                      COLHDG('LOST TIME Y/N')
     A            CRIEFL    R               REFFLD(FLAG)
     A                                      COLHDG('INC, EX, I/E')
     A            CRSTAT    R               REFFLD(STAT)
     A            CRUSER    R               REFFLD(USER)
     A            CRPGM     R               REFFLD(PGM)
     A            CRTIME    R               REFFLD(TIME)
     A            CRDT      R               REFFLD(DT)
     A                                      COLHDG('DATE' 'MAINTAINED')
     A            CRIUSR    R               REFFLD(USER)
     A                                      COLHDG('INITIAL' 'USER')
     A            CRIDT     R               REFFLD(DT)
     A                                      COLHDG('INITIAL' 'ENTRY' 'DATE')
     A            CRPOS     R               REFFLD(FLAG)
     A                                      COLHDG('PLACE' 'OF' 'SERVICE')
     A            CROCCR    R               REFFLD(A30)
     A                                      COLHDG('# OF OCCURANCES')
     A            CRETYP    R               REFFLD(EDTTYP)
     A                                      COLHDG('EDIT TYPE')
