     A*  (C) Copyright Progressive Data Systems, Inc., 1993
     A*
     A** U/R  INTERQUAL CASE FILE
     A*
     A          R PIQ01                     PFILE(UMIQP)
     A          K IQCO#
     A          K IQSUB#
     A          K IQFND
     A          K IQCERT
