     A*  (C) Copyright Progressive Data Systems, Inc., 1993
     A*
     A** U/R  INTERQUAL CRITERIA FILE
     A*
     A          R PIS01                     PFILE(UMISP)
     A          K ISBDSY
     A          K ISCRTP
     A          K ISLIN#
