     A* (c) 2013 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A*
     A**************************************************************************
     A*                                                                        *
     A* CREATED 03/18/97   C:45    REQ/PROJ: UR022                             *
     A*                                                                        *
     A* UMPCL5 *  Utilization Review LOGICAL OVER PRE-CERT MASTER FILE         *
     A*                                                                        *
     A**************************************************************************
     A*
     A          R PPC01                     PFILE(UMPCP)
     A          K PCCO#
     A          K PCSUB#
     A          K PCFND
     A          K PCFYR
     A          K PCCASE
     A          K PCFEIN
     A          K PCMOD
     A          S PCSTAT                    COMP(NE 'C')
