     A* (c) 2013 StoneRiver, Inc. All rights Reserved.
     A* StoneRiver is a trademark of StoneRiver, Inc.
     A**
     A** Utilization Review LOGICAL OVER PRE-CERT MASTER FILE
     A*
     A          R PPC01                     PFILE(UMPCP)
     A          K PCCO#
     A          K PCSUB#
     A          K PCFND
     A          K PCFYR
     A          K PCCASE
     A          K PCCERT
     A          K PCEXT
     A          S PCEXT                     COMP(NE 000)
