     A*  (C) Copyright Progressive Data Systems, Inc., 1993
     A*
     A** TEXT FILE - AMBULATORY GUIDELINES & BLOOD/URINE VALUES
     A*
     A          R PTS01                     PFILE(UMTSP)
     A          K TSTYPE
     A          K TSSEQ#
