     A*****************************************************************
     A*  (c) Copyright Fiserv Insurance Solutions, Inc., 2005
     A*
     A*  WORKERS' COMPENSATION VADUM1 Claim Import Flat File
     A*****************************************************************
     A*  DESCRIPTION:                                                 *
     A*    VADUM16 - GIC Claim Import-Format 06 Claim Change or Delete*
     A*****************************************************************
     A*  CREATED: 12/08/05       PROJECT: 139WAI               C:132  *
     A*****************************************************************
     A*  REVISIONS:                                                   *
     A*
     A*****************************************************************
     A
     A                                      REF(WREFP)
     A
     A          R PV601                     TEXT('VADUM CLAIM IMPORT  +
     A                                            Record 06 Format')
     A
     A            V6RCID         2A         TEXT('Record ID-Format 06')
     A            V6FND          3S 0       TEXT('Group Number')
     A            V6CLM#    R               REFFLD(DS40)
     A                                      TEXT('VADUM CLAIM#-XREF TO CMCASE')
     A            V6TRDT         8A         TEXT('Transaction Date of Claim +
     A                                            Change-YYYYMMDD')
     A            V6TRTP    R               REFFLD(FLAG)
     A                                      TEXT('C=Chg Policy#,Div,SS# +
     A                                            Accident Dte, D=Delete')
     A*                               C=Policy#, Division, SS# or Accident Date
     A*                               D=Delete Claim from System
     A*                                 No Transfers Allowed in VADUM system.
     A            V6EMP#         9S 0       TEXT('New Policy Number')
     A            V6DIV          5S 0       TEXT('New Division')
     A            V6SS#     R               REFFLD(SS#)
     A                                      TEXT('New Social Security #')
     A            V6ACDT         8A         TEXT('New Accident Date in +
     A                                            CCYYMMDD format')
     A*
     A            V6FILL       648A         TEXT('FILLER Format 06 Record')
